[
    {
        "content": "How can anyone still doubt that the bullet train towards socialism has not left the station? I have seen a swing of thinking on many here on this site going from...\"we are not going socialist\" to \"what so bad about socialism?\" No matter how it is done whether with guns and force, pen and paper, or coercion of the board of directors/CEO/union bosses...socialism is socialism. \"http://www.detnews.com/article/20090520/AUTO01/905200376/Feds-to-inject-$7.5B-more-into-GMAC I would rather see every car company fail along with banks and have a massive economical impact than to see this country skip along to government run businesses because of people being too selfish, lazy, greedy, and whiny or anything else that can be added. The ones on this blog who support unconditionally on this website the actions of this Administration in my mind have already sold out. When the smoke clears and the highers are fat dumb and happy on their estates, we will be left holding the bag. Because an individual is born I am now indebted to them if they do not contribute to society. Socialism = a \"level\" playing field for the serfs...not for the glamour stars or politicians.", 
        "intTime": 20090521, 
        "postID": 1, 
        "quote": "", 
        "reply": "How can anyone still doubt that the bullet train towards socialism has not left the station? I have seen a swing of thinking on many here on this site going from...\"we are not going socialist\" to \"what so bad about socialism?\" No matter how it is done whether with guns and force, pen and paper, or coercion of the board of directors/CEO/union bosses...socialism is socialism. \"http://www.detnews.com/article/20090520/AUTO01/905200376/Feds-to-inject-$7.5B-more-into-GMAC I would rather see every car company fail along with banks and have a massive economical impact than to see this country skip along to government run businesses because of people being too selfish, lazy, greedy, and whiny or anything else that can be added. The ones on this blog who support unconditionally on this website the actions of this Administration in my mind have already sold out. When the smoke clears and the highers are fat dumb and happy on their estates, we will be left holding the bag. Because an individual is born I am now indebted to them if they do not contribute to society. Socialism = a \"level\" playing field for the serfs...not for the glamour stars or politicians.", 
        "threadID": "672198221_5500078322001", 
        "time": "2009-05-21 07:49:00", 
        "title": "For those who still doubt", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by ACR26: How can anyone still doubt that the bullet train towards socialism has not left the station? I have seen a swing of thinking on many here on this site going from...\"we are not going socialist\" to \"what so bad about socialism?\" No matter how it is done whether with guns and force, pen and paper, or coercion of the board of directors/CEO/union bosses...socialism is socialism. \"http://www.detnews.com/article/20090520/AUTO01/905200376/Feds-to-inject-$7.5B-more-into-GMAC Socialism is the involuntary expropriation of the means of production. Socialism is NOT loaning companies money until they can pay you back. If THAT\"S the definition of Socialism, you better explain all the previous bailouts and bank seizures of the last 150 years. All these companies getting Federal money will NEVER be government owned. Indeed, even the bank seizures merely guarranteed profit and \"socialised\" the risk. As a long time honest to God Socialist, I can tell you point blank that I support almost none of these moves - Because they are the very opposite of Socialism. quote: Originally posted by ACR26: I would rather see every car company fail along with banks and have a massive economical impact than to see this country skip along to government run businesses because of people being too selfish, lazy, greedy, and whiny or anything else that can be added. The ones on this blog who support unconditionally on this website the actions of this Administration in my mind have already sold out. Thank you, that leaves ME off the hook... quote: Originally posted by ACR26: When the smoke clears and the highers are fat dumb and happy on their estates, we will be left holding the bag. Because an individual is born I am now indebted to them if they do not contribute to society. Socialism = a \"level\" playing field for the serfs...not for the glamour stars or politicians. You bet, the public WILL be holding the bag, precisly because this is not Socialism. It's nothing more than welfare for the rich. All risks are born by the public and all gain will go to the owners. Apparently the Bush/Obama version of Capitalism is something that you don't like - But it is typical of Monopoly Capitalism to pass it's losses to the people. It's certainly not Socialism. Dave", 
        "intTime": 20090521, 
        "postID": 2, 
        "quote": "Originally posted by ACR26: How can anyone still doubt that the bullet train towards socialism has not left the station? I have seen a swing of thinking on many here on this site going from...\"we are not going socialist\" to \"what so bad about socialism?\" No matter how it is done whether with guns and force, pen and paper, or coercion of the board of directors/CEO/union bosses...socialism is socialism. \"http://www.detnews.com/article/20090520/AUTO01/905200376/Feds-to-inject-$7.5B-more-into-GMAC", 
        "reply": " Socialism is the involuntary expropriation of the means of production. Socialism is NOT loaning companies money until they can pay you back. If THAT\"S the definition of Socialism, you better explain all the previous bailouts and bank seizures of the last 150 years. All these companies getting Federal money will NEVER be government owned. Indeed, even the bank seizures merely guarranteed profit and \"socialised\" the risk. As a long time honest to God Socialist, I can tell you point blank that I support almost none of these moves - Because they are the very opposite of Socialism. quote: Originally posted by ACR26: I would rather see every car company fail along with banks and have a massive economical impact than to see this country skip along to government run businesses because of people being too selfish, lazy, greedy, and whiny or anything else that can be added. The ones on this blog who support unconditionally on this website the actions of this Administration in my mind have already sold out. Thank you, that leaves ME off the hook... quote: Originally posted by ACR26: When the smoke clears and the highers are fat dumb and happy on their estates, we will be left holding the bag. Because an individual is born I am now indebted to them if they do not contribute to society. Socialism = a \"level\" playing field for the serfs...not for the glamour stars or politicians. You bet, the public WILL be holding the bag, precisly because this is not Socialism. It's nothing more than welfare for the rich. All risks are born by the public and all gain will go to the owners. Apparently the Bush/Obama version of Capitalism is something that you don't like - But it is typical of Monopoly Capitalism to pass it's losses to the people. It's certainly not Socialism. Dave", 
        "threadID": "672198221_5500078322001", 
        "time": "2009-05-21 08:34:00", 
        "title": "For those who still doubt", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: All these companies getting Federal money will NEVER be government owned. Indeed, even the bank seizures merely guarranteed profit and \"socialised\" the risk. As a long time honest to God Socialist, I can tell you point blank that I support almost none of these moves - Because they are the very opposite of Socialism. Never say never. quote: NEW YORK (Reuters) - If General Motors Corp (GM.N) files for bankruptcy, as widely expected, its healthy assets will be quickly sold to a new company owned by the U.S. government, a source familiar with the situation said on Tuesday. The source, who was not cleared to speak with the media and would not be identified, said the U.S. government would pay for the assets by assuming the automaker's $6 billion of secured debt and forgiving the bulk of the $15.4 billion of emergency loans that the U.S. Treasury has provided to GM. The government is negotiating the terms on which it will assume GM's secured debt and might make an the offer to holders of the debt that is far superior to the one made to Chrysler LLC's secured lenders, the source said. \"http://www.reuters.com/article/euDealsNews/idUSTRE54H6AN20090520\"", 
        "intTime": 20090521, 
        "postID": 3, 
        "quote": "Originally posted by Grachus: All these companies getting Federal money will NEVER be government owned. Indeed, even the bank seizures merely guarranteed profit and \"socialised\" the risk. As a long time honest to God Socialist, I can tell you point blank that I support almost none of these moves - Because they are the very opposite of Socialism.", 
        "reply": " Never say never. quote: NEW YORK (Reuters) - If General Motors Corp (GM.N) files for bankruptcy, as widely expected, its healthy assets will be quickly sold to a new company owned by the U.S. government, a source familiar with the situation said on Tuesday. The source, who was not cleared to speak with the media and would not be identified, said the U.S. government would pay for the assets by assuming the automaker's $6 billion of secured debt and forgiving the bulk of the $15.4 billion of emergency loans that the U.S. Treasury has provided to GM. The government is negotiating the terms on which it will assume GM's secured debt and might make an the offer to holders of the debt that is far superior to the one made to Chrysler LLC's secured lenders, the source said. \"http://www.reuters.com/article/euDealsNews/idUSTRE54H6AN20090520\"", 
        "threadID": "672198221_5500078322001", 
        "time": "2009-05-21 09:14:00", 
        "title": "For those who still doubt", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Originally posted by stec74: quote: Originally posted by Grachus: All these companies getting Federal money will NEVER be government owned. Indeed, even the bank seizures merely guarranteed profit and \"socialised\" the risk. As a long time honest to God Socialist, I can tell you point blank that I support almost none of these moves - Because they are the very opposite of Socialism. Never say never. quote: NEW YORK (Reuters) - If General Motors Corp (GM.N) files for bankruptcy, as widely expected, its healthy assets will be quickly sold to a new company owned by the U.S. government, a source familiar with the situation said on Tuesday. The source, who was not cleared to speak with the media and would not be identified, said the U.S. government would pay for the assets by assuming the automaker's $6 billion of secured debt and forgiving the bulk of the $15.4 billion of emergency loans that the U.S. Treasury has provided to GM. The government is negotiating the terms on which it will assume GM's secured debt and might make an the offer to holders of the debt that is far superior to the one made to Chrysler LLC's secured lenders, the source said. \"http://www.reuters.com/article/euDealsNews/idUSTRE54H6AN20090520\" It might very well turn out that the Government winds up \"owning\" these companies. But they wont keep them, have no intention of keeping them, and NEVER had an intention of keeping them. And I believe you are aware of this... Dave", 
        "intTime": 20090521, 
        "postID": 4, 
        "quote": "Originally posted by stec74: quote: Originally posted by Grachus: All these companies getting Federal money will NEVER be government owned. Indeed, even the bank seizures merely guarranteed profit and \"socialised\" the risk. As a long time honest to God Socialist, I can tell you point blank that I support almost none of these moves - Because they are the very opposite of Socialism. Never say never. quote: NEW YORK (Reuters) - If General Motors Corp (GM.N) files for bankruptcy, as widely expected, its healthy assets will be quickly sold to a new company owned by the U.S. government, a source familiar with the situation said on Tuesday. The source, who was not cleared to speak with the media and would not be identified, said the U.S. government would pay for the assets by assuming the automaker's $6 billion of secured debt and forgiving the bulk of the $15.4 billion of emergency loans that the U.S. Treasury has provided to GM. The government is negotiating the terms on which it will assume GM's secured debt and might make an the offer to holders of the debt that is far superior to the one made to Chrysler LLC's secured lenders, the source said. \"http://www.reuters.com/article/euDealsNews/idUSTRE54H6AN20090520\"", 
        "reply": " It might very well turn out that the Government winds up \"owning\" these companies. But they wont keep them, have no intention of keeping them, and NEVER had an intention of keeping them. And I believe you are aware of this... Dave", 
        "threadID": "672198221_5500078322001", 
        "time": "2009-05-21 10:18:00", 
        "title": "For those who still doubt", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: It might very well turn out that the Government winds up \"owning\" these companies. But they wont keep themHA!, have no intention of keeping themDouble HA!, and NEVER had an intention of keeping them HAR DE HAR HAR!. And I believe you are aware of this... Dave", 
        "intTime": 20090521, 
        "postID": 5, 
        "quote": "Originally posted by Grachus: It might very well turn out that the Government winds up \"owning\" these companies. But they wont keep themHA!, have no intention of keeping themDouble HA!, and NEVER had an intention of keeping them HAR DE HAR HAR!. And I believe you are aware of this... Dave", 
        "reply": "", 
        "threadID": "672198221_5500078322001", 
        "time": "2009-05-21 10:22:00", 
        "title": "For those who still doubt", 
        "userID": "FIST101CAV"
    }, 
    {
        "content": "quote: Socialism is the involuntary expropriation of the means of production. Socialism is NOT loaning companies money until they can pay you back. If THAT\"S the definition of Socialism, you better explain all the previous bailouts and bank seizures of the last 150 years. All these companies getting Federal money will NEVER be government owned. Indeed, even the bank seizures merely guarranteed profit and \"socialised\" the risk. As a long time honest to God Socialist, I can tell you point blank that I support almost none of these moves - Because they are the very opposite of Socialism. So replacing board members/CEO's with for lack of a better term \"government lackeys\" falls into the category of \"just loaning money\". How about dictating again what cars will be built? Is that \"just loaning money?\" Restricting compensation of management is just \"loaning money?\" What about taking away the board members voting rights on the board? Why have them there and not outright remove them? Because then there might be a lawsuit. These dudes that work at GMAC and GM are just as guilty as this administration It is our money bailing out the union employees, CEO's, and management. We will ensure the clowns who put themselves billions of dollars in the hole get their pension. How insane is this? The union gets a crapload of money for putting cars together as is, the sups and execs get a crapload of money marketing cars…meanwhile they are losing profit. The union wants more the execs want more they all get what they want and they lose money faster as a company. I am paying for that turd on the line putting lug nuts on a wheel at what ever $$ amount. I am paying for that exec to keep his mansion…meanwhile my taxes are not reduced in the slightest dwindling my chances of sending my kids to a decent non-public school. WTF is that all about????? Then in steps the government…we loan them money at first with no stipulation other than it will be paid back with interest…bad move on our part. Now we loan them MORE and MORE money and try to dictate with mandates what to build. WTF is THAT? You can slice that dirt pie any way you want grachus but when you boil all the fat away, government run/controlled/owned is socialism.", 
        "intTime": 20090521, 
        "postID": 6, 
        "quote": "Socialism is the involuntary expropriation of the means of production. Socialism is NOT loaning companies money until they can pay you back. If THAT\"S the definition of Socialism, you better explain all the previous bailouts and bank seizures of the last 150 years. All these companies getting Federal money will NEVER be government owned. Indeed, even the bank seizures merely guarranteed profit and \"socialised\" the risk. As a long time honest to God Socialist, I can tell you point blank that I support almost none of these moves - Because they are the very opposite of Socialism.", 
        "reply": " So replacing board members/CEO's with for lack of a better term \"government lackeys\" falls into the category of \"just loaning money\". How about dictating again what cars will be built? Is that \"just loaning money?\" Restricting compensation of management is just \"loaning money?\" What about taking away the board members voting rights on the board? Why have them there and not outright remove them? Because then there might be a lawsuit. These dudes that work at GMAC and GM are just as guilty as this administration It is our money bailing out the union employees, CEO's, and management. We will ensure the clowns who put themselves billions of dollars in the hole get their pension. How insane is this? The union gets a crapload of money for putting cars together as is, the sups and execs get a crapload of money marketing cars…meanwhile they are losing profit. The union wants more the execs want more they all get what they want and they lose money faster as a company. I am paying for that turd on the line putting lug nuts on a wheel at what ever $$ amount. I am paying for that exec to keep his mansion…meanwhile my taxes are not reduced in the slightest dwindling my chances of sending my kids to a decent non-public school. WTF is that all about????? Then in steps the government…we loan them money at first with no stipulation other than it will be paid back with interest…bad move on our part. Now we loan them MORE and MORE money and try to dictate with mandates what to build. WTF is THAT? You can slice that dirt pie any way you want grachus but when you boil all the fat away, government run/controlled/owned is socialism.", 
        "threadID": "672198221_5500078322001", 
        "time": "2009-05-21 10:29:00", 
        "title": "For those who still doubt", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by FIST101CAV: quote: Originally posted by Grachus: It might very well turn out that the Government winds up \"owning\" these companies. But they wont keep themHA!, have no intention of keeping themDouble HA!, and NEVER had an intention of keeping them HAR DE HAR HAR!. And I believe you are aware of this... Dave Err, you do know that this is not the FIRST time that the government stepped in to bail out the auto industry? And it sure as hell isn't the first time that the government seized banks. Dave", 
        "intTime": 20090521, 
        "postID": 7, 
        "quote": "Originally posted by FIST101CAV: quote: Originally posted by Grachus: It might very well turn out that the Government winds up \"owning\" these companies. But they wont keep themHA!, have no intention of keeping themDouble HA!, and NEVER had an intention of keeping them HAR DE HAR HAR!. And I believe you are aware of this... Dave", 
        "reply": " Err, you do know that this is not the FIRST time that the government stepped in to bail out the auto industry? And it sure as hell isn't the first time that the government seized banks. Dave", 
        "threadID": "672198221_5500078322001", 
        "time": "2009-05-21 10:30:00", 
        "title": "For those who still doubt", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by stec74: quote: Originally posted by Grachus: All these companies getting Federal money will NEVER be government owned. Indeed, even the bank seizures merely guarranteed profit and \"socialised\" the risk. As a long time honest to God Socialist, I can tell you point blank that I support almost none of these moves - Because they are the very opposite of Socialism. Never say never. quote: NEW YORK (Reuters) - If General Motors Corp (GM.N) files for bankruptcy, as widely expected, its healthy assets will be quickly sold to a new company owned by the U.S. government, a source familiar with the situation said on Tuesday. The source, who was not cleared to speak with the media and would not be identified, said the U.S. government would pay for the assets by assuming the automaker's $6 billion of secured debt and forgiving the bulk of the $15.4 billion of emergency loans that the U.S. Treasury has provided to GM. The government is negotiating the terms on which it will assume GM's secured debt and might make an the offer to holders of the debt that is far superior to the one made to Chrysler LLC's secured lenders, the source said. \"http://www.reuters.com/article/euDealsNews/idUSTRE54H6AN20090520\" It might very well turn out that the Government winds up \"owning\" these companies. But they wont keep them, have no intention of keeping them, and NEVER had an intention of keeping them. And I believe you are aware of this... Dave I also thought the government would accept money from the financial institutions that received bailout money to pay it back. That hasn't turned out quite the way I expected.", 
        "intTime": 20090521, 
        "postID": 8, 
        "quote": "Originally posted by Grachus: quote: Originally posted by stec74: quote: Originally posted by Grachus: All these companies getting Federal money will NEVER be government owned. Indeed, even the bank seizures merely guarranteed profit and \"socialised\" the risk. As a long time honest to God Socialist, I can tell you point blank that I support almost none of these moves - Because they are the very opposite of Socialism. Never say never. quote: NEW YORK (Reuters) - If General Motors Corp (GM.N) files for bankruptcy, as widely expected, its healthy assets will be quickly sold to a new company owned by the U.S. government, a source familiar with the situation said on Tuesday. The source, who was not cleared to speak with the media and would not be identified, said the U.S. government would pay for the assets by assuming the automaker's $6 billion of secured debt and forgiving the bulk of the $15.4 billion of emergency loans that the U.S. Treasury has provided to GM. The government is negotiating the terms on which it will assume GM's secured debt and might make an the offer to holders of the debt that is far superior to the one made to Chrysler LLC's secured lenders, the source said. \"http://www.reuters.com/article/euDealsNews/idUSTRE54H6AN20090520\" It might very well turn out that the Government winds up \"owning\" these companies. But they wont keep them, have no intention of keeping them, and NEVER had an intention of keeping them. And I believe you are aware of this... Dave", 
        "reply": " I also thought the government would accept money from the financial institutions that received bailout money to pay it back. That hasn't turned out quite the way I expected.", 
        "threadID": "672198221_5500078322001", 
        "time": "2009-05-21 10:38:00", 
        "title": "For those who still doubt", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Err, you do know that this is not the FIRST time that the government stepped in to bail out the auto industry? And it sure as hell isn't the first time that the government seized banks. delusional", 
        "intTime": 20090521, 
        "postID": 9, 
        "quote": "Err, you do know that this is not the FIRST time that the government stepped in to bail out the auto industry? And it sure as hell isn't the first time that the government seized banks.", 
        "reply": " delusional", 
        "threadID": "672198221_5500078322001", 
        "time": "2009-05-21 10:45:00", 
        "title": "For those who still doubt", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by stec74: quote: Originally posted by Grachus: quote: Originally posted by stec74: quote: Originally posted by Grachus: All these companies getting Federal money will NEVER be government owned. Indeed, even the bank seizures merely guarranteed profit and \"socialised\" the risk. As a long time honest to God Socialist, I can tell you point blank that I support almost none of these moves - Because they are the very opposite of Socialism. Never say never. quote: NEW YORK (Reuters) - If General Motors Corp (GM.N) files for bankruptcy, as widely expected, its healthy assets will be quickly sold to a new company owned by the U.S. government, a source familiar with the situation said on Tuesday. The source, who was not cleared to speak with the media and would not be identified, said the U.S. government would pay for the assets by assuming the automaker's $6 billion of secured debt and forgiving the bulk of the $15.4 billion of emergency loans that the U.S. Treasury has provided to GM. The government is negotiating the terms on which it will assume GM's secured debt and might make an the offer to holders of the debt that is far superior to the one made to Chrysler LLC's secured lenders, the source said. \"http://www.reuters.com/article /euDealsNews/idUSTRE54H6AN20090520\" It might very well turn out that the Government winds up \"owning\" these companies. But they wont keep them, have no intention of keeping them, and NEVER had an intention of keeping them. And I believe you are aware of this... Dave I also thought the government would accept money from the financial institutions that received bailout money to pay it back. That hasn't turned out quite the way I expected. If a bank (company management) wants to pay back quickly so management can start getting their big bonuses again (current case) and doing so carries a significant risk that bank would get in financial trouble again should they be allowed to pay back the money or should they have to wait until they are in a better financial state? How many of these banks would still want to pay back quickly if management would still have to wait before they could start getting bonuses again? IMO NONE.", 
        "intTime": 20090521, 
        "postID": 10, 
        "quote": "Originally posted by stec74: quote: Originally posted by Grachus: quote: Originally posted by stec74: quote: Originally posted by Grachus: All these companies getting Federal money will NEVER be government owned. Indeed, even the bank seizures merely guarranteed profit and \"socialised\" the risk. As a long time honest to God Socialist, I can tell you point blank that I support almost none of these moves - Because they are the very opposite of Socialism. Never say never. quote: NEW YORK (Reuters) - If General Motors Corp (GM.N) files for bankruptcy, as widely expected, its healthy assets will be quickly sold to a new company owned by the U.S. government, a source familiar with the situation said on Tuesday. The source, who was not cleared to speak with the media and would not be identified, said the U.S. government would pay for the assets by assuming the automaker's $6 billion of secured debt and forgiving the bulk of the $15.4 billion of emergency loans that the U.S. Treasury has provided to GM. The government is negotiating the terms on which it will assume GM's secured debt and might make an the offer to holders of the debt that is far superior to the one made to Chrysler LLC's secured lenders, the source said. \"http://www.reuters.com/article /euDealsNews/idUSTRE54H6AN20090520\" It might very well turn out that the Government winds up \"owning\" these companies. But they wont keep them, have no intention of keeping them, and NEVER had an intention of keeping them. And I believe you are aware of this... Dave I also thought the government would accept money from the financial institutions that received bailout money to pay it back. That hasn't turned out quite the way I expected.", 
        "reply": " If a bank (company management) wants to pay back quickly so management can start getting their big bonuses again (current case) and doing so carries a significant risk that bank would get in financial trouble again should they be allowed to pay back the money or should they have to wait until they are in a better financial state? How many of these banks would still want to pay back quickly if management would still have to wait before they could start getting bonuses again? IMO NONE.", 
        "threadID": "672198221_5500078322001", 
        "time": "2009-05-21 10:54:00", 
        "title": "For those who still doubt", 
        "userID": "rayld2"
    }, 
    {
        "content": "Let them get their big checks...let the banks fail...let the market be reborn... Will it be tough when eventually it happens? You bet. The pain will be much less if we let the market adjust itself instead of Pres Obama making things worse.", 
        "intTime": 20090521, 
        "postID": 11, 
        "quote": "", 
        "reply": "Let them get their big checks...let the banks fail...let the market be reborn... Will it be tough when eventually it happens? You bet. The pain will be much less if we let the market adjust itself instead of Pres Obama making things worse.", 
        "threadID": "672198221_5500078322001", 
        "time": "2009-05-21 11:18:00", 
        "title": "For those who still doubt", 
        "userID": "ACR26"
    }, 
    {
        "content": "That's why we continue to get into these messes. A bunch of politicians, many of whom have never run a lemonade stand, let alone a multi-billion dollar corporation are trying to tell these corporations their opinion on the right way to do business. If these banks want to pay back the money let them. If they want to pay bonuses to their executives let them. If they fail, so be it. A couple more years of this administration and no one will have any need for money anyway. We will all have \"free\" health care, drive a white \"smart car\", and live in the same \"cookie cutter\" two bedroom apartment paid for by the government.", 
        "intTime": 20090521, 
        "postID": 12, 
        "quote": "", 
        "reply": "That's why we continue to get into these messes. A bunch of politicians, many of whom have never run a lemonade stand, let alone a multi-billion dollar corporation are trying to tell these corporations their opinion on the right way to do business. If these banks want to pay back the money let them. If they want to pay bonuses to their executives let them. If they fail, so be it. A couple more years of this administration and no one will have any need for money anyway. We will all have \"free\" health care, drive a white \"smart car\", and live in the same \"cookie cutter\" two bedroom apartment paid for by the government.", 
        "threadID": "672198221_5500078322001", 
        "time": "2009-05-21 11:23:00", 
        "title": "For those who still doubt", 
        "userID": "stec74"
    }, 
    {
        "content": "Socialism never works. Ask the Brits. Or France. Better yet...look at the past. The USSR! We are America. How long will we stay AMERICA? The Land of the FREE! The Home of the BRAVE!", 
        "intTime": 20090521, 
        "postID": 13, 
        "quote": "", 
        "reply": "Socialism never works. Ask the Brits. Or France. Better yet...look at the past. The USSR! We are America. How long will we stay AMERICA? The Land of the FREE! The Home of the BRAVE!", 
        "threadID": "672198221_5500078322001", 
        "time": "2009-05-21 11:36:00", 
        "title": "For those who still doubt", 
        "userID": "Agent991"
    }, 
    {
        "content": "quote: Originally posted by stec74: That's why we continue to get into these messes. A bunch of politicians, many of whom have never run a lemonade stand, let alone a multi-billion dollar corporation are trying to tell these corporations their opinion on the right way to do business. If these banks want to pay back the money let them. If they want to pay bonuses to their executives let them. If they fail, so be it. A couple more years of this administration and no one will have any need for money anyway. We will all have \"free\" health care, drive a white \"smart car\", and live in the same \"cookie cutter\" two bedroom apartment paid for by the government. I'd love a Smart car. Everytime I have to park, I envy them suckers. Always tempted to put one under my coat and run with it. They should make em with handles on the roof for ease of carry... Dave", 
        "intTime": 20090521, 
        "postID": 14, 
        "quote": "Originally posted by stec74: That's why we continue to get into these messes. A bunch of politicians, many of whom have never run a lemonade stand, let alone a multi-billion dollar corporation are trying to tell these corporations their opinion on the right way to do business. If these banks want to pay back the money let them. If they want to pay bonuses to their executives let them. If they fail, so be it. A couple more years of this administration and no one will have any need for money anyway. We will all have \"free\" health care, drive a white \"smart car\", and live in the same \"cookie cutter\" two bedroom apartment paid for by the government.", 
        "reply": " I'd love a Smart car. Everytime I have to park, I envy them suckers. Always tempted to put one under my coat and run with it. They should make em with handles on the roof for ease of carry... Dave", 
        "threadID": "672198221_5500078322001", 
        "time": "2009-05-21 11:49:00", 
        "title": "For those who still doubt", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by ACR26: How can anyone still doubt that the bullet train towards socialism has not left the station? I have seen a swing of thinking on many here on this site going from...\"we are not going socialist\" to \"what so bad about socialism?\" No matter how it is done whether with guns and force, pen and paper, or coercion of the board of directors/CEO/union bosses...socialism is socialism. \"http://www.detnews.com/article/20090520/AUTO01/905200376/Feds-to-inject-$7.5B-more-into-GMAC I would rather see every car company fail along with banks and have a massive economical impact than to see this country skip along to government run businesses because of people being too selfish, lazy, greedy, and whiny or anything else that can be added. The ones on this blog who support unconditionally on this website the actions of this Administration in my mind have already sold out. When the smoke clears and the highers are fat dumb and happy on their estates, we will be left holding the bag. Because an individual is born I am now indebted to them if they do not contribute to society. Socialism = a \"level\" playing field for the serfs...not for the glamour stars or politicians. \"The ones on this blog who support unconditionally on this website the actions of this Administration in my mind have already sold out. \" But the ones who supported the criminal right wing extremist thugs that are responsible for getting over 4000 Americans and hundreds of thousands of Iraqis needlessly killed did not sell out? We have a good president dedicated to the betterment of our country who was actually elected by a majority but you want to keep the right wing extremist philosophy of hate dishonor and subjugation going.", 
        "intTime": 20090521, 
        "postID": 15, 
        "quote": "Originally posted by ACR26: How can anyone still doubt that the bullet train towards socialism has not left the station? I have seen a swing of thinking on many here on this site going from...\"we are not going socialist\" to \"what so bad about socialism?\" No matter how it is done whether with guns and force, pen and paper, or coercion of the board of directors/CEO/union bosses...socialism is socialism. \"http://www.detnews.com/article/20090520/AUTO01/905200376/Feds-to-inject-$7.5B-more-into-GMAC I would rather see every car company fail along with banks and have a massive economical impact than to see this country skip along to government run businesses because of people being too selfish, lazy, greedy, and whiny or anything else that can be added. The ones on this blog who support unconditionally on this website the actions of this Administration in my mind have already sold out. When the smoke clears and the highers are fat dumb and happy on their estates, we will be left holding the bag. Because an individual is born I am now indebted to them if they do not contribute to society. Socialism = a \"level\" playing field for the serfs...not for the glamour stars or politicians.", 
        "reply": " \"The ones on this blog who support unconditionally on this website the actions of this Administration in my mind have already sold out. \" But the ones who supported the criminal right wing extremist thugs that are responsible for getting over 4000 Americans and hundreds of thousands of Iraqis needlessly killed did not sell out? We have a good president dedicated to the betterment of our country who was actually elected by a majority but you want to keep the right wing extremist philosophy of hate dishonor and subjugation going.", 
        "threadID": "672198221_5500078322001", 
        "time": "2009-05-21 11:57:00", 
        "title": "For those who still doubt", 
        "userID": "6837602"
    }, 
    {
        "content": "I hear the Fife and the drums acoming oer the bridge. The Brits wouldn't have us any longer, and France is happy being looked after by their government, no need of call out the Minutemen. Is not being Socialist owning a good portion or majority of the rail, air and communication outlets? These other countries do. In all cases the Banks are to be regulated and in the words of the new Secretary of Treasury we can force these institutions to do the bidding of the government. Have you notice, Congress has not received or past new regulations controlling what got us here in the first place? The ones presented so far are the same as the in 2005, 2008. I've yet to figure how the Union (UAW)gets 55% of Chrysler? The government will be in \"control\" not only auto builders, (build this kind of car) but all industries, (cap on CO2) individuals, taxes and high cost of energy. If you're born in the next decade the hospitals will not fill out a birth certificate, just stamp your butts USDA and send you directly to a new government and Union controlled school .", 
        "intTime": 20090521, 
        "postID": 16, 
        "quote": "", 
        "reply": "I hear the Fife and the drums acoming oer the bridge. The Brits wouldn't have us any longer, and France is happy being looked after by their government, no need of call out the Minutemen. Is not being Socialist owning a good portion or majority of the rail, air and communication outlets? These other countries do. In all cases the Banks are to be regulated and in the words of the new Secretary of Treasury we can force these institutions to do the bidding of the government. Have you notice, Congress has not received or past new regulations controlling what got us here in the first place? The ones presented so far are the same as the in 2005, 2008. I've yet to figure how the Union (UAW)gets 55% of Chrysler? The government will be in \"control\" not only auto builders, (build this kind of car) but all industries, (cap on CO2) individuals, taxes and high cost of energy. If you're born in the next decade the hospitals will not fill out a birth certificate, just stamp your butts USDA and send you directly to a new government and Union controlled school .", 
        "threadID": "672198221_5500078322001", 
        "time": "2009-05-21 11:58:00", 
        "title": "For those who still doubt", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: Originally posted by ACR26: Let them get their big checks...let the banks fail...let the market be reborn... Will it be tough when eventually it happens? You bet. The pain will be much less if we let the market adjust itself instead of Pres Obama making things worse. You do realise that the government (ie the tax payers) will pick up the tab for a LOT of the loss (FDIC, etc.) don't you while the managers will have millions in their pockets (oversea accounts).", 
        "intTime": 20090521, 
        "postID": 17, 
        "quote": "Originally posted by ACR26: Let them get their big checks...let the banks fail...let the market be reborn... Will it be tough when eventually it happens? You bet. The pain will be much less if we let the market adjust itself instead of Pres Obama making things worse.", 
        "reply": " You do realise that the government (ie the tax payers) will pick up the tab for a LOT of the loss (FDIC, etc.) don't you while the managers will have millions in their pockets (oversea accounts).", 
        "threadID": "672198221_5500078322001", 
        "time": "2009-05-21 12:15:00", 
        "title": "For those who still doubt", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by stec74: That's why we continue to get into these messes. A bunch of politicians, many of whom have never run a lemonade stand, let alone a multi-billion dollar corporation are trying to tell these corporations their opinion on the right way to do business. If these banks want to pay back the money let them. If they want to pay bonuses to their executives let them. If they fail, so be it. A couple more years of this administration and no one will have any need for money anyway. We will all have \"free\" health care, drive a white \"smart car\", and live in the same \"cookie cutter\" two bedroom apartment paid for by the government. Mr. Obama is just doing what Pres Bush I did to fix the S&L problem created by Saint Ronnie's deregs and what Pres Bush II started to fix this problem caused by deregulation. Amazing how to Repubs NOTHING is ever their fault. During the 8 years of the Bush admin they blamed everything bad that happened on Clinton and now that Obama has been in power just over 100 days (his first budget doesn't take effect until Oct) everything is his fault. I find it funny that if they are being honest then in effect the Repubs are saving their party and politicians are and have been COMPLETELY ineffective.", 
        "intTime": 20090521, 
        "postID": 18, 
        "quote": "Originally posted by stec74: That's why we continue to get into these messes. A bunch of politicians, many of whom have never run a lemonade stand, let alone a multi-billion dollar corporation are trying to tell these corporations their opinion on the right way to do business. If these banks want to pay back the money let them. If they want to pay bonuses to their executives let them. If they fail, so be it. A couple more years of this administration and no one will have any need for money anyway. We will all have \"free\" health care, drive a white \"smart car\", and live in the same \"cookie cutter\" two bedroom apartment paid for by the government.", 
        "reply": " Mr. Obama is just doing what Pres Bush I did to fix the S&L problem created by Saint Ronnie's deregs and what Pres Bush II started to fix this problem caused by deregulation. Amazing how to Repubs NOTHING is ever their fault. During the 8 years of the Bush admin they blamed everything bad that happened on Clinton and now that Obama has been in power just over 100 days (his first budget doesn't take effect until Oct) everything is his fault. I find it funny that if they are being honest then in effect the Repubs are saving their party and politicians are and have been COMPLETELY ineffective.", 
        "threadID": "672198221_5500078322001", 
        "time": "2009-05-21 12:26:00", 
        "title": "For those who still doubt", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: I'd love a Smart car. Everytime I have to park, I envy them suckers. Always tempted to put one under my coat and run with it. They should make em with handles on the roof for ease of carry That smart car...as they scrape you off the road...hope a few more mpgs was worth it", 
        "intTime": 20090521, 
        "postID": 19, 
        "quote": "I'd love a Smart car. Everytime I have to park, I envy them suckers. Always tempted to put one under my coat and run with it. They should make em with handles on the roof for ease of carry", 
        "reply": " That smart car...as they scrape you off the road...hope a few more mpgs was worth it", 
        "threadID": "672198221_5500078322001", 
        "time": "2009-05-21 15:50:00", 
        "title": "For those who still doubt", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: But the ones who supported the criminal right wing extremist thugs that are responsible for getting over 4000 Americans and hundreds of thousands of Iraqis needlessly killed did not sell out? We have a good president dedicated to the betterment of our country who was actually elected by a majority but you want to keep the right wing extremist philosophy of hate dishonor and subjugation going. I like the use of the word criminal... I like vomit too...that is a good word for this post", 
        "intTime": 20090521, 
        "postID": 20, 
        "quote": "But the ones who supported the criminal right wing extremist thugs that are responsible for getting over 4000 Americans and hundreds of thousands of Iraqis needlessly killed did not sell out? We have a good president dedicated to the betterment of our country who was actually elected by a majority but you want to keep the right wing extremist philosophy of hate dishonor and subjugation going.", 
        "reply": " I like the use of the word criminal... I like vomit too...that is a good word for this post", 
        "threadID": "672198221_5500078322001", 
        "time": "2009-05-21 15:52:00", 
        "title": "For those who still doubt", 
        "userID": "ACR26"
    }, 
    {
        "content": "How can anyone still doubt that the bullet train towards socialism has not left the station? I have seen a swing of thinking on many here on this site going from...\"we are not going socialist\" to \"what so bad about socialism?\" No matter how it is done whether with guns and force, pen and paper, or coercion of the board of directors/CEO/union bosses...socialism is socialism. \"http://www.detnews.com/article/20090520/AUTO01/905200376/Feds-to-inject-$7.5B-more-into-GMAC I would rather see every car company fail along with banks and have a massive economical impact than to see this country skip along to government run businesses because of people being too selfish, lazy, greedy, and whiny or anything else that can be added. The ones on this blog who support unconditionally on this website the actions of this Administration in my mind have already sold out. When the smoke clears and the highers are fat dumb and happy on their estates, we will be left holding the bag. Because an individual is born I am now indebted to them if they do not contribute to society. Socialism = a \"level\" playing field for the serfs...not for the glamour stars or politicians.", 
        "intTime": 20090521, 
        "postID": 21, 
        "quote": "", 
        "reply": "How can anyone still doubt that the bullet train towards socialism has not left the station? I have seen a swing of thinking on many here on this site going from...\"we are not going socialist\" to \"what so bad about socialism?\" No matter how it is done whether with guns and force, pen and paper, or coercion of the board of directors/CEO/union bosses...socialism is socialism. \"http://www.detnews.com/article/20090520/AUTO01/905200376/Feds-to-inject-$7.5B-more-into-GMAC I would rather see every car company fail along with banks and have a massive economical impact than to see this country skip along to government run businesses because of people being too selfish, lazy, greedy, and whiny or anything else that can be added. The ones on this blog who support unconditionally on this website the actions of this Administration in my mind have already sold out. When the smoke clears and the highers are fat dumb and happy on their estates, we will be left holding the bag. Because an individual is born I am now indebted to them if they do not contribute to society. Socialism = a \"level\" playing field for the serfs...not for the glamour stars or politicians.", 
        "threadID": "672198221_5500078322001", 
        "time": "2009-05-21 07:49:00", 
        "title": "For those who still doubt", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by ACR26: How can anyone still doubt that the bullet train towards socialism has not left the station? I have seen a swing of thinking on many here on this site going from...\"we are not going socialist\" to \"what so bad about socialism?\" No matter how it is done whether with guns and force, pen and paper, or coercion of the board of directors/CEO/union bosses...socialism is socialism. \"http://www.detnews.com/article/20090520/AUTO01/905200376/Feds-to-inject-$7.5B-more-into-GMAC Socialism is the involuntary expropriation of the means of production. Socialism is NOT loaning companies money until they can pay you back. If THAT\"S the definition of Socialism, you better explain all the previous bailouts and bank seizures of the last 150 years. All these companies getting Federal money will NEVER be government owned. Indeed, even the bank seizures merely guarranteed profit and \"socialised\" the risk. As a long time honest to God Socialist, I can tell you point blank that I support almost none of these moves - Because they are the very opposite of Socialism. quote: Originally posted by ACR26: I would rather see every car company fail along with banks and have a massive economical impact than to see this country skip along to government run businesses because of people being too selfish, lazy, greedy, and whiny or anything else that can be added. The ones on this blog who support unconditionally on this website the actions of this Administration in my mind have already sold out. Thank you, that leaves ME off the hook... quote: Originally posted by ACR26: When the smoke clears and the highers are fat dumb and happy on their estates, we will be left holding the bag. Because an individual is born I am now indebted to them if they do not contribute to society. Socialism = a \"level\" playing field for the serfs...not for the glamour stars or politicians. You bet, the public WILL be holding the bag, precisly because this is not Socialism. It's nothing more than welfare for the rich. All risks are born by the public and all gain will go to the owners. Apparently the Bush/Obama version of Capitalism is something that you don't like - But it is typical of Monopoly Capitalism to pass it's losses to the people. It's certainly not Socialism. Dave", 
        "intTime": 20090521, 
        "postID": 22, 
        "quote": "Originally posted by ACR26: How can anyone still doubt that the bullet train towards socialism has not left the station? I have seen a swing of thinking on many here on this site going from...\"we are not going socialist\" to \"what so bad about socialism?\" No matter how it is done whether with guns and force, pen and paper, or coercion of the board of directors/CEO/union bosses...socialism is socialism. \"http://www.detnews.com/article/20090520/AUTO01/905200376/Feds-to-inject-$7.5B-more-into-GMAC", 
        "reply": " Socialism is the involuntary expropriation of the means of production. Socialism is NOT loaning companies money until they can pay you back. If THAT\"S the definition of Socialism, you better explain all the previous bailouts and bank seizures of the last 150 years. All these companies getting Federal money will NEVER be government owned. Indeed, even the bank seizures merely guarranteed profit and \"socialised\" the risk. As a long time honest to God Socialist, I can tell you point blank that I support almost none of these moves - Because they are the very opposite of Socialism. quote: Originally posted by ACR26: I would rather see every car company fail along with banks and have a massive economical impact than to see this country skip along to government run businesses because of people being too selfish, lazy, greedy, and whiny or anything else that can be added. The ones on this blog who support unconditionally on this website the actions of this Administration in my mind have already sold out. Thank you, that leaves ME off the hook... quote: Originally posted by ACR26: When the smoke clears and the highers are fat dumb and happy on their estates, we will be left holding the bag. Because an individual is born I am now indebted to them if they do not contribute to society. Socialism = a \"level\" playing field for the serfs...not for the glamour stars or politicians. You bet, the public WILL be holding the bag, precisly because this is not Socialism. It's nothing more than welfare for the rich. All risks are born by the public and all gain will go to the owners. Apparently the Bush/Obama version of Capitalism is something that you don't like - But it is typical of Monopoly Capitalism to pass it's losses to the people. It's certainly not Socialism. Dave", 
        "threadID": "672198221_5500078322001", 
        "time": "2009-05-21 08:34:00", 
        "title": "For those who still doubt", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: All these companies getting Federal money will NEVER be government owned. Indeed, even the bank seizures merely guarranteed profit and \"socialised\" the risk. As a long time honest to God Socialist, I can tell you point blank that I support almost none of these moves - Because they are the very opposite of Socialism. Never say never. quote: NEW YORK (Reuters) - If General Motors Corp (GM.N) files for bankruptcy, as widely expected, its healthy assets will be quickly sold to a new company owned by the U.S. government, a source familiar with the situation said on Tuesday. The source, who was not cleared to speak with the media and would not be identified, said the U.S. government would pay for the assets by assuming the automaker's $6 billion of secured debt and forgiving the bulk of the $15.4 billion of emergency loans that the U.S. Treasury has provided to GM. The government is negotiating the terms on which it will assume GM's secured debt and might make an the offer to holders of the debt that is far superior to the one made to Chrysler LLC's secured lenders, the source said. \"http://www.reuters.com/article/euDealsNews/idUSTRE54H6AN20090520\"", 
        "intTime": 20090521, 
        "postID": 23, 
        "quote": "Originally posted by Grachus: All these companies getting Federal money will NEVER be government owned. Indeed, even the bank seizures merely guarranteed profit and \"socialised\" the risk. As a long time honest to God Socialist, I can tell you point blank that I support almost none of these moves - Because they are the very opposite of Socialism.", 
        "reply": " Never say never. quote: NEW YORK (Reuters) - If General Motors Corp (GM.N) files for bankruptcy, as widely expected, its healthy assets will be quickly sold to a new company owned by the U.S. government, a source familiar with the situation said on Tuesday. The source, who was not cleared to speak with the media and would not be identified, said the U.S. government would pay for the assets by assuming the automaker's $6 billion of secured debt and forgiving the bulk of the $15.4 billion of emergency loans that the U.S. Treasury has provided to GM. The government is negotiating the terms on which it will assume GM's secured debt and might make an the offer to holders of the debt that is far superior to the one made to Chrysler LLC's secured lenders, the source said. \"http://www.reuters.com/article/euDealsNews/idUSTRE54H6AN20090520\"", 
        "threadID": "672198221_5500078322001", 
        "time": "2009-05-21 09:14:00", 
        "title": "For those who still doubt", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Originally posted by stec74: quote: Originally posted by Grachus: All these companies getting Federal money will NEVER be government owned. Indeed, even the bank seizures merely guarranteed profit and \"socialised\" the risk. As a long time honest to God Socialist, I can tell you point blank that I support almost none of these moves - Because they are the very opposite of Socialism. Never say never. quote: NEW YORK (Reuters) - If General Motors Corp (GM.N) files for bankruptcy, as widely expected, its healthy assets will be quickly sold to a new company owned by the U.S. government, a source familiar with the situation said on Tuesday. The source, who was not cleared to speak with the media and would not be identified, said the U.S. government would pay for the assets by assuming the automaker's $6 billion of secured debt and forgiving the bulk of the $15.4 billion of emergency loans that the U.S. Treasury has provided to GM. The government is negotiating the terms on which it will assume GM's secured debt and might make an the offer to holders of the debt that is far superior to the one made to Chrysler LLC's secured lenders, the source said. \"http://www.reuters.com/article/euDealsNews/idUSTRE54H6AN20090520\" It might very well turn out that the Government winds up \"owning\" these companies. But they wont keep them, have no intention of keeping them, and NEVER had an intention of keeping them. And I believe you are aware of this... Dave", 
        "intTime": 20090521, 
        "postID": 24, 
        "quote": "Originally posted by stec74: quote: Originally posted by Grachus: All these companies getting Federal money will NEVER be government owned. Indeed, even the bank seizures merely guarranteed profit and \"socialised\" the risk. As a long time honest to God Socialist, I can tell you point blank that I support almost none of these moves - Because they are the very opposite of Socialism. Never say never. quote: NEW YORK (Reuters) - If General Motors Corp (GM.N) files for bankruptcy, as widely expected, its healthy assets will be quickly sold to a new company owned by the U.S. government, a source familiar with the situation said on Tuesday. The source, who was not cleared to speak with the media and would not be identified, said the U.S. government would pay for the assets by assuming the automaker's $6 billion of secured debt and forgiving the bulk of the $15.4 billion of emergency loans that the U.S. Treasury has provided to GM. The government is negotiating the terms on which it will assume GM's secured debt and might make an the offer to holders of the debt that is far superior to the one made to Chrysler LLC's secured lenders, the source said. \"http://www.reuters.com/article/euDealsNews/idUSTRE54H6AN20090520\"", 
        "reply": " It might very well turn out that the Government winds up \"owning\" these companies. But they wont keep them, have no intention of keeping them, and NEVER had an intention of keeping them. And I believe you are aware of this... Dave", 
        "threadID": "672198221_5500078322001", 
        "time": "2009-05-21 10:18:00", 
        "title": "For those who still doubt", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: It might very well turn out that the Government winds up \"owning\" these companies. But they wont keep themHA!, have no intention of keeping themDouble HA!, and NEVER had an intention of keeping them HAR DE HAR HAR!. And I believe you are aware of this... Dave", 
        "intTime": 20090521, 
        "postID": 25, 
        "quote": "Originally posted by Grachus: It might very well turn out that the Government winds up \"owning\" these companies. But they wont keep themHA!, have no intention of keeping themDouble HA!, and NEVER had an intention of keeping them HAR DE HAR HAR!. And I believe you are aware of this... Dave", 
        "reply": "", 
        "threadID": "672198221_5500078322001", 
        "time": "2009-05-21 10:22:00", 
        "title": "For those who still doubt", 
        "userID": "FIST101CAV"
    }, 
    {
        "content": "quote: Socialism is the involuntary expropriation of the means of production. Socialism is NOT loaning companies money until they can pay you back. If THAT\"S the definition of Socialism, you better explain all the previous bailouts and bank seizures of the last 150 years. All these companies getting Federal money will NEVER be government owned. Indeed, even the bank seizures merely guarranteed profit and \"socialised\" the risk. As a long time honest to God Socialist, I can tell you point blank that I support almost none of these moves - Because they are the very opposite of Socialism. So replacing board members/CEO's with for lack of a better term \"government lackeys\" falls into the category of \"just loaning money\". How about dictating again what cars will be built? Is that \"just loaning money?\" Restricting compensation of management is just \"loaning money?\" What about taking away the board members voting rights on the board? Why have them there and not outright remove them? Because then there might be a lawsuit. These dudes that work at GMAC and GM are just as guilty as this administration It is our money bailing out the union employees, CEO's, and management. We will ensure the clowns who put themselves billions of dollars in the hole get their pension. How insane is this? The union gets a crapload of money for putting cars together as is, the sups and execs get a crapload of money marketing cars…meanwhile they are losing profit. The union wants more the execs want more they all get what they want and they lose money faster as a company. I am paying for that turd on the line putting lug nuts on a wheel at what ever $$ amount. I am paying for that exec to keep his mansion…meanwhile my taxes are not reduced in the slightest dwindling my chances of sending my kids to a decent non-public school. WTF is that all about????? Then in steps the government…we loan them money at first with no stipulation other than it will be paid back with interest…bad move on our part. Now we loan them MORE and MORE money and try to dictate with mandates what to build. WTF is THAT? You can slice that dirt pie any way you want grachus but when you boil all the fat away, government run/controlled/owned is socialism.", 
        "intTime": 20090521, 
        "postID": 26, 
        "quote": "Socialism is the involuntary expropriation of the means of production. Socialism is NOT loaning companies money until they can pay you back. If THAT\"S the definition of Socialism, you better explain all the previous bailouts and bank seizures of the last 150 years. All these companies getting Federal money will NEVER be government owned. Indeed, even the bank seizures merely guarranteed profit and \"socialised\" the risk. As a long time honest to God Socialist, I can tell you point blank that I support almost none of these moves - Because they are the very opposite of Socialism.", 
        "reply": " So replacing board members/CEO's with for lack of a better term \"government lackeys\" falls into the category of \"just loaning money\". How about dictating again what cars will be built? Is that \"just loaning money?\" Restricting compensation of management is just \"loaning money?\" What about taking away the board members voting rights on the board? Why have them there and not outright remove them? Because then there might be a lawsuit. These dudes that work at GMAC and GM are just as guilty as this administration It is our money bailing out the union employees, CEO's, and management. We will ensure the clowns who put themselves billions of dollars in the hole get their pension. How insane is this? The union gets a crapload of money for putting cars together as is, the sups and execs get a crapload of money marketing cars…meanwhile they are losing profit. The union wants more the execs want more they all get what they want and they lose money faster as a company. I am paying for that turd on the line putting lug nuts on a wheel at what ever $$ amount. I am paying for that exec to keep his mansion…meanwhile my taxes are not reduced in the slightest dwindling my chances of sending my kids to a decent non-public school. WTF is that all about????? Then in steps the government…we loan them money at first with no stipulation other than it will be paid back with interest…bad move on our part. Now we loan them MORE and MORE money and try to dictate with mandates what to build. WTF is THAT? You can slice that dirt pie any way you want grachus but when you boil all the fat away, government run/controlled/owned is socialism.", 
        "threadID": "672198221_5500078322001", 
        "time": "2009-05-21 10:29:00", 
        "title": "For those who still doubt", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by FIST101CAV: quote: Originally posted by Grachus: It might very well turn out that the Government winds up \"owning\" these companies. But they wont keep themHA!, have no intention of keeping themDouble HA!, and NEVER had an intention of keeping them HAR DE HAR HAR!. And I believe you are aware of this... Dave Err, you do know that this is not the FIRST time that the government stepped in to bail out the auto industry? And it sure as hell isn't the first time that the government seized banks. Dave", 
        "intTime": 20090521, 
        "postID": 27, 
        "quote": "Originally posted by FIST101CAV: quote: Originally posted by Grachus: It might very well turn out that the Government winds up \"owning\" these companies. But they wont keep themHA!, have no intention of keeping themDouble HA!, and NEVER had an intention of keeping them HAR DE HAR HAR!. And I believe you are aware of this... Dave", 
        "reply": " Err, you do know that this is not the FIRST time that the government stepped in to bail out the auto industry? And it sure as hell isn't the first time that the government seized banks. Dave", 
        "threadID": "672198221_5500078322001", 
        "time": "2009-05-21 10:30:00", 
        "title": "For those who still doubt", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by stec74: quote: Originally posted by Grachus: All these companies getting Federal money will NEVER be government owned. Indeed, even the bank seizures merely guarranteed profit and \"socialised\" the risk. As a long time honest to God Socialist, I can tell you point blank that I support almost none of these moves - Because they are the very opposite of Socialism. Never say never. quote: NEW YORK (Reuters) - If General Motors Corp (GM.N) files for bankruptcy, as widely expected, its healthy assets will be quickly sold to a new company owned by the U.S. government, a source familiar with the situation said on Tuesday. The source, who was not cleared to speak with the media and would not be identified, said the U.S. government would pay for the assets by assuming the automaker's $6 billion of secured debt and forgiving the bulk of the $15.4 billion of emergency loans that the U.S. Treasury has provided to GM. The government is negotiating the terms on which it will assume GM's secured debt and might make an the offer to holders of the debt that is far superior to the one made to Chrysler LLC's secured lenders, the source said. \"http://www.reuters.com/article/euDealsNews/idUSTRE54H6AN20090520\" It might very well turn out that the Government winds up \"owning\" these companies. But they wont keep them, have no intention of keeping them, and NEVER had an intention of keeping them. And I believe you are aware of this... Dave I also thought the government would accept money from the financial institutions that received bailout money to pay it back. That hasn't turned out quite the way I expected.", 
        "intTime": 20090521, 
        "postID": 28, 
        "quote": "Originally posted by Grachus: quote: Originally posted by stec74: quote: Originally posted by Grachus: All these companies getting Federal money will NEVER be government owned. Indeed, even the bank seizures merely guarranteed profit and \"socialised\" the risk. As a long time honest to God Socialist, I can tell you point blank that I support almost none of these moves - Because they are the very opposite of Socialism. Never say never. quote: NEW YORK (Reuters) - If General Motors Corp (GM.N) files for bankruptcy, as widely expected, its healthy assets will be quickly sold to a new company owned by the U.S. government, a source familiar with the situation said on Tuesday. The source, who was not cleared to speak with the media and would not be identified, said the U.S. government would pay for the assets by assuming the automaker's $6 billion of secured debt and forgiving the bulk of the $15.4 billion of emergency loans that the U.S. Treasury has provided to GM. The government is negotiating the terms on which it will assume GM's secured debt and might make an the offer to holders of the debt that is far superior to the one made to Chrysler LLC's secured lenders, the source said. \"http://www.reuters.com/article/euDealsNews/idUSTRE54H6AN20090520\" It might very well turn out that the Government winds up \"owning\" these companies. But they wont keep them, have no intention of keeping them, and NEVER had an intention of keeping them. And I believe you are aware of this... Dave", 
        "reply": " I also thought the government would accept money from the financial institutions that received bailout money to pay it back. That hasn't turned out quite the way I expected.", 
        "threadID": "672198221_5500078322001", 
        "time": "2009-05-21 10:38:00", 
        "title": "For those who still doubt", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Err, you do know that this is not the FIRST time that the government stepped in to bail out the auto industry? And it sure as hell isn't the first time that the government seized banks. delusional", 
        "intTime": 20090521, 
        "postID": 29, 
        "quote": "Err, you do know that this is not the FIRST time that the government stepped in to bail out the auto industry? And it sure as hell isn't the first time that the government seized banks.", 
        "reply": " delusional", 
        "threadID": "672198221_5500078322001", 
        "time": "2009-05-21 10:45:00", 
        "title": "For those who still doubt", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by stec74: quote: Originally posted by Grachus: quote: Originally posted by stec74: quote: Originally posted by Grachus: All these companies getting Federal money will NEVER be government owned. Indeed, even the bank seizures merely guarranteed profit and \"socialised\" the risk. As a long time honest to God Socialist, I can tell you point blank that I support almost none of these moves - Because they are the very opposite of Socialism. Never say never. quote: NEW YORK (Reuters) - If General Motors Corp (GM.N) files for bankruptcy, as widely expected, its healthy assets will be quickly sold to a new company owned by the U.S. government, a source familiar with the situation said on Tuesday. The source, who was not cleared to speak with the media and would not be identified, said the U.S. government would pay for the assets by assuming the automaker's $6 billion of secured debt and forgiving the bulk of the $15.4 billion of emergency loans that the U.S. Treasury has provided to GM. The government is negotiating the terms on which it will assume GM's secured debt and might make an the offer to holders of the debt that is far superior to the one made to Chrysler LLC's secured lenders, the source said. \"http://www.reuters.com/article /euDealsNews/idUSTRE54H6AN20090520\" It might very well turn out that the Government winds up \"owning\" these companies. But they wont keep them, have no intention of keeping them, and NEVER had an intention of keeping them. And I believe you are aware of this... Dave I also thought the government would accept money from the financial institutions that received bailout money to pay it back. That hasn't turned out quite the way I expected. If a bank (company management) wants to pay back quickly so management can start getting their big bonuses again (current case) and doing so carries a significant risk that bank would get in financial trouble again should they be allowed to pay back the money or should they have to wait until they are in a better financial state? How many of these banks would still want to pay back quickly if management would still have to wait before they could start getting bonuses again? IMO NONE.", 
        "intTime": 20090521, 
        "postID": 30, 
        "quote": "Originally posted by stec74: quote: Originally posted by Grachus: quote: Originally posted by stec74: quote: Originally posted by Grachus: All these companies getting Federal money will NEVER be government owned. Indeed, even the bank seizures merely guarranteed profit and \"socialised\" the risk. As a long time honest to God Socialist, I can tell you point blank that I support almost none of these moves - Because they are the very opposite of Socialism. Never say never. quote: NEW YORK (Reuters) - If General Motors Corp (GM.N) files for bankruptcy, as widely expected, its healthy assets will be quickly sold to a new company owned by the U.S. government, a source familiar with the situation said on Tuesday. The source, who was not cleared to speak with the media and would not be identified, said the U.S. government would pay for the assets by assuming the automaker's $6 billion of secured debt and forgiving the bulk of the $15.4 billion of emergency loans that the U.S. Treasury has provided to GM. The government is negotiating the terms on which it will assume GM's secured debt and might make an the offer to holders of the debt that is far superior to the one made to Chrysler LLC's secured lenders, the source said. \"http://www.reuters.com/article /euDealsNews/idUSTRE54H6AN20090520\" It might very well turn out that the Government winds up \"owning\" these companies. But they wont keep them, have no intention of keeping them, and NEVER had an intention of keeping them. And I believe you are aware of this... Dave I also thought the government would accept money from the financial institutions that received bailout money to pay it back. That hasn't turned out quite the way I expected.", 
        "reply": " If a bank (company management) wants to pay back quickly so management can start getting their big bonuses again (current case) and doing so carries a significant risk that bank would get in financial trouble again should they be allowed to pay back the money or should they have to wait until they are in a better financial state? How many of these banks would still want to pay back quickly if management would still have to wait before they could start getting bonuses again? IMO NONE.", 
        "threadID": "672198221_5500078322001", 
        "time": "2009-05-21 10:54:00", 
        "title": "For those who still doubt", 
        "userID": "rayld2"
    }, 
    {
        "content": "Let them get their big checks...let the banks fail...let the market be reborn... Will it be tough when eventually it happens? You bet. The pain will be much less if we let the market adjust itself instead of Pres Obama making things worse.", 
        "intTime": 20090521, 
        "postID": 31, 
        "quote": "", 
        "reply": "Let them get their big checks...let the banks fail...let the market be reborn... Will it be tough when eventually it happens? You bet. The pain will be much less if we let the market adjust itself instead of Pres Obama making things worse.", 
        "threadID": "672198221_5500078322001", 
        "time": "2009-05-21 11:18:00", 
        "title": "For those who still doubt", 
        "userID": "ACR26"
    }, 
    {
        "content": "That's why we continue to get into these messes. A bunch of politicians, many of whom have never run a lemonade stand, let alone a multi-billion dollar corporation are trying to tell these corporations their opinion on the right way to do business. If these banks want to pay back the money let them. If they want to pay bonuses to their executives let them. If they fail, so be it. A couple more years of this administration and no one will have any need for money anyway. We will all have \"free\" health care, drive a white \"smart car\", and live in the same \"cookie cutter\" two bedroom apartment paid for by the government.", 
        "intTime": 20090521, 
        "postID": 32, 
        "quote": "", 
        "reply": "That's why we continue to get into these messes. A bunch of politicians, many of whom have never run a lemonade stand, let alone a multi-billion dollar corporation are trying to tell these corporations their opinion on the right way to do business. If these banks want to pay back the money let them. If they want to pay bonuses to their executives let them. If they fail, so be it. A couple more years of this administration and no one will have any need for money anyway. We will all have \"free\" health care, drive a white \"smart car\", and live in the same \"cookie cutter\" two bedroom apartment paid for by the government.", 
        "threadID": "672198221_5500078322001", 
        "time": "2009-05-21 11:23:00", 
        "title": "For those who still doubt", 
        "userID": "stec74"
    }, 
    {
        "content": "Socialism never works. Ask the Brits. Or France. Better yet...look at the past. The USSR! We are America. How long will we stay AMERICA? The Land of the FREE! The Home of the BRAVE!", 
        "intTime": 20090521, 
        "postID": 33, 
        "quote": "", 
        "reply": "Socialism never works. Ask the Brits. Or France. Better yet...look at the past. The USSR! We are America. How long will we stay AMERICA? The Land of the FREE! The Home of the BRAVE!", 
        "threadID": "672198221_5500078322001", 
        "time": "2009-05-21 11:36:00", 
        "title": "For those who still doubt", 
        "userID": "Agent991"
    }, 
    {
        "content": "quote: Originally posted by stec74: That's why we continue to get into these messes. A bunch of politicians, many of whom have never run a lemonade stand, let alone a multi-billion dollar corporation are trying to tell these corporations their opinion on the right way to do business. If these banks want to pay back the money let them. If they want to pay bonuses to their executives let them. If they fail, so be it. A couple more years of this administration and no one will have any need for money anyway. We will all have \"free\" health care, drive a white \"smart car\", and live in the same \"cookie cutter\" two bedroom apartment paid for by the government. I'd love a Smart car. Everytime I have to park, I envy them suckers. Always tempted to put one under my coat and run with it. They should make em with handles on the roof for ease of carry... Dave", 
        "intTime": 20090521, 
        "postID": 34, 
        "quote": "Originally posted by stec74: That's why we continue to get into these messes. A bunch of politicians, many of whom have never run a lemonade stand, let alone a multi-billion dollar corporation are trying to tell these corporations their opinion on the right way to do business. If these banks want to pay back the money let them. If they want to pay bonuses to their executives let them. If they fail, so be it. A couple more years of this administration and no one will have any need for money anyway. We will all have \"free\" health care, drive a white \"smart car\", and live in the same \"cookie cutter\" two bedroom apartment paid for by the government.", 
        "reply": " I'd love a Smart car. Everytime I have to park, I envy them suckers. Always tempted to put one under my coat and run with it. They should make em with handles on the roof for ease of carry... Dave", 
        "threadID": "672198221_5500078322001", 
        "time": "2009-05-21 11:49:00", 
        "title": "For those who still doubt", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by ACR26: How can anyone still doubt that the bullet train towards socialism has not left the station? I have seen a swing of thinking on many here on this site going from...\"we are not going socialist\" to \"what so bad about socialism?\" No matter how it is done whether with guns and force, pen and paper, or coercion of the board of directors/CEO/union bosses...socialism is socialism. \"http://www.detnews.com/article/20090520/AUTO01/905200376/Feds-to-inject-$7.5B-more-into-GMAC I would rather see every car company fail along with banks and have a massive economical impact than to see this country skip along to government run businesses because of people being too selfish, lazy, greedy, and whiny or anything else that can be added. The ones on this blog who support unconditionally on this website the actions of this Administration in my mind have already sold out. When the smoke clears and the highers are fat dumb and happy on their estates, we will be left holding the bag. Because an individual is born I am now indebted to them if they do not contribute to society. Socialism = a \"level\" playing field for the serfs...not for the glamour stars or politicians. \"The ones on this blog who support unconditionally on this website the actions of this Administration in my mind have already sold out. \" But the ones who supported the criminal right wing extremist thugs that are responsible for getting over 4000 Americans and hundreds of thousands of Iraqis needlessly killed did not sell out? We have a good president dedicated to the betterment of our country who was actually elected by a majority but you want to keep the right wing extremist philosophy of hate dishonor and subjugation going.", 
        "intTime": 20090521, 
        "postID": 35, 
        "quote": "Originally posted by ACR26: How can anyone still doubt that the bullet train towards socialism has not left the station? I have seen a swing of thinking on many here on this site going from...\"we are not going socialist\" to \"what so bad about socialism?\" No matter how it is done whether with guns and force, pen and paper, or coercion of the board of directors/CEO/union bosses...socialism is socialism. \"http://www.detnews.com/article/20090520/AUTO01/905200376/Feds-to-inject-$7.5B-more-into-GMAC I would rather see every car company fail along with banks and have a massive economical impact than to see this country skip along to government run businesses because of people being too selfish, lazy, greedy, and whiny or anything else that can be added. The ones on this blog who support unconditionally on this website the actions of this Administration in my mind have already sold out. When the smoke clears and the highers are fat dumb and happy on their estates, we will be left holding the bag. Because an individual is born I am now indebted to them if they do not contribute to society. Socialism = a \"level\" playing field for the serfs...not for the glamour stars or politicians.", 
        "reply": " \"The ones on this blog who support unconditionally on this website the actions of this Administration in my mind have already sold out. \" But the ones who supported the criminal right wing extremist thugs that are responsible for getting over 4000 Americans and hundreds of thousands of Iraqis needlessly killed did not sell out? We have a good president dedicated to the betterment of our country who was actually elected by a majority but you want to keep the right wing extremist philosophy of hate dishonor and subjugation going.", 
        "threadID": "672198221_5500078322001", 
        "time": "2009-05-21 11:57:00", 
        "title": "For those who still doubt", 
        "userID": "6837602"
    }, 
    {
        "content": "I hear the Fife and the drums acoming oer the bridge. The Brits wouldn't have us any longer, and France is happy being looked after by their government, no need of call out the Minutemen. Is not being Socialist owning a good portion or majority of the rail, air and communication outlets? These other countries do. In all cases the Banks are to be regulated and in the words of the new Secretary of Treasury we can force these institutions to do the bidding of the government. Have you notice, Congress has not received or past new regulations controlling what got us here in the first place? The ones presented so far are the same as the in 2005, 2008. I've yet to figure how the Union (UAW)gets 55% of Chrysler? The government will be in \"control\" not only auto builders, (build this kind of car) but all industries, (cap on CO2) individuals, taxes and high cost of energy. If you're born in the next decade the hospitals will not fill out a birth certificate, just stamp your butts USDA and send you directly to a new government and Union controlled school .", 
        "intTime": 20090521, 
        "postID": 36, 
        "quote": "", 
        "reply": "I hear the Fife and the drums acoming oer the bridge. The Brits wouldn't have us any longer, and France is happy being looked after by their government, no need of call out the Minutemen. Is not being Socialist owning a good portion or majority of the rail, air and communication outlets? These other countries do. In all cases the Banks are to be regulated and in the words of the new Secretary of Treasury we can force these institutions to do the bidding of the government. Have you notice, Congress has not received or past new regulations controlling what got us here in the first place? The ones presented so far are the same as the in 2005, 2008. I've yet to figure how the Union (UAW)gets 55% of Chrysler? The government will be in \"control\" not only auto builders, (build this kind of car) but all industries, (cap on CO2) individuals, taxes and high cost of energy. If you're born in the next decade the hospitals will not fill out a birth certificate, just stamp your butts USDA and send you directly to a new government and Union controlled school .", 
        "threadID": "672198221_5500078322001", 
        "time": "2009-05-21 11:58:00", 
        "title": "For those who still doubt", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: Originally posted by ACR26: Let them get their big checks...let the banks fail...let the market be reborn... Will it be tough when eventually it happens? You bet. The pain will be much less if we let the market adjust itself instead of Pres Obama making things worse. You do realise that the government (ie the tax payers) will pick up the tab for a LOT of the loss (FDIC, etc.) don't you while the managers will have millions in their pockets (oversea accounts).", 
        "intTime": 20090521, 
        "postID": 37, 
        "quote": "Originally posted by ACR26: Let them get their big checks...let the banks fail...let the market be reborn... Will it be tough when eventually it happens? You bet. The pain will be much less if we let the market adjust itself instead of Pres Obama making things worse.", 
        "reply": " You do realise that the government (ie the tax payers) will pick up the tab for a LOT of the loss (FDIC, etc.) don't you while the managers will have millions in their pockets (oversea accounts).", 
        "threadID": "672198221_5500078322001", 
        "time": "2009-05-21 12:15:00", 
        "title": "For those who still doubt", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by stec74: That's why we continue to get into these messes. A bunch of politicians, many of whom have never run a lemonade stand, let alone a multi-billion dollar corporation are trying to tell these corporations their opinion on the right way to do business. If these banks want to pay back the money let them. If they want to pay bonuses to their executives let them. If they fail, so be it. A couple more years of this administration and no one will have any need for money anyway. We will all have \"free\" health care, drive a white \"smart car\", and live in the same \"cookie cutter\" two bedroom apartment paid for by the government. Mr. Obama is just doing what Pres Bush I did to fix the S&L problem created by Saint Ronnie's deregs and what Pres Bush II started to fix this problem caused by deregulation. Amazing how to Repubs NOTHING is ever their fault. During the 8 years of the Bush admin they blamed everything bad that happened on Clinton and now that Obama has been in power just over 100 days (his first budget doesn't take effect until Oct) everything is his fault. I find it funny that if they are being honest then in effect the Repubs are saving their party and politicians are and have been COMPLETELY ineffective.", 
        "intTime": 20090521, 
        "postID": 38, 
        "quote": "Originally posted by stec74: That's why we continue to get into these messes. A bunch of politicians, many of whom have never run a lemonade stand, let alone a multi-billion dollar corporation are trying to tell these corporations their opinion on the right way to do business. If these banks want to pay back the money let them. If they want to pay bonuses to their executives let them. If they fail, so be it. A couple more years of this administration and no one will have any need for money anyway. We will all have \"free\" health care, drive a white \"smart car\", and live in the same \"cookie cutter\" two bedroom apartment paid for by the government.", 
        "reply": " Mr. Obama is just doing what Pres Bush I did to fix the S&L problem created by Saint Ronnie's deregs and what Pres Bush II started to fix this problem caused by deregulation. Amazing how to Repubs NOTHING is ever their fault. During the 8 years of the Bush admin they blamed everything bad that happened on Clinton and now that Obama has been in power just over 100 days (his first budget doesn't take effect until Oct) everything is his fault. I find it funny that if they are being honest then in effect the Repubs are saving their party and politicians are and have been COMPLETELY ineffective.", 
        "threadID": "672198221_5500078322001", 
        "time": "2009-05-21 12:26:00", 
        "title": "For those who still doubt", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: I'd love a Smart car. Everytime I have to park, I envy them suckers. Always tempted to put one under my coat and run with it. They should make em with handles on the roof for ease of carry That smart car...as they scrape you off the road...hope a few more mpgs was worth it", 
        "intTime": 20090521, 
        "postID": 39, 
        "quote": "I'd love a Smart car. Everytime I have to park, I envy them suckers. Always tempted to put one under my coat and run with it. They should make em with handles on the roof for ease of carry", 
        "reply": " That smart car...as they scrape you off the road...hope a few more mpgs was worth it", 
        "threadID": "672198221_5500078322001", 
        "time": "2009-05-21 15:50:00", 
        "title": "For those who still doubt", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: But the ones who supported the criminal right wing extremist thugs that are responsible for getting over 4000 Americans and hundreds of thousands of Iraqis needlessly killed did not sell out? We have a good president dedicated to the betterment of our country who was actually elected by a majority but you want to keep the right wing extremist philosophy of hate dishonor and subjugation going. I like the use of the word criminal... I like vomit too...that is a good word for this post", 
        "intTime": 20090521, 
        "postID": 40, 
        "quote": "But the ones who supported the criminal right wing extremist thugs that are responsible for getting over 4000 Americans and hundreds of thousands of Iraqis needlessly killed did not sell out? We have a good president dedicated to the betterment of our country who was actually elected by a majority but you want to keep the right wing extremist philosophy of hate dishonor and subjugation going.", 
        "reply": " I like the use of the word criminal... I like vomit too...that is a good word for this post", 
        "threadID": "672198221_5500078322001", 
        "time": "2009-05-21 15:52:00", 
        "title": "For those who still doubt", 
        "userID": "ACR26"
    }, 
    {
        "content": "How can anyone still doubt that the bullet train towards socialism has not left the station? I have seen a swing of thinking on many here on this site going from...\"we are not going socialist\" to \"what so bad about socialism?\" No matter how it is done whether with guns and force, pen and paper, or coercion of the board of directors/CEO/union bosses...socialism is socialism. \"http://www.detnews.com/article/20090520/AUTO01/905200376/Feds-to-inject-$7.5B-more-into-GMAC I would rather see every car company fail along with banks and have a massive economical impact than to see this country skip along to government run businesses because of people being too selfish, lazy, greedy, and whiny or anything else that can be added. The ones on this blog who support unconditionally on this website the actions of this Administration in my mind have already sold out. When the smoke clears and the highers are fat dumb and happy on their estates, we will be left holding the bag. Because an individual is born I am now indebted to them if they do not contribute to society. Socialism = a \"level\" playing field for the serfs...not for the glamour stars or politicians.", 
        "intTime": 20090521, 
        "postID": 41, 
        "quote": "", 
        "reply": "How can anyone still doubt that the bullet train towards socialism has not left the station? I have seen a swing of thinking on many here on this site going from...\"we are not going socialist\" to \"what so bad about socialism?\" No matter how it is done whether with guns and force, pen and paper, or coercion of the board of directors/CEO/union bosses...socialism is socialism. \"http://www.detnews.com/article/20090520/AUTO01/905200376/Feds-to-inject-$7.5B-more-into-GMAC I would rather see every car company fail along with banks and have a massive economical impact than to see this country skip along to government run businesses because of people being too selfish, lazy, greedy, and whiny or anything else that can be added. The ones on this blog who support unconditionally on this website the actions of this Administration in my mind have already sold out. When the smoke clears and the highers are fat dumb and happy on their estates, we will be left holding the bag. Because an individual is born I am now indebted to them if they do not contribute to society. Socialism = a \"level\" playing field for the serfs...not for the glamour stars or politicians.", 
        "threadID": "672198221_5500078322001", 
        "time": "2009-05-21 07:49:00", 
        "title": "For those who still doubt", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by ACR26: How can anyone still doubt that the bullet train towards socialism has not left the station? I have seen a swing of thinking on many here on this site going from...\"we are not going socialist\" to \"what so bad about socialism?\" No matter how it is done whether with guns and force, pen and paper, or coercion of the board of directors/CEO/union bosses...socialism is socialism. \"http://www.detnews.com/article/20090520/AUTO01/905200376/Feds-to-inject-$7.5B-more-into-GMAC Socialism is the involuntary expropriation of the means of production. Socialism is NOT loaning companies money until they can pay you back. If THAT\"S the definition of Socialism, you better explain all the previous bailouts and bank seizures of the last 150 years. All these companies getting Federal money will NEVER be government owned. Indeed, even the bank seizures merely guarranteed profit and \"socialised\" the risk. As a long time honest to God Socialist, I can tell you point blank that I support almost none of these moves - Because they are the very opposite of Socialism. quote: Originally posted by ACR26: I would rather see every car company fail along with banks and have a massive economical impact than to see this country skip along to government run businesses because of people being too selfish, lazy, greedy, and whiny or anything else that can be added. The ones on this blog who support unconditionally on this website the actions of this Administration in my mind have already sold out. Thank you, that leaves ME off the hook... quote: Originally posted by ACR26: When the smoke clears and the highers are fat dumb and happy on their estates, we will be left holding the bag. Because an individual is born I am now indebted to them if they do not contribute to society. Socialism = a \"level\" playing field for the serfs...not for the glamour stars or politicians. You bet, the public WILL be holding the bag, precisly because this is not Socialism. It's nothing more than welfare for the rich. All risks are born by the public and all gain will go to the owners. Apparently the Bush/Obama version of Capitalism is something that you don't like - But it is typical of Monopoly Capitalism to pass it's losses to the people. It's certainly not Socialism. Dave", 
        "intTime": 20090521, 
        "postID": 42, 
        "quote": "Originally posted by ACR26: How can anyone still doubt that the bullet train towards socialism has not left the station? I have seen a swing of thinking on many here on this site going from...\"we are not going socialist\" to \"what so bad about socialism?\" No matter how it is done whether with guns and force, pen and paper, or coercion of the board of directors/CEO/union bosses...socialism is socialism. \"http://www.detnews.com/article/20090520/AUTO01/905200376/Feds-to-inject-$7.5B-more-into-GMAC", 
        "reply": " Socialism is the involuntary expropriation of the means of production. Socialism is NOT loaning companies money until they can pay you back. If THAT\"S the definition of Socialism, you better explain all the previous bailouts and bank seizures of the last 150 years. All these companies getting Federal money will NEVER be government owned. Indeed, even the bank seizures merely guarranteed profit and \"socialised\" the risk. As a long time honest to God Socialist, I can tell you point blank that I support almost none of these moves - Because they are the very opposite of Socialism. quote: Originally posted by ACR26: I would rather see every car company fail along with banks and have a massive economical impact than to see this country skip along to government run businesses because of people being too selfish, lazy, greedy, and whiny or anything else that can be added. The ones on this blog who support unconditionally on this website the actions of this Administration in my mind have already sold out. Thank you, that leaves ME off the hook... quote: Originally posted by ACR26: When the smoke clears and the highers are fat dumb and happy on their estates, we will be left holding the bag. Because an individual is born I am now indebted to them if they do not contribute to society. Socialism = a \"level\" playing field for the serfs...not for the glamour stars or politicians. You bet, the public WILL be holding the bag, precisly because this is not Socialism. It's nothing more than welfare for the rich. All risks are born by the public and all gain will go to the owners. Apparently the Bush/Obama version of Capitalism is something that you don't like - But it is typical of Monopoly Capitalism to pass it's losses to the people. It's certainly not Socialism. Dave", 
        "threadID": "672198221_5500078322001", 
        "time": "2009-05-21 08:34:00", 
        "title": "For those who still doubt", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: All these companies getting Federal money will NEVER be government owned. Indeed, even the bank seizures merely guarranteed profit and \"socialised\" the risk. As a long time honest to God Socialist, I can tell you point blank that I support almost none of these moves - Because they are the very opposite of Socialism. Never say never. quote: NEW YORK (Reuters) - If General Motors Corp (GM.N) files for bankruptcy, as widely expected, its healthy assets will be quickly sold to a new company owned by the U.S. government, a source familiar with the situation said on Tuesday. The source, who was not cleared to speak with the media and would not be identified, said the U.S. government would pay for the assets by assuming the automaker's $6 billion of secured debt and forgiving the bulk of the $15.4 billion of emergency loans that the U.S. Treasury has provided to GM. The government is negotiating the terms on which it will assume GM's secured debt and might make an the offer to holders of the debt that is far superior to the one made to Chrysler LLC's secured lenders, the source said. \"http://www.reuters.com/article/euDealsNews/idUSTRE54H6AN20090520\"", 
        "intTime": 20090521, 
        "postID": 43, 
        "quote": "Originally posted by Grachus: All these companies getting Federal money will NEVER be government owned. Indeed, even the bank seizures merely guarranteed profit and \"socialised\" the risk. As a long time honest to God Socialist, I can tell you point blank that I support almost none of these moves - Because they are the very opposite of Socialism.", 
        "reply": " Never say never. quote: NEW YORK (Reuters) - If General Motors Corp (GM.N) files for bankruptcy, as widely expected, its healthy assets will be quickly sold to a new company owned by the U.S. government, a source familiar with the situation said on Tuesday. The source, who was not cleared to speak with the media and would not be identified, said the U.S. government would pay for the assets by assuming the automaker's $6 billion of secured debt and forgiving the bulk of the $15.4 billion of emergency loans that the U.S. Treasury has provided to GM. The government is negotiating the terms on which it will assume GM's secured debt and might make an the offer to holders of the debt that is far superior to the one made to Chrysler LLC's secured lenders, the source said. \"http://www.reuters.com/article/euDealsNews/idUSTRE54H6AN20090520\"", 
        "threadID": "672198221_5500078322001", 
        "time": "2009-05-21 09:14:00", 
        "title": "For those who still doubt", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Originally posted by stec74: quote: Originally posted by Grachus: All these companies getting Federal money will NEVER be government owned. Indeed, even the bank seizures merely guarranteed profit and \"socialised\" the risk. As a long time honest to God Socialist, I can tell you point blank that I support almost none of these moves - Because they are the very opposite of Socialism. Never say never. quote: NEW YORK (Reuters) - If General Motors Corp (GM.N) files for bankruptcy, as widely expected, its healthy assets will be quickly sold to a new company owned by the U.S. government, a source familiar with the situation said on Tuesday. The source, who was not cleared to speak with the media and would not be identified, said the U.S. government would pay for the assets by assuming the automaker's $6 billion of secured debt and forgiving the bulk of the $15.4 billion of emergency loans that the U.S. Treasury has provided to GM. The government is negotiating the terms on which it will assume GM's secured debt and might make an the offer to holders of the debt that is far superior to the one made to Chrysler LLC's secured lenders, the source said. \"http://www.reuters.com/article/euDealsNews/idUSTRE54H6AN20090520\" It might very well turn out that the Government winds up \"owning\" these companies. But they wont keep them, have no intention of keeping them, and NEVER had an intention of keeping them. And I believe you are aware of this... Dave", 
        "intTime": 20090521, 
        "postID": 44, 
        "quote": "Originally posted by stec74: quote: Originally posted by Grachus: All these companies getting Federal money will NEVER be government owned. Indeed, even the bank seizures merely guarranteed profit and \"socialised\" the risk. As a long time honest to God Socialist, I can tell you point blank that I support almost none of these moves - Because they are the very opposite of Socialism. Never say never. quote: NEW YORK (Reuters) - If General Motors Corp (GM.N) files for bankruptcy, as widely expected, its healthy assets will be quickly sold to a new company owned by the U.S. government, a source familiar with the situation said on Tuesday. The source, who was not cleared to speak with the media and would not be identified, said the U.S. government would pay for the assets by assuming the automaker's $6 billion of secured debt and forgiving the bulk of the $15.4 billion of emergency loans that the U.S. Treasury has provided to GM. The government is negotiating the terms on which it will assume GM's secured debt and might make an the offer to holders of the debt that is far superior to the one made to Chrysler LLC's secured lenders, the source said. \"http://www.reuters.com/article/euDealsNews/idUSTRE54H6AN20090520\"", 
        "reply": " It might very well turn out that the Government winds up \"owning\" these companies. But they wont keep them, have no intention of keeping them, and NEVER had an intention of keeping them. And I believe you are aware of this... Dave", 
        "threadID": "672198221_5500078322001", 
        "time": "2009-05-21 10:18:00", 
        "title": "For those who still doubt", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: It might very well turn out that the Government winds up \"owning\" these companies. But they wont keep themHA!, have no intention of keeping themDouble HA!, and NEVER had an intention of keeping them HAR DE HAR HAR!. And I believe you are aware of this... Dave", 
        "intTime": 20090521, 
        "postID": 45, 
        "quote": "Originally posted by Grachus: It might very well turn out that the Government winds up \"owning\" these companies. But they wont keep themHA!, have no intention of keeping themDouble HA!, and NEVER had an intention of keeping them HAR DE HAR HAR!. And I believe you are aware of this... Dave", 
        "reply": "", 
        "threadID": "672198221_5500078322001", 
        "time": "2009-05-21 10:22:00", 
        "title": "For those who still doubt", 
        "userID": "FIST101CAV"
    }, 
    {
        "content": "quote: Socialism is the involuntary expropriation of the means of production. Socialism is NOT loaning companies money until they can pay you back. If THAT\"S the definition of Socialism, you better explain all the previous bailouts and bank seizures of the last 150 years. All these companies getting Federal money will NEVER be government owned. Indeed, even the bank seizures merely guarranteed profit and \"socialised\" the risk. As a long time honest to God Socialist, I can tell you point blank that I support almost none of these moves - Because they are the very opposite of Socialism. So replacing board members/CEO's with for lack of a better term \"government lackeys\" falls into the category of \"just loaning money\". How about dictating again what cars will be built? Is that \"just loaning money?\" Restricting compensation of management is just \"loaning money?\" What about taking away the board members voting rights on the board? Why have them there and not outright remove them? Because then there might be a lawsuit. These dudes that work at GMAC and GM are just as guilty as this administration It is our money bailing out the union employees, CEO's, and management. We will ensure the clowns who put themselves billions of dollars in the hole get their pension. How insane is this? The union gets a crapload of money for putting cars together as is, the sups and execs get a crapload of money marketing cars…meanwhile they are losing profit. The union wants more the execs want more they all get what they want and they lose money faster as a company. I am paying for that turd on the line putting lug nuts on a wheel at what ever $$ amount. I am paying for that exec to keep his mansion…meanwhile my taxes are not reduced in the slightest dwindling my chances of sending my kids to a decent non-public school. WTF is that all about????? Then in steps the government…we loan them money at first with no stipulation other than it will be paid back with interest…bad move on our part. Now we loan them MORE and MORE money and try to dictate with mandates what to build. WTF is THAT? You can slice that dirt pie any way you want grachus but when you boil all the fat away, government run/controlled/owned is socialism.", 
        "intTime": 20090521, 
        "postID": 46, 
        "quote": "Socialism is the involuntary expropriation of the means of production. Socialism is NOT loaning companies money until they can pay you back. If THAT\"S the definition of Socialism, you better explain all the previous bailouts and bank seizures of the last 150 years. All these companies getting Federal money will NEVER be government owned. Indeed, even the bank seizures merely guarranteed profit and \"socialised\" the risk. As a long time honest to God Socialist, I can tell you point blank that I support almost none of these moves - Because they are the very opposite of Socialism.", 
        "reply": " So replacing board members/CEO's with for lack of a better term \"government lackeys\" falls into the category of \"just loaning money\". How about dictating again what cars will be built? Is that \"just loaning money?\" Restricting compensation of management is just \"loaning money?\" What about taking away the board members voting rights on the board? Why have them there and not outright remove them? Because then there might be a lawsuit. These dudes that work at GMAC and GM are just as guilty as this administration It is our money bailing out the union employees, CEO's, and management. We will ensure the clowns who put themselves billions of dollars in the hole get their pension. How insane is this? The union gets a crapload of money for putting cars together as is, the sups and execs get a crapload of money marketing cars…meanwhile they are losing profit. The union wants more the execs want more they all get what they want and they lose money faster as a company. I am paying for that turd on the line putting lug nuts on a wheel at what ever $$ amount. I am paying for that exec to keep his mansion…meanwhile my taxes are not reduced in the slightest dwindling my chances of sending my kids to a decent non-public school. WTF is that all about????? Then in steps the government…we loan them money at first with no stipulation other than it will be paid back with interest…bad move on our part. Now we loan them MORE and MORE money and try to dictate with mandates what to build. WTF is THAT? You can slice that dirt pie any way you want grachus but when you boil all the fat away, government run/controlled/owned is socialism.", 
        "threadID": "672198221_5500078322001", 
        "time": "2009-05-21 10:29:00", 
        "title": "For those who still doubt", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by FIST101CAV: quote: Originally posted by Grachus: It might very well turn out that the Government winds up \"owning\" these companies. But they wont keep themHA!, have no intention of keeping themDouble HA!, and NEVER had an intention of keeping them HAR DE HAR HAR!. And I believe you are aware of this... Dave Err, you do know that this is not the FIRST time that the government stepped in to bail out the auto industry? And it sure as hell isn't the first time that the government seized banks. Dave", 
        "intTime": 20090521, 
        "postID": 47, 
        "quote": "Originally posted by FIST101CAV: quote: Originally posted by Grachus: It might very well turn out that the Government winds up \"owning\" these companies. But they wont keep themHA!, have no intention of keeping themDouble HA!, and NEVER had an intention of keeping them HAR DE HAR HAR!. And I believe you are aware of this... Dave", 
        "reply": " Err, you do know that this is not the FIRST time that the government stepped in to bail out the auto industry? And it sure as hell isn't the first time that the government seized banks. Dave", 
        "threadID": "672198221_5500078322001", 
        "time": "2009-05-21 10:30:00", 
        "title": "For those who still doubt", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by stec74: quote: Originally posted by Grachus: All these companies getting Federal money will NEVER be government owned. Indeed, even the bank seizures merely guarranteed profit and \"socialised\" the risk. As a long time honest to God Socialist, I can tell you point blank that I support almost none of these moves - Because they are the very opposite of Socialism. Never say never. quote: NEW YORK (Reuters) - If General Motors Corp (GM.N) files for bankruptcy, as widely expected, its healthy assets will be quickly sold to a new company owned by the U.S. government, a source familiar with the situation said on Tuesday. The source, who was not cleared to speak with the media and would not be identified, said the U.S. government would pay for the assets by assuming the automaker's $6 billion of secured debt and forgiving the bulk of the $15.4 billion of emergency loans that the U.S. Treasury has provided to GM. The government is negotiating the terms on which it will assume GM's secured debt and might make an the offer to holders of the debt that is far superior to the one made to Chrysler LLC's secured lenders, the source said. \"http://www.reuters.com/article/euDealsNews/idUSTRE54H6AN20090520\" It might very well turn out that the Government winds up \"owning\" these companies. But they wont keep them, have no intention of keeping them, and NEVER had an intention of keeping them. And I believe you are aware of this... Dave I also thought the government would accept money from the financial institutions that received bailout money to pay it back. That hasn't turned out quite the way I expected.", 
        "intTime": 20090521, 
        "postID": 48, 
        "quote": "Originally posted by Grachus: quote: Originally posted by stec74: quote: Originally posted by Grachus: All these companies getting Federal money will NEVER be government owned. Indeed, even the bank seizures merely guarranteed profit and \"socialised\" the risk. As a long time honest to God Socialist, I can tell you point blank that I support almost none of these moves - Because they are the very opposite of Socialism. Never say never. quote: NEW YORK (Reuters) - If General Motors Corp (GM.N) files for bankruptcy, as widely expected, its healthy assets will be quickly sold to a new company owned by the U.S. government, a source familiar with the situation said on Tuesday. The source, who was not cleared to speak with the media and would not be identified, said the U.S. government would pay for the assets by assuming the automaker's $6 billion of secured debt and forgiving the bulk of the $15.4 billion of emergency loans that the U.S. Treasury has provided to GM. The government is negotiating the terms on which it will assume GM's secured debt and might make an the offer to holders of the debt that is far superior to the one made to Chrysler LLC's secured lenders, the source said. \"http://www.reuters.com/article/euDealsNews/idUSTRE54H6AN20090520\" It might very well turn out that the Government winds up \"owning\" these companies. But they wont keep them, have no intention of keeping them, and NEVER had an intention of keeping them. And I believe you are aware of this... Dave", 
        "reply": " I also thought the government would accept money from the financial institutions that received bailout money to pay it back. That hasn't turned out quite the way I expected.", 
        "threadID": "672198221_5500078322001", 
        "time": "2009-05-21 10:38:00", 
        "title": "For those who still doubt", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Err, you do know that this is not the FIRST time that the government stepped in to bail out the auto industry? And it sure as hell isn't the first time that the government seized banks. delusional", 
        "intTime": 20090521, 
        "postID": 49, 
        "quote": "Err, you do know that this is not the FIRST time that the government stepped in to bail out the auto industry? And it sure as hell isn't the first time that the government seized banks.", 
        "reply": " delusional", 
        "threadID": "672198221_5500078322001", 
        "time": "2009-05-21 10:45:00", 
        "title": "For those who still doubt", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by stec74: quote: Originally posted by Grachus: quote: Originally posted by stec74: quote: Originally posted by Grachus: All these companies getting Federal money will NEVER be government owned. Indeed, even the bank seizures merely guarranteed profit and \"socialised\" the risk. As a long time honest to God Socialist, I can tell you point blank that I support almost none of these moves - Because they are the very opposite of Socialism. Never say never. quote: NEW YORK (Reuters) - If General Motors Corp (GM.N) files for bankruptcy, as widely expected, its healthy assets will be quickly sold to a new company owned by the U.S. government, a source familiar with the situation said on Tuesday. The source, who was not cleared to speak with the media and would not be identified, said the U.S. government would pay for the assets by assuming the automaker's $6 billion of secured debt and forgiving the bulk of the $15.4 billion of emergency loans that the U.S. Treasury has provided to GM. The government is negotiating the terms on which it will assume GM's secured debt and might make an the offer to holders of the debt that is far superior to the one made to Chrysler LLC's secured lenders, the source said. \"http://www.reuters.com/article /euDealsNews/idUSTRE54H6AN20090520\" It might very well turn out that the Government winds up \"owning\" these companies. But they wont keep them, have no intention of keeping them, and NEVER had an intention of keeping them. And I believe you are aware of this... Dave I also thought the government would accept money from the financial institutions that received bailout money to pay it back. That hasn't turned out quite the way I expected. If a bank (company management) wants to pay back quickly so management can start getting their big bonuses again (current case) and doing so carries a significant risk that bank would get in financial trouble again should they be allowed to pay back the money or should they have to wait until they are in a better financial state? How many of these banks would still want to pay back quickly if management would still have to wait before they could start getting bonuses again? IMO NONE.", 
        "intTime": 20090521, 
        "postID": 50, 
        "quote": "Originally posted by stec74: quote: Originally posted by Grachus: quote: Originally posted by stec74: quote: Originally posted by Grachus: All these companies getting Federal money will NEVER be government owned. Indeed, even the bank seizures merely guarranteed profit and \"socialised\" the risk. As a long time honest to God Socialist, I can tell you point blank that I support almost none of these moves - Because they are the very opposite of Socialism. Never say never. quote: NEW YORK (Reuters) - If General Motors Corp (GM.N) files for bankruptcy, as widely expected, its healthy assets will be quickly sold to a new company owned by the U.S. government, a source familiar with the situation said on Tuesday. The source, who was not cleared to speak with the media and would not be identified, said the U.S. government would pay for the assets by assuming the automaker's $6 billion of secured debt and forgiving the bulk of the $15.4 billion of emergency loans that the U.S. Treasury has provided to GM. The government is negotiating the terms on which it will assume GM's secured debt and might make an the offer to holders of the debt that is far superior to the one made to Chrysler LLC's secured lenders, the source said. \"http://www.reuters.com/article /euDealsNews/idUSTRE54H6AN20090520\" It might very well turn out that the Government winds up \"owning\" these companies. But they wont keep them, have no intention of keeping them, and NEVER had an intention of keeping them. And I believe you are aware of this... Dave I also thought the government would accept money from the financial institutions that received bailout money to pay it back. That hasn't turned out quite the way I expected.", 
        "reply": " If a bank (company management) wants to pay back quickly so management can start getting their big bonuses again (current case) and doing so carries a significant risk that bank would get in financial trouble again should they be allowed to pay back the money or should they have to wait until they are in a better financial state? How many of these banks would still want to pay back quickly if management would still have to wait before they could start getting bonuses again? IMO NONE.", 
        "threadID": "672198221_5500078322001", 
        "time": "2009-05-21 10:54:00", 
        "title": "For those who still doubt", 
        "userID": "rayld2"
    }, 
    {
        "content": "Let them get their big checks...let the banks fail...let the market be reborn... Will it be tough when eventually it happens? You bet. The pain will be much less if we let the market adjust itself instead of Pres Obama making things worse.", 
        "intTime": 20090521, 
        "postID": 51, 
        "quote": "", 
        "reply": "Let them get their big checks...let the banks fail...let the market be reborn... Will it be tough when eventually it happens? You bet. The pain will be much less if we let the market adjust itself instead of Pres Obama making things worse.", 
        "threadID": "672198221_5500078322001", 
        "time": "2009-05-21 11:18:00", 
        "title": "For those who still doubt", 
        "userID": "ACR26"
    }, 
    {
        "content": "That's why we continue to get into these messes. A bunch of politicians, many of whom have never run a lemonade stand, let alone a multi-billion dollar corporation are trying to tell these corporations their opinion on the right way to do business. If these banks want to pay back the money let them. If they want to pay bonuses to their executives let them. If they fail, so be it. A couple more years of this administration and no one will have any need for money anyway. We will all have \"free\" health care, drive a white \"smart car\", and live in the same \"cookie cutter\" two bedroom apartment paid for by the government.", 
        "intTime": 20090521, 
        "postID": 52, 
        "quote": "", 
        "reply": "That's why we continue to get into these messes. A bunch of politicians, many of whom have never run a lemonade stand, let alone a multi-billion dollar corporation are trying to tell these corporations their opinion on the right way to do business. If these banks want to pay back the money let them. If they want to pay bonuses to their executives let them. If they fail, so be it. A couple more years of this administration and no one will have any need for money anyway. We will all have \"free\" health care, drive a white \"smart car\", and live in the same \"cookie cutter\" two bedroom apartment paid for by the government.", 
        "threadID": "672198221_5500078322001", 
        "time": "2009-05-21 11:23:00", 
        "title": "For those who still doubt", 
        "userID": "stec74"
    }, 
    {
        "content": "Socialism never works. Ask the Brits. Or France. Better yet...look at the past. The USSR! We are America. How long will we stay AMERICA? The Land of the FREE! The Home of the BRAVE!", 
        "intTime": 20090521, 
        "postID": 53, 
        "quote": "", 
        "reply": "Socialism never works. Ask the Brits. Or France. Better yet...look at the past. The USSR! We are America. How long will we stay AMERICA? The Land of the FREE! The Home of the BRAVE!", 
        "threadID": "672198221_5500078322001", 
        "time": "2009-05-21 11:36:00", 
        "title": "For those who still doubt", 
        "userID": "Agent991"
    }, 
    {
        "content": "quote: Originally posted by stec74: That's why we continue to get into these messes. A bunch of politicians, many of whom have never run a lemonade stand, let alone a multi-billion dollar corporation are trying to tell these corporations their opinion on the right way to do business. If these banks want to pay back the money let them. If they want to pay bonuses to their executives let them. If they fail, so be it. A couple more years of this administration and no one will have any need for money anyway. We will all have \"free\" health care, drive a white \"smart car\", and live in the same \"cookie cutter\" two bedroom apartment paid for by the government. I'd love a Smart car. Everytime I have to park, I envy them suckers. Always tempted to put one under my coat and run with it. They should make em with handles on the roof for ease of carry... Dave", 
        "intTime": 20090521, 
        "postID": 54, 
        "quote": "Originally posted by stec74: That's why we continue to get into these messes. A bunch of politicians, many of whom have never run a lemonade stand, let alone a multi-billion dollar corporation are trying to tell these corporations their opinion on the right way to do business. If these banks want to pay back the money let them. If they want to pay bonuses to their executives let them. If they fail, so be it. A couple more years of this administration and no one will have any need for money anyway. We will all have \"free\" health care, drive a white \"smart car\", and live in the same \"cookie cutter\" two bedroom apartment paid for by the government.", 
        "reply": " I'd love a Smart car. Everytime I have to park, I envy them suckers. Always tempted to put one under my coat and run with it. They should make em with handles on the roof for ease of carry... Dave", 
        "threadID": "672198221_5500078322001", 
        "time": "2009-05-21 11:49:00", 
        "title": "For those who still doubt", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by ACR26: How can anyone still doubt that the bullet train towards socialism has not left the station? I have seen a swing of thinking on many here on this site going from...\"we are not going socialist\" to \"what so bad about socialism?\" No matter how it is done whether with guns and force, pen and paper, or coercion of the board of directors/CEO/union bosses...socialism is socialism. \"http://www.detnews.com/article/20090520/AUTO01/905200376/Feds-to-inject-$7.5B-more-into-GMAC I would rather see every car company fail along with banks and have a massive economical impact than to see this country skip along to government run businesses because of people being too selfish, lazy, greedy, and whiny or anything else that can be added. The ones on this blog who support unconditionally on this website the actions of this Administration in my mind have already sold out. When the smoke clears and the highers are fat dumb and happy on their estates, we will be left holding the bag. Because an individual is born I am now indebted to them if they do not contribute to society. Socialism = a \"level\" playing field for the serfs...not for the glamour stars or politicians. \"The ones on this blog who support unconditionally on this website the actions of this Administration in my mind have already sold out. \" But the ones who supported the criminal right wing extremist thugs that are responsible for getting over 4000 Americans and hundreds of thousands of Iraqis needlessly killed did not sell out? We have a good president dedicated to the betterment of our country who was actually elected by a majority but you want to keep the right wing extremist philosophy of hate dishonor and subjugation going.", 
        "intTime": 20090521, 
        "postID": 55, 
        "quote": "Originally posted by ACR26: How can anyone still doubt that the bullet train towards socialism has not left the station? I have seen a swing of thinking on many here on this site going from...\"we are not going socialist\" to \"what so bad about socialism?\" No matter how it is done whether with guns and force, pen and paper, or coercion of the board of directors/CEO/union bosses...socialism is socialism. \"http://www.detnews.com/article/20090520/AUTO01/905200376/Feds-to-inject-$7.5B-more-into-GMAC I would rather see every car company fail along with banks and have a massive economical impact than to see this country skip along to government run businesses because of people being too selfish, lazy, greedy, and whiny or anything else that can be added. The ones on this blog who support unconditionally on this website the actions of this Administration in my mind have already sold out. When the smoke clears and the highers are fat dumb and happy on their estates, we will be left holding the bag. Because an individual is born I am now indebted to them if they do not contribute to society. Socialism = a \"level\" playing field for the serfs...not for the glamour stars or politicians.", 
        "reply": " \"The ones on this blog who support unconditionally on this website the actions of this Administration in my mind have already sold out. \" But the ones who supported the criminal right wing extremist thugs that are responsible for getting over 4000 Americans and hundreds of thousands of Iraqis needlessly killed did not sell out? We have a good president dedicated to the betterment of our country who was actually elected by a majority but you want to keep the right wing extremist philosophy of hate dishonor and subjugation going.", 
        "threadID": "672198221_5500078322001", 
        "time": "2009-05-21 11:57:00", 
        "title": "For those who still doubt", 
        "userID": "6837602"
    }, 
    {
        "content": "I hear the Fife and the drums acoming oer the bridge. The Brits wouldn't have us any longer, and France is happy being looked after by their government, no need of call out the Minutemen. Is not being Socialist owning a good portion or majority of the rail, air and communication outlets? These other countries do. In all cases the Banks are to be regulated and in the words of the new Secretary of Treasury we can force these institutions to do the bidding of the government. Have you notice, Congress has not received or past new regulations controlling what got us here in the first place? The ones presented so far are the same as the in 2005, 2008. I've yet to figure how the Union (UAW)gets 55% of Chrysler? The government will be in \"control\" not only auto builders, (build this kind of car) but all industries, (cap on CO2) individuals, taxes and high cost of energy. If you're born in the next decade the hospitals will not fill out a birth certificate, just stamp your butts USDA and send you directly to a new government and Union controlled school .", 
        "intTime": 20090521, 
        "postID": 56, 
        "quote": "", 
        "reply": "I hear the Fife and the drums acoming oer the bridge. The Brits wouldn't have us any longer, and France is happy being looked after by their government, no need of call out the Minutemen. Is not being Socialist owning a good portion or majority of the rail, air and communication outlets? These other countries do. In all cases the Banks are to be regulated and in the words of the new Secretary of Treasury we can force these institutions to do the bidding of the government. Have you notice, Congress has not received or past new regulations controlling what got us here in the first place? The ones presented so far are the same as the in 2005, 2008. I've yet to figure how the Union (UAW)gets 55% of Chrysler? The government will be in \"control\" not only auto builders, (build this kind of car) but all industries, (cap on CO2) individuals, taxes and high cost of energy. If you're born in the next decade the hospitals will not fill out a birth certificate, just stamp your butts USDA and send you directly to a new government and Union controlled school .", 
        "threadID": "672198221_5500078322001", 
        "time": "2009-05-21 11:58:00", 
        "title": "For those who still doubt", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: Originally posted by ACR26: Let them get their big checks...let the banks fail...let the market be reborn... Will it be tough when eventually it happens? You bet. The pain will be much less if we let the market adjust itself instead of Pres Obama making things worse. You do realise that the government (ie the tax payers) will pick up the tab for a LOT of the loss (FDIC, etc.) don't you while the managers will have millions in their pockets (oversea accounts).", 
        "intTime": 20090521, 
        "postID": 57, 
        "quote": "Originally posted by ACR26: Let them get their big checks...let the banks fail...let the market be reborn... Will it be tough when eventually it happens? You bet. The pain will be much less if we let the market adjust itself instead of Pres Obama making things worse.", 
        "reply": " You do realise that the government (ie the tax payers) will pick up the tab for a LOT of the loss (FDIC, etc.) don't you while the managers will have millions in their pockets (oversea accounts).", 
        "threadID": "672198221_5500078322001", 
        "time": "2009-05-21 12:15:00", 
        "title": "For those who still doubt", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by stec74: That's why we continue to get into these messes. A bunch of politicians, many of whom have never run a lemonade stand, let alone a multi-billion dollar corporation are trying to tell these corporations their opinion on the right way to do business. If these banks want to pay back the money let them. If they want to pay bonuses to their executives let them. If they fail, so be it. A couple more years of this administration and no one will have any need for money anyway. We will all have \"free\" health care, drive a white \"smart car\", and live in the same \"cookie cutter\" two bedroom apartment paid for by the government. Mr. Obama is just doing what Pres Bush I did to fix the S&L problem created by Saint Ronnie's deregs and what Pres Bush II started to fix this problem caused by deregulation. Amazing how to Repubs NOTHING is ever their fault. During the 8 years of the Bush admin they blamed everything bad that happened on Clinton and now that Obama has been in power just over 100 days (his first budget doesn't take effect until Oct) everything is his fault. I find it funny that if they are being honest then in effect the Repubs are saving their party and politicians are and have been COMPLETELY ineffective.", 
        "intTime": 20090521, 
        "postID": 58, 
        "quote": "Originally posted by stec74: That's why we continue to get into these messes. A bunch of politicians, many of whom have never run a lemonade stand, let alone a multi-billion dollar corporation are trying to tell these corporations their opinion on the right way to do business. If these banks want to pay back the money let them. If they want to pay bonuses to their executives let them. If they fail, so be it. A couple more years of this administration and no one will have any need for money anyway. We will all have \"free\" health care, drive a white \"smart car\", and live in the same \"cookie cutter\" two bedroom apartment paid for by the government.", 
        "reply": " Mr. Obama is just doing what Pres Bush I did to fix the S&L problem created by Saint Ronnie's deregs and what Pres Bush II started to fix this problem caused by deregulation. Amazing how to Repubs NOTHING is ever their fault. During the 8 years of the Bush admin they blamed everything bad that happened on Clinton and now that Obama has been in power just over 100 days (his first budget doesn't take effect until Oct) everything is his fault. I find it funny that if they are being honest then in effect the Repubs are saving their party and politicians are and have been COMPLETELY ineffective.", 
        "threadID": "672198221_5500078322001", 
        "time": "2009-05-21 12:26:00", 
        "title": "For those who still doubt", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: I'd love a Smart car. Everytime I have to park, I envy them suckers. Always tempted to put one under my coat and run with it. They should make em with handles on the roof for ease of carry That smart car...as they scrape you off the road...hope a few more mpgs was worth it", 
        "intTime": 20090521, 
        "postID": 59, 
        "quote": "I'd love a Smart car. Everytime I have to park, I envy them suckers. Always tempted to put one under my coat and run with it. They should make em with handles on the roof for ease of carry", 
        "reply": " That smart car...as they scrape you off the road...hope a few more mpgs was worth it", 
        "threadID": "672198221_5500078322001", 
        "time": "2009-05-21 15:50:00", 
        "title": "For those who still doubt", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: But the ones who supported the criminal right wing extremist thugs that are responsible for getting over 4000 Americans and hundreds of thousands of Iraqis needlessly killed did not sell out? We have a good president dedicated to the betterment of our country who was actually elected by a majority but you want to keep the right wing extremist philosophy of hate dishonor and subjugation going. I like the use of the word criminal... I like vomit too...that is a good word for this post", 
        "intTime": 20090521, 
        "postID": 60, 
        "quote": "But the ones who supported the criminal right wing extremist thugs that are responsible for getting over 4000 Americans and hundreds of thousands of Iraqis needlessly killed did not sell out? We have a good president dedicated to the betterment of our country who was actually elected by a majority but you want to keep the right wing extremist philosophy of hate dishonor and subjugation going.", 
        "reply": " I like the use of the word criminal... I like vomit too...that is a good word for this post", 
        "threadID": "672198221_5500078322001", 
        "time": "2009-05-21 15:52:00", 
        "title": "For those who still doubt", 
        "userID": "ACR26"
    }, 
    {
        "content": "How can anyone still doubt that the bullet train towards socialism has not left the station? I have seen a swing of thinking on many here on this site going from...\"we are not going socialist\" to \"what so bad about socialism?\" No matter how it is done whether with guns and force, pen and paper, or coercion of the board of directors/CEO/union bosses...socialism is socialism. \"http://www.detnews.com/article/20090520/AUTO01/905200376/Feds-to-inject-$7.5B-more-into-GMAC I would rather see every car company fail along with banks and have a massive economical impact than to see this country skip along to government run businesses because of people being too selfish, lazy, greedy, and whiny or anything else that can be added. The ones on this blog who support unconditionally on this website the actions of this Administration in my mind have already sold out. When the smoke clears and the highers are fat dumb and happy on their estates, we will be left holding the bag. Because an individual is born I am now indebted to them if they do not contribute to society. Socialism = a \"level\" playing field for the serfs...not for the glamour stars or politicians.", 
        "intTime": 20090521, 
        "postID": 61, 
        "quote": "", 
        "reply": "How can anyone still doubt that the bullet train towards socialism has not left the station? I have seen a swing of thinking on many here on this site going from...\"we are not going socialist\" to \"what so bad about socialism?\" No matter how it is done whether with guns and force, pen and paper, or coercion of the board of directors/CEO/union bosses...socialism is socialism. \"http://www.detnews.com/article/20090520/AUTO01/905200376/Feds-to-inject-$7.5B-more-into-GMAC I would rather see every car company fail along with banks and have a massive economical impact than to see this country skip along to government run businesses because of people being too selfish, lazy, greedy, and whiny or anything else that can be added. The ones on this blog who support unconditionally on this website the actions of this Administration in my mind have already sold out. When the smoke clears and the highers are fat dumb and happy on their estates, we will be left holding the bag. Because an individual is born I am now indebted to them if they do not contribute to society. Socialism = a \"level\" playing field for the serfs...not for the glamour stars or politicians.", 
        "threadID": "672198221_5500078322001", 
        "time": "2009-05-21 07:49:00", 
        "title": "For those who still doubt", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by ACR26: How can anyone still doubt that the bullet train towards socialism has not left the station? I have seen a swing of thinking on many here on this site going from...\"we are not going socialist\" to \"what so bad about socialism?\" No matter how it is done whether with guns and force, pen and paper, or coercion of the board of directors/CEO/union bosses...socialism is socialism. \"http://www.detnews.com/article/20090520/AUTO01/905200376/Feds-to-inject-$7.5B-more-into-GMAC Socialism is the involuntary expropriation of the means of production. Socialism is NOT loaning companies money until they can pay you back. If THAT\"S the definition of Socialism, you better explain all the previous bailouts and bank seizures of the last 150 years. All these companies getting Federal money will NEVER be government owned. Indeed, even the bank seizures merely guarranteed profit and \"socialised\" the risk. As a long time honest to God Socialist, I can tell you point blank that I support almost none of these moves - Because they are the very opposite of Socialism. quote: Originally posted by ACR26: I would rather see every car company fail along with banks and have a massive economical impact than to see this country skip along to government run businesses because of people being too selfish, lazy, greedy, and whiny or anything else that can be added. The ones on this blog who support unconditionally on this website the actions of this Administration in my mind have already sold out. Thank you, that leaves ME off the hook... quote: Originally posted by ACR26: When the smoke clears and the highers are fat dumb and happy on their estates, we will be left holding the bag. Because an individual is born I am now indebted to them if they do not contribute to society. Socialism = a \"level\" playing field for the serfs...not for the glamour stars or politicians. You bet, the public WILL be holding the bag, precisly because this is not Socialism. It's nothing more than welfare for the rich. All risks are born by the public and all gain will go to the owners. Apparently the Bush/Obama version of Capitalism is something that you don't like - But it is typical of Monopoly Capitalism to pass it's losses to the people. It's certainly not Socialism. Dave", 
        "intTime": 20090521, 
        "postID": 62, 
        "quote": "Originally posted by ACR26: How can anyone still doubt that the bullet train towards socialism has not left the station? I have seen a swing of thinking on many here on this site going from...\"we are not going socialist\" to \"what so bad about socialism?\" No matter how it is done whether with guns and force, pen and paper, or coercion of the board of directors/CEO/union bosses...socialism is socialism. \"http://www.detnews.com/article/20090520/AUTO01/905200376/Feds-to-inject-$7.5B-more-into-GMAC", 
        "reply": " Socialism is the involuntary expropriation of the means of production. Socialism is NOT loaning companies money until they can pay you back. If THAT\"S the definition of Socialism, you better explain all the previous bailouts and bank seizures of the last 150 years. All these companies getting Federal money will NEVER be government owned. Indeed, even the bank seizures merely guarranteed profit and \"socialised\" the risk. As a long time honest to God Socialist, I can tell you point blank that I support almost none of these moves - Because they are the very opposite of Socialism. quote: Originally posted by ACR26: I would rather see every car company fail along with banks and have a massive economical impact than to see this country skip along to government run businesses because of people being too selfish, lazy, greedy, and whiny or anything else that can be added. The ones on this blog who support unconditionally on this website the actions of this Administration in my mind have already sold out. Thank you, that leaves ME off the hook... quote: Originally posted by ACR26: When the smoke clears and the highers are fat dumb and happy on their estates, we will be left holding the bag. Because an individual is born I am now indebted to them if they do not contribute to society. Socialism = a \"level\" playing field for the serfs...not for the glamour stars or politicians. You bet, the public WILL be holding the bag, precisly because this is not Socialism. It's nothing more than welfare for the rich. All risks are born by the public and all gain will go to the owners. Apparently the Bush/Obama version of Capitalism is something that you don't like - But it is typical of Monopoly Capitalism to pass it's losses to the people. It's certainly not Socialism. Dave", 
        "threadID": "672198221_5500078322001", 
        "time": "2009-05-21 08:34:00", 
        "title": "For those who still doubt", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: All these companies getting Federal money will NEVER be government owned. Indeed, even the bank seizures merely guarranteed profit and \"socialised\" the risk. As a long time honest to God Socialist, I can tell you point blank that I support almost none of these moves - Because they are the very opposite of Socialism. Never say never. quote: NEW YORK (Reuters) - If General Motors Corp (GM.N) files for bankruptcy, as widely expected, its healthy assets will be quickly sold to a new company owned by the U.S. government, a source familiar with the situation said on Tuesday. The source, who was not cleared to speak with the media and would not be identified, said the U.S. government would pay for the assets by assuming the automaker's $6 billion of secured debt and forgiving the bulk of the $15.4 billion of emergency loans that the U.S. Treasury has provided to GM. The government is negotiating the terms on which it will assume GM's secured debt and might make an the offer to holders of the debt that is far superior to the one made to Chrysler LLC's secured lenders, the source said. \"http://www.reuters.com/article/euDealsNews/idUSTRE54H6AN20090520\"", 
        "intTime": 20090521, 
        "postID": 63, 
        "quote": "Originally posted by Grachus: All these companies getting Federal money will NEVER be government owned. Indeed, even the bank seizures merely guarranteed profit and \"socialised\" the risk. As a long time honest to God Socialist, I can tell you point blank that I support almost none of these moves - Because they are the very opposite of Socialism.", 
        "reply": " Never say never. quote: NEW YORK (Reuters) - If General Motors Corp (GM.N) files for bankruptcy, as widely expected, its healthy assets will be quickly sold to a new company owned by the U.S. government, a source familiar with the situation said on Tuesday. The source, who was not cleared to speak with the media and would not be identified, said the U.S. government would pay for the assets by assuming the automaker's $6 billion of secured debt and forgiving the bulk of the $15.4 billion of emergency loans that the U.S. Treasury has provided to GM. The government is negotiating the terms on which it will assume GM's secured debt and might make an the offer to holders of the debt that is far superior to the one made to Chrysler LLC's secured lenders, the source said. \"http://www.reuters.com/article/euDealsNews/idUSTRE54H6AN20090520\"", 
        "threadID": "672198221_5500078322001", 
        "time": "2009-05-21 09:14:00", 
        "title": "For those who still doubt", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Originally posted by stec74: quote: Originally posted by Grachus: All these companies getting Federal money will NEVER be government owned. Indeed, even the bank seizures merely guarranteed profit and \"socialised\" the risk. As a long time honest to God Socialist, I can tell you point blank that I support almost none of these moves - Because they are the very opposite of Socialism. Never say never. quote: NEW YORK (Reuters) - If General Motors Corp (GM.N) files for bankruptcy, as widely expected, its healthy assets will be quickly sold to a new company owned by the U.S. government, a source familiar with the situation said on Tuesday. The source, who was not cleared to speak with the media and would not be identified, said the U.S. government would pay for the assets by assuming the automaker's $6 billion of secured debt and forgiving the bulk of the $15.4 billion of emergency loans that the U.S. Treasury has provided to GM. The government is negotiating the terms on which it will assume GM's secured debt and might make an the offer to holders of the debt that is far superior to the one made to Chrysler LLC's secured lenders, the source said. \"http://www.reuters.com/article/euDealsNews/idUSTRE54H6AN20090520\" It might very well turn out that the Government winds up \"owning\" these companies. But they wont keep them, have no intention of keeping them, and NEVER had an intention of keeping them. And I believe you are aware of this... Dave", 
        "intTime": 20090521, 
        "postID": 64, 
        "quote": "Originally posted by stec74: quote: Originally posted by Grachus: All these companies getting Federal money will NEVER be government owned. Indeed, even the bank seizures merely guarranteed profit and \"socialised\" the risk. As a long time honest to God Socialist, I can tell you point blank that I support almost none of these moves - Because they are the very opposite of Socialism. Never say never. quote: NEW YORK (Reuters) - If General Motors Corp (GM.N) files for bankruptcy, as widely expected, its healthy assets will be quickly sold to a new company owned by the U.S. government, a source familiar with the situation said on Tuesday. The source, who was not cleared to speak with the media and would not be identified, said the U.S. government would pay for the assets by assuming the automaker's $6 billion of secured debt and forgiving the bulk of the $15.4 billion of emergency loans that the U.S. Treasury has provided to GM. The government is negotiating the terms on which it will assume GM's secured debt and might make an the offer to holders of the debt that is far superior to the one made to Chrysler LLC's secured lenders, the source said. \"http://www.reuters.com/article/euDealsNews/idUSTRE54H6AN20090520\"", 
        "reply": " It might very well turn out that the Government winds up \"owning\" these companies. But they wont keep them, have no intention of keeping them, and NEVER had an intention of keeping them. And I believe you are aware of this... Dave", 
        "threadID": "672198221_5500078322001", 
        "time": "2009-05-21 10:18:00", 
        "title": "For those who still doubt", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: It might very well turn out that the Government winds up \"owning\" these companies. But they wont keep themHA!, have no intention of keeping themDouble HA!, and NEVER had an intention of keeping them HAR DE HAR HAR!. And I believe you are aware of this... Dave", 
        "intTime": 20090521, 
        "postID": 65, 
        "quote": "Originally posted by Grachus: It might very well turn out that the Government winds up \"owning\" these companies. But they wont keep themHA!, have no intention of keeping themDouble HA!, and NEVER had an intention of keeping them HAR DE HAR HAR!. And I believe you are aware of this... Dave", 
        "reply": "", 
        "threadID": "672198221_5500078322001", 
        "time": "2009-05-21 10:22:00", 
        "title": "For those who still doubt", 
        "userID": "FIST101CAV"
    }, 
    {
        "content": "quote: Socialism is the involuntary expropriation of the means of production. Socialism is NOT loaning companies money until they can pay you back. If THAT\"S the definition of Socialism, you better explain all the previous bailouts and bank seizures of the last 150 years. All these companies getting Federal money will NEVER be government owned. Indeed, even the bank seizures merely guarranteed profit and \"socialised\" the risk. As a long time honest to God Socialist, I can tell you point blank that I support almost none of these moves - Because they are the very opposite of Socialism. So replacing board members/CEO's with for lack of a better term \"government lackeys\" falls into the category of \"just loaning money\". How about dictating again what cars will be built? Is that \"just loaning money?\" Restricting compensation of management is just \"loaning money?\" What about taking away the board members voting rights on the board? Why have them there and not outright remove them? Because then there might be a lawsuit. These dudes that work at GMAC and GM are just as guilty as this administration It is our money bailing out the union employees, CEO's, and management. We will ensure the clowns who put themselves billions of dollars in the hole get their pension. How insane is this? The union gets a crapload of money for putting cars together as is, the sups and execs get a crapload of money marketing cars…meanwhile they are losing profit. The union wants more the execs want more they all get what they want and they lose money faster as a company. I am paying for that turd on the line putting lug nuts on a wheel at what ever $$ amount. I am paying for that exec to keep his mansion…meanwhile my taxes are not reduced in the slightest dwindling my chances of sending my kids to a decent non-public school. WTF is that all about????? Then in steps the government…we loan them money at first with no stipulation other than it will be paid back with interest…bad move on our part. Now we loan them MORE and MORE money and try to dictate with mandates what to build. WTF is THAT? You can slice that dirt pie any way you want grachus but when you boil all the fat away, government run/controlled/owned is socialism.", 
        "intTime": 20090521, 
        "postID": 66, 
        "quote": "Socialism is the involuntary expropriation of the means of production. Socialism is NOT loaning companies money until they can pay you back. If THAT\"S the definition of Socialism, you better explain all the previous bailouts and bank seizures of the last 150 years. All these companies getting Federal money will NEVER be government owned. Indeed, even the bank seizures merely guarranteed profit and \"socialised\" the risk. As a long time honest to God Socialist, I can tell you point blank that I support almost none of these moves - Because they are the very opposite of Socialism.", 
        "reply": " So replacing board members/CEO's with for lack of a better term \"government lackeys\" falls into the category of \"just loaning money\". How about dictating again what cars will be built? Is that \"just loaning money?\" Restricting compensation of management is just \"loaning money?\" What about taking away the board members voting rights on the board? Why have them there and not outright remove them? Because then there might be a lawsuit. These dudes that work at GMAC and GM are just as guilty as this administration It is our money bailing out the union employees, CEO's, and management. We will ensure the clowns who put themselves billions of dollars in the hole get their pension. How insane is this? The union gets a crapload of money for putting cars together as is, the sups and execs get a crapload of money marketing cars…meanwhile they are losing profit. The union wants more the execs want more they all get what they want and they lose money faster as a company. I am paying for that turd on the line putting lug nuts on a wheel at what ever $$ amount. I am paying for that exec to keep his mansion…meanwhile my taxes are not reduced in the slightest dwindling my chances of sending my kids to a decent non-public school. WTF is that all about????? Then in steps the government…we loan them money at first with no stipulation other than it will be paid back with interest…bad move on our part. Now we loan them MORE and MORE money and try to dictate with mandates what to build. WTF is THAT? You can slice that dirt pie any way you want grachus but when you boil all the fat away, government run/controlled/owned is socialism.", 
        "threadID": "672198221_5500078322001", 
        "time": "2009-05-21 10:29:00", 
        "title": "For those who still doubt", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by FIST101CAV: quote: Originally posted by Grachus: It might very well turn out that the Government winds up \"owning\" these companies. But they wont keep themHA!, have no intention of keeping themDouble HA!, and NEVER had an intention of keeping them HAR DE HAR HAR!. And I believe you are aware of this... Dave Err, you do know that this is not the FIRST time that the government stepped in to bail out the auto industry? And it sure as hell isn't the first time that the government seized banks. Dave", 
        "intTime": 20090521, 
        "postID": 67, 
        "quote": "Originally posted by FIST101CAV: quote: Originally posted by Grachus: It might very well turn out that the Government winds up \"owning\" these companies. But they wont keep themHA!, have no intention of keeping themDouble HA!, and NEVER had an intention of keeping them HAR DE HAR HAR!. And I believe you are aware of this... Dave", 
        "reply": " Err, you do know that this is not the FIRST time that the government stepped in to bail out the auto industry? And it sure as hell isn't the first time that the government seized banks. Dave", 
        "threadID": "672198221_5500078322001", 
        "time": "2009-05-21 10:30:00", 
        "title": "For those who still doubt", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by stec74: quote: Originally posted by Grachus: All these companies getting Federal money will NEVER be government owned. Indeed, even the bank seizures merely guarranteed profit and \"socialised\" the risk. As a long time honest to God Socialist, I can tell you point blank that I support almost none of these moves - Because they are the very opposite of Socialism. Never say never. quote: NEW YORK (Reuters) - If General Motors Corp (GM.N) files for bankruptcy, as widely expected, its healthy assets will be quickly sold to a new company owned by the U.S. government, a source familiar with the situation said on Tuesday. The source, who was not cleared to speak with the media and would not be identified, said the U.S. government would pay for the assets by assuming the automaker's $6 billion of secured debt and forgiving the bulk of the $15.4 billion of emergency loans that the U.S. Treasury has provided to GM. The government is negotiating the terms on which it will assume GM's secured debt and might make an the offer to holders of the debt that is far superior to the one made to Chrysler LLC's secured lenders, the source said. \"http://www.reuters.com/article/euDealsNews/idUSTRE54H6AN20090520\" It might very well turn out that the Government winds up \"owning\" these companies. But they wont keep them, have no intention of keeping them, and NEVER had an intention of keeping them. And I believe you are aware of this... Dave I also thought the government would accept money from the financial institutions that received bailout money to pay it back. That hasn't turned out quite the way I expected.", 
        "intTime": 20090521, 
        "postID": 68, 
        "quote": "Originally posted by Grachus: quote: Originally posted by stec74: quote: Originally posted by Grachus: All these companies getting Federal money will NEVER be government owned. Indeed, even the bank seizures merely guarranteed profit and \"socialised\" the risk. As a long time honest to God Socialist, I can tell you point blank that I support almost none of these moves - Because they are the very opposite of Socialism. Never say never. quote: NEW YORK (Reuters) - If General Motors Corp (GM.N) files for bankruptcy, as widely expected, its healthy assets will be quickly sold to a new company owned by the U.S. government, a source familiar with the situation said on Tuesday. The source, who was not cleared to speak with the media and would not be identified, said the U.S. government would pay for the assets by assuming the automaker's $6 billion of secured debt and forgiving the bulk of the $15.4 billion of emergency loans that the U.S. Treasury has provided to GM. The government is negotiating the terms on which it will assume GM's secured debt and might make an the offer to holders of the debt that is far superior to the one made to Chrysler LLC's secured lenders, the source said. \"http://www.reuters.com/article/euDealsNews/idUSTRE54H6AN20090520\" It might very well turn out that the Government winds up \"owning\" these companies. But they wont keep them, have no intention of keeping them, and NEVER had an intention of keeping them. And I believe you are aware of this... Dave", 
        "reply": " I also thought the government would accept money from the financial institutions that received bailout money to pay it back. That hasn't turned out quite the way I expected.", 
        "threadID": "672198221_5500078322001", 
        "time": "2009-05-21 10:38:00", 
        "title": "For those who still doubt", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Err, you do know that this is not the FIRST time that the government stepped in to bail out the auto industry? And it sure as hell isn't the first time that the government seized banks. delusional", 
        "intTime": 20090521, 
        "postID": 69, 
        "quote": "Err, you do know that this is not the FIRST time that the government stepped in to bail out the auto industry? And it sure as hell isn't the first time that the government seized banks.", 
        "reply": " delusional", 
        "threadID": "672198221_5500078322001", 
        "time": "2009-05-21 10:45:00", 
        "title": "For those who still doubt", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by stec74: quote: Originally posted by Grachus: quote: Originally posted by stec74: quote: Originally posted by Grachus: All these companies getting Federal money will NEVER be government owned. Indeed, even the bank seizures merely guarranteed profit and \"socialised\" the risk. As a long time honest to God Socialist, I can tell you point blank that I support almost none of these moves - Because they are the very opposite of Socialism. Never say never. quote: NEW YORK (Reuters) - If General Motors Corp (GM.N) files for bankruptcy, as widely expected, its healthy assets will be quickly sold to a new company owned by the U.S. government, a source familiar with the situation said on Tuesday. The source, who was not cleared to speak with the media and would not be identified, said the U.S. government would pay for the assets by assuming the automaker's $6 billion of secured debt and forgiving the bulk of the $15.4 billion of emergency loans that the U.S. Treasury has provided to GM. The government is negotiating the terms on which it will assume GM's secured debt and might make an the offer to holders of the debt that is far superior to the one made to Chrysler LLC's secured lenders, the source said. \"http://www.reuters.com/article /euDealsNews/idUSTRE54H6AN20090520\" It might very well turn out that the Government winds up \"owning\" these companies. But they wont keep them, have no intention of keeping them, and NEVER had an intention of keeping them. And I believe you are aware of this... Dave I also thought the government would accept money from the financial institutions that received bailout money to pay it back. That hasn't turned out quite the way I expected. If a bank (company management) wants to pay back quickly so management can start getting their big bonuses again (current case) and doing so carries a significant risk that bank would get in financial trouble again should they be allowed to pay back the money or should they have to wait until they are in a better financial state? How many of these banks would still want to pay back quickly if management would still have to wait before they could start getting bonuses again? IMO NONE.", 
        "intTime": 20090521, 
        "postID": 70, 
        "quote": "Originally posted by stec74: quote: Originally posted by Grachus: quote: Originally posted by stec74: quote: Originally posted by Grachus: All these companies getting Federal money will NEVER be government owned. Indeed, even the bank seizures merely guarranteed profit and \"socialised\" the risk. As a long time honest to God Socialist, I can tell you point blank that I support almost none of these moves - Because they are the very opposite of Socialism. Never say never. quote: NEW YORK (Reuters) - If General Motors Corp (GM.N) files for bankruptcy, as widely expected, its healthy assets will be quickly sold to a new company owned by the U.S. government, a source familiar with the situation said on Tuesday. The source, who was not cleared to speak with the media and would not be identified, said the U.S. government would pay for the assets by assuming the automaker's $6 billion of secured debt and forgiving the bulk of the $15.4 billion of emergency loans that the U.S. Treasury has provided to GM. The government is negotiating the terms on which it will assume GM's secured debt and might make an the offer to holders of the debt that is far superior to the one made to Chrysler LLC's secured lenders, the source said. \"http://www.reuters.com/article /euDealsNews/idUSTRE54H6AN20090520\" It might very well turn out that the Government winds up \"owning\" these companies. But they wont keep them, have no intention of keeping them, and NEVER had an intention of keeping them. And I believe you are aware of this... Dave I also thought the government would accept money from the financial institutions that received bailout money to pay it back. That hasn't turned out quite the way I expected.", 
        "reply": " If a bank (company management) wants to pay back quickly so management can start getting their big bonuses again (current case) and doing so carries a significant risk that bank would get in financial trouble again should they be allowed to pay back the money or should they have to wait until they are in a better financial state? How many of these banks would still want to pay back quickly if management would still have to wait before they could start getting bonuses again? IMO NONE.", 
        "threadID": "672198221_5500078322001", 
        "time": "2009-05-21 10:54:00", 
        "title": "For those who still doubt", 
        "userID": "rayld2"
    }, 
    {
        "content": "Let them get their big checks...let the banks fail...let the market be reborn... Will it be tough when eventually it happens? You bet. The pain will be much less if we let the market adjust itself instead of Pres Obama making things worse.", 
        "intTime": 20090521, 
        "postID": 71, 
        "quote": "", 
        "reply": "Let them get their big checks...let the banks fail...let the market be reborn... Will it be tough when eventually it happens? You bet. The pain will be much less if we let the market adjust itself instead of Pres Obama making things worse.", 
        "threadID": "672198221_5500078322001", 
        "time": "2009-05-21 11:18:00", 
        "title": "For those who still doubt", 
        "userID": "ACR26"
    }, 
    {
        "content": "That's why we continue to get into these messes. A bunch of politicians, many of whom have never run a lemonade stand, let alone a multi-billion dollar corporation are trying to tell these corporations their opinion on the right way to do business. If these banks want to pay back the money let them. If they want to pay bonuses to their executives let them. If they fail, so be it. A couple more years of this administration and no one will have any need for money anyway. We will all have \"free\" health care, drive a white \"smart car\", and live in the same \"cookie cutter\" two bedroom apartment paid for by the government.", 
        "intTime": 20090521, 
        "postID": 72, 
        "quote": "", 
        "reply": "That's why we continue to get into these messes. A bunch of politicians, many of whom have never run a lemonade stand, let alone a multi-billion dollar corporation are trying to tell these corporations their opinion on the right way to do business. If these banks want to pay back the money let them. If they want to pay bonuses to their executives let them. If they fail, so be it. A couple more years of this administration and no one will have any need for money anyway. We will all have \"free\" health care, drive a white \"smart car\", and live in the same \"cookie cutter\" two bedroom apartment paid for by the government.", 
        "threadID": "672198221_5500078322001", 
        "time": "2009-05-21 11:23:00", 
        "title": "For those who still doubt", 
        "userID": "stec74"
    }, 
    {
        "content": "Socialism never works. Ask the Brits. Or France. Better yet...look at the past. The USSR! We are America. How long will we stay AMERICA? The Land of the FREE! The Home of the BRAVE!", 
        "intTime": 20090521, 
        "postID": 73, 
        "quote": "", 
        "reply": "Socialism never works. Ask the Brits. Or France. Better yet...look at the past. The USSR! We are America. How long will we stay AMERICA? The Land of the FREE! The Home of the BRAVE!", 
        "threadID": "672198221_5500078322001", 
        "time": "2009-05-21 11:36:00", 
        "title": "For those who still doubt", 
        "userID": "Agent991"
    }, 
    {
        "content": "quote: Originally posted by stec74: That's why we continue to get into these messes. A bunch of politicians, many of whom have never run a lemonade stand, let alone a multi-billion dollar corporation are trying to tell these corporations their opinion on the right way to do business. If these banks want to pay back the money let them. If they want to pay bonuses to their executives let them. If they fail, so be it. A couple more years of this administration and no one will have any need for money anyway. We will all have \"free\" health care, drive a white \"smart car\", and live in the same \"cookie cutter\" two bedroom apartment paid for by the government. I'd love a Smart car. Everytime I have to park, I envy them suckers. Always tempted to put one under my coat and run with it. They should make em with handles on the roof for ease of carry... Dave", 
        "intTime": 20090521, 
        "postID": 74, 
        "quote": "Originally posted by stec74: That's why we continue to get into these messes. A bunch of politicians, many of whom have never run a lemonade stand, let alone a multi-billion dollar corporation are trying to tell these corporations their opinion on the right way to do business. If these banks want to pay back the money let them. If they want to pay bonuses to their executives let them. If they fail, so be it. A couple more years of this administration and no one will have any need for money anyway. We will all have \"free\" health care, drive a white \"smart car\", and live in the same \"cookie cutter\" two bedroom apartment paid for by the government.", 
        "reply": " I'd love a Smart car. Everytime I have to park, I envy them suckers. Always tempted to put one under my coat and run with it. They should make em with handles on the roof for ease of carry... Dave", 
        "threadID": "672198221_5500078322001", 
        "time": "2009-05-21 11:49:00", 
        "title": "For those who still doubt", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by ACR26: How can anyone still doubt that the bullet train towards socialism has not left the station? I have seen a swing of thinking on many here on this site going from...\"we are not going socialist\" to \"what so bad about socialism?\" No matter how it is done whether with guns and force, pen and paper, or coercion of the board of directors/CEO/union bosses...socialism is socialism. \"http://www.detnews.com/article/20090520/AUTO01/905200376/Feds-to-inject-$7.5B-more-into-GMAC I would rather see every car company fail along with banks and have a massive economical impact than to see this country skip along to government run businesses because of people being too selfish, lazy, greedy, and whiny or anything else that can be added. The ones on this blog who support unconditionally on this website the actions of this Administration in my mind have already sold out. When the smoke clears and the highers are fat dumb and happy on their estates, we will be left holding the bag. Because an individual is born I am now indebted to them if they do not contribute to society. Socialism = a \"level\" playing field for the serfs...not for the glamour stars or politicians. \"The ones on this blog who support unconditionally on this website the actions of this Administration in my mind have already sold out. \" But the ones who supported the criminal right wing extremist thugs that are responsible for getting over 4000 Americans and hundreds of thousands of Iraqis needlessly killed did not sell out? We have a good president dedicated to the betterment of our country who was actually elected by a majority but you want to keep the right wing extremist philosophy of hate dishonor and subjugation going.", 
        "intTime": 20090521, 
        "postID": 75, 
        "quote": "Originally posted by ACR26: How can anyone still doubt that the bullet train towards socialism has not left the station? I have seen a swing of thinking on many here on this site going from...\"we are not going socialist\" to \"what so bad about socialism?\" No matter how it is done whether with guns and force, pen and paper, or coercion of the board of directors/CEO/union bosses...socialism is socialism. \"http://www.detnews.com/article/20090520/AUTO01/905200376/Feds-to-inject-$7.5B-more-into-GMAC I would rather see every car company fail along with banks and have a massive economical impact than to see this country skip along to government run businesses because of people being too selfish, lazy, greedy, and whiny or anything else that can be added. The ones on this blog who support unconditionally on this website the actions of this Administration in my mind have already sold out. When the smoke clears and the highers are fat dumb and happy on their estates, we will be left holding the bag. Because an individual is born I am now indebted to them if they do not contribute to society. Socialism = a \"level\" playing field for the serfs...not for the glamour stars or politicians.", 
        "reply": " \"The ones on this blog who support unconditionally on this website the actions of this Administration in my mind have already sold out. \" But the ones who supported the criminal right wing extremist thugs that are responsible for getting over 4000 Americans and hundreds of thousands of Iraqis needlessly killed did not sell out? We have a good president dedicated to the betterment of our country who was actually elected by a majority but you want to keep the right wing extremist philosophy of hate dishonor and subjugation going.", 
        "threadID": "672198221_5500078322001", 
        "time": "2009-05-21 11:57:00", 
        "title": "For those who still doubt", 
        "userID": "6837602"
    }, 
    {
        "content": "I hear the Fife and the drums acoming oer the bridge. The Brits wouldn't have us any longer, and France is happy being looked after by their government, no need of call out the Minutemen. Is not being Socialist owning a good portion or majority of the rail, air and communication outlets? These other countries do. In all cases the Banks are to be regulated and in the words of the new Secretary of Treasury we can force these institutions to do the bidding of the government. Have you notice, Congress has not received or past new regulations controlling what got us here in the first place? The ones presented so far are the same as the in 2005, 2008. I've yet to figure how the Union (UAW)gets 55% of Chrysler? The government will be in \"control\" not only auto builders, (build this kind of car) but all industries, (cap on CO2) individuals, taxes and high cost of energy. If you're born in the next decade the hospitals will not fill out a birth certificate, just stamp your butts USDA and send you directly to a new government and Union controlled school .", 
        "intTime": 20090521, 
        "postID": 76, 
        "quote": "", 
        "reply": "I hear the Fife and the drums acoming oer the bridge. The Brits wouldn't have us any longer, and France is happy being looked after by their government, no need of call out the Minutemen. Is not being Socialist owning a good portion or majority of the rail, air and communication outlets? These other countries do. In all cases the Banks are to be regulated and in the words of the new Secretary of Treasury we can force these institutions to do the bidding of the government. Have you notice, Congress has not received or past new regulations controlling what got us here in the first place? The ones presented so far are the same as the in 2005, 2008. I've yet to figure how the Union (UAW)gets 55% of Chrysler? The government will be in \"control\" not only auto builders, (build this kind of car) but all industries, (cap on CO2) individuals, taxes and high cost of energy. If you're born in the next decade the hospitals will not fill out a birth certificate, just stamp your butts USDA and send you directly to a new government and Union controlled school .", 
        "threadID": "672198221_5500078322001", 
        "time": "2009-05-21 11:58:00", 
        "title": "For those who still doubt", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: Originally posted by ACR26: Let them get their big checks...let the banks fail...let the market be reborn... Will it be tough when eventually it happens? You bet. The pain will be much less if we let the market adjust itself instead of Pres Obama making things worse. You do realise that the government (ie the tax payers) will pick up the tab for a LOT of the loss (FDIC, etc.) don't you while the managers will have millions in their pockets (oversea accounts).", 
        "intTime": 20090521, 
        "postID": 77, 
        "quote": "Originally posted by ACR26: Let them get their big checks...let the banks fail...let the market be reborn... Will it be tough when eventually it happens? You bet. The pain will be much less if we let the market adjust itself instead of Pres Obama making things worse.", 
        "reply": " You do realise that the government (ie the tax payers) will pick up the tab for a LOT of the loss (FDIC, etc.) don't you while the managers will have millions in their pockets (oversea accounts).", 
        "threadID": "672198221_5500078322001", 
        "time": "2009-05-21 12:15:00", 
        "title": "For those who still doubt", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by stec74: That's why we continue to get into these messes. A bunch of politicians, many of whom have never run a lemonade stand, let alone a multi-billion dollar corporation are trying to tell these corporations their opinion on the right way to do business. If these banks want to pay back the money let them. If they want to pay bonuses to their executives let them. If they fail, so be it. A couple more years of this administration and no one will have any need for money anyway. We will all have \"free\" health care, drive a white \"smart car\", and live in the same \"cookie cutter\" two bedroom apartment paid for by the government. Mr. Obama is just doing what Pres Bush I did to fix the S&L problem created by Saint Ronnie's deregs and what Pres Bush II started to fix this problem caused by deregulation. Amazing how to Repubs NOTHING is ever their fault. During the 8 years of the Bush admin they blamed everything bad that happened on Clinton and now that Obama has been in power just over 100 days (his first budget doesn't take effect until Oct) everything is his fault. I find it funny that if they are being honest then in effect the Repubs are saving their party and politicians are and have been COMPLETELY ineffective.", 
        "intTime": 20090521, 
        "postID": 78, 
        "quote": "Originally posted by stec74: That's why we continue to get into these messes. A bunch of politicians, many of whom have never run a lemonade stand, let alone a multi-billion dollar corporation are trying to tell these corporations their opinion on the right way to do business. If these banks want to pay back the money let them. If they want to pay bonuses to their executives let them. If they fail, so be it. A couple more years of this administration and no one will have any need for money anyway. We will all have \"free\" health care, drive a white \"smart car\", and live in the same \"cookie cutter\" two bedroom apartment paid for by the government.", 
        "reply": " Mr. Obama is just doing what Pres Bush I did to fix the S&L problem created by Saint Ronnie's deregs and what Pres Bush II started to fix this problem caused by deregulation. Amazing how to Repubs NOTHING is ever their fault. During the 8 years of the Bush admin they blamed everything bad that happened on Clinton and now that Obama has been in power just over 100 days (his first budget doesn't take effect until Oct) everything is his fault. I find it funny that if they are being honest then in effect the Repubs are saving their party and politicians are and have been COMPLETELY ineffective.", 
        "threadID": "672198221_5500078322001", 
        "time": "2009-05-21 12:26:00", 
        "title": "For those who still doubt", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: I'd love a Smart car. Everytime I have to park, I envy them suckers. Always tempted to put one under my coat and run with it. They should make em with handles on the roof for ease of carry That smart car...as they scrape you off the road...hope a few more mpgs was worth it", 
        "intTime": 20090521, 
        "postID": 79, 
        "quote": "I'd love a Smart car. Everytime I have to park, I envy them suckers. Always tempted to put one under my coat and run with it. They should make em with handles on the roof for ease of carry", 
        "reply": " That smart car...as they scrape you off the road...hope a few more mpgs was worth it", 
        "threadID": "672198221_5500078322001", 
        "time": "2009-05-21 15:50:00", 
        "title": "For those who still doubt", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: But the ones who supported the criminal right wing extremist thugs that are responsible for getting over 4000 Americans and hundreds of thousands of Iraqis needlessly killed did not sell out? We have a good president dedicated to the betterment of our country who was actually elected by a majority but you want to keep the right wing extremist philosophy of hate dishonor and subjugation going. I like the use of the word criminal... I like vomit too...that is a good word for this post", 
        "intTime": 20090521, 
        "postID": 80, 
        "quote": "But the ones who supported the criminal right wing extremist thugs that are responsible for getting over 4000 Americans and hundreds of thousands of Iraqis needlessly killed did not sell out? We have a good president dedicated to the betterment of our country who was actually elected by a majority but you want to keep the right wing extremist philosophy of hate dishonor and subjugation going.", 
        "reply": " I like the use of the word criminal... I like vomit too...that is a good word for this post", 
        "threadID": "672198221_5500078322001", 
        "time": "2009-05-21 15:52:00", 
        "title": "For those who still doubt", 
        "userID": "ACR26"
    }
]