[
    {
        "content": "http://www.military.com/news/article/April-2009/montana...to-be-new-gitmo.html quote: he development authority in Hardin, a city of 3,400 people bordering the Crow Indian Reservation, built the $27 million, 460-bed jail two years ago and has been looking for tenants ever since. Its construction loans are in default. The City Council voted 5-0 Tuesday in favor of a resolution supporting a proposal to house terror suspects currently detained at the U.S. naval base in Guantanamo Bay while they await trial. \"Somebody has to stand up and put (the Guantanamo prisoners) in their backyards. It's our patriotic duty,\" said Greg Smith, director of the city's Two Rivers Authority. \"Not on my watch,\" U.S. Sen. Max Baucus said. The Montana Democrat said the detainees' presence would be a security risk to the community and exceed the capacity of the U.S. District Court in Billings, which would have jurisdiction over their cases. The rest of the state's congressional delegation - Democratic Sen. Jon Tester and Republican Rep. Denny Rehberg - agreed that bringing Guantanamo prisoners to Montana is a bad idea, though they support efforts to find some other use for the jail. If the town is willing to take them, why not??", 
        "intTime": 20090424, 
        "postID": 1, 
        "quote": "he development authority in Hardin, a city of 3,400 people bordering the Crow Indian Reservation, built the $27 million, 460-bed jail two years ago and has been looking for tenants ever since. Its construction loans are in default. The City Council voted 5-0 Tuesday in favor of a resolution supporting a proposal to house terror suspects currently detained at the U.S. naval base in Guantanamo Bay while they await trial. \"Somebody has to stand up and put (the Guantanamo prisoners) in their backyards. It's our patriotic duty,\" said Greg Smith, director of the city's Two Rivers Authority. \"Not on my watch,\" U.S. Sen. Max Baucus said. The Montana Democrat said the detainees' presence would be a security risk to the community and exceed the capacity of the U.S. District Court in Billings, which would have jurisdiction over their cases. The rest of the state's congressional delegation - Democratic Sen. Jon Tester and Republican Rep. Denny Rehberg - agreed that bringing Guantanamo prisoners to Montana is a bad idea, though they support efforts to find some other use for the jail.", 
        "reply": "http://www.military.com/news/article/April-2009/montana...to-be-new-gitmo.html  If the town is willing to take them, why not??", 
        "threadID": "672198221_6430007122001", 
        "time": "2009-04-24 18:57:00", 
        "title": "So why don't they want them in their State??", 
        "userID": "3678131"
    }, 
    {
        "content": "quote: \"Somebody has to stand up and put (the Guantanamo prisoners) in their backyards. It's our patriotic duty,\" said Greg Smith, director of the city's Two Rivers Authority. alcatraz would do", 
        "intTime": 20090425, 
        "postID": 2, 
        "quote": "\"Somebody has to stand up and put (the Guantanamo prisoners) in their backyards. It's our patriotic duty,\" said Greg Smith, director of the city's Two Rivers Authority.", 
        "reply": " alcatraz would do", 
        "threadID": "672198221_6430007122001", 
        "time": "2009-04-25 08:40:00", 
        "title": "So why don't they want them in their State??", 
        "userID": "ss_287"
    }, 
    {
        "content": "The weather in Montana is just too cold for these folks. I suggest to move them to Miami or SF and put them in general population with the Black, white, and hispanic gangs. Let them pray five times a day there.", 
        "intTime": 20090425, 
        "postID": 3, 
        "quote": "", 
        "reply": "The weather in Montana is just too cold for these folks. I suggest to move them to Miami or SF and put them in general population with the Black, white, and hispanic gangs. Let them pray five times a day there.", 
        "threadID": "672198221_6430007122001", 
        "time": "2009-04-25 13:00:00", 
        "title": "So why don't they want them in their State??", 
        "userID": "Duster6"
    }, 
    {
        "content": "I think the bigger question is why is private industry and law enforcement in bed together? Someone should go to jail over this jail, it was obviously someones pet project to fatten the pocket of some law enforcement individuals in return for union support... BTW: I support the Alcatraz plan my self.", 
        "intTime": 20090425, 
        "postID": 4, 
        "quote": "", 
        "reply": "I think the bigger question is why is private industry and law enforcement in bed together? Someone should go to jail over this jail, it was obviously someones pet project to fatten the pocket of some law enforcement individuals in return for union support... BTW: I support the Alcatraz plan my self.", 
        "threadID": "672198221_6430007122001", 
        "time": "2009-04-25 13:04:00", 
        "title": "So why don't they want them in their State??", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "Well first of all, I believe they have to be charged with a crime. If not, they should not be brought to this country in the 1st place. If they have been charged, or are expected to be charged in the NEAR FUTURE they should be placed in confinement until trial but they deserve no special treatment, I agree with Duster on this one. Alcatraz would work for me as well. Our prisons are way to liberal. I also see no issue in setting up a prison THE RIGHT WAY just for foreign / enemy combatants, they will be placed on trial, serve and or executed if that is the punishment. Bring them down here to SW VA, we need more prisons 50 isn't enough, we need jobs, I would guard them, I would rather guard them than the \"nice\" American prisoners we have sitting over at the red onion.", 
        "intTime": 20090425, 
        "postID": 5, 
        "quote": "", 
        "reply": "Well first of all, I believe they have to be charged with a crime. If not, they should not be brought to this country in the 1st place. If they have been charged, or are expected to be charged in the NEAR FUTURE they should be placed in confinement until trial but they deserve no special treatment, I agree with Duster on this one. Alcatraz would work for me as well. Our prisons are way to liberal. I also see no issue in setting up a prison THE RIGHT WAY just for foreign / enemy combatants, they will be placed on trial, serve and or executed if that is the punishment. Bring them down here to SW VA, we need more prisons 50 isn't enough, we need jobs, I would guard them, I would rather guard them than the \"nice\" American prisoners we have sitting over at the red onion.", 
        "threadID": "672198221_6430007122001", 
        "time": "2009-04-25 13:42:00", 
        "title": "So why don't they want them in their State??", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "Most cannot be charged with a \"crime\" as there are no easily available witnesses against them. They COULD be charged with WAR CRIMES, and be tried before a Tribunal....no....wait.....that's what we WERE doing, but the current Admin. cancelled them.....their nations of origine either DON'T want them back or will likely TORTURE (no, the real thing, cutting them into pieces while alive, etc.)and KILL them, we can't send them back.....what to do with them, where and for how long?", 
        "intTime": 20090425, 
        "postID": 6, 
        "quote": "", 
        "reply": "Most cannot be charged with a \"crime\" as there are no easily available witnesses against them. They COULD be charged with WAR CRIMES, and be tried before a Tribunal....no....wait.....that's what we WERE doing, but the current Admin. cancelled them.....their nations of origine either DON'T want them back or will likely TORTURE (no, the real thing, cutting them into pieces while alive, etc.)and KILL them, we can't send them back.....what to do with them, where and for how long?", 
        "threadID": "672198221_6430007122001", 
        "time": "2009-04-25 13:51:00", 
        "title": "So why don't they want them in their State??", 
        "userID": "peter3_1"
    }, 
    {
        "content": "ss_287: I agree...we could reopen Alcatraz and send them all there.. I just thought it interesting this town says..SEND THEM HERE..when nobody else around the globe wants to deal with them..", 
        "intTime": 20090425, 
        "postID": 7, 
        "quote": "", 
        "reply": "ss_287: I agree...we could reopen Alcatraz and send them all there.. I just thought it interesting this town says..SEND THEM HERE..when nobody else around the globe wants to deal with them..", 
        "threadID": "672198221_6430007122001", 
        "time": "2009-04-25 16:06:00", 
        "title": "So why don't they want them in their State??", 
        "userID": "3678131"
    }, 
    {
        "content": "quote: Originally posted by 3678131: ss_287: I agree...we could reopen Alcatraz and send them all there.. I just thought it interesting this town says..SEND THEM HERE..when nobody else around the globe wants to deal with them.. Alcatraz is surounded by cold water and beyond swimming distance, an island away from our shores a perfect place for them to be housed andnot on mainland ground", 
        "intTime": 20090425, 
        "postID": 8, 
        "quote": "Originally posted by 3678131: ss_287: I agree...we could reopen Alcatraz and send them all there.. I just thought it interesting this town says..SEND THEM HERE..when nobody else around the globe wants to deal with them..", 
        "reply": " Alcatraz is surounded by cold water and beyond swimming distance, an island away from our shores a perfect place for them to be housed andnot on mainland ground", 
        "threadID": "672198221_6430007122001", 
        "time": "2009-04-25 18:33:00", 
        "title": "So why don't they want them in their State??", 
        "userID": "ss_287"
    }, 
    {
        "content": "quote: Originally posted by ss_287: quote: Originally posted by 3678131: ss_287: I agree...we could reopen Alcatraz and send them all there.. I just thought it interesting this town says..SEND THEM HERE..when nobody else around the globe wants to deal with them.. Alcatraz is surounded by cold water and beyond swimming distance, an island away from our shores a perfect place for them to be housed andnot on mainland ground It would be the perfect place. I bet Nancy would have a conniption fit and meltdown all at once.....", 
        "intTime": 20090426, 
        "postID": 9, 
        "quote": "Originally posted by ss_287: quote: Originally posted by 3678131: ss_287: I agree...we could reopen Alcatraz and send them all there.. I just thought it interesting this town says..SEND THEM HERE..when nobody else around the globe wants to deal with them.. Alcatraz is surounded by cold water and beyond swimming distance, an island away from our shores a perfect place for them to be housed andnot on mainland ground", 
        "reply": " It would be the perfect place. I bet Nancy would have a conniption fit and meltdown all at once.....", 
        "threadID": "672198221_6430007122001", 
        "time": "2009-04-26 06:43:00", 
        "title": "So why don't they want them in their State??", 
        "userID": "Woody_in_La"
    }, 
    {
        "content": "Alcatraz is a revenue producing museum that belongs to the National Park Service. Hey, if you want to send the millions it would take to \"fix her up\", we could sure use the jobs and the scratch.", 
        "intTime": 20090426, 
        "postID": 10, 
        "quote": "", 
        "reply": "Alcatraz is a revenue producing museum that belongs to the National Park Service. Hey, if you want to send the millions it would take to \"fix her up\", we could sure use the jobs and the scratch.", 
        "threadID": "672198221_6430007122001", 
        "time": "2009-04-26 06:52:00", 
        "title": "So why don't they want them in their State??", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "This makes no sense! I completely support closing Guantanamo having served there a year and seeing what a stupid waste of money and legal quagmire its become... HOWEVER I do not support bringing them to the states because their lawyers will immediately petition for asylum and they will get it. RETURN THEM TO THEIR OWN COUNTRIES! Except the Uigurs, of course.", 
        "intTime": 20090427, 
        "postID": 11, 
        "quote": "", 
        "reply": "This makes no sense! I completely support closing Guantanamo having served there a year and seeing what a stupid waste of money and legal quagmire its become... HOWEVER I do not support bringing them to the states because their lawyers will immediately petition for asylum and they will get it. RETURN THEM TO THEIR OWN COUNTRIES! Except the Uigurs, of course.", 
        "threadID": "672198221_6430007122001", 
        "time": "2009-04-27 10:26:00", 
        "title": "So why don't they want them in their State??", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: Alcatraz is a revenue producing museum that belongs to the National Park Service. Hey, if you want to send the millions it would take to \"fix her up\", we could sure use the jobs and the scratch. You could always add, \"See the Terrorist Folks.\" Exhabit. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090427, 
        "postID": 12, 
        "quote": "Originally posted by SeaWitch1220: Alcatraz is a revenue producing museum that belongs to the National Park Service. Hey, if you want to send the millions it would take to \"fix her up\", we could sure use the jobs and the scratch.", 
        "reply": " You could always add, \"See the Terrorist Folks.\" Exhabit. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_6430007122001", 
        "time": "2009-04-27 11:32:00", 
        "title": "So why don't they want them in their State??", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: This makes no sense! I completely support closing Guantanamo having served there a year and seeing what a stupid waste of money and legal quagmire its become... HOWEVER I do not support bringing them to the states because their lawyers will immediately petition for asylum and they will get it. RETURN THEM TO THEIR OWN COUNTRIES! Except the Uigurs, of course. Sending them back to their own country is a death sentence. Be consistant. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090427, 
        "postID": 13, 
        "quote": "Originally posted by mrmixitup: This makes no sense! I completely support closing Guantanamo having served there a year and seeing what a stupid waste of money and legal quagmire its become... HOWEVER I do not support bringing them to the states because their lawyers will immediately petition for asylum and they will get it. RETURN THEM TO THEIR OWN COUNTRIES! Except the Uigurs, of course.", 
        "reply": " Sending them back to their own country is a death sentence. Be consistant. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_6430007122001", 
        "time": "2009-04-27 11:33:00", 
        "title": "So why don't they want them in their State??", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by SeaWitch1220: Alcatraz is a revenue producing museum that belongs to the National Park Service. Hey, if you want to send the millions it would take to \"fix her up\", we could sure use the jobs and the scratch. You could always add, \"See the Terrorist Folks.\" Exhabit. hey that could be a real money maker there. A weekly raffle to see who gets to throw the switch on Ol'Sparky while a terrorist gets to meet his virgins.", 
        "intTime": 20090427, 
        "postID": 14, 
        "quote": "Originally posted by L0A1: quote: Originally posted by SeaWitch1220: Alcatraz is a revenue producing museum that belongs to the National Park Service. Hey, if you want to send the millions it would take to \"fix her up\", we could sure use the jobs and the scratch. You could always add, \"See the Terrorist Folks.\" Exhabit.", 
        "reply": " hey that could be a real money maker there. A weekly raffle to see who gets to throw the switch on Ol'Sparky while a terrorist gets to meet his virgins.", 
        "threadID": "672198221_6430007122001", 
        "time": "2009-04-27 11:50:00", 
        "title": "So why don't they want them in their State??", 
        "userID": "Sand_Flea"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by mrmixitup: This makes no sense! I completely support closing Guantanamo having served there a year and seeing what a stupid waste of money and legal quagmire its become... HOWEVER I do not support bringing them to the states because their lawyers will immediately petition for asylum and they will get it. RETURN THEM TO THEIR OWN COUNTRIES! Except the Uigurs, of course. Sending them back to their own country is a death sentence. Be consistant. I'm still looking for the downside of this...", 
        "intTime": 20090427, 
        "postID": 15, 
        "quote": "Originally posted by L0A1: quote: Originally posted by mrmixitup: This makes no sense! I completely support closing Guantanamo having served there a year and seeing what a stupid waste of money and legal quagmire its become... HOWEVER I do not support bringing them to the states because their lawyers will immediately petition for asylum and they will get it. RETURN THEM TO THEIR OWN COUNTRIES! Except the Uigurs, of course. Sending them back to their own country is a death sentence. Be consistant.", 
        "reply": " I'm still looking for the downside of this...", 
        "threadID": "672198221_6430007122001", 
        "time": "2009-04-27 11:51:00", 
        "title": "So why don't they want them in their State??", 
        "userID": "Sand_Flea"
    }, 
    {
        "content": "quote: Originally posted by Sand_Flea: quote: Originally posted by L0A1: quote: Originally posted by mrmixitup: This makes no sense! I completely support closing Guantanamo having served there a year and seeing what a stupid waste of money and legal quagmire its become... HOWEVER I do not support bringing them to the states because their lawyers will immediately petition for asylum and they will get it. RETURN THEM TO THEIR OWN COUNTRIES! Except the Uigurs, of course. Sending them back to their own country is a death sentence. Be consistant. I'm still looking for the downside of this... It would violate rule of law apparently. Personnally, I think they should have met their fate on the battle fields. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090427, 
        "postID": 16, 
        "quote": "Originally posted by Sand_Flea: quote: Originally posted by L0A1: quote: Originally posted by mrmixitup: This makes no sense! I completely support closing Guantanamo having served there a year and seeing what a stupid waste of money and legal quagmire its become... HOWEVER I do not support bringing them to the states because their lawyers will immediately petition for asylum and they will get it. RETURN THEM TO THEIR OWN COUNTRIES! Except the Uigurs, of course. Sending them back to their own country is a death sentence. Be consistant. I'm still looking for the downside of this...", 
        "reply": " It would violate rule of law apparently. Personnally, I think they should have met their fate on the battle fields. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_6430007122001", 
        "time": "2009-04-27 12:12:00", 
        "title": "So why don't they want them in their State??", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by peter3_1: Most cannot be charged with a \"crime\" as there are no easily available witnesses against them. They COULD be charged with WAR CRIMES, and be tried before a Tribunal....no....wait.....that's what we WERE doing, but the current Admin. cancelled them.....their nations of origine either DON'T want them back or will likely TORTURE (no, the real thing, cutting them into pieces while alive, etc.)and KILL them, we can't send them back.....what to do with them, where and for how long? You mean they are being held, and no one even knows what they did? And you go on to suggest that trying them with no evidence, or I guess, \"for the hell of it,\" is what we call American Justice? And a real shame that we're not allowed to hang people for being arrested. Doesn't that defy logic? I mean, they were arrested, do we need any more evidence than that? Lousy stinking Supreme Court, bunch of evil do-gooders who actually claim that you have to use evidence to hang someone. Who's a thunk it? Of course we could simply take the liberal woose way out, and hold those whom we don't have evidence against indefinitely as POW's. On the other hand something tells me that at least against SOME of them, we DO have enough evidence to hang them - And a fair trial will indeed cause them to hang. Dave", 
        "intTime": 20090427, 
        "postID": 17, 
        "quote": "Originally posted by peter3_1: Most cannot be charged with a \"crime\" as there are no easily available witnesses against them. They COULD be charged with WAR CRIMES, and be tried before a Tribunal....no....wait.....that's what we WERE doing, but the current Admin. cancelled them.....their nations of origine either DON'T want them back or will likely TORTURE (no, the real thing, cutting them into pieces while alive, etc.)and KILL them, we can't send them back.....what to do with them, where and for how long?", 
        "reply": " You mean they are being held, and no one even knows what they did? And you go on to suggest that trying them with no evidence, or I guess, \"for the hell of it,\" is what we call American Justice? And a real shame that we're not allowed to hang people for being arrested. Doesn't that defy logic? I mean, they were arrested, do we need any more evidence than that? Lousy stinking Supreme Court, bunch of evil do-gooders who actually claim that you have to use evidence to hang someone. Who's a thunk it? Of course we could simply take the liberal woose way out, and hold those whom we don't have evidence against indefinitely as POW's. On the other hand something tells me that at least against SOME of them, we DO have enough evidence to hang them - And a fair trial will indeed cause them to hang. Dave", 
        "threadID": "672198221_6430007122001", 
        "time": "2009-04-27 12:24:00", 
        "title": "So why don't they want them in their State??", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by SeaWitch1220: Alcatraz is a revenue producing museum that belongs to the National Park Service. Hey, if you want to send the millions it would take to \"fix her up\", we could sure use the jobs and the scratch. You could always add, \"See the Terrorist Folks.\" Exhabit. LOL! Yeah, that'll work! Dave", 
        "intTime": 20090427, 
        "postID": 18, 
        "quote": "Originally posted by L0A1: quote: Originally posted by SeaWitch1220: Alcatraz is a revenue producing museum that belongs to the National Park Service. Hey, if you want to send the millions it would take to \"fix her up\", we could sure use the jobs and the scratch. You could always add, \"See the Terrorist Folks.\" Exhabit.", 
        "reply": " LOL! Yeah, that'll work! Dave", 
        "threadID": "672198221_6430007122001", 
        "time": "2009-04-27 12:25:00", 
        "title": "So why don't they want them in their State??", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: Alcatraz is a revenue producing museum that belongs to the National Park Service. Hey, if you want to send the millions it would take to \"fix her up\", we could sure use the jobs and the scratch. Let the dirtbags we send there \"fix the place up\". All they need is a roof over their head and 2 squares a day to live better then they ever had. BTW, make sure to overstock the bay with sharks, let them carry out the justice we're afraid to do.", 
        "intTime": 20090427, 
        "postID": 19, 
        "quote": "Originally posted by SeaWitch1220: Alcatraz is a revenue producing museum that belongs to the National Park Service. Hey, if you want to send the millions it would take to \"fix her up\", we could sure use the jobs and the scratch.", 
        "reply": " Let the dirtbags we send there \"fix the place up\". All they need is a roof over their head and 2 squares a day to live better then they ever had. BTW, make sure to overstock the bay with sharks, let them carry out the justice we're afraid to do.", 
        "threadID": "672198221_6430007122001", 
        "time": "2009-04-27 16:20:00", 
        "title": "So why don't they want them in their State??", 
        "userID": "Raunchy"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by peter3_1: Most cannot be charged with a \"crime\" as there are no easily available witnesses against them. They COULD be charged with WAR CRIMES, and be tried before a Tribunal....no....wait.....that's what we WERE doing, but the current Admin. cancelled them.....their nations of origine either DON'T want them back or will likely TORTURE (no, the real thing, cutting them into pieces while alive, etc.)and KILL them, we can't send them back.....what to do with them, where and for how long? You mean they are being held, and no one even knows what they did? And you go on to suggest that trying them with no evidence, or I guess, \"for the hell of it,\" is what we call American Justice? News flash, they are NOT Americans. Besides most have no concept of \"justice\". And a real shame that we're not allowed to hang people for being arrested. Doesn't that defy logic? I mean, they were arrested, do we need any more evidence than that? Were they \"arrested\" or captured on the battlefield? Maranda Rights read? \"Stop in the name of the law\" shouted at them? Lousy stinking Supreme Court, bunch of evil do-gooders who actually claim that you have to use evidence to hang someone. Who's a thunk it? Shooting at you should be all the evidence needed to eliminate them with extreme prejudice. Of course we could simply take the liberal woose way out, and hold those whom we don't have evidence against indefinitely as POW's. Better, extract all the intel possible from them, implant a tracking device (like we do with animals), send them home and wait for them to lead us to bigger fish. On the other hand something tells me that at least against SOME of them, we DO have enough evidence to hang them - And a fair trial will indeed cause them to hang. Very few \"fair\" trials (high profile trials anyway) available in American anymore what with the over abundance of out-of-work shyster lawyers available, all looking to make a name. Can you imagine the media circus that would surround such a trial? Why the WUSS democrats would all faint with a case of \"the vapors\" and the cowardly republicans would all run for cover. The only thing that would be hung is the jury. Dave", 
        "intTime": 20090427, 
        "postID": 20, 
        "quote": "Originally posted by Grachus: quote: Originally posted by peter3_1: Most cannot be charged with a \"crime\" as there are no easily available witnesses against them. They COULD be charged with WAR CRIMES, and be tried before a Tribunal....no....wait.....that's what we WERE doing, but the current Admin. cancelled them.....their nations of origine either DON'T want them back or will likely TORTURE (no, the real thing, cutting them into pieces while alive, etc.)and KILL them, we can't send them back.....what to do with them, where and for how long? You mean they are being held, and no one even knows what they did? And you go on to suggest that trying them with no evidence, or I guess, \"for the hell of it,\" is what we call American Justice? News flash, they are NOT Americans. Besides most have no concept of \"justice\". And a real shame that we're not allowed to hang people for being arrested. Doesn't that defy logic? I mean, they were arrested, do we need any more evidence than that? Were they \"arrested\" or captured on the battlefield? Maranda Rights read? \"Stop in the name of the law\" shouted at them? Lousy stinking Supreme Court, bunch of evil do-gooders who actually claim that you have to use evidence to hang someone. Who's a thunk it? Shooting at you should be all the evidence needed to eliminate them with extreme prejudice. Of course we could simply take the liberal woose way out, and hold those whom we don't have evidence against indefinitely as POW's. Better, extract all the intel possible from them, implant a tracking device (like we do with animals), send them home and wait for them to lead us to bigger fish. On the other hand something tells me that at least against SOME of them, we DO have enough evidence to hang them - And a fair trial will indeed cause them to hang. Very few \"fair\" trials (high profile trials anyway) available in American anymore what with the over abundance of out-of-work shyster lawyers available, all looking to make a name. Can you imagine the media circus that would surround such a trial? Why the WUSS democrats would all faint with a case of \"the vapors\" and the cowardly republicans would all run for cover. The only thing that would be hung is the jury. Dave", 
        "reply": "", 
        "threadID": "672198221_6430007122001", 
        "time": "2009-04-27 16:42:00", 
        "title": "So why don't they want them in their State??", 
        "userID": "Raunchy"
    }, 
    {
        "content": "http://www.military.com/news/article/April-2009/montana...to-be-new-gitmo.html quote: he development authority in Hardin, a city of 3,400 people bordering the Crow Indian Reservation, built the $27 million, 460-bed jail two years ago and has been looking for tenants ever since. Its construction loans are in default. The City Council voted 5-0 Tuesday in favor of a resolution supporting a proposal to house terror suspects currently detained at the U.S. naval base in Guantanamo Bay while they await trial. \"Somebody has to stand up and put (the Guantanamo prisoners) in their backyards. It's our patriotic duty,\" said Greg Smith, director of the city's Two Rivers Authority. \"Not on my watch,\" U.S. Sen. Max Baucus said. The Montana Democrat said the detainees' presence would be a security risk to the community and exceed the capacity of the U.S. District Court in Billings, which would have jurisdiction over their cases. The rest of the state's congressional delegation - Democratic Sen. Jon Tester and Republican Rep. Denny Rehberg - agreed that bringing Guantanamo prisoners to Montana is a bad idea, though they support efforts to find some other use for the jail. If the town is willing to take them, why not??", 
        "intTime": 20090424, 
        "postID": 21, 
        "quote": "he development authority in Hardin, a city of 3,400 people bordering the Crow Indian Reservation, built the $27 million, 460-bed jail two years ago and has been looking for tenants ever since. Its construction loans are in default. The City Council voted 5-0 Tuesday in favor of a resolution supporting a proposal to house terror suspects currently detained at the U.S. naval base in Guantanamo Bay while they await trial. \"Somebody has to stand up and put (the Guantanamo prisoners) in their backyards. It's our patriotic duty,\" said Greg Smith, director of the city's Two Rivers Authority. \"Not on my watch,\" U.S. Sen. Max Baucus said. The Montana Democrat said the detainees' presence would be a security risk to the community and exceed the capacity of the U.S. District Court in Billings, which would have jurisdiction over their cases. The rest of the state's congressional delegation - Democratic Sen. Jon Tester and Republican Rep. Denny Rehberg - agreed that bringing Guantanamo prisoners to Montana is a bad idea, though they support efforts to find some other use for the jail.", 
        "reply": "http://www.military.com/news/article/April-2009/montana...to-be-new-gitmo.html  If the town is willing to take them, why not??", 
        "threadID": "672198221_6430007122001", 
        "time": "2009-04-24 18:57:00", 
        "title": "So why don't they want them in their State??", 
        "userID": "3678131"
    }, 
    {
        "content": "quote: \"Somebody has to stand up and put (the Guantanamo prisoners) in their backyards. It's our patriotic duty,\" said Greg Smith, director of the city's Two Rivers Authority. alcatraz would do", 
        "intTime": 20090425, 
        "postID": 22, 
        "quote": "\"Somebody has to stand up and put (the Guantanamo prisoners) in their backyards. It's our patriotic duty,\" said Greg Smith, director of the city's Two Rivers Authority.", 
        "reply": " alcatraz would do", 
        "threadID": "672198221_6430007122001", 
        "time": "2009-04-25 08:40:00", 
        "title": "So why don't they want them in their State??", 
        "userID": "ss_287"
    }, 
    {
        "content": "The weather in Montana is just too cold for these folks. I suggest to move them to Miami or SF and put them in general population with the Black, white, and hispanic gangs. Let them pray five times a day there.", 
        "intTime": 20090425, 
        "postID": 23, 
        "quote": "", 
        "reply": "The weather in Montana is just too cold for these folks. I suggest to move them to Miami or SF and put them in general population with the Black, white, and hispanic gangs. Let them pray five times a day there.", 
        "threadID": "672198221_6430007122001", 
        "time": "2009-04-25 13:00:00", 
        "title": "So why don't they want them in their State??", 
        "userID": "Duster6"
    }, 
    {
        "content": "I think the bigger question is why is private industry and law enforcement in bed together? Someone should go to jail over this jail, it was obviously someones pet project to fatten the pocket of some law enforcement individuals in return for union support... BTW: I support the Alcatraz plan my self.", 
        "intTime": 20090425, 
        "postID": 24, 
        "quote": "", 
        "reply": "I think the bigger question is why is private industry and law enforcement in bed together? Someone should go to jail over this jail, it was obviously someones pet project to fatten the pocket of some law enforcement individuals in return for union support... BTW: I support the Alcatraz plan my self.", 
        "threadID": "672198221_6430007122001", 
        "time": "2009-04-25 13:04:00", 
        "title": "So why don't they want them in their State??", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "Well first of all, I believe they have to be charged with a crime. If not, they should not be brought to this country in the 1st place. If they have been charged, or are expected to be charged in the NEAR FUTURE they should be placed in confinement until trial but they deserve no special treatment, I agree with Duster on this one. Alcatraz would work for me as well. Our prisons are way to liberal. I also see no issue in setting up a prison THE RIGHT WAY just for foreign / enemy combatants, they will be placed on trial, serve and or executed if that is the punishment. Bring them down here to SW VA, we need more prisons 50 isn't enough, we need jobs, I would guard them, I would rather guard them than the \"nice\" American prisoners we have sitting over at the red onion.", 
        "intTime": 20090425, 
        "postID": 25, 
        "quote": "", 
        "reply": "Well first of all, I believe they have to be charged with a crime. If not, they should not be brought to this country in the 1st place. If they have been charged, or are expected to be charged in the NEAR FUTURE they should be placed in confinement until trial but they deserve no special treatment, I agree with Duster on this one. Alcatraz would work for me as well. Our prisons are way to liberal. I also see no issue in setting up a prison THE RIGHT WAY just for foreign / enemy combatants, they will be placed on trial, serve and or executed if that is the punishment. Bring them down here to SW VA, we need more prisons 50 isn't enough, we need jobs, I would guard them, I would rather guard them than the \"nice\" American prisoners we have sitting over at the red onion.", 
        "threadID": "672198221_6430007122001", 
        "time": "2009-04-25 13:42:00", 
        "title": "So why don't they want them in their State??", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "Most cannot be charged with a \"crime\" as there are no easily available witnesses against them. They COULD be charged with WAR CRIMES, and be tried before a Tribunal....no....wait.....that's what we WERE doing, but the current Admin. cancelled them.....their nations of origine either DON'T want them back or will likely TORTURE (no, the real thing, cutting them into pieces while alive, etc.)and KILL them, we can't send them back.....what to do with them, where and for how long?", 
        "intTime": 20090425, 
        "postID": 26, 
        "quote": "", 
        "reply": "Most cannot be charged with a \"crime\" as there are no easily available witnesses against them. They COULD be charged with WAR CRIMES, and be tried before a Tribunal....no....wait.....that's what we WERE doing, but the current Admin. cancelled them.....their nations of origine either DON'T want them back or will likely TORTURE (no, the real thing, cutting them into pieces while alive, etc.)and KILL them, we can't send them back.....what to do with them, where and for how long?", 
        "threadID": "672198221_6430007122001", 
        "time": "2009-04-25 13:51:00", 
        "title": "So why don't they want them in their State??", 
        "userID": "peter3_1"
    }, 
    {
        "content": "ss_287: I agree...we could reopen Alcatraz and send them all there.. I just thought it interesting this town says..SEND THEM HERE..when nobody else around the globe wants to deal with them..", 
        "intTime": 20090425, 
        "postID": 27, 
        "quote": "", 
        "reply": "ss_287: I agree...we could reopen Alcatraz and send them all there.. I just thought it interesting this town says..SEND THEM HERE..when nobody else around the globe wants to deal with them..", 
        "threadID": "672198221_6430007122001", 
        "time": "2009-04-25 16:06:00", 
        "title": "So why don't they want them in their State??", 
        "userID": "3678131"
    }, 
    {
        "content": "quote: Originally posted by 3678131: ss_287: I agree...we could reopen Alcatraz and send them all there.. I just thought it interesting this town says..SEND THEM HERE..when nobody else around the globe wants to deal with them.. Alcatraz is surounded by cold water and beyond swimming distance, an island away from our shores a perfect place for them to be housed andnot on mainland ground", 
        "intTime": 20090425, 
        "postID": 28, 
        "quote": "Originally posted by 3678131: ss_287: I agree...we could reopen Alcatraz and send them all there.. I just thought it interesting this town says..SEND THEM HERE..when nobody else around the globe wants to deal with them..", 
        "reply": " Alcatraz is surounded by cold water and beyond swimming distance, an island away from our shores a perfect place for them to be housed andnot on mainland ground", 
        "threadID": "672198221_6430007122001", 
        "time": "2009-04-25 18:33:00", 
        "title": "So why don't they want them in their State??", 
        "userID": "ss_287"
    }, 
    {
        "content": "quote: Originally posted by ss_287: quote: Originally posted by 3678131: ss_287: I agree...we could reopen Alcatraz and send them all there.. I just thought it interesting this town says..SEND THEM HERE..when nobody else around the globe wants to deal with them.. Alcatraz is surounded by cold water and beyond swimming distance, an island away from our shores a perfect place for them to be housed andnot on mainland ground It would be the perfect place. I bet Nancy would have a conniption fit and meltdown all at once.....", 
        "intTime": 20090426, 
        "postID": 29, 
        "quote": "Originally posted by ss_287: quote: Originally posted by 3678131: ss_287: I agree...we could reopen Alcatraz and send them all there.. I just thought it interesting this town says..SEND THEM HERE..when nobody else around the globe wants to deal with them.. Alcatraz is surounded by cold water and beyond swimming distance, an island away from our shores a perfect place for them to be housed andnot on mainland ground", 
        "reply": " It would be the perfect place. I bet Nancy would have a conniption fit and meltdown all at once.....", 
        "threadID": "672198221_6430007122001", 
        "time": "2009-04-26 06:43:00", 
        "title": "So why don't they want them in their State??", 
        "userID": "Woody_in_La"
    }, 
    {
        "content": "Alcatraz is a revenue producing museum that belongs to the National Park Service. Hey, if you want to send the millions it would take to \"fix her up\", we could sure use the jobs and the scratch.", 
        "intTime": 20090426, 
        "postID": 30, 
        "quote": "", 
        "reply": "Alcatraz is a revenue producing museum that belongs to the National Park Service. Hey, if you want to send the millions it would take to \"fix her up\", we could sure use the jobs and the scratch.", 
        "threadID": "672198221_6430007122001", 
        "time": "2009-04-26 06:52:00", 
        "title": "So why don't they want them in their State??", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "This makes no sense! I completely support closing Guantanamo having served there a year and seeing what a stupid waste of money and legal quagmire its become... HOWEVER I do not support bringing them to the states because their lawyers will immediately petition for asylum and they will get it. RETURN THEM TO THEIR OWN COUNTRIES! Except the Uigurs, of course.", 
        "intTime": 20090427, 
        "postID": 31, 
        "quote": "", 
        "reply": "This makes no sense! I completely support closing Guantanamo having served there a year and seeing what a stupid waste of money and legal quagmire its become... HOWEVER I do not support bringing them to the states because their lawyers will immediately petition for asylum and they will get it. RETURN THEM TO THEIR OWN COUNTRIES! Except the Uigurs, of course.", 
        "threadID": "672198221_6430007122001", 
        "time": "2009-04-27 10:26:00", 
        "title": "So why don't they want them in their State??", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: Alcatraz is a revenue producing museum that belongs to the National Park Service. Hey, if you want to send the millions it would take to \"fix her up\", we could sure use the jobs and the scratch. You could always add, \"See the Terrorist Folks.\" Exhabit. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090427, 
        "postID": 32, 
        "quote": "Originally posted by SeaWitch1220: Alcatraz is a revenue producing museum that belongs to the National Park Service. Hey, if you want to send the millions it would take to \"fix her up\", we could sure use the jobs and the scratch.", 
        "reply": " You could always add, \"See the Terrorist Folks.\" Exhabit. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_6430007122001", 
        "time": "2009-04-27 11:32:00", 
        "title": "So why don't they want them in their State??", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: This makes no sense! I completely support closing Guantanamo having served there a year and seeing what a stupid waste of money and legal quagmire its become... HOWEVER I do not support bringing them to the states because their lawyers will immediately petition for asylum and they will get it. RETURN THEM TO THEIR OWN COUNTRIES! Except the Uigurs, of course. Sending them back to their own country is a death sentence. Be consistant. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090427, 
        "postID": 33, 
        "quote": "Originally posted by mrmixitup: This makes no sense! I completely support closing Guantanamo having served there a year and seeing what a stupid waste of money and legal quagmire its become... HOWEVER I do not support bringing them to the states because their lawyers will immediately petition for asylum and they will get it. RETURN THEM TO THEIR OWN COUNTRIES! Except the Uigurs, of course.", 
        "reply": " Sending them back to their own country is a death sentence. Be consistant. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_6430007122001", 
        "time": "2009-04-27 11:33:00", 
        "title": "So why don't they want them in their State??", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by SeaWitch1220: Alcatraz is a revenue producing museum that belongs to the National Park Service. Hey, if you want to send the millions it would take to \"fix her up\", we could sure use the jobs and the scratch. You could always add, \"See the Terrorist Folks.\" Exhabit. hey that could be a real money maker there. A weekly raffle to see who gets to throw the switch on Ol'Sparky while a terrorist gets to meet his virgins.", 
        "intTime": 20090427, 
        "postID": 34, 
        "quote": "Originally posted by L0A1: quote: Originally posted by SeaWitch1220: Alcatraz is a revenue producing museum that belongs to the National Park Service. Hey, if you want to send the millions it would take to \"fix her up\", we could sure use the jobs and the scratch. You could always add, \"See the Terrorist Folks.\" Exhabit.", 
        "reply": " hey that could be a real money maker there. A weekly raffle to see who gets to throw the switch on Ol'Sparky while a terrorist gets to meet his virgins.", 
        "threadID": "672198221_6430007122001", 
        "time": "2009-04-27 11:50:00", 
        "title": "So why don't they want them in their State??", 
        "userID": "Sand_Flea"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by mrmixitup: This makes no sense! I completely support closing Guantanamo having served there a year and seeing what a stupid waste of money and legal quagmire its become... HOWEVER I do not support bringing them to the states because their lawyers will immediately petition for asylum and they will get it. RETURN THEM TO THEIR OWN COUNTRIES! Except the Uigurs, of course. Sending them back to their own country is a death sentence. Be consistant. I'm still looking for the downside of this...", 
        "intTime": 20090427, 
        "postID": 35, 
        "quote": "Originally posted by L0A1: quote: Originally posted by mrmixitup: This makes no sense! I completely support closing Guantanamo having served there a year and seeing what a stupid waste of money and legal quagmire its become... HOWEVER I do not support bringing them to the states because their lawyers will immediately petition for asylum and they will get it. RETURN THEM TO THEIR OWN COUNTRIES! Except the Uigurs, of course. Sending them back to their own country is a death sentence. Be consistant.", 
        "reply": " I'm still looking for the downside of this...", 
        "threadID": "672198221_6430007122001", 
        "time": "2009-04-27 11:51:00", 
        "title": "So why don't they want them in their State??", 
        "userID": "Sand_Flea"
    }, 
    {
        "content": "quote: Originally posted by Sand_Flea: quote: Originally posted by L0A1: quote: Originally posted by mrmixitup: This makes no sense! I completely support closing Guantanamo having served there a year and seeing what a stupid waste of money and legal quagmire its become... HOWEVER I do not support bringing them to the states because their lawyers will immediately petition for asylum and they will get it. RETURN THEM TO THEIR OWN COUNTRIES! Except the Uigurs, of course. Sending them back to their own country is a death sentence. Be consistant. I'm still looking for the downside of this... It would violate rule of law apparently. Personnally, I think they should have met their fate on the battle fields. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090427, 
        "postID": 36, 
        "quote": "Originally posted by Sand_Flea: quote: Originally posted by L0A1: quote: Originally posted by mrmixitup: This makes no sense! I completely support closing Guantanamo having served there a year and seeing what a stupid waste of money and legal quagmire its become... HOWEVER I do not support bringing them to the states because their lawyers will immediately petition for asylum and they will get it. RETURN THEM TO THEIR OWN COUNTRIES! Except the Uigurs, of course. Sending them back to their own country is a death sentence. Be consistant. I'm still looking for the downside of this...", 
        "reply": " It would violate rule of law apparently. Personnally, I think they should have met their fate on the battle fields. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_6430007122001", 
        "time": "2009-04-27 12:12:00", 
        "title": "So why don't they want them in their State??", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by peter3_1: Most cannot be charged with a \"crime\" as there are no easily available witnesses against them. They COULD be charged with WAR CRIMES, and be tried before a Tribunal....no....wait.....that's what we WERE doing, but the current Admin. cancelled them.....their nations of origine either DON'T want them back or will likely TORTURE (no, the real thing, cutting them into pieces while alive, etc.)and KILL them, we can't send them back.....what to do with them, where and for how long? You mean they are being held, and no one even knows what they did? And you go on to suggest that trying them with no evidence, or I guess, \"for the hell of it,\" is what we call American Justice? And a real shame that we're not allowed to hang people for being arrested. Doesn't that defy logic? I mean, they were arrested, do we need any more evidence than that? Lousy stinking Supreme Court, bunch of evil do-gooders who actually claim that you have to use evidence to hang someone. Who's a thunk it? Of course we could simply take the liberal woose way out, and hold those whom we don't have evidence against indefinitely as POW's. On the other hand something tells me that at least against SOME of them, we DO have enough evidence to hang them - And a fair trial will indeed cause them to hang. Dave", 
        "intTime": 20090427, 
        "postID": 37, 
        "quote": "Originally posted by peter3_1: Most cannot be charged with a \"crime\" as there are no easily available witnesses against them. They COULD be charged with WAR CRIMES, and be tried before a Tribunal....no....wait.....that's what we WERE doing, but the current Admin. cancelled them.....their nations of origine either DON'T want them back or will likely TORTURE (no, the real thing, cutting them into pieces while alive, etc.)and KILL them, we can't send them back.....what to do with them, where and for how long?", 
        "reply": " You mean they are being held, and no one even knows what they did? And you go on to suggest that trying them with no evidence, or I guess, \"for the hell of it,\" is what we call American Justice? And a real shame that we're not allowed to hang people for being arrested. Doesn't that defy logic? I mean, they were arrested, do we need any more evidence than that? Lousy stinking Supreme Court, bunch of evil do-gooders who actually claim that you have to use evidence to hang someone. Who's a thunk it? Of course we could simply take the liberal woose way out, and hold those whom we don't have evidence against indefinitely as POW's. On the other hand something tells me that at least against SOME of them, we DO have enough evidence to hang them - And a fair trial will indeed cause them to hang. Dave", 
        "threadID": "672198221_6430007122001", 
        "time": "2009-04-27 12:24:00", 
        "title": "So why don't they want them in their State??", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by SeaWitch1220: Alcatraz is a revenue producing museum that belongs to the National Park Service. Hey, if you want to send the millions it would take to \"fix her up\", we could sure use the jobs and the scratch. You could always add, \"See the Terrorist Folks.\" Exhabit. LOL! Yeah, that'll work! Dave", 
        "intTime": 20090427, 
        "postID": 38, 
        "quote": "Originally posted by L0A1: quote: Originally posted by SeaWitch1220: Alcatraz is a revenue producing museum that belongs to the National Park Service. Hey, if you want to send the millions it would take to \"fix her up\", we could sure use the jobs and the scratch. You could always add, \"See the Terrorist Folks.\" Exhabit.", 
        "reply": " LOL! Yeah, that'll work! Dave", 
        "threadID": "672198221_6430007122001", 
        "time": "2009-04-27 12:25:00", 
        "title": "So why don't they want them in their State??", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: Alcatraz is a revenue producing museum that belongs to the National Park Service. Hey, if you want to send the millions it would take to \"fix her up\", we could sure use the jobs and the scratch. Let the dirtbags we send there \"fix the place up\". All they need is a roof over their head and 2 squares a day to live better then they ever had. BTW, make sure to overstock the bay with sharks, let them carry out the justice we're afraid to do.", 
        "intTime": 20090427, 
        "postID": 39, 
        "quote": "Originally posted by SeaWitch1220: Alcatraz is a revenue producing museum that belongs to the National Park Service. Hey, if you want to send the millions it would take to \"fix her up\", we could sure use the jobs and the scratch.", 
        "reply": " Let the dirtbags we send there \"fix the place up\". All they need is a roof over their head and 2 squares a day to live better then they ever had. BTW, make sure to overstock the bay with sharks, let them carry out the justice we're afraid to do.", 
        "threadID": "672198221_6430007122001", 
        "time": "2009-04-27 16:20:00", 
        "title": "So why don't they want them in their State??", 
        "userID": "Raunchy"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by peter3_1: Most cannot be charged with a \"crime\" as there are no easily available witnesses against them. They COULD be charged with WAR CRIMES, and be tried before a Tribunal....no....wait.....that's what we WERE doing, but the current Admin. cancelled them.....their nations of origine either DON'T want them back or will likely TORTURE (no, the real thing, cutting them into pieces while alive, etc.)and KILL them, we can't send them back.....what to do with them, where and for how long? You mean they are being held, and no one even knows what they did? And you go on to suggest that trying them with no evidence, or I guess, \"for the hell of it,\" is what we call American Justice? News flash, they are NOT Americans. Besides most have no concept of \"justice\". And a real shame that we're not allowed to hang people for being arrested. Doesn't that defy logic? I mean, they were arrested, do we need any more evidence than that? Were they \"arrested\" or captured on the battlefield? Maranda Rights read? \"Stop in the name of the law\" shouted at them? Lousy stinking Supreme Court, bunch of evil do-gooders who actually claim that you have to use evidence to hang someone. Who's a thunk it? Shooting at you should be all the evidence needed to eliminate them with extreme prejudice. Of course we could simply take the liberal woose way out, and hold those whom we don't have evidence against indefinitely as POW's. Better, extract all the intel possible from them, implant a tracking device (like we do with animals), send them home and wait for them to lead us to bigger fish. On the other hand something tells me that at least against SOME of them, we DO have enough evidence to hang them - And a fair trial will indeed cause them to hang. Very few \"fair\" trials (high profile trials anyway) available in American anymore what with the over abundance of out-of-work shyster lawyers available, all looking to make a name. Can you imagine the media circus that would surround such a trial? Why the WUSS democrats would all faint with a case of \"the vapors\" and the cowardly republicans would all run for cover. The only thing that would be hung is the jury. Dave", 
        "intTime": 20090427, 
        "postID": 40, 
        "quote": "Originally posted by Grachus: quote: Originally posted by peter3_1: Most cannot be charged with a \"crime\" as there are no easily available witnesses against them. They COULD be charged with WAR CRIMES, and be tried before a Tribunal....no....wait.....that's what we WERE doing, but the current Admin. cancelled them.....their nations of origine either DON'T want them back or will likely TORTURE (no, the real thing, cutting them into pieces while alive, etc.)and KILL them, we can't send them back.....what to do with them, where and for how long? You mean they are being held, and no one even knows what they did? And you go on to suggest that trying them with no evidence, or I guess, \"for the hell of it,\" is what we call American Justice? News flash, they are NOT Americans. Besides most have no concept of \"justice\". And a real shame that we're not allowed to hang people for being arrested. Doesn't that defy logic? I mean, they were arrested, do we need any more evidence than that? Were they \"arrested\" or captured on the battlefield? Maranda Rights read? \"Stop in the name of the law\" shouted at them? Lousy stinking Supreme Court, bunch of evil do-gooders who actually claim that you have to use evidence to hang someone. Who's a thunk it? Shooting at you should be all the evidence needed to eliminate them with extreme prejudice. Of course we could simply take the liberal woose way out, and hold those whom we don't have evidence against indefinitely as POW's. Better, extract all the intel possible from them, implant a tracking device (like we do with animals), send them home and wait for them to lead us to bigger fish. On the other hand something tells me that at least against SOME of them, we DO have enough evidence to hang them - And a fair trial will indeed cause them to hang. Very few \"fair\" trials (high profile trials anyway) available in American anymore what with the over abundance of out-of-work shyster lawyers available, all looking to make a name. Can you imagine the media circus that would surround such a trial? Why the WUSS democrats would all faint with a case of \"the vapors\" and the cowardly republicans would all run for cover. The only thing that would be hung is the jury. Dave", 
        "reply": "", 
        "threadID": "672198221_6430007122001", 
        "time": "2009-04-27 16:42:00", 
        "title": "So why don't they want them in their State??", 
        "userID": "Raunchy"
    }
]