[
    {
        "content": "Yikes!!!! quote: NORAD fighters respond to airspace violation NORAD news release, 6 Apr 09 ++http://www.norad.mil/News/2009/040609_a.html PETERSON AIR FORCE BASE, Colo. —Two F-16 fighters under the direction of North American Aerospace Defense Command intercepted a small Cessna aircraft near Michigan’s Upper Peninsula and the Wisconsin border today at approximately 4:43 p.m. EDT. F-16 aircraft from the Minnesota Air National Guard initially scrambled out of Duluth, Minn., were replaced by fighters from the Wisconsin Air National Guard based out of Madison, Wisc., who then handed off the pursuit to the Louisiana Air National Guard fighters from New Orleans. The civilian aircraft departed Thunder Bay, Ontario without Navigation Canada authority and was reported as stolen. It entered United States airspace from the north and was headed south over Lake Superior at approximately 4:23 p.m. EDT. After intercept, the pilot acknowledged the fighters but was unresponsive to specific non-verbal commands. U.S. Customs Border Protection aircraft intercepted the Cessna as well, but the F-16s followed the aircraft until it landed in an area 23 miles northwest of Poplar Bluff, Mo., at 9:45 p.m. EDT. The intent of military intercepts is to have the identified aircraft re-establish communications with... And the drama ends relatively peacefully... quote: Rogue pilot ends flight on Missouri highway JOSH WINGROVE Globe and Mail update April 7, 2009 at 4:32 AM EDT ++http://www.theglobeandmail.com/servlet/story/RTGAM.20090406.wstolen0406/BNStory/National/?cid=al_gam_nletter_newsUp The pilot of a stolen Canadian trainer plane ignored the warnings of U.S. fighter jets to land before finally putting down on a southern Missouri highway Monday night, after the plane was stolen from a Northern Ontario college and taken on a rogue flight into U.S. airspace. The pilot, identified by police as 31-year-old Adam Dylan Leon, eventually landed the plane on a rural road, reportedly tried to hide it under a bridge, and hitched a ride to a nearby grocer. Inside, he bought a bottle of Gatorade and waited for 30 minutes before being arrested. \"The plane was put down, the suspect fled the aircraft on foot, and local authorities subsequently picked him up,\" said RCMP superintendent Tim Cogan. (...) \"He had access [to the hangar, so obviously there's some connection, but I'm not sure what that connection is,\" Supt. Cogan said, adding the man was a Canadian citizen. CNN reported a suicide note was found near the hangar. The pilot got in a Cessna 172 single-engine plane with full fuel tanks, and took off. (...) \"He did land on his own accord, and he's currently under the jurisdiction of local authorities,\" North American Aerospace Defense Command Master Sergeant Claudette Hutchinson said. After landing the plane around 9:45 ET, the suspect fled into the woods, Missouri State Highway Patrol Sergeant Marty Elmore said. According to staff at nearby grocery store and restaurant, he hitched a ride with another person before entering Simmons Grocery & Hardware, near Ellsinore. He used the facilities and bought a drink. \"He sat in here in the store with us for like 30 minutes. He heard us talking about people looking for a man who was running from the law,\" said Teresa Davidson, 41, a cashier at the place. Mr. Leon tried to buy beef jerky and a lemon-lime Gatorade, but only had enough for the drink, she said. \"He did seem a little nervous, but he didn't act strange or nothing,\" Ms. Davidson told The Globe and Mail. Then, around 10:20 ET, \"Oh man there was just cops everywhere, they just came in and got him.\" He went peacefully, she said. Staff identified him as an outsider when he asked to use a \"washroom\" instead of a \"bathroom.\" (...) This message has been edited. Last edited by: Canuck_Centaur, Tue 07 April 2009 12:05 PM",
        "intTime": 20090407,
        "postID": 1,
        "quote": "NORAD fighters respond to airspace violation NORAD news release, 6 Apr 09 ++http://www.norad.mil/News/2009/040609_a.html PETERSON AIR FORCE BASE, Colo. —Two F-16 fighters under the direction of North American Aerospace Defense Command intercepted a small Cessna aircraft near Michigan’s Upper Peninsula and the Wisconsin border today at approximately 4:43 p.m. EDT. F-16 aircraft from the Minnesota Air National Guard initially scrambled out of Duluth, Minn., were replaced by fighters from the Wisconsin Air National Guard based out of Madison, Wisc., who then handed off the pursuit to the Louisiana Air National Guard fighters from New Orleans. The civilian aircraft departed Thunder Bay, Ontario without Navigation Canada authority and was reported as stolen. It entered United States airspace from the north and was headed south over Lake Superior at approximately 4:23 p.m. EDT. After intercept, the pilot acknowledged the fighters but was unresponsive to specific non-verbal commands. U.S. Customs Border Protection aircraft intercepted the Cessna as well, but the F-16s followed the aircraft until it landed in an area 23 miles northwest of Poplar Bluff, Mo., at 9:45 p.m. EDT. The intent of military intercepts is to have the identified aircraft re-establish communications with...",
        "reply": "Yikes!!!!  And the drama ends relatively peacefully... quote: Rogue pilot ends flight on Missouri highway JOSH WINGROVE Globe and Mail update April 7, 2009 at 4:32 AM EDT ++http://www.theglobeandmail.com/servlet/story/RTGAM.20090406.wstolen0406/BNStory/National/?cid=al_gam_nletter_newsUp The pilot of a stolen Canadian trainer plane ignored the warnings of U.S. fighter jets to land before finally putting down on a southern Missouri highway Monday night, after the plane was stolen from a Northern Ontario college and taken on a rogue flight into U.S. airspace. The pilot, identified by police as 31-year-old Adam Dylan Leon, eventually landed the plane on a rural road, reportedly tried to hide it under a bridge, and hitched a ride to a nearby grocer. Inside, he bought a bottle of Gatorade and waited for 30 minutes before being arrested. \"The plane was put down, the suspect fled the aircraft on foot, and local authorities subsequently picked him up,\" said RCMP superintendent Tim Cogan. (...) \"He had access [to the hangar, so obviously there's some connection, but I'm not sure what that connection is,\" Supt. Cogan said, adding the man was a Canadian citizen. CNN reported a suicide note was found near the hangar. The pilot got in a Cessna 172 single-engine plane with full fuel tanks, and took off. (...) \"He did land on his own accord, and he's currently under the jurisdiction of local authorities,\" North American Aerospace Defense Command Master Sergeant Claudette Hutchinson said. After landing the plane around 9:45 ET, the suspect fled into the woods, Missouri State Highway Patrol Sergeant Marty Elmore said. According to staff at nearby grocery store and restaurant, he hitched a ride with another person before entering Simmons Grocery & Hardware, near Ellsinore. He used the facilities and bought a drink. \"He sat in here in the store with us for like 30 minutes. He heard us talking about people looking for a man who was running from the law,\" said Teresa Davidson, 41, a cashier at the place. Mr. Leon tried to buy beef jerky and a lemon-lime Gatorade, but only had enough for the drink, she said. \"He did seem a little nervous, but he didn't act strange or nothing,\" Ms. Davidson told The Globe and Mail. Then, around 10:20 ET, \"Oh man there was just cops everywhere, they just came in and got him.\" He went peacefully, she said. Staff identified him as an outsider when he asked to use a \"washroom\" instead of a \"bathroom.\" (...) This message has been edited. Last edited by: Canuck_Centaur, Tue 07 April 2009 12:05 PM",
        "threadID": "672198221_9380050022001",
        "time": "2009-04-07 08:26:00",
        "title": "ANG F16s chase light plane piloted by suicidal man&stolen from Canadian flight school",
        "userID": "Canuck_Centaur"
    },
    {
        "content": "Those wacky Canadians!",
        "intTime": 20090407,
        "postID": 2,
        "quote": "",
        "reply": "Those wacky Canadians!",
        "threadID": "672198221_9380050022001",
        "time": "2009-04-07 08:28:00",
        "title": "ANG F16s chase light plane piloted by suicidal man&stolen from Canadian flight school",
        "userID": "mrmixitup"
    },
    {
        "content": "I read an article stating the man had wanted to be shot down by the F-16s... can't remember where I read it though. Funny thing is though, this guy steals a plane, flies it into US airspace, gets chased by F-16s, ignores their communications, then not only lands it- but runs and hides from police? Seems a bit odd for a suicidal man, but maybe after six hours of flying he had a change of heart... still a little bit elaborate for a suicide plot though.",
        "intTime": 20090407,
        "postID": 3,
        "quote": "",
        "reply": "I read an article stating the man had wanted to be shot down by the F-16s... can't remember where I read it though. Funny thing is though, this guy steals a plane, flies it into US airspace, gets chased by F-16s, ignores their communications, then not only lands it- but runs and hides from police? Seems a bit odd for a suicidal man, but maybe after six hours of flying he had a change of heart... still a little bit elaborate for a suicide plot though.",
        "threadID": "672198221_9380050022001",
        "time": "2009-04-07 11:51:00",
        "title": "ANG F16s chase light plane piloted by suicidal man&stolen from Canadian flight school",
        "userID": "AF3C0X1"
    },
    {
        "content": "quote: Originally posted by AF3C0X1: I read an article stating the man had wanted to be shot down by the F-16s... can't remember where I read it though. Funny thing is though, this guy steals a plane, flies it into US airspace, gets chased by F-16s, ignores their communications, then not only lands it- but runs and hides from police? Seems a bit odd for a suicidal man, but maybe after six hours of flying he had a change of heart... still a little bit elaborate for a suicide plot though. or as one suggested in another thread on this topic..... could have been a \"dry run\". something to think about. One Flag......One Heart......One Nation............EVERMORE",
        "intTime": 20090407,
        "postID": 4,
        "quote": "Originally posted by AF3C0X1: I read an article stating the man had wanted to be shot down by the F-16s... can't remember where I read it though. Funny thing is though, this guy steals a plane, flies it into US airspace, gets chased by F-16s, ignores their communications, then not only lands it- but runs and hides from police? Seems a bit odd for a suicidal man, but maybe after six hours of flying he had a change of heart... still a little bit elaborate for a suicide plot though.",
        "reply": " or as one suggested in another thread on this topic..... could have been a \"dry run\". something to think about. One Flag......One Heart......One Nation............EVERMORE",
        "threadID": "672198221_9380050022001",
        "time": "2009-04-07 11:53:00",
        "title": "ANG F16s chase light plane piloted by suicidal man&stolen from Canadian flight school",
        "userID": "m551sheridan"
    },
    {
        "content": "quote: Originally posted by AF3C0X1: I read an article stating the man had wanted to be shot down by the F-16s... can't remember where I read it though. Funny thing is though, this guy steals a plane, flies it into US airspace, gets chased by F-16s, ignores their communications, then not only lands it- but runs and hides from police? Seems a bit odd for a suicidal man Well he did leave a suicide note, which I bolded on the second article after I editing it so that it was more evident.",
        "intTime": 20090407,
        "postID": 5,
        "quote": "Originally posted by AF3C0X1: I read an article stating the man had wanted to be shot down by the F-16s... can't remember where I read it though. Funny thing is though, this guy steals a plane, flies it into US airspace, gets chased by F-16s, ignores their communications, then not only lands it- but runs and hides from police? Seems a bit odd for a suicidal man",
        "reply": " Well he did leave a suicide note, which I bolded on the second article after I editing it so that it was more evident.",
        "threadID": "672198221_9380050022001",
        "time": "2009-04-07 12:07:00",
        "title": "ANG F16s chase light plane piloted by suicidal man&stolen from Canadian flight school",
        "userID": "Canuck_Centaur"
    },
    {
        "content": "quote: Originally posted by mrmixitup: Those wacky Canadians! He is actually Turkish",
        "intTime": 20090407,
        "postID": 6,
        "quote": "Originally posted by mrmixitup: Those wacky Canadians!",
        "reply": " He is actually Turkish",
        "threadID": "672198221_9380050022001",
        "time": "2009-04-07 13:27:00",
        "title": "ANG F16s chase light plane piloted by suicidal man&stolen from Canadian flight school",
        "userID": "tsgtpetrey"
    },
    {
        "content": "quote: Originally posted by tsgtpetrey: quote: Originally posted by mrmixitup: Those wacky Canadians! He is actually Turkish Correction. Turkish-Canadian, since this Leon guy is a naturalized Canadian citizen, which you can confirm by looking at the full article at the link of the 2nd article.",
        "intTime": 20090407,
        "postID": 7,
        "quote": "Originally posted by tsgtpetrey: quote: Originally posted by mrmixitup: Those wacky Canadians! He is actually Turkish",
        "reply": " Correction. Turkish-Canadian, since this Leon guy is a naturalized Canadian citizen, which you can confirm by looking at the full article at the link of the 2nd article.",
        "threadID": "672198221_9380050022001",
        "time": "2009-04-07 21:27:00",
        "title": "ANG F16s chase light plane piloted by suicidal man&stolen from Canadian flight school",
        "userID": "Canuck_Centaur"
    },
    {
        "content": "quote: Originally posted by Canuck_Centaur: quote: Originally posted by AF3C0X1: I read an article stating the man had wanted to be shot down by the F-16s... can't remember where I read it though. Funny thing is though, this guy steals a plane, flies it into US airspace, gets chased by F-16s, ignores their communications, then not only lands it- but runs and hides from police? Seems a bit odd for a suicidal man Well he did leave a suicide note, which I bolded on the second article after I editing it so that it was more evident. And had several opportunities to do so, but didn't... which is what seems weird.",
        "intTime": 20090408,
        "postID": 8,
        "quote": "Originally posted by Canuck_Centaur: quote: Originally posted by AF3C0X1: I read an article stating the man had wanted to be shot down by the F-16s... can't remember where I read it though. Funny thing is though, this guy steals a plane, flies it into US airspace, gets chased by F-16s, ignores their communications, then not only lands it- but runs and hides from police? Seems a bit odd for a suicidal man Well he did leave a suicide note, which I bolded on the second article after I editing it so that it was more evident.",
        "reply": " And had several opportunities to do so, but didn't... which is what seems weird.",
        "threadID": "672198221_9380050022001",
        "time": "2009-04-08 10:18:00",
        "title": "ANG F16s chase light plane piloted by suicidal man&stolen from Canadian flight school",
        "userID": "AF3C0X1"
    },
    {
        "content": "He could have got his wish if he knew where our bases were.",
        "intTime": 20090408,
        "postID": 9,
        "quote": "",
        "reply": "He could have got his wish if he knew where our bases were.",
        "threadID": "672198221_9380050022001",
        "time": "2009-04-08 10:33:00",
        "title": "ANG F16s chase light plane piloted by suicidal man&stolen from Canadian flight school",
        "userID": "world_king377"
    },
    {
        "content": "I dont care who he was, they should of taken him out as soon as they had him in their sights! I find it odd that they allowed this plane to cross several states. How did the F-16 pilots or DHS know if he wasnt carrying anything on board with him like Chem/Bio? This guy wasnt worth one life if he would have crashed into someone or a building or a house. The F-16s didnt need to use a missle either. They could of used their after burners and caused him to crash. Now everyone in the world knows that we will allow a stolen plane to cross over our airspace with impunity.",
        "intTime": 20090408,
        "postID": 10,
        "quote": "",
        "reply": "I dont care who he was, they should of taken him out as soon as they had him in their sights! I find it odd that they allowed this plane to cross several states. How did the F-16 pilots or DHS know if he wasnt carrying anything on board with him like Chem/Bio? This guy wasnt worth one life if he would have crashed into someone or a building or a house. The F-16s didnt need to use a missle either. They could of used their after burners and caused him to crash. Now everyone in the world knows that we will allow a stolen plane to cross over our airspace with impunity.",
        "threadID": "672198221_9380050022001",
        "time": "2009-04-08 12:46:00",
        "title": "ANG F16s chase light plane piloted by suicidal man&stolen from Canadian flight school",
        "userID": "TheGoodOne"
    },
    {
        "content": "quote: Originally posted by TheGoodOne: I dont care who he was, they should of taken him out as soon as they had him in their sights! I find it odd that they allowed this plane to cross several states. How did the F-16 pilots or DHS know if he wasnt carrying anything on board with him like Chem/Bio? This guy wasnt worth one life if he would have crashed into someone or a building or a house. The F-16s didnt need to use a missle either. They could of used their after burners and caused him to crash. Now everyone in the world knows that we will allow a stolen plane to cross over our airspace with impunity. Of course, now he can be questioned and interogated. Which would be very difficult to do following you scenario... I suspect they were prepared to take him out in a heartbeat if they thought it necessary. Dave",
        "intTime": 20090408,
        "postID": 11,
        "quote": "Originally posted by TheGoodOne: I dont care who he was, they should of taken him out as soon as they had him in their sights! I find it odd that they allowed this plane to cross several states. How did the F-16 pilots or DHS know if he wasnt carrying anything on board with him like Chem/Bio? This guy wasnt worth one life if he would have crashed into someone or a building or a house. The F-16s didnt need to use a missle either. They could of used their after burners and caused him to crash. Now everyone in the world knows that we will allow a stolen plane to cross over our airspace with impunity.",
        "reply": " Of course, now he can be questioned and interogated. Which would be very difficult to do following you scenario... I suspect they were prepared to take him out in a heartbeat if they thought it necessary. Dave",
        "threadID": "672198221_9380050022001",
        "time": "2009-04-08 12:50:00",
        "title": "ANG F16s chase light plane piloted by suicidal man&stolen from Canadian flight school",
        "userID": "Grachus"
    },
    {
        "content": "quote: Originally posted by TheGoodOne: Now everyone in the world knows that we will allow a stolen plane to cross over our airspace with impunity. Not quite 9/11-level damage if you ask me: ++http://en.wikipedia.org/wiki/2002_Tampa_plane_crash",
        "intTime": 20090408,
        "postID": 12,
        "quote": "Originally posted by TheGoodOne: Now everyone in the world knows that we will allow a stolen plane to cross over our airspace with impunity.",
        "reply": " Not quite 9/11-level damage if you ask me: ++http://en.wikipedia.org/wiki/2002_Tampa_plane_crash",
        "threadID": "672198221_9380050022001",
        "time": "2009-04-08 14:08:00",
        "title": "ANG F16s chase light plane piloted by suicidal man&stolen from Canadian flight school",
        "userID": "mrmixitup"
    },
    {
        "content": "quote: Originally posted by TheGoodOne: I dont care who he was, they should of taken him out as soon as they had him in their sights! I find it odd that they allowed this plane to cross several states. How did the F-16 pilots or DHS know if he wasnt carrying anything on board with him like Chem/Bio? This guy wasnt worth one life if he would have crashed into someone or a building or a house. The F-16s didnt need to use a missle either. They could of used their after burners and caused him to crash. Now everyone in the world knows that we will allow a stolen plane to cross over our airspace with impunity. BS if he had headed towards any targets (town, city, important site, etc.)they would have forced/shot him down but as long as he did not go towards a target shooting him down would probably cause as much damage as him deliberately crashing. By intercepting him right away it shows the world that they can NOT fly in US airspace and hit a target. This message has been edited. Last edited by: rayld2, Thu 09 April 2009 07:16 AM",
        "intTime": 20090409,
        "postID": 13,
        "quote": "Originally posted by TheGoodOne: I dont care who he was, they should of taken him out as soon as they had him in their sights! I find it odd that they allowed this plane to cross several states. How did the F-16 pilots or DHS know if he wasnt carrying anything on board with him like Chem/Bio? This guy wasnt worth one life if he would have crashed into someone or a building or a house. The F-16s didnt need to use a missle either. They could of used their after burners and caused him to crash. Now everyone in the world knows that we will allow a stolen plane to cross over our airspace with impunity.",
        "reply": " BS if he had headed towards any targets (town, city, important site, etc.)they would have forced/shot him down but as long as he did not go towards a target shooting him down would probably cause as much damage as him deliberately crashing. By intercepting him right away it shows the world that they can NOT fly in US airspace and hit a target. This message has been edited. Last edited by: rayld2, Thu 09 April 2009 07:16 AM",
        "threadID": "672198221_9380050022001",
        "time": "2009-04-09 06:07:00",
        "title": "ANG F16s chase light plane piloted by suicidal man&stolen from Canadian flight school",
        "userID": "rayld2"
    },
    {
        "content": "BUMPED for Phoenix.",
        "intTime": 20090413,
        "postID": 14,
        "quote": "",
        "reply": "BUMPED for Phoenix.",
        "threadID": "672198221_9380050022001",
        "time": "2009-04-13 09:24:00",
        "title": "ANG F16s chase light plane piloted by suicidal man&stolen from Canadian flight school",
        "userID": "Canuck_Centaur"
    },
    {
        "content": "quote: Originally posted by Canuck_Centaur: BUMPED for Phoenix. What? Why'd you bump this. The idiot is in jail and the plane was recovered.",
        "intTime": 20090413,
        "postID": 15,
        "quote": "Originally posted by Canuck_Centaur: BUMPED for Phoenix.",
        "reply": " What? Why'd you bump this. The idiot is in jail and the plane was recovered.",
        "threadID": "672198221_9380050022001",
        "time": "2009-04-13 09:29:00",
        "title": "ANG F16s chase light plane piloted by suicidal man&stolen from Canadian flight school",
        "userID": "mrmixitup"
    }
]