[
    {
        "content": "quote: RAMALLAH, West Bank (AP) — Hamas directed gunmen to eliminate political opponents and suspected collaborators under the cover of Israel's military offensive in Gaza, killing 32 people and wounding dozens in such attacks since December, an international human rights group said Monday. The New York-based Human Rights Watch urged Gaza's Hamas rulers to halt what it described as a pattern of arbitrary arrests, torture and summary executions by the Islamic militant group. Human Rights Watch portrayed the attacks as the worst outbreak of internal violence since Hamas violently seized control of Gaza in June 2007 and expelled rivals in the more moderate Fatah movement of Palestinian President Mahmoud Abbas, who now controls only the West Bank. Such practices are aimed, in part, at quashing dissent in Gaza and make a mockery of Hamas' claim it upholds the law, the group said. During the war, \"Hamas authorities ... took extraordinary steps to control, intimidate, punish and at times eliminate their internal political rivals as well as persons suspected of collaborating with Israel,\" the report said. (....) +http://www.google.com/hostednews/ap/article/ALeqM5iTyo8mV2mx7RYxp7nCnaponz765QD97M7UVO0 \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090420, 
        "postID": 1, 
        "quote": "RAMALLAH, West Bank (AP) — Hamas directed gunmen to eliminate political opponents and suspected collaborators under the cover of Israel's military offensive in Gaza, killing 32 people and wounding dozens in such attacks since December, an international human rights group said Monday. The New York-based Human Rights Watch urged Gaza's Hamas rulers to halt what it described as a pattern of arbitrary arrests, torture and summary executions by the Islamic militant group. Human Rights Watch portrayed the attacks as the worst outbreak of internal violence since Hamas violently seized control of Gaza in June 2007 and expelled rivals in the more moderate Fatah movement of Palestinian President Mahmoud Abbas, who now controls only the West Bank. Such practices are aimed, in part, at quashing dissent in Gaza and make a mockery of Hamas' claim it upholds the law, the group said. During the war, \"Hamas authorities ... took extraordinary steps to control, intimidate, punish and at times eliminate their internal political rivals as well as persons suspected of collaborating with Israel,\" the report said. (....)", 
        "reply": " +http://www.google.com/hostednews/ap/article/ALeqM5iTyo8mV2mx7RYxp7nCnaponz765QD97M7UVO0 \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_1520072122001", 
        "time": "2009-04-20 09:27:00", 
        "title": "Report: Hamas killed, maimed dozens of opponents", 
        "userID": "NSNN"
    }, 
    {
        "content": "at least they dont waterboard", 
        "intTime": 20090420, 
        "postID": 2, 
        "quote": "", 
        "reply": "at least they dont waterboard", 
        "threadID": "672198221_1520072122001", 
        "time": "2009-04-20 09:38:00", 
        "title": "Report: Hamas killed, maimed dozens of opponents", 
        "userID": "corporalJT"
    }, 
    {
        "content": "They seemed to think somebody was helping the Israelis target HAMAS installations and personnel. Then there was the on-going problem of somebody continuing to fire rockets into Israel - as much a difficulty for HAMAS to stop as it is for the Israelis. The retribution was brutal.", 
        "intTime": 20090421, 
        "postID": 3, 
        "quote": "", 
        "reply": "They seemed to think somebody was helping the Israelis target HAMAS installations and personnel. Then there was the on-going problem of somebody continuing to fire rockets into Israel - as much a difficulty for HAMAS to stop as it is for the Israelis. The retribution was brutal.", 
        "threadID": "672198221_1520072122001", 
        "time": "2009-04-21 08:03:00", 
        "title": "Report: Hamas killed, maimed dozens of opponents", 
        "userID": "popsiq"
    }, 
    {
        "content": "quote: Originally posted by popsiq: They seemed to think somebody was helping the Israelis target HAMAS installations and personnel. Then there was the on-going problem of somebody continuing to fire rockets into Israel - as much a difficulty for HAMAS to stop as it is for the Israelis. The retribution was brutal. You do realise that to a group like Hamas, to quote a recent American Statesmen, \"If you're not with us, you're against us.\" I suspect that Hamas is ready to blow away those who disagree with them, using any cover at all. Dave", 
        "intTime": 20090421, 
        "postID": 4, 
        "quote": "Originally posted by popsiq: They seemed to think somebody was helping the Israelis target HAMAS installations and personnel. Then there was the on-going problem of somebody continuing to fire rockets into Israel - as much a difficulty for HAMAS to stop as it is for the Israelis. The retribution was brutal.", 
        "reply": " You do realise that to a group like Hamas, to quote a recent American Statesmen, \"If you're not with us, you're against us.\" I suspect that Hamas is ready to blow away those who disagree with them, using any cover at all. Dave", 
        "threadID": "672198221_1520072122001", 
        "time": "2009-04-21 08:17:00", 
        "title": "Report: Hamas killed, maimed dozens of opponents", 
        "userID": "Grachus"
    }, 
    {
        "content": "Good thing they got 900mil to work with.", 
        "intTime": 20090421, 
        "postID": 5, 
        "quote": "", 
        "reply": "Good thing they got 900mil to work with.", 
        "threadID": "672198221_1520072122001", 
        "time": "2009-04-21 21:25:00", 
        "title": "Report: Hamas killed, maimed dozens of opponents", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by popsiq: They seemed to think somebody was helping the Israelis target HAMAS installations and personnel. Then there was the on-going problem of somebody continuing to fire rockets into Israel - as much a difficulty for HAMAS to stop as it is for the Israelis. The retribution was brutal. You do realise that to a group like Hamas, to quote a recent American Statesmen, \"If you're not with us, you're against us.\" I suspect that Hamas is ready to blow away those who disagree with them, using any cover at all. Dave They seemed all set to cooperate with FATAH in getting a decent peace settlement until the Israelis arrested every one they could lay hand on, and the US equipped Fatah to try a 'mano a mano' in the Gaza. After they took those FATAH weapons you folk sent, the situation deteriorated. As it stands now FATAH wants their toys back, but they're afraid to hold the election that scheduled for fear the Palestinians dump them in the West Bank too. HAMAS continues to bear up under the same kind of 'punishment' the world gave the Sinn Feiners. On that note, the same kind of retribution was meted out to 'turncoats and informers' in other places at other times, including America. Hamas seems to have a large number of non-Fatah Palestinans behind them, possibly the disillusioned majority.", 
        "intTime": 20090422, 
        "postID": 6, 
        "quote": "Originally posted by Grachus: quote: Originally posted by popsiq: They seemed to think somebody was helping the Israelis target HAMAS installations and personnel. Then there was the on-going problem of somebody continuing to fire rockets into Israel - as much a difficulty for HAMAS to stop as it is for the Israelis. The retribution was brutal. You do realise that to a group like Hamas, to quote a recent American Statesmen, \"If you're not with us, you're against us.\" I suspect that Hamas is ready to blow away those who disagree with them, using any cover at all. Dave", 
        "reply": " They seemed all set to cooperate with FATAH in getting a decent peace settlement until the Israelis arrested every one they could lay hand on, and the US equipped Fatah to try a 'mano a mano' in the Gaza. After they took those FATAH weapons you folk sent, the situation deteriorated. As it stands now FATAH wants their toys back, but they're afraid to hold the election that scheduled for fear the Palestinians dump them in the West Bank too. HAMAS continues to bear up under the same kind of 'punishment' the world gave the Sinn Feiners. On that note, the same kind of retribution was meted out to 'turncoats and informers' in other places at other times, including America. Hamas seems to have a large number of non-Fatah Palestinans behind them, possibly the disillusioned majority.", 
        "threadID": "672198221_1520072122001", 
        "time": "2009-04-22 07:53:00", 
        "title": "Report: Hamas killed, maimed dozens of opponents", 
        "userID": "popsiq"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: Good thing they got 900mil to work with. Dropping another turd? \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090422, 
        "postID": 7, 
        "quote": "Originally posted by GunnyRet03: Good thing they got 900mil to work with.", 
        "reply": " Dropping another turd? \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_1520072122001", 
        "time": "2009-04-22 08:29:00", 
        "title": "Report: Hamas killed, maimed dozens of opponents", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: Good thing they got 900mil to work with. yup thanks obama for his super support of a terrorist org... so far obama has given more money to hamas and the pals then any other potus...", 
        "intTime": 20090422, 
        "postID": 8, 
        "quote": "Originally posted by GunnyRet03: Good thing they got 900mil to work with.", 
        "reply": " yup thanks obama for his super support of a terrorist org... so far obama has given more money to hamas and the pals then any other potus...", 
        "threadID": "672198221_1520072122001", 
        "time": "2009-04-22 08:47:00", 
        "title": "Report: Hamas killed, maimed dozens of opponents", 
        "userID": "outlaws93"
    }
]