[
    {
        "content": "Supreme Court Justice Souter To Retire Centrist Justice Will Remain In Place Until A Successor Is Appointed (CBS) Supreme Court Justice David Souter is planning retire at the end of the current court term. Souter, 69, has informed the White House of his decision and plans to return to his native New Hampshire according to NPR. Full report at >>>http://www.cbsnews.com/stories/2009/04/30/national/main4981868.shtml?tag=topStories;secondStory", 
        "intTime": 20090430, 
        "postID": 1, 
        "quote": "", 
        "reply": "Supreme Court Justice Souter To Retire Centrist Justice Will Remain In Place Until A Successor Is Appointed (CBS) Supreme Court Justice David Souter is planning retire at the end of the current court term. Souter, 69, has informed the White House of his decision and plans to return to his native New Hampshire according to NPR. Full report at >>>http://www.cbsnews.com/stories/2009/04/30/national/main4981868.shtml?tag=topStories;secondStory", 
        "threadID": "672198221_5120022222001", 
        "time": "2009-04-30 21:55:00", 
        "title": "BREAKING NEWS: Supreme Court Justice Souter To Retire", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "great.....just what I want to hear about all summer long", 
        "intTime": 20090430, 
        "postID": 2, 
        "quote": "", 
        "reply": "great.....just what I want to hear about all summer long", 
        "threadID": "672198221_5120022222001", 
        "time": "2009-04-30 22:03:00", 
        "title": "BREAKING NEWS: Supreme Court Justice Souter To Retire", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "I'll bet that President Obama appoints a female to fill this all important seat.", 
        "intTime": 20090501, 
        "postID": 3, 
        "quote": "", 
        "reply": "I'll bet that President Obama appoints a female to fill this all important seat.", 
        "threadID": "672198221_5120022222001", 
        "time": "2009-05-01 08:45:00", 
        "title": "BREAKING NEWS: Supreme Court Justice Souter To Retire", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "Conservatives are already gearing up for a fight on this one - let's see if their famous \"up or down vote\" mantra holds true or if they try to delay and obsfucate now that Obama is nominating the justices instead of Bush.", 
        "intTime": 20090501, 
        "postID": 4, 
        "quote": "", 
        "reply": "Conservatives are already gearing up for a fight on this one - let's see if their famous \"up or down vote\" mantra holds true or if they try to delay and obsfucate now that Obama is nominating the justices instead of Bush.", 
        "threadID": "672198221_5120022222001", 
        "time": "2009-05-01 11:56:00", 
        "title": "BREAKING NEWS: Supreme Court Justice Souter To Retire", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: Conservatives are already gearing up for a fight on this one - let's see if their famous \"up or down vote\" mantra holds true or if they try to delay and obsfucate now that Obama is nominating the justices instead of Bush. Specter kind of screwed the Dems there. He was the common yes vote by the republican party needed to confirm someone, now that he is a Dem, they may not have it quite as easy putting a left wing Judge in. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090501, 
        "postID": 5, 
        "quote": "Originally posted by PhoenixDark: Conservatives are already gearing up for a fight on this one - let's see if their famous \"up or down vote\" mantra holds true or if they try to delay and obsfucate now that Obama is nominating the justices instead of Bush.", 
        "reply": " Specter kind of screwed the Dems there. He was the common yes vote by the republican party needed to confirm someone, now that he is a Dem, they may not have it quite as easy putting a left wing Judge in. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_5120022222001", 
        "time": "2009-05-01 12:05:00", 
        "title": "BREAKING NEWS: Supreme Court Justice Souter To Retire", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by PhoenixDark: Conservatives are already gearing up for a fight on this one - let's see if their famous \"up or down vote\" mantra holds true or if they try to delay and obsfucate now that Obama is nominating the justices instead of Bush. Specter kind of screwed the Dems there. He was the common yes vote by the republican party needed to confirm someone, now that he is a Dem, they may not have it quite as easy putting a left wing Judge in. Very funny considering that the Dems control 59 of the 99 seats currently occupied in the Senate. No amount of wishful thinking is going to get a conservative judge in the Supreme Court upon Souter's retirement.", 
        "intTime": 20090501, 
        "postID": 6, 
        "quote": "Originally posted by L0A1: quote: Originally posted by PhoenixDark: Conservatives are already gearing up for a fight on this one - let's see if their famous \"up or down vote\" mantra holds true or if they try to delay and obsfucate now that Obama is nominating the justices instead of Bush. Specter kind of screwed the Dems there. He was the common yes vote by the republican party needed to confirm someone, now that he is a Dem, they may not have it quite as easy putting a left wing Judge in.", 
        "reply": " Very funny considering that the Dems control 59 of the 99 seats currently occupied in the Senate. No amount of wishful thinking is going to get a conservative judge in the Supreme Court upon Souter's retirement.", 
        "threadID": "672198221_5120022222001", 
        "time": "2009-05-01 12:32:00", 
        "title": "BREAKING NEWS: Supreme Court Justice Souter To Retire", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: quote: Originally posted by L0A1: quote: Originally posted by PhoenixDark: Conservatives are already gearing up for a fight on this one - let's see if their famous \"up or down vote\" mantra holds true or if they try to delay and obsfucate now that Obama is nominating the justices instead of Bush. Specter kind of screwed the Dems there. He was the common yes vote by the republican party needed to confirm someone, now that he is a Dem, they may not have it quite as easy putting a left wing Judge in. Very funny considering that the Dems control 59 of the 99 seats currently occupied in the Senate. No amount of wishful thinking is going to get a conservative judge in the Supreme Court upon Souter's retirement. I am talking aboyut the Judicial (sp) Committee They confirm US SC Justices dont they? As far as your comment about a conservative as judge. I do not want ANY right wing or left wing judges. I am tired or partisan politics. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090501, 
        "postID": 7, 
        "quote": "Originally posted by PhoenixDark: quote: Originally posted by L0A1: quote: Originally posted by PhoenixDark: Conservatives are already gearing up for a fight on this one - let's see if their famous \"up or down vote\" mantra holds true or if they try to delay and obsfucate now that Obama is nominating the justices instead of Bush. Specter kind of screwed the Dems there. He was the common yes vote by the republican party needed to confirm someone, now that he is a Dem, they may not have it quite as easy putting a left wing Judge in. Very funny considering that the Dems control 59 of the 99 seats currently occupied in the Senate. No amount of wishful thinking is going to get a conservative judge in the Supreme Court upon Souter's retirement.", 
        "reply": " I am talking aboyut the Judicial (sp) Committee They confirm US SC Justices dont they? As far as your comment about a conservative as judge. I do not want ANY right wing or left wing judges. I am tired or partisan politics. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_5120022222001", 
        "time": "2009-05-01 13:09:00", 
        "title": "BREAKING NEWS: Supreme Court Justice Souter To Retire", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by PhoenixDark: quote: Originally posted by L0A1: quote: Originally posted by PhoenixDark: Conservatives are already gearing up for a fight on this one - let's see if their famous \"up or down vote\" mantra holds true or if they try to delay and obsfucate now that Obama is nominating the justices instead of Bush. Specter kind of screwed the Dems there. He was the common yes vote by the republican party needed to confirm someone, now that he is a Dem, they may not have it quite as easy putting a left wing Judge in. Very funny considering that the Dems control 59 of the 99 seats currently occupied in the Senate. No amount of wishful thinking is going to get a conservative judge in the Supreme Court upon Souter's retirement. I am talking aboyut the Judicial (sp) Committee They confirm US SC Justices dont they? As far as your comment about a conservative as judge. I do not want ANY right wing or left wing judges. I am tired or partisan politics. I agree -- a split Court that when a case is put before it we are not sure which way it will go is the best court we can have -- Savage", 
        "intTime": 20090501, 
        "postID": 8, 
        "quote": "Originally posted by L0A1: quote: Originally posted by PhoenixDark: quote: Originally posted by L0A1: quote: Originally posted by PhoenixDark: Conservatives are already gearing up for a fight on this one - let's see if their famous \"up or down vote\" mantra holds true or if they try to delay and obsfucate now that Obama is nominating the justices instead of Bush. Specter kind of screwed the Dems there. He was the common yes vote by the republican party needed to confirm someone, now that he is a Dem, they may not have it quite as easy putting a left wing Judge in. Very funny considering that the Dems control 59 of the 99 seats currently occupied in the Senate. No amount of wishful thinking is going to get a conservative judge in the Supreme Court upon Souter's retirement. I am talking aboyut the Judicial (sp) Committee They confirm US SC Justices dont they? As far as your comment about a conservative as judge. I do not want ANY right wing or left wing judges. I am tired or partisan politics.", 
        "reply": " I agree -- a split Court that when a case is put before it we are not sure which way it will go is the best court we can have -- Savage", 
        "threadID": "672198221_5120022222001", 
        "time": "2009-05-01 13:39:00", 
        "title": "BREAKING NEWS: Supreme Court Justice Souter To Retire", 
        "userID": "A_Savage"
    }
]