[
    {
        "content": "Fox news reports North Korea has just launched missile! \"http://www.foxnews.com/ Breaking News \"http://www.cnn.com/", 
        "intTime": 20090404, 
        "postID": 1, 
        "quote": "", 
        "reply": "Fox news reports North Korea has just launched missile! \"http://www.foxnews.com/ Breaking News \"http://www.cnn.com/", 
        "threadID": "672198221_7370058912001", 
        "time": "2009-04-04 19:51:00", 
        "title": "North Korea launches missile", 
        "userID": "EAG154"
    }, 
    {
        "content": "quote: Originally posted by EAG154: Fox news reports North Korea has just launched missile! \"http://www.foxnews.com/ Can you tell me if it's headed to NYC? Make your response VERY rapid, so I have time to get to the basement... Dave", 
        "intTime": 20090404, 
        "postID": 2, 
        "quote": "Originally posted by EAG154: Fox news reports North Korea has just launched missile! \"http://www.foxnews.com/", 
        "reply": " Can you tell me if it's headed to NYC? Make your response VERY rapid, so I have time to get to the basement... Dave", 
        "threadID": "672198221_7370058912001", 
        "time": "2009-04-04 19:56:00", 
        "title": "North Korea launches missile", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by EAG154: Fox news reports North Korea has just launched missile! \"http://www.foxnews.com/ Can you tell me if it's headed to NYC? Make your response VERY rapid, so I have time to get to the basement... Dave na worries! very slow missile", 
        "intTime": 20090404, 
        "postID": 3, 
        "quote": "Originally posted by Grachus: quote: Originally posted by EAG154: Fox news reports North Korea has just launched missile! \"http://www.foxnews.com/ Can you tell me if it's headed to NYC? Make your response VERY rapid, so I have time to get to the basement... Dave", 
        "reply": " na worries! very slow missile", 
        "threadID": "672198221_7370058912001", 
        "time": "2009-04-04 19:59:00", 
        "title": "North Korea launches missile", 
        "userID": "EAG154"
    }, 
    {
        "content": "Anyonn shot it down? damn cnn going off the story", 
        "intTime": 20090404, 
        "postID": 4, 
        "quote": "", 
        "reply": "Anyonn shot it down? damn cnn going off the story", 
        "threadID": "672198221_7370058912001", 
        "time": "2009-04-04 20:00:00", 
        "title": "North Korea launches missile", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: Anyonn shot it down? damn cnn going off the story Fox is on it, it was a three stage, two liquid and one solid!", 
        "intTime": 20090404, 
        "postID": 5, 
        "quote": "Originally posted by crackerjacks61: Anyonn shot it down? damn cnn going off the story", 
        "reply": " Fox is on it, it was a three stage, two liquid and one solid!", 
        "threadID": "672198221_7370058912001", 
        "time": "2009-04-04 20:03:00", 
        "title": "North Korea launches missile", 
        "userID": "EAG154"
    }, 
    {
        "content": "How many more times is CNN gona talk about MLKs killing? geeees I wanna hear about the rocket", 
        "intTime": 20090404, 
        "postID": 6, 
        "quote": "", 
        "reply": "How many more times is CNN gona talk about MLKs killing? geeees I wanna hear about the rocket", 
        "threadID": "672198221_7370058912001", 
        "time": "2009-04-04 20:04:00", 
        "title": "North Korea launches missile", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "--- This Just In! - Commie missile stopped to refuel... still headed right to your basement... woman & childern hardest hit....", 
        "intTime": 20090404, 
        "postID": 7, 
        "quote": "", 
        "reply": "--- This Just In! - Commie missile stopped to refuel... still headed right to your basement... woman & childern hardest hit....", 
        "threadID": "672198221_7370058912001", 
        "time": "2009-04-04 20:05:00", 
        "title": "North Korea launches missile", 
        "userID": "LuckySoFar"
    }, 
    {
        "content": "Nuke 'em", 
        "intTime": 20090404, 
        "postID": 8, 
        "quote": "", 
        "reply": "Nuke 'em", 
        "threadID": "672198221_7370058912001", 
        "time": "2009-04-04 20:08:00", 
        "title": "North Korea launches missile", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "Japan said it's didn't go over NK said it did. Guess Japan don't want to admit they missed..", 
        "intTime": 20090404, 
        "postID": 9, 
        "quote": "", 
        "reply": "Japan said it's didn't go over NK said it did. Guess Japan don't want to admit they missed..", 
        "threadID": "672198221_7370058912001", 
        "time": "2009-04-04 20:11:00", 
        "title": "North Korea launches missile", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "Can anyone confirm a shot was taken ?", 
        "intTime": 20090404, 
        "postID": 10, 
        "quote": "", 
        "reply": "Can anyone confirm a shot was taken ?", 
        "threadID": "672198221_7370058912001", 
        "time": "2009-04-04 21:23:00", 
        "title": "North Korea launches missile", 
        "userID": "OddBall1st"
    }, 
    {
        "content": "We all pansied out? Let's let them think they are just that much more powerful.", 
        "intTime": 20090404, 
        "postID": 11, 
        "quote": "", 
        "reply": "We all pansied out? Let's let them think they are just that much more powerful.", 
        "threadID": "672198221_7370058912001", 
        "time": "2009-04-04 21:35:00", 
        "title": "North Korea launches missile", 
        "userID": "Grimbo"
    }, 
    {
        "content": "It was a good call not to shoot it down. If it had been a threat I am sure it would have been engaged. We can tell where things like that are going to impact.", 
        "intTime": 20090404, 
        "postID": 12, 
        "quote": "", 
        "reply": "It was a good call not to shoot it down. If it had been a threat I am sure it would have been engaged. We can tell where things like that are going to impact.", 
        "threadID": "672198221_7370058912001", 
        "time": "2009-04-04 21:48:00", 
        "title": "North Korea launches missile", 
        "userID": "nspreitler"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: It was a good call not to shoot it down. If it had been a threat I am sure it would have been engaged. We can tell where things like that are going to impact. why?? shoot the damn thing down and dont let nk (a hostile country) complete their tests...", 
        "intTime": 20090404, 
        "postID": 13, 
        "quote": "Originally posted by nspreitler: It was a good call not to shoot it down. If it had been a threat I am sure it would have been engaged. We can tell where things like that are going to impact.", 
        "reply": " why?? shoot the damn thing down and dont let nk (a hostile country) complete their tests...", 
        "threadID": "672198221_7370058912001", 
        "time": "2009-04-04 21:55:00", 
        "title": "North Korea launches missile", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: quote: Originally posted by nspreitler: It was a good call not to shoot it down. If it had been a threat I am sure it would have been engaged. We can tell where things like that are going to impact. why?? shoot the damn thing down and dont let nk (a hostile country) complete their tests... Because it wasn't a threat. If it was a threat certainly shoot it down. If they fired a missile that was targeted at us or an ally that would be a threat. A satellite launch with rocket bodies splahing down harmlessly in the ocean is not a threat. Shooting it down is an act of war, and in case you haven't noticed we are a little busy with the other two wars. We don't have the manpower to fight N Korea if they decided to invade the south. Besides, starting a war with N Korea over a satellite launch just isn't worth a single American life.", 
        "intTime": 20090404, 
        "postID": 14, 
        "quote": "Originally posted by outlaws93: quote: Originally posted by nspreitler: It was a good call not to shoot it down. If it had been a threat I am sure it would have been engaged. We can tell where things like that are going to impact. why?? shoot the damn thing down and dont let nk (a hostile country) complete their tests...", 
        "reply": " Because it wasn't a threat. If it was a threat certainly shoot it down. If they fired a missile that was targeted at us or an ally that would be a threat. A satellite launch with rocket bodies splahing down harmlessly in the ocean is not a threat. Shooting it down is an act of war, and in case you haven't noticed we are a little busy with the other two wars. We don't have the manpower to fight N Korea if they decided to invade the south. Besides, starting a war with N Korea over a satellite launch just isn't worth a single American life.", 
        "threadID": "672198221_7370058912001", 
        "time": "2009-04-04 22:33:00", 
        "title": "North Korea launches missile", 
        "userID": "nspreitler"
    }, 
    {
        "content": "obama has come out and said this is a clear violation of un charters... or something...", 
        "intTime": 20090404, 
        "postID": 15, 
        "quote": "", 
        "reply": "obama has come out and said this is a clear violation of un charters... or something...", 
        "threadID": "672198221_7370058912001", 
        "time": "2009-04-04 22:36:00", 
        "title": "North Korea launches missile", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: quote: Originally posted by outlaws93: quote: Originally posted by nspreitler: It was a good call not to shoot it down. If it had been a threat I am sure it would have been engaged. We can tell where things like that are going to impact. why?? shoot the damn thing down and dont let nk (a hostile country) complete their tests... Because it wasn't a threat. If it was a threat certainly shoot it down. If they fired a missile that was targeted at us or an ally that would be a threat. A satellite launch with rocket bodies splahing down harmlessly in the ocean is not a threat. Shooting it down is an act of war, and in case you haven't noticed we are a little busy with the other two wars. We don't have the manpower to fight N Korea if they decided to invade the south. Besides, starting a war with N Korea over a satellite launch just isn't worth a single American life. well it prevents them from gaining accreted info from the test and it prevents them from completing the test... or shooting whatever it is they are wanting to stick in orbit... it could be anything we wouldnt know till it came down and did whatever destruction it could do...", 
        "intTime": 20090404, 
        "postID": 16, 
        "quote": "Originally posted by nspreitler: quote: Originally posted by outlaws93: quote: Originally posted by nspreitler: It was a good call not to shoot it down. If it had been a threat I am sure it would have been engaged. We can tell where things like that are going to impact. why?? shoot the damn thing down and dont let nk (a hostile country) complete their tests... Because it wasn't a threat. If it was a threat certainly shoot it down. If they fired a missile that was targeted at us or an ally that would be a threat. A satellite launch with rocket bodies splahing down harmlessly in the ocean is not a threat. Shooting it down is an act of war, and in case you haven't noticed we are a little busy with the other two wars. We don't have the manpower to fight N Korea if they decided to invade the south. Besides, starting a war with N Korea over a satellite launch just isn't worth a single American life.", 
        "reply": " well it prevents them from gaining accreted info from the test and it prevents them from completing the test... or shooting whatever it is they are wanting to stick in orbit... it could be anything we wouldnt know till it came down and did whatever destruction it could do...", 
        "threadID": "672198221_7370058912001", 
        "time": "2009-04-04 22:39:00", 
        "title": "North Korea launches missile", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: quote: Originally posted by nspreitler: quote: Originally posted by outlaws93: quote: Originally posted by nspreitler: It was a good call not to shoot it down. If it had been a threat I am sure it would have been engaged. We can tell where things like that are going to impact. why?? shoot the damn thing down and dont let nk (a hostile country) complete their tests... Because it wasn't a threat. If it was a threat certainly shoot it down. If they fired a missile that was targeted at us or an ally that would be a threat. A satellite launch with rocket bodies splahing down harmlessly in the ocean is not a threat. Shooting it down is an act of war, and in case you haven't noticed we are a little busy with the other two wars. We don't have the manpower to fight N Korea if they decided to invade the south. Besides, starting a war with N Korea over a satellite launch just isn't worth a single American life. well it prevents them from gaining accreted info from the test and it prevents them from completing the test... or shooting whatever it is they are wanting to stick in orbit... it could be anything we wouldnt know till it came down and did whatever destruction it could do... That is worth going to war over? Easy for you to say while you would be safe on your couch. If we had shot that one down they could pummel Japan with hundreds of SCUDS and MRBMs and South Korea with thousands of artillery pieces.", 
        "intTime": 20090404, 
        "postID": 17, 
        "quote": "Originally posted by outlaws93: quote: Originally posted by nspreitler: quote: Originally posted by outlaws93: quote: Originally posted by nspreitler: It was a good call not to shoot it down. If it had been a threat I am sure it would have been engaged. We can tell where things like that are going to impact. why?? shoot the damn thing down and dont let nk (a hostile country) complete their tests... Because it wasn't a threat. If it was a threat certainly shoot it down. If they fired a missile that was targeted at us or an ally that would be a threat. A satellite launch with rocket bodies splahing down harmlessly in the ocean is not a threat. Shooting it down is an act of war, and in case you haven't noticed we are a little busy with the other two wars. We don't have the manpower to fight N Korea if they decided to invade the south. Besides, starting a war with N Korea over a satellite launch just isn't worth a single American life. well it prevents them from gaining accreted info from the test and it prevents them from completing the test... or shooting whatever it is they are wanting to stick in orbit... it could be anything we wouldnt know till it came down and did whatever destruction it could do...", 
        "reply": " That is worth going to war over? Easy for you to say while you would be safe on your couch. If we had shot that one down they could pummel Japan with hundreds of SCUDS and MRBMs and South Korea with thousands of artillery pieces.", 
        "threadID": "672198221_7370058912001", 
        "time": "2009-04-04 22:57:00", 
        "title": "North Korea launches missile", 
        "userID": "nspreitler"
    }, 
    {
        "content": "well he have to back up our un charters somehow dont we?? other wise why have them if we are not going to enforce anything>>????? obama has said what nk did was in violation of un charters.... it should of been shot down ...", 
        "intTime": 20090404, 
        "postID": 18, 
        "quote": "", 
        "reply": "well he have to back up our un charters somehow dont we?? other wise why have them if we are not going to enforce anything>>????? obama has said what nk did was in violation of un charters.... it should of been shot down ...", 
        "threadID": "672198221_7370058912001", 
        "time": "2009-04-04 23:17:00", 
        "title": "North Korea launches missile", 
        "userID": "outlaws93"
    }, 
    {
        "content": "Obama has just said he is not happy about this missile being launched. Now the world is sitting back to see how he responds. Will he be strong and do something about it or will he use stern words? to be continued........", 
        "intTime": 20090405, 
        "postID": 19, 
        "quote": "", 
        "reply": "Obama has just said he is not happy about this missile being launched. Now the world is sitting back to see how he responds. Will he be strong and do something about it or will he use stern words? to be continued........", 
        "threadID": "672198221_7370058912001", 
        "time": "2009-04-05 01:18:00", 
        "title": "North Korea launches missile", 
        "userID": "Duster6"
    }, 
    {
        "content": "My concern for any military action with North Korea isn't the war itself.... its the aftermath. NK is not a serious challenge militarily...its what to do with the millions of refugees that will flood south within days of the action, and how that will cripple the south", 
        "intTime": 20090405, 
        "postID": 20, 
        "quote": "", 
        "reply": "My concern for any military action with North Korea isn't the war itself.... its the aftermath. NK is not a serious challenge militarily...its what to do with the millions of refugees that will flood south within days of the action, and how that will cripple the south", 
        "threadID": "672198221_7370058912001", 
        "time": "2009-04-05 02:17:00", 
        "title": "North Korea launches missile", 
        "userID": "6481273"
    }, 
    {
        "content": "Fox news reports North Korea has just launched missile! \"http://www.foxnews.com/ Breaking News \"http://www.cnn.com/", 
        "intTime": 20090404, 
        "postID": 21, 
        "quote": "", 
        "reply": "Fox news reports North Korea has just launched missile! \"http://www.foxnews.com/ Breaking News \"http://www.cnn.com/", 
        "threadID": "672198221_7370058912001", 
        "time": "2009-04-04 19:51:00", 
        "title": "North Korea launches missile", 
        "userID": "EAG154"
    }, 
    {
        "content": "quote: Originally posted by EAG154: Fox news reports North Korea has just launched missile! \"http://www.foxnews.com/ Can you tell me if it's headed to NYC? Make your response VERY rapid, so I have time to get to the basement... Dave", 
        "intTime": 20090404, 
        "postID": 22, 
        "quote": "Originally posted by EAG154: Fox news reports North Korea has just launched missile! \"http://www.foxnews.com/", 
        "reply": " Can you tell me if it's headed to NYC? Make your response VERY rapid, so I have time to get to the basement... Dave", 
        "threadID": "672198221_7370058912001", 
        "time": "2009-04-04 19:56:00", 
        "title": "North Korea launches missile", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by EAG154: Fox news reports North Korea has just launched missile! \"http://www.foxnews.com/ Can you tell me if it's headed to NYC? Make your response VERY rapid, so I have time to get to the basement... Dave na worries! very slow missile", 
        "intTime": 20090404, 
        "postID": 23, 
        "quote": "Originally posted by Grachus: quote: Originally posted by EAG154: Fox news reports North Korea has just launched missile! \"http://www.foxnews.com/ Can you tell me if it's headed to NYC? Make your response VERY rapid, so I have time to get to the basement... Dave", 
        "reply": " na worries! very slow missile", 
        "threadID": "672198221_7370058912001", 
        "time": "2009-04-04 19:59:00", 
        "title": "North Korea launches missile", 
        "userID": "EAG154"
    }, 
    {
        "content": "Anyonn shot it down? damn cnn going off the story", 
        "intTime": 20090404, 
        "postID": 24, 
        "quote": "", 
        "reply": "Anyonn shot it down? damn cnn going off the story", 
        "threadID": "672198221_7370058912001", 
        "time": "2009-04-04 20:00:00", 
        "title": "North Korea launches missile", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: Anyonn shot it down? damn cnn going off the story Fox is on it, it was a three stage, two liquid and one solid!", 
        "intTime": 20090404, 
        "postID": 25, 
        "quote": "Originally posted by crackerjacks61: Anyonn shot it down? damn cnn going off the story", 
        "reply": " Fox is on it, it was a three stage, two liquid and one solid!", 
        "threadID": "672198221_7370058912001", 
        "time": "2009-04-04 20:03:00", 
        "title": "North Korea launches missile", 
        "userID": "EAG154"
    }, 
    {
        "content": "How many more times is CNN gona talk about MLKs killing? geeees I wanna hear about the rocket", 
        "intTime": 20090404, 
        "postID": 26, 
        "quote": "", 
        "reply": "How many more times is CNN gona talk about MLKs killing? geeees I wanna hear about the rocket", 
        "threadID": "672198221_7370058912001", 
        "time": "2009-04-04 20:04:00", 
        "title": "North Korea launches missile", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "--- This Just In! - Commie missile stopped to refuel... still headed right to your basement... woman & childern hardest hit....", 
        "intTime": 20090404, 
        "postID": 27, 
        "quote": "", 
        "reply": "--- This Just In! - Commie missile stopped to refuel... still headed right to your basement... woman & childern hardest hit....", 
        "threadID": "672198221_7370058912001", 
        "time": "2009-04-04 20:05:00", 
        "title": "North Korea launches missile", 
        "userID": "LuckySoFar"
    }, 
    {
        "content": "Nuke 'em", 
        "intTime": 20090404, 
        "postID": 28, 
        "quote": "", 
        "reply": "Nuke 'em", 
        "threadID": "672198221_7370058912001", 
        "time": "2009-04-04 20:08:00", 
        "title": "North Korea launches missile", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "Japan said it's didn't go over NK said it did. Guess Japan don't want to admit they missed..", 
        "intTime": 20090404, 
        "postID": 29, 
        "quote": "", 
        "reply": "Japan said it's didn't go over NK said it did. Guess Japan don't want to admit they missed..", 
        "threadID": "672198221_7370058912001", 
        "time": "2009-04-04 20:11:00", 
        "title": "North Korea launches missile", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "Can anyone confirm a shot was taken ?", 
        "intTime": 20090404, 
        "postID": 30, 
        "quote": "", 
        "reply": "Can anyone confirm a shot was taken ?", 
        "threadID": "672198221_7370058912001", 
        "time": "2009-04-04 21:23:00", 
        "title": "North Korea launches missile", 
        "userID": "OddBall1st"
    }, 
    {
        "content": "We all pansied out? Let's let them think they are just that much more powerful.", 
        "intTime": 20090404, 
        "postID": 31, 
        "quote": "", 
        "reply": "We all pansied out? Let's let them think they are just that much more powerful.", 
        "threadID": "672198221_7370058912001", 
        "time": "2009-04-04 21:35:00", 
        "title": "North Korea launches missile", 
        "userID": "Grimbo"
    }, 
    {
        "content": "It was a good call not to shoot it down. If it had been a threat I am sure it would have been engaged. We can tell where things like that are going to impact.", 
        "intTime": 20090404, 
        "postID": 32, 
        "quote": "", 
        "reply": "It was a good call not to shoot it down. If it had been a threat I am sure it would have been engaged. We can tell where things like that are going to impact.", 
        "threadID": "672198221_7370058912001", 
        "time": "2009-04-04 21:48:00", 
        "title": "North Korea launches missile", 
        "userID": "nspreitler"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: It was a good call not to shoot it down. If it had been a threat I am sure it would have been engaged. We can tell where things like that are going to impact. why?? shoot the damn thing down and dont let nk (a hostile country) complete their tests...", 
        "intTime": 20090404, 
        "postID": 33, 
        "quote": "Originally posted by nspreitler: It was a good call not to shoot it down. If it had been a threat I am sure it would have been engaged. We can tell where things like that are going to impact.", 
        "reply": " why?? shoot the damn thing down and dont let nk (a hostile country) complete their tests...", 
        "threadID": "672198221_7370058912001", 
        "time": "2009-04-04 21:55:00", 
        "title": "North Korea launches missile", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: quote: Originally posted by nspreitler: It was a good call not to shoot it down. If it had been a threat I am sure it would have been engaged. We can tell where things like that are going to impact. why?? shoot the damn thing down and dont let nk (a hostile country) complete their tests... Because it wasn't a threat. If it was a threat certainly shoot it down. If they fired a missile that was targeted at us or an ally that would be a threat. A satellite launch with rocket bodies splahing down harmlessly in the ocean is not a threat. Shooting it down is an act of war, and in case you haven't noticed we are a little busy with the other two wars. We don't have the manpower to fight N Korea if they decided to invade the south. Besides, starting a war with N Korea over a satellite launch just isn't worth a single American life.", 
        "intTime": 20090404, 
        "postID": 34, 
        "quote": "Originally posted by outlaws93: quote: Originally posted by nspreitler: It was a good call not to shoot it down. If it had been a threat I am sure it would have been engaged. We can tell where things like that are going to impact. why?? shoot the damn thing down and dont let nk (a hostile country) complete their tests...", 
        "reply": " Because it wasn't a threat. If it was a threat certainly shoot it down. If they fired a missile that was targeted at us or an ally that would be a threat. A satellite launch with rocket bodies splahing down harmlessly in the ocean is not a threat. Shooting it down is an act of war, and in case you haven't noticed we are a little busy with the other two wars. We don't have the manpower to fight N Korea if they decided to invade the south. Besides, starting a war with N Korea over a satellite launch just isn't worth a single American life.", 
        "threadID": "672198221_7370058912001", 
        "time": "2009-04-04 22:33:00", 
        "title": "North Korea launches missile", 
        "userID": "nspreitler"
    }, 
    {
        "content": "obama has come out and said this is a clear violation of un charters... or something...", 
        "intTime": 20090404, 
        "postID": 35, 
        "quote": "", 
        "reply": "obama has come out and said this is a clear violation of un charters... or something...", 
        "threadID": "672198221_7370058912001", 
        "time": "2009-04-04 22:36:00", 
        "title": "North Korea launches missile", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: quote: Originally posted by outlaws93: quote: Originally posted by nspreitler: It was a good call not to shoot it down. If it had been a threat I am sure it would have been engaged. We can tell where things like that are going to impact. why?? shoot the damn thing down and dont let nk (a hostile country) complete their tests... Because it wasn't a threat. If it was a threat certainly shoot it down. If they fired a missile that was targeted at us or an ally that would be a threat. A satellite launch with rocket bodies splahing down harmlessly in the ocean is not a threat. Shooting it down is an act of war, and in case you haven't noticed we are a little busy with the other two wars. We don't have the manpower to fight N Korea if they decided to invade the south. Besides, starting a war with N Korea over a satellite launch just isn't worth a single American life. well it prevents them from gaining accreted info from the test and it prevents them from completing the test... or shooting whatever it is they are wanting to stick in orbit... it could be anything we wouldnt know till it came down and did whatever destruction it could do...", 
        "intTime": 20090404, 
        "postID": 36, 
        "quote": "Originally posted by nspreitler: quote: Originally posted by outlaws93: quote: Originally posted by nspreitler: It was a good call not to shoot it down. If it had been a threat I am sure it would have been engaged. We can tell where things like that are going to impact. why?? shoot the damn thing down and dont let nk (a hostile country) complete their tests... Because it wasn't a threat. If it was a threat certainly shoot it down. If they fired a missile that was targeted at us or an ally that would be a threat. A satellite launch with rocket bodies splahing down harmlessly in the ocean is not a threat. Shooting it down is an act of war, and in case you haven't noticed we are a little busy with the other two wars. We don't have the manpower to fight N Korea if they decided to invade the south. Besides, starting a war with N Korea over a satellite launch just isn't worth a single American life.", 
        "reply": " well it prevents them from gaining accreted info from the test and it prevents them from completing the test... or shooting whatever it is they are wanting to stick in orbit... it could be anything we wouldnt know till it came down and did whatever destruction it could do...", 
        "threadID": "672198221_7370058912001", 
        "time": "2009-04-04 22:39:00", 
        "title": "North Korea launches missile", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: quote: Originally posted by nspreitler: quote: Originally posted by outlaws93: quote: Originally posted by nspreitler: It was a good call not to shoot it down. If it had been a threat I am sure it would have been engaged. We can tell where things like that are going to impact. why?? shoot the damn thing down and dont let nk (a hostile country) complete their tests... Because it wasn't a threat. If it was a threat certainly shoot it down. If they fired a missile that was targeted at us or an ally that would be a threat. A satellite launch with rocket bodies splahing down harmlessly in the ocean is not a threat. Shooting it down is an act of war, and in case you haven't noticed we are a little busy with the other two wars. We don't have the manpower to fight N Korea if they decided to invade the south. Besides, starting a war with N Korea over a satellite launch just isn't worth a single American life. well it prevents them from gaining accreted info from the test and it prevents them from completing the test... or shooting whatever it is they are wanting to stick in orbit... it could be anything we wouldnt know till it came down and did whatever destruction it could do... That is worth going to war over? Easy for you to say while you would be safe on your couch. If we had shot that one down they could pummel Japan with hundreds of SCUDS and MRBMs and South Korea with thousands of artillery pieces.", 
        "intTime": 20090404, 
        "postID": 37, 
        "quote": "Originally posted by outlaws93: quote: Originally posted by nspreitler: quote: Originally posted by outlaws93: quote: Originally posted by nspreitler: It was a good call not to shoot it down. If it had been a threat I am sure it would have been engaged. We can tell where things like that are going to impact. why?? shoot the damn thing down and dont let nk (a hostile country) complete their tests... Because it wasn't a threat. If it was a threat certainly shoot it down. If they fired a missile that was targeted at us or an ally that would be a threat. A satellite launch with rocket bodies splahing down harmlessly in the ocean is not a threat. Shooting it down is an act of war, and in case you haven't noticed we are a little busy with the other two wars. We don't have the manpower to fight N Korea if they decided to invade the south. Besides, starting a war with N Korea over a satellite launch just isn't worth a single American life. well it prevents them from gaining accreted info from the test and it prevents them from completing the test... or shooting whatever it is they are wanting to stick in orbit... it could be anything we wouldnt know till it came down and did whatever destruction it could do...", 
        "reply": " That is worth going to war over? Easy for you to say while you would be safe on your couch. If we had shot that one down they could pummel Japan with hundreds of SCUDS and MRBMs and South Korea with thousands of artillery pieces.", 
        "threadID": "672198221_7370058912001", 
        "time": "2009-04-04 22:57:00", 
        "title": "North Korea launches missile", 
        "userID": "nspreitler"
    }, 
    {
        "content": "well he have to back up our un charters somehow dont we?? other wise why have them if we are not going to enforce anything>>????? obama has said what nk did was in violation of un charters.... it should of been shot down ...", 
        "intTime": 20090404, 
        "postID": 38, 
        "quote": "", 
        "reply": "well he have to back up our un charters somehow dont we?? other wise why have them if we are not going to enforce anything>>????? obama has said what nk did was in violation of un charters.... it should of been shot down ...", 
        "threadID": "672198221_7370058912001", 
        "time": "2009-04-04 23:17:00", 
        "title": "North Korea launches missile", 
        "userID": "outlaws93"
    }, 
    {
        "content": "Obama has just said he is not happy about this missile being launched. Now the world is sitting back to see how he responds. Will he be strong and do something about it or will he use stern words? to be continued........", 
        "intTime": 20090405, 
        "postID": 39, 
        "quote": "", 
        "reply": "Obama has just said he is not happy about this missile being launched. Now the world is sitting back to see how he responds. Will he be strong and do something about it or will he use stern words? to be continued........", 
        "threadID": "672198221_7370058912001", 
        "time": "2009-04-05 01:18:00", 
        "title": "North Korea launches missile", 
        "userID": "Duster6"
    }, 
    {
        "content": "My concern for any military action with North Korea isn't the war itself.... its the aftermath. NK is not a serious challenge militarily...its what to do with the millions of refugees that will flood south within days of the action, and how that will cripple the south", 
        "intTime": 20090405, 
        "postID": 40, 
        "quote": "", 
        "reply": "My concern for any military action with North Korea isn't the war itself.... its the aftermath. NK is not a serious challenge militarily...its what to do with the millions of refugees that will flood south within days of the action, and how that will cripple the south", 
        "threadID": "672198221_7370058912001", 
        "time": "2009-04-05 02:17:00", 
        "title": "North Korea launches missile", 
        "userID": "6481273"
    }
]