[
    {
        "content": "Yup. Nationwide unemployment claims have decreased. For the first time in seven months: ++http://news.medill.northwestern.edu/chicago/news.aspx?id=127669 quote: Originally posted by the Article: Initial jobless claims nationwide fell 14,000 to a seasonally adjusted 631,000 last week, the U.S. Department of Labor announced Thursday. The four-week moving average was 637,250. You may now continue with your Obama bashing. I have the following prepared statements for you to use in order to ease your replies: 1. But...but...the stimulus doesn't work! 2. Where's his birth certificate?!?! 3. I still hope the economy fails, because I didn't vote for the President! This message has been edited. Last edited by: mrmixitup, Fri 01 May 2009 08:42 AM", 
        "intTime": 20090501, 
        "postID": 1, 
        "quote": "Originally posted by the Article: Initial jobless claims nationwide fell 14,000 to a seasonally adjusted 631,000 last week, the U.S. Department of Labor announced Thursday. The four-week moving average was 637,250.", 
        "reply": "Yup. Nationwide unemployment claims have decreased. For the first time in seven months: ++http://news.medill.northwestern.edu/chicago/news.aspx?id=127669  You may now continue with your Obama bashing. I have the following prepared statements for you to use in order to ease your replies: 1. But...but...the stimulus doesn't work! 2. Where's his birth certificate?!?! 3. I still hope the economy fails, because I didn't vote for the President! This message has been edited. Last edited by: mrmixitup, Fri 01 May 2009 08:42 AM", 
        "threadID": "672198221_6250032222001", 
        "time": "2009-05-01 07:16:00", 
        "title": "for I_M_Querty:  Unemployment drops!", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "4. It's nearing summer and seasonal jobs pick back up around this time. 5. it's probably only temporary. 6. I voted for him and I hope he doesn't fail but 4 and 5 are probably correct.", 
        "intTime": 20090501, 
        "postID": 2, 
        "quote": "", 
        "reply": "4. It's nearing summer and seasonal jobs pick back up around this time. 5. it's probably only temporary. 6. I voted for him and I hope he doesn't fail but 4 and 5 are probably correct.", 
        "threadID": "672198221_6250032222001", 
        "time": "2009-05-01 07:28:00", 
        "title": "for I_M_Querty:  Unemployment drops!", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: for Mainedawg: Unemployment drops! And for what reason is this addressed to me Sir: for Mainedawg: Unemployment drops!", 
        "intTime": 20090501, 
        "postID": 3, 
        "quote": "for Mainedawg: Unemployment drops!", 
        "reply": " And for what reason is this addressed to me Sir: for Mainedawg: Unemployment drops!", 
        "threadID": "672198221_6250032222001", 
        "time": "2009-05-01 08:28:00", 
        "title": "for I_M_Querty:  Unemployment drops!", 
        "userID": "mainedawg"
    }, 
    {
        "content": "quote: Originally posted by mainedawg: quote: for Mainedawg: Unemployment drops! And for what reason is this addressed to me Sir: for Mainedawg: Unemployment drops! \"And for what reason is this addressed to me?\" Maybe it is time for you to get a job.", 
        "intTime": 20090501, 
        "postID": 4, 
        "quote": "Originally posted by mainedawg: quote: for Mainedawg: Unemployment drops! And for what reason is this addressed to me Sir: for Mainedawg: Unemployment drops!", 
        "reply": " \"And for what reason is this addressed to me?\" Maybe it is time for you to get a job.", 
        "threadID": "672198221_6250032222001", 
        "time": "2009-05-01 08:40:00", 
        "title": "for I_M_Querty:  Unemployment drops!", 
        "userID": "6837602"
    }, 
    {
        "content": "quote: Originally posted by mainedawg: quote: for Mainedawg: Unemployment drops! And for what reason is this addressed to me Sir: for Mainedawg: Unemployment drops! Whoops. My bad. I meant to say I_M_Querty. You both have dogs in your sig I was referring to this earlier thread in the Hot Topics section (military.com forums link!): http://forums.military.com/eve/forums/a/tpc/f/672198221/m/2770037912001 See my post halfway down. EDIT: FIXED! Sorry again!", 
        "intTime": 20090501, 
        "postID": 5, 
        "quote": "Originally posted by mainedawg: quote: for Mainedawg: Unemployment drops! And for what reason is this addressed to me Sir: for Mainedawg: Unemployment drops!", 
        "reply": " Whoops. My bad. I meant to say I_M_Querty. You both have dogs in your sig I was referring to this earlier thread in the Hot Topics section (military.com forums link!): http://forums.military.com/eve/forums/a/tpc/f/672198221/m/2770037912001 See my post halfway down. EDIT: FIXED! Sorry again!", 
        "threadID": "672198221_6250032222001", 
        "time": "2009-05-01 08:41:00", 
        "title": "for I_M_Querty:  Unemployment drops!", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "Wow calling people out. Couldnt just post the thread and say hey whomever...Look. Or post it on their thread. So the numbers dropped. So, that means that they will stay and will never go back up over the next several months? Man, talk about spaz. I hope his socialism fails.....", 
        "intTime": 20090501, 
        "postID": 6, 
        "quote": "", 
        "reply": "Wow calling people out. Couldnt just post the thread and say hey whomever...Look. Or post it on their thread. So the numbers dropped. So, that means that they will stay and will never go back up over the next several months? Man, talk about spaz. I hope his socialism fails.....", 
        "threadID": "672198221_6250032222001", 
        "time": "2009-05-01 08:50:00", 
        "title": "for I_M_Querty:  Unemployment drops!", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "So? And you thread title is a lie. Unemployment has not dropped. The rate at which people are becoming unemployed has decreased. Unemployment is still increasing. Have a nice day.", 
        "intTime": 20090501, 
        "postID": 7, 
        "quote": "", 
        "reply": "So? And you thread title is a lie. Unemployment has not dropped. The rate at which people are becoming unemployed has decreased. Unemployment is still increasing. Have a nice day.", 
        "threadID": "672198221_6250032222001", 
        "time": "2009-05-01 08:54:00", 
        "title": "for I_M_Querty:  Unemployment drops!", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: So the numbers dropped. So, that means that they will stay and will never go back up over the next several months? I made a point that even the most dire unemployment predictions didn't see the unemployment rate going past 9.0%, since the rate is now so close to that, it's decreasing, exactly as was predicted.", 
        "intTime": 20090501, 
        "postID": 8, 
        "quote": "Originally posted by GunnyRet03: So the numbers dropped. So, that means that they will stay and will never go back up over the next several months?", 
        "reply": " I made a point that even the most dire unemployment predictions didn't see the unemployment rate going past 9.0%, since the rate is now so close to that, it's decreasing, exactly as was predicted.", 
        "threadID": "672198221_6250032222001", 
        "time": "2009-05-01 08:55:00", 
        "title": "for I_M_Querty:  Unemployment drops!", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by I_M_Qwerty: The rate at which people are becoming unemployed has decreased. Unemployment is still increasing. Have a nice day. Well, the first one has to happen (and always does) for the second one to do the same. You seem upset that a positive economic indicator has occured. Sorry I ruined your day with the good news.", 
        "intTime": 20090501, 
        "postID": 9, 
        "quote": "Originally posted by I_M_Qwerty: The rate at which people are becoming unemployed has decreased. Unemployment is still increasing. Have a nice day.", 
        "reply": " Well, the first one has to happen (and always does) for the second one to do the same. You seem upset that a positive economic indicator has occured. Sorry I ruined your day with the good news.", 
        "threadID": "672198221_6250032222001", 
        "time": "2009-05-01 09:06:00", 
        "title": "for I_M_Querty:  Unemployment drops!", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "Please folks, post to the subject matter and not to the poster. Remember that thing we have here called the TOS? MD", 
        "intTime": 20090501, 
        "postID": 10, 
        "quote": "", 
        "reply": "Please folks, post to the subject matter and not to the poster. Remember that thing we have here called the TOS? MD", 
        "threadID": "672198221_6250032222001", 
        "time": "2009-05-01 09:15:00", 
        "title": "for I_M_Querty:  Unemployment drops!", 
        "userID": "mainedawg"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by I_M_Qwerty: The rate at which people are becoming unemployed has decreased. Unemployment is still increasing. Have a nice day. Well, the first one has to happen (and always does) for the second one to do the same. You seem upset that a positive economic indicator has occured. Sorry I ruined your day with the good news. I have confidence that Obama will lead us out of the bush depression. When this starts to happen the number of people employed in the nation’s emergency rooms will skyrocket. The extra help will be needed to treat all the strokes the right wing extremist will be having.", 
        "intTime": 20090501, 
        "postID": 11, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by I_M_Qwerty: The rate at which people are becoming unemployed has decreased. Unemployment is still increasing. Have a nice day. Well, the first one has to happen (and always does) for the second one to do the same. You seem upset that a positive economic indicator has occured. Sorry I ruined your day with the good news.", 
        "reply": " I have confidence that Obama will lead us out of the bush depression. When this starts to happen the number of people employed in the nation’s emergency rooms will skyrocket. The extra help will be needed to treat all the strokes the right wing extremist will be having.", 
        "threadID": "672198221_6250032222001", 
        "time": "2009-05-01 09:19:00", 
        "title": "for I_M_Querty:  Unemployment drops!", 
        "userID": "6837602"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: Yup. Nationwide unemployment claims have decreased. For the first time in seven months: ++http://news.medill.northwestern.edu/chicago/news.aspx?id=127669 quote: Originally posted by the Article: Initial jobless claims nationwide fell 14,000 to a seasonally adjusted 631,000 last week, the U.S. Department of Labor announced Thursday. The four-week moving average was 637,250. You may now continue with your Obama bashing. I have the following prepared statements for you to use in order to ease your replies: LOL, you are kidding right? 631,000 people lost their jobs. A drop by 14,000 is not even 1% it's like 0.02% Some folks reach to attack President Obama, JUST AS MANY reach to defend him. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090501, 
        "postID": 12, 
        "quote": "Originally posted by mrmixitup: Yup. Nationwide unemployment claims have decreased. For the first time in seven months: ++http://news.medill.northwestern.edu/chicago/news.aspx?id=127669 quote: Originally posted by the Article: Initial jobless claims nationwide fell 14,000 to a seasonally adjusted 631,000 last week, the U.S. Department of Labor announced Thursday. The four-week moving average was 637,250. You may now continue with your Obama bashing. I have the following prepared statements for you to use in order to ease your replies:", 
        "reply": " LOL, you are kidding right? 631,000 people lost their jobs. A drop by 14,000 is not even 1% it's like 0.02% Some folks reach to attack President Obama, JUST AS MANY reach to defend him. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_6250032222001", 
        "time": "2009-05-01 09:27:00", 
        "title": "for I_M_Querty:  Unemployment drops!", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: LOL, you are kidding right? 631,000 people lost their jobs. A drop by 14,000 is not even 1% it's like 0.02% Some folks reach to attack President Obama, JUST AS MANY reach to defend him. A drop is still a drop. It didn't exactly shoot to 8% overnight, it took months (like the last nine) during Bush's presidency for that to happen.", 
        "intTime": 20090501, 
        "postID": 13, 
        "quote": "Originally posted by L0A1: LOL, you are kidding right? 631,000 people lost their jobs. A drop by 14,000 is not even 1% it's like 0.02% Some folks reach to attack President Obama, JUST AS MANY reach to defend him.", 
        "reply": " A drop is still a drop. It didn't exactly shoot to 8% overnight, it took months (like the last nine) during Bush's presidency for that to happen.", 
        "threadID": "672198221_6250032222001", 
        "time": "2009-05-01 09:33:00", 
        "title": "for I_M_Querty:  Unemployment drops!", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: You seem upset that a positive economic indicator has occured. Sorry I ruined your day with the good news. Not at all ... I am simply amused that you don't understand that of which you post ... and mischaracterize the \"good news\" as something that it is not. Again, there has been no decrease in unemployment ... simply a decrease in the rate at which more people are becoming unemployed. In short, we are still losing jobs and the number of persons unemployed is still increasing.", 
        "intTime": 20090501, 
        "postID": 14, 
        "quote": "You seem upset that a positive economic indicator has occured. Sorry I ruined your day with the good news.", 
        "reply": " Not at all ... I am simply amused that you don't understand that of which you post ... and mischaracterize the \"good news\" as something that it is not. Again, there has been no decrease in unemployment ... simply a decrease in the rate at which more people are becoming unemployed. In short, we are still losing jobs and the number of persons unemployed is still increasing.", 
        "threadID": "672198221_6250032222001", 
        "time": "2009-05-01 09:38:00", 
        "title": "for I_M_Querty:  Unemployment drops!", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Originally posted by I_M_Qwerty: quote: You seem upset that a positive economic indicator has occured. Sorry I ruined your day with the good news. Not at all ... I am simply amused that you don't understand that of which you post ... and mischaracterize the \"good news\" as something that it is not. Again, there has been no decrease in unemployment ... simply a decrease in the rate at which more people are becoming unemployed. In short, we are still losing jobs and the number of persons unemployed is still increasing. Its called desperation.", 
        "intTime": 20090501, 
        "postID": 15, 
        "quote": "Originally posted by I_M_Qwerty: quote: You seem upset that a positive economic indicator has occured. Sorry I ruined your day with the good news. Not at all ... I am simply amused that you don't understand that of which you post ... and mischaracterize the \"good news\" as something that it is not. Again, there has been no decrease in unemployment ... simply a decrease in the rate at which more people are becoming unemployed. In short, we are still losing jobs and the number of persons unemployed is still increasing.", 
        "reply": " Its called desperation.", 
        "threadID": "672198221_6250032222001", 
        "time": "2009-05-01 11:33:00", 
        "title": "for I_M_Querty:  Unemployment drops!", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Its called desperation. Those broken promises are gonna be hard to swallow.", 
        "intTime": 20090501, 
        "postID": 16, 
        "quote": "Its called desperation.", 
        "reply": " Those broken promises are gonna be hard to swallow.", 
        "threadID": "672198221_6250032222001", 
        "time": "2009-05-01 11:35:00", 
        "title": "for I_M_Querty:  Unemployment drops!", 
        "userID": "soscorpio"
    }, 
    {
        "content": "Unemployment rate since 2006 according to BLS: \"The World's Finest\"", 
        "intTime": 20090501, 
        "postID": 17, 
        "quote": "", 
        "reply": "Unemployment rate since 2006 according to BLS: \"The World's Finest\"", 
        "threadID": "672198221_6250032222001", 
        "time": "2009-05-01 11:54:00", 
        "title": "for I_M_Querty:  Unemployment drops!", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: Unemployment rate since democrats took control in 2006 according to BLS: Good link. Shows that the present situation was due to the previous administration. Hopefully unemployment will go down in the future. However, it's still rising at this moment. Dave", 
        "intTime": 20090501, 
        "postID": 18, 
        "quote": "Originally posted by Kegler300: Unemployment rate since democrats took control in 2006 according to BLS:", 
        "reply": " Good link. Shows that the present situation was due to the previous administration. Hopefully unemployment will go down in the future. However, it's still rising at this moment. Dave", 
        "threadID": "672198221_6250032222001", 
        "time": "2009-05-01 11:57:00", 
        "title": "for I_M_Querty:  Unemployment drops!", 
        "userID": "Grachus"
    }, 
    {
        "content": "Actually, it show what's happened since democrats took control of the congress. Nice try though... \"The World's Finest\"", 
        "intTime": 20090501, 
        "postID": 19, 
        "quote": "", 
        "reply": "Actually, it show what's happened since democrats took control of the congress. Nice try though... \"The World's Finest\"", 
        "threadID": "672198221_6250032222001", 
        "time": "2009-05-01 12:22:00", 
        "title": "for I_M_Querty:  Unemployment drops!", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: Actually, it show what's happened since democrats took control of the congress. Nice try though... LOL! So which specific act of Congress in the preceding two years caused this? Which one undid all the wonderful work of this administration? Dave", 
        "intTime": 20090501, 
        "postID": 20, 
        "quote": "Originally posted by Kegler300: Actually, it show what's happened since democrats took control of the congress. Nice try though...", 
        "reply": " LOL! So which specific act of Congress in the preceding two years caused this? Which one undid all the wonderful work of this administration? Dave", 
        "threadID": "672198221_6250032222001", 
        "time": "2009-05-01 12:37:00", 
        "title": "for I_M_Querty:  Unemployment drops!", 
        "userID": "Grachus"
    }, 
    {
        "content": "Yup. Nationwide unemployment claims have decreased. For the first time in seven months: ++http://news.medill.northwestern.edu/chicago/news.aspx?id=127669 quote: Originally posted by the Article: Initial jobless claims nationwide fell 14,000 to a seasonally adjusted 631,000 last week, the U.S. Department of Labor announced Thursday. The four-week moving average was 637,250. You may now continue with your Obama bashing. I have the following prepared statements for you to use in order to ease your replies: 1. But...but...the stimulus doesn't work! 2. Where's his birth certificate?!?! 3. I still hope the economy fails, because I didn't vote for the President! This message has been edited. Last edited by: mrmixitup, Fri 01 May 2009 08:42 AM", 
        "intTime": 20090501, 
        "postID": 21, 
        "quote": "Originally posted by the Article: Initial jobless claims nationwide fell 14,000 to a seasonally adjusted 631,000 last week, the U.S. Department of Labor announced Thursday. The four-week moving average was 637,250.", 
        "reply": "Yup. Nationwide unemployment claims have decreased. For the first time in seven months: ++http://news.medill.northwestern.edu/chicago/news.aspx?id=127669  You may now continue with your Obama bashing. I have the following prepared statements for you to use in order to ease your replies: 1. But...but...the stimulus doesn't work! 2. Where's his birth certificate?!?! 3. I still hope the economy fails, because I didn't vote for the President! This message has been edited. Last edited by: mrmixitup, Fri 01 May 2009 08:42 AM", 
        "threadID": "672198221_6250032222001", 
        "time": "2009-05-01 07:16:00", 
        "title": "for I_M_Querty:  Unemployment drops!", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "4. It's nearing summer and seasonal jobs pick back up around this time. 5. it's probably only temporary. 6. I voted for him and I hope he doesn't fail but 4 and 5 are probably correct.", 
        "intTime": 20090501, 
        "postID": 22, 
        "quote": "", 
        "reply": "4. It's nearing summer and seasonal jobs pick back up around this time. 5. it's probably only temporary. 6. I voted for him and I hope he doesn't fail but 4 and 5 are probably correct.", 
        "threadID": "672198221_6250032222001", 
        "time": "2009-05-01 07:28:00", 
        "title": "for I_M_Querty:  Unemployment drops!", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: for Mainedawg: Unemployment drops! And for what reason is this addressed to me Sir: for Mainedawg: Unemployment drops!", 
        "intTime": 20090501, 
        "postID": 23, 
        "quote": "for Mainedawg: Unemployment drops!", 
        "reply": " And for what reason is this addressed to me Sir: for Mainedawg: Unemployment drops!", 
        "threadID": "672198221_6250032222001", 
        "time": "2009-05-01 08:28:00", 
        "title": "for I_M_Querty:  Unemployment drops!", 
        "userID": "mainedawg"
    }, 
    {
        "content": "quote: Originally posted by mainedawg: quote: for Mainedawg: Unemployment drops! And for what reason is this addressed to me Sir: for Mainedawg: Unemployment drops! \"And for what reason is this addressed to me?\" Maybe it is time for you to get a job.", 
        "intTime": 20090501, 
        "postID": 24, 
        "quote": "Originally posted by mainedawg: quote: for Mainedawg: Unemployment drops! And for what reason is this addressed to me Sir: for Mainedawg: Unemployment drops!", 
        "reply": " \"And for what reason is this addressed to me?\" Maybe it is time for you to get a job.", 
        "threadID": "672198221_6250032222001", 
        "time": "2009-05-01 08:40:00", 
        "title": "for I_M_Querty:  Unemployment drops!", 
        "userID": "6837602"
    }, 
    {
        "content": "quote: Originally posted by mainedawg: quote: for Mainedawg: Unemployment drops! And for what reason is this addressed to me Sir: for Mainedawg: Unemployment drops! Whoops. My bad. I meant to say I_M_Querty. You both have dogs in your sig I was referring to this earlier thread in the Hot Topics section (military.com forums link!): http://forums.military.com/eve/forums/a/tpc/f/672198221/m/2770037912001 See my post halfway down. EDIT: FIXED! Sorry again!", 
        "intTime": 20090501, 
        "postID": 25, 
        "quote": "Originally posted by mainedawg: quote: for Mainedawg: Unemployment drops! And for what reason is this addressed to me Sir: for Mainedawg: Unemployment drops!", 
        "reply": " Whoops. My bad. I meant to say I_M_Querty. You both have dogs in your sig I was referring to this earlier thread in the Hot Topics section (military.com forums link!): http://forums.military.com/eve/forums/a/tpc/f/672198221/m/2770037912001 See my post halfway down. EDIT: FIXED! Sorry again!", 
        "threadID": "672198221_6250032222001", 
        "time": "2009-05-01 08:41:00", 
        "title": "for I_M_Querty:  Unemployment drops!", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "Wow calling people out. Couldnt just post the thread and say hey whomever...Look. Or post it on their thread. So the numbers dropped. So, that means that they will stay and will never go back up over the next several months? Man, talk about spaz. I hope his socialism fails.....", 
        "intTime": 20090501, 
        "postID": 26, 
        "quote": "", 
        "reply": "Wow calling people out. Couldnt just post the thread and say hey whomever...Look. Or post it on their thread. So the numbers dropped. So, that means that they will stay and will never go back up over the next several months? Man, talk about spaz. I hope his socialism fails.....", 
        "threadID": "672198221_6250032222001", 
        "time": "2009-05-01 08:50:00", 
        "title": "for I_M_Querty:  Unemployment drops!", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "So? And you thread title is a lie. Unemployment has not dropped. The rate at which people are becoming unemployed has decreased. Unemployment is still increasing. Have a nice day.", 
        "intTime": 20090501, 
        "postID": 27, 
        "quote": "", 
        "reply": "So? And you thread title is a lie. Unemployment has not dropped. The rate at which people are becoming unemployed has decreased. Unemployment is still increasing. Have a nice day.", 
        "threadID": "672198221_6250032222001", 
        "time": "2009-05-01 08:54:00", 
        "title": "for I_M_Querty:  Unemployment drops!", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: So the numbers dropped. So, that means that they will stay and will never go back up over the next several months? I made a point that even the most dire unemployment predictions didn't see the unemployment rate going past 9.0%, since the rate is now so close to that, it's decreasing, exactly as was predicted.", 
        "intTime": 20090501, 
        "postID": 28, 
        "quote": "Originally posted by GunnyRet03: So the numbers dropped. So, that means that they will stay and will never go back up over the next several months?", 
        "reply": " I made a point that even the most dire unemployment predictions didn't see the unemployment rate going past 9.0%, since the rate is now so close to that, it's decreasing, exactly as was predicted.", 
        "threadID": "672198221_6250032222001", 
        "time": "2009-05-01 08:55:00", 
        "title": "for I_M_Querty:  Unemployment drops!", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by I_M_Qwerty: The rate at which people are becoming unemployed has decreased. Unemployment is still increasing. Have a nice day. Well, the first one has to happen (and always does) for the second one to do the same. You seem upset that a positive economic indicator has occured. Sorry I ruined your day with the good news.", 
        "intTime": 20090501, 
        "postID": 29, 
        "quote": "Originally posted by I_M_Qwerty: The rate at which people are becoming unemployed has decreased. Unemployment is still increasing. Have a nice day.", 
        "reply": " Well, the first one has to happen (and always does) for the second one to do the same. You seem upset that a positive economic indicator has occured. Sorry I ruined your day with the good news.", 
        "threadID": "672198221_6250032222001", 
        "time": "2009-05-01 09:06:00", 
        "title": "for I_M_Querty:  Unemployment drops!", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "Please folks, post to the subject matter and not to the poster. Remember that thing we have here called the TOS? MD", 
        "intTime": 20090501, 
        "postID": 30, 
        "quote": "", 
        "reply": "Please folks, post to the subject matter and not to the poster. Remember that thing we have here called the TOS? MD", 
        "threadID": "672198221_6250032222001", 
        "time": "2009-05-01 09:15:00", 
        "title": "for I_M_Querty:  Unemployment drops!", 
        "userID": "mainedawg"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by I_M_Qwerty: The rate at which people are becoming unemployed has decreased. Unemployment is still increasing. Have a nice day. Well, the first one has to happen (and always does) for the second one to do the same. You seem upset that a positive economic indicator has occured. Sorry I ruined your day with the good news. I have confidence that Obama will lead us out of the bush depression. When this starts to happen the number of people employed in the nation’s emergency rooms will skyrocket. The extra help will be needed to treat all the strokes the right wing extremist will be having.", 
        "intTime": 20090501, 
        "postID": 31, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by I_M_Qwerty: The rate at which people are becoming unemployed has decreased. Unemployment is still increasing. Have a nice day. Well, the first one has to happen (and always does) for the second one to do the same. You seem upset that a positive economic indicator has occured. Sorry I ruined your day with the good news.", 
        "reply": " I have confidence that Obama will lead us out of the bush depression. When this starts to happen the number of people employed in the nation’s emergency rooms will skyrocket. The extra help will be needed to treat all the strokes the right wing extremist will be having.", 
        "threadID": "672198221_6250032222001", 
        "time": "2009-05-01 09:19:00", 
        "title": "for I_M_Querty:  Unemployment drops!", 
        "userID": "6837602"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: Yup. Nationwide unemployment claims have decreased. For the first time in seven months: ++http://news.medill.northwestern.edu/chicago/news.aspx?id=127669 quote: Originally posted by the Article: Initial jobless claims nationwide fell 14,000 to a seasonally adjusted 631,000 last week, the U.S. Department of Labor announced Thursday. The four-week moving average was 637,250. You may now continue with your Obama bashing. I have the following prepared statements for you to use in order to ease your replies: LOL, you are kidding right? 631,000 people lost their jobs. A drop by 14,000 is not even 1% it's like 0.02% Some folks reach to attack President Obama, JUST AS MANY reach to defend him. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090501, 
        "postID": 32, 
        "quote": "Originally posted by mrmixitup: Yup. Nationwide unemployment claims have decreased. For the first time in seven months: ++http://news.medill.northwestern.edu/chicago/news.aspx?id=127669 quote: Originally posted by the Article: Initial jobless claims nationwide fell 14,000 to a seasonally adjusted 631,000 last week, the U.S. Department of Labor announced Thursday. The four-week moving average was 637,250. You may now continue with your Obama bashing. I have the following prepared statements for you to use in order to ease your replies:", 
        "reply": " LOL, you are kidding right? 631,000 people lost their jobs. A drop by 14,000 is not even 1% it's like 0.02% Some folks reach to attack President Obama, JUST AS MANY reach to defend him. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_6250032222001", 
        "time": "2009-05-01 09:27:00", 
        "title": "for I_M_Querty:  Unemployment drops!", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: LOL, you are kidding right? 631,000 people lost their jobs. A drop by 14,000 is not even 1% it's like 0.02% Some folks reach to attack President Obama, JUST AS MANY reach to defend him. A drop is still a drop. It didn't exactly shoot to 8% overnight, it took months (like the last nine) during Bush's presidency for that to happen.", 
        "intTime": 20090501, 
        "postID": 33, 
        "quote": "Originally posted by L0A1: LOL, you are kidding right? 631,000 people lost their jobs. A drop by 14,000 is not even 1% it's like 0.02% Some folks reach to attack President Obama, JUST AS MANY reach to defend him.", 
        "reply": " A drop is still a drop. It didn't exactly shoot to 8% overnight, it took months (like the last nine) during Bush's presidency for that to happen.", 
        "threadID": "672198221_6250032222001", 
        "time": "2009-05-01 09:33:00", 
        "title": "for I_M_Querty:  Unemployment drops!", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: You seem upset that a positive economic indicator has occured. Sorry I ruined your day with the good news. Not at all ... I am simply amused that you don't understand that of which you post ... and mischaracterize the \"good news\" as something that it is not. Again, there has been no decrease in unemployment ... simply a decrease in the rate at which more people are becoming unemployed. In short, we are still losing jobs and the number of persons unemployed is still increasing.", 
        "intTime": 20090501, 
        "postID": 34, 
        "quote": "You seem upset that a positive economic indicator has occured. Sorry I ruined your day with the good news.", 
        "reply": " Not at all ... I am simply amused that you don't understand that of which you post ... and mischaracterize the \"good news\" as something that it is not. Again, there has been no decrease in unemployment ... simply a decrease in the rate at which more people are becoming unemployed. In short, we are still losing jobs and the number of persons unemployed is still increasing.", 
        "threadID": "672198221_6250032222001", 
        "time": "2009-05-01 09:38:00", 
        "title": "for I_M_Querty:  Unemployment drops!", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Originally posted by I_M_Qwerty: quote: You seem upset that a positive economic indicator has occured. Sorry I ruined your day with the good news. Not at all ... I am simply amused that you don't understand that of which you post ... and mischaracterize the \"good news\" as something that it is not. Again, there has been no decrease in unemployment ... simply a decrease in the rate at which more people are becoming unemployed. In short, we are still losing jobs and the number of persons unemployed is still increasing. Its called desperation.", 
        "intTime": 20090501, 
        "postID": 35, 
        "quote": "Originally posted by I_M_Qwerty: quote: You seem upset that a positive economic indicator has occured. Sorry I ruined your day with the good news. Not at all ... I am simply amused that you don't understand that of which you post ... and mischaracterize the \"good news\" as something that it is not. Again, there has been no decrease in unemployment ... simply a decrease in the rate at which more people are becoming unemployed. In short, we are still losing jobs and the number of persons unemployed is still increasing.", 
        "reply": " Its called desperation.", 
        "threadID": "672198221_6250032222001", 
        "time": "2009-05-01 11:33:00", 
        "title": "for I_M_Querty:  Unemployment drops!", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Its called desperation. Those broken promises are gonna be hard to swallow.", 
        "intTime": 20090501, 
        "postID": 36, 
        "quote": "Its called desperation.", 
        "reply": " Those broken promises are gonna be hard to swallow.", 
        "threadID": "672198221_6250032222001", 
        "time": "2009-05-01 11:35:00", 
        "title": "for I_M_Querty:  Unemployment drops!", 
        "userID": "soscorpio"
    }, 
    {
        "content": "Unemployment rate since 2006 according to BLS: \"The World's Finest\"", 
        "intTime": 20090501, 
        "postID": 37, 
        "quote": "", 
        "reply": "Unemployment rate since 2006 according to BLS: \"The World's Finest\"", 
        "threadID": "672198221_6250032222001", 
        "time": "2009-05-01 11:54:00", 
        "title": "for I_M_Querty:  Unemployment drops!", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: Unemployment rate since democrats took control in 2006 according to BLS: Good link. Shows that the present situation was due to the previous administration. Hopefully unemployment will go down in the future. However, it's still rising at this moment. Dave", 
        "intTime": 20090501, 
        "postID": 38, 
        "quote": "Originally posted by Kegler300: Unemployment rate since democrats took control in 2006 according to BLS:", 
        "reply": " Good link. Shows that the present situation was due to the previous administration. Hopefully unemployment will go down in the future. However, it's still rising at this moment. Dave", 
        "threadID": "672198221_6250032222001", 
        "time": "2009-05-01 11:57:00", 
        "title": "for I_M_Querty:  Unemployment drops!", 
        "userID": "Grachus"
    }, 
    {
        "content": "Actually, it show what's happened since democrats took control of the congress. Nice try though... \"The World's Finest\"", 
        "intTime": 20090501, 
        "postID": 39, 
        "quote": "", 
        "reply": "Actually, it show what's happened since democrats took control of the congress. Nice try though... \"The World's Finest\"", 
        "threadID": "672198221_6250032222001", 
        "time": "2009-05-01 12:22:00", 
        "title": "for I_M_Querty:  Unemployment drops!", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: Actually, it show what's happened since democrats took control of the congress. Nice try though... LOL! So which specific act of Congress in the preceding two years caused this? Which one undid all the wonderful work of this administration? Dave", 
        "intTime": 20090501, 
        "postID": 40, 
        "quote": "Originally posted by Kegler300: Actually, it show what's happened since democrats took control of the congress. Nice try though...", 
        "reply": " LOL! So which specific act of Congress in the preceding two years caused this? Which one undid all the wonderful work of this administration? Dave", 
        "threadID": "672198221_6250032222001", 
        "time": "2009-05-01 12:37:00", 
        "title": "for I_M_Querty:  Unemployment drops!", 
        "userID": "Grachus"
    }
]