[
    {
        "content": "\"http://www.boston.com/news/politics/politicalintelligence/2009/05/powell_to_rush.html\" The General WILL win this. It's the Republican's only chance of relevance and respect in not only the short, but the long run. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson",
        "intTime": 20090520,
        "postID": 1,
        "quote": "",
        "reply": "\"http://www.boston.com/news/politics/politicalintelligence/2009/05/powell_to_rush.html\" The General WILL win this. It's the Republican's only chance of relevance and respect in not only the short, but the long run. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson",
        "threadID": "672198221_9440087322001",
        "time": "2009-05-20 11:22:00",
        "title": "General Powell Hits Back at Rush and Cheney",
        "userID": "jack_flats"
    },
    {
        "content": "Powell backstabbed the Repubs. But I do agree that there needs to be a different party. The radicals that have hijacked it are out of their mind. I don't think Powell is the one to bring back the Repubs, but hey every little bit helps. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "intTime": 20090520,
        "postID": 2,
        "quote": "",
        "reply": "Powell backstabbed the Repubs. But I do agree that there needs to be a different party. The radicals that have hijacked it are out of their mind. I don't think Powell is the one to bring back the Repubs, but hey every little bit helps. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "threadID": "672198221_9440087322001",
        "time": "2009-05-20 11:27:00",
        "title": "General Powell Hits Back at Rush and Cheney",
        "userID": "Anbar7"
    },
    {
        "content": "Good for him, as a citizen he is entitled to his Opinion. Mine is Powells an azzhat backstabber. I trust Powell as far as I can throw a Connex",
        "intTime": 20090520,
        "postID": 3,
        "quote": "",
        "reply": "Good for him, as a citizen he is entitled to his Opinion. Mine is Powells an azzhat backstabber. I trust Powell as far as I can throw a Connex",
        "threadID": "672198221_9440087322001",
        "time": "2009-05-20 11:28:00",
        "title": "General Powell Hits Back at Rush and Cheney",
        "userID": "LineDoggie"
    },
    {
        "content": "He shouldn’t have even dignified them with a response. Anbar7, Are you saying everybody should vote according to party lines, regardless of candidates? \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe",
        "intTime": 20090520,
        "postID": 4,
        "quote": "",
        "reply": "He shouldn’t have even dignified them with a response. Anbar7, Are you saying everybody should vote according to party lines, regardless of candidates? \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe",
        "threadID": "672198221_9440087322001",
        "time": "2009-05-20 11:39:00",
        "title": "General Powell Hits Back at Rush and Cheney",
        "userID": "NSNN"
    },
    {
        "content": "quote: Originally posted by NSNN: He shouldn’t have even dignified them with a response. Anbar7, Are you saying everybody should vote according to party lines, regardless of candidates? No, I'm not. I'm saying if you are a prominent figure within your party you don't back the enemy. You stay support your party. If you don't want to support your party, become an independent. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "intTime": 20090520,
        "postID": 5,
        "quote": "Originally posted by NSNN: He shouldn’t have even dignified them with a response. Anbar7, Are you saying everybody should vote according to party lines, regardless of candidates?",
        "reply": " No, I'm not. I'm saying if you are a prominent figure within your party you don't back the enemy. You stay support your party. If you don't want to support your party, become an independent. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "threadID": "672198221_9440087322001",
        "time": "2009-05-20 11:44:00",
        "title": "General Powell Hits Back at Rush and Cheney",
        "userID": "Anbar7"
    },
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by NSNN: He shouldn’t have even dignified them with a response. Anbar7, Are you saying everybody should vote according to party lines, regardless of candidates? No, I'm not. I'm saying if you are a prominent figure within your party you don't back the enemy. You stay support your party. If you don't want to support your party, become an independent. The real enemy is the notion that the other party is in any shape or form the “enemy”! A person should vote for who ever they think will be better for the entire country, not just his or her political party! As a matter of fact, every American has a moral right obligation to do the same! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe",
        "intTime": 20090520,
        "postID": 6,
        "quote": "Originally posted by Anbar7: quote: Originally posted by NSNN: He shouldn’t have even dignified them with a response. Anbar7, Are you saying everybody should vote according to party lines, regardless of candidates? No, I'm not. I'm saying if you are a prominent figure within your party you don't back the enemy. You stay support your party. If you don't want to support your party, become an independent.",
        "reply": " The real enemy is the notion that the other party is in any shape or form the “enemy”! A person should vote for who ever they think will be better for the entire country, not just his or her political party! As a matter of fact, every American has a moral right obligation to do the same! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe",
        "threadID": "672198221_9440087322001",
        "time": "2009-05-20 11:49:00",
        "title": "General Powell Hits Back at Rush and Cheney",
        "userID": "NSNN"
    },
    {
        "content": "quote: Originally posted by NSNN: quote: Originally posted by Anbar7: quote: Originally posted by NSNN: He shouldn’t have even dignified them with a response. Anbar7, Are you saying everybody should vote according to party lines, regardless of candidates? No, I'm not. I'm saying if you are a prominent figure within your party you don't back the enemy. You stay support your party. If you don't want to support your party, become an independent. The real enemy is the notion that the other party is in any shape or form the “enemy”! A person should vote for who ever they think will be better for the entire country, not just his or her political party! As a matter of fact, every American has a moral right obligation to do the same! You are correct, but if I believe in one system the other system is my \"enemy\". Not the same enemy as a hadji, but a political enemy nonetheless. Every American shoudl vote for who is better, but then we wouldn't have political parties to be affiliated with now would we? We would all be Indys \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "intTime": 20090520,
        "postID": 7,
        "quote": "Originally posted by NSNN: quote: Originally posted by Anbar7: quote: Originally posted by NSNN: He shouldn’t have even dignified them with a response. Anbar7, Are you saying everybody should vote according to party lines, regardless of candidates? No, I'm not. I'm saying if you are a prominent figure within your party you don't back the enemy. You stay support your party. If you don't want to support your party, become an independent. The real enemy is the notion that the other party is in any shape or form the “enemy”! A person should vote for who ever they think will be better for the entire country, not just his or her political party! As a matter of fact, every American has a moral right obligation to do the same!",
        "reply": " You are correct, but if I believe in one system the other system is my \"enemy\". Not the same enemy as a hadji, but a political enemy nonetheless. Every American shoudl vote for who is better, but then we wouldn't have political parties to be affiliated with now would we? We would all be Indys \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "threadID": "672198221_9440087322001",
        "time": "2009-05-20 11:54:00",
        "title": "General Powell Hits Back at Rush and Cheney",
        "userID": "Anbar7"
    },
    {
        "content": "quote: Originally posted by klassylady25: He's a republican by registration and a rino by heart. When was the last time he did anything to help out his party? He backed O, he voted O, and he's waiting for the GOP to be revived without lifting a finger? Why? What's his point? Without lifting a finger? You been living in a cave? \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson",
        "intTime": 20090520,
        "postID": 8,
        "quote": "Originally posted by klassylady25: He's a republican by registration and a rino by heart. When was the last time he did anything to help out his party? He backed O, he voted O, and he's waiting for the GOP to be revived without lifting a finger? Why? What's his point?",
        "reply": " Without lifting a finger? You been living in a cave? \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson",
        "threadID": "672198221_9440087322001",
        "time": "2009-05-20 12:01:00",
        "title": "General Powell Hits Back at Rush and Cheney",
        "userID": "jack_flats"
    },
    {
        "content": "The days of Rush and Cheney's influence on the republican party is coming to an end It's the Gen. Powell's and the Meghan McCain types who will be the big winners here. It has to be. Otherwise the republican's will just keep on losing elections. Listen to the new people people republican fossil hardliners. It's your only hope again for relevance and respect. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson",
        "intTime": 20090520,
        "postID": 9,
        "quote": "",
        "reply": "The days of Rush and Cheney's influence on the republican party is coming to an end It's the Gen. Powell's and the Meghan McCain types who will be the big winners here. It has to be. Otherwise the republican's will just keep on losing elections. Listen to the new people people republican fossil hardliners. It's your only hope again for relevance and respect. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson",
        "threadID": "672198221_9440087322001",
        "time": "2009-05-20 12:04:00",
        "title": "General Powell Hits Back at Rush and Cheney",
        "userID": "jack_flats"
    },
    {
        "content": "quote: Originally posted by Anbar7: Every American shoudl vote for who is better, but then we wouldn't have political parties to be affiliated with now would we? We would all be Indys 20 I have already intimated to you the danger of parties in the state, with particular reference to the founding of them on geographical discriminations. Let me now take a more comprehensive view, and warn you in the most solemn manner against the baneful effects of the spirit of party, generally. 21 This spirit, unfortunately, is inseparable from our nature, having its root in the strongest passions of the human mind. It exists under different shapes in all governments, more or less stifled, controlled, or repressed; but, in those of the popular form, it is seen in its greatest rankness, and is truly their worst enemy. 22 The alternate domination of one faction over another, sharpened by the spirit of revenge, natural to party dissension, which in different ages and countries has perpetrated the most horrid enormities, is itself a frightful despotism. But this leads at length to a more formal and permanent despotism. The disorders and miseries, which result, gradually incline the minds of men to seek security and repose in the absolute power of an individual; and sooner or later the chief of some prevailing faction, more able or more fortunate than his competitors, turns this disposition to the purposes of his own elevation, on the ruins of Public Liberty. 23 Without looking forward to an extremity of this kind, (which nevertheless ought not to be entirely out of sight,) the common and continual mischiefs of the spirit of party are sufficient to make it the interest and duty of a wise people to discourage and restrain it. 24 It serves always to distract the Public Councils, and enfeeble the Public Administration. It agitates the Community with ill-founded jealousies and false alarms; kindles the animosity of one part against another, foments occasionally riot and insurrection. It opens the door to foreign influence and corruption, which find a facilitated access to the government itself through the channels of party passions. Thus the policy and the will of one country are subjected to the policy and will of another. 25 There is an opinion, that parties in free countries are useful checks upon the administration of the Government, and serve to keep alive the spirit of Liberty. This within certain limits is probably true; and in Governments of a Monarchical cast, Patriotism may look with indulgence, if not with favor, upon the spirit of party. But in those of the popular character, in Governments purely elective, it is a spirit not to be encouraged. From their natural tendency, it is certain there will always be enough of that spirit for every salutary purpose. And, there being constant danger of excess, the effort ought to be, by force of public opinion, to mitigate and assuage it. A fire not to be quenched, it demands a uniform vigilance to prevent its bursting into a flame, lest, instead of warming, it should consume George Washington's Farewell Address +http://en.wikipedia.org/wiki/George_Washington's_Farewell_Address \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe",
        "intTime": 20090520,
        "postID": 10,
        "quote": "Originally posted by Anbar7: Every American shoudl vote for who is better, but then we wouldn't have political parties to be affiliated with now would we? We would all be Indys",
        "reply": " 20 I have already intimated to you the danger of parties in the state, with particular reference to the founding of them on geographical discriminations. Let me now take a more comprehensive view, and warn you in the most solemn manner against the baneful effects of the spirit of party, generally. 21 This spirit, unfortunately, is inseparable from our nature, having its root in the strongest passions of the human mind. It exists under different shapes in all governments, more or less stifled, controlled, or repressed; but, in those of the popular form, it is seen in its greatest rankness, and is truly their worst enemy. 22 The alternate domination of one faction over another, sharpened by the spirit of revenge, natural to party dissension, which in different ages and countries has perpetrated the most horrid enormities, is itself a frightful despotism. But this leads at length to a more formal and permanent despotism. The disorders and miseries, which result, gradually incline the minds of men to seek security and repose in the absolute power of an individual; and sooner or later the chief of some prevailing faction, more able or more fortunate than his competitors, turns this disposition to the purposes of his own elevation, on the ruins of Public Liberty. 23 Without looking forward to an extremity of this kind, (which nevertheless ought not to be entirely out of sight,) the common and continual mischiefs of the spirit of party are sufficient to make it the interest and duty of a wise people to discourage and restrain it. 24 It serves always to distract the Public Councils, and enfeeble the Public Administration. It agitates the Community with ill-founded jealousies and false alarms; kindles the animosity of one part against another, foments occasionally riot and insurrection. It opens the door to foreign influence and corruption, which find a facilitated access to the government itself through the channels of party passions. Thus the policy and the will of one country are subjected to the policy and will of another. 25 There is an opinion, that parties in free countries are useful checks upon the administration of the Government, and serve to keep alive the spirit of Liberty. This within certain limits is probably true; and in Governments of a Monarchical cast, Patriotism may look with indulgence, if not with favor, upon the spirit of party. But in those of the popular character, in Governments purely elective, it is a spirit not to be encouraged. From their natural tendency, it is certain there will always be enough of that spirit for every salutary purpose. And, there being constant danger of excess, the effort ought to be, by force of public opinion, to mitigate and assuage it. A fire not to be quenched, it demands a uniform vigilance to prevent its bursting into a flame, lest, instead of warming, it should consume George Washington's Farewell Address +http://en.wikipedia.org/wiki/George_Washington's_Farewell_Address \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe",
        "threadID": "672198221_9440087322001",
        "time": "2009-05-20 12:10:00",
        "title": "General Powell Hits Back at Rush and Cheney",
        "userID": "NSNN"
    },
    {
        "content": "quote: Originally posted by Anbar7: You are correct, but if I believe in one system the other system is my \"enemy\". Not the same enemy as a hadji, but a political enemy nonetheless. Every American shoudl vote for who is better, but then we wouldn't have political parties to be affiliated with now would we? We would all be Indys See, IMO, this sort of thinking drives me nuts. Why SHOULD we have political parties? What, really, is their use? Brain washing? Making money? IMO, all they do is create \"enemies\" of your fellow Americans -- who pledge their allegiance to the same flag, and who fight for the same liberties we all love and cherish. And yes -- we should all be Independents. Personally, the day I chose to leave the democrats in 2004 to be a registered \"non-partisan\" was like being released from jail. I didn't have the knee-jerk reaction of feeling I HAD to defend that party; nor did I have the knee-jerk reaction of feeling ashamed of having a conservative/republican opinion, and voicing it out loud. Now ... both sides hate me!",
        "intTime": 20090520,
        "postID": 11,
        "quote": "Originally posted by Anbar7: You are correct, but if I believe in one system the other system is my \"enemy\". Not the same enemy as a hadji, but a political enemy nonetheless. Every American shoudl vote for who is better, but then we wouldn't have political parties to be affiliated with now would we? We would all be Indys",
        "reply": " See, IMO, this sort of thinking drives me nuts. Why SHOULD we have political parties? What, really, is their use? Brain washing? Making money? IMO, all they do is create \"enemies\" of your fellow Americans -- who pledge their allegiance to the same flag, and who fight for the same liberties we all love and cherish. And yes -- we should all be Independents. Personally, the day I chose to leave the democrats in 2004 to be a registered \"non-partisan\" was like being released from jail. I didn't have the knee-jerk reaction of feeling I HAD to defend that party; nor did I have the knee-jerk reaction of feeling ashamed of having a conservative/republican opinion, and voicing it out loud. Now ... both sides hate me!",
        "threadID": "672198221_9440087322001",
        "time": "2009-05-20 12:14:00",
        "title": "General Powell Hits Back at Rush and Cheney",
        "userID": "1WW"
    },
    {
        "content": "quote: Originally posted by 1WW: quote: Originally posted by Anbar7: You are correct, but if I believe in one system the other system is my \"enemy\". Not the same enemy as a hadji, but a political enemy nonetheless. Every American shoudl vote for who is better, but then we wouldn't have political parties to be affiliated with now would we? We would all be Indys See, IMO, this sort of thinking drives me nuts. Why SHOULD we have political parties? What, really, is their use? Brain washing? Making money? IMO, all they do is create \"enemies\" of your fellow Americans -- who pledge their allegiance to the same flag, and who fight for the same liberties we all love and cherish. And yes -- we should all be Independents. Personally, the day I chose to leave the democrats in 2004 to be a registered \"non-partisan\" was like being released from jail. I didn't have the knee-jerk reaction of feeling I HAD to defend that party; nor did I have the knee-jerk reaction of feeling ashamed of having a conservative/republican opinion, and voicing it out loud. Now ... both sides hate me! The only real purpose they serve is for checks and balances, but as we can see now, they don't work. I also believe that we should all be independents and vote for who we want and believe whatever we want. I only stay Repub so I can vote for who I think should run for the party. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "intTime": 20090520,
        "postID": 12,
        "quote": "Originally posted by 1WW: quote: Originally posted by Anbar7: You are correct, but if I believe in one system the other system is my \"enemy\". Not the same enemy as a hadji, but a political enemy nonetheless. Every American shoudl vote for who is better, but then we wouldn't have political parties to be affiliated with now would we? We would all be Indys See, IMO, this sort of thinking drives me nuts. Why SHOULD we have political parties? What, really, is their use? Brain washing? Making money? IMO, all they do is create \"enemies\" of your fellow Americans -- who pledge their allegiance to the same flag, and who fight for the same liberties we all love and cherish. And yes -- we should all be Independents. Personally, the day I chose to leave the democrats in 2004 to be a registered \"non-partisan\" was like being released from jail. I didn't have the knee-jerk reaction of feeling I HAD to defend that party; nor did I have the knee-jerk reaction of feeling ashamed of having a conservative/republican opinion, and voicing it out loud. Now ... both sides hate me!",
        "reply": " The only real purpose they serve is for checks and balances, but as we can see now, they don't work. I also believe that we should all be independents and vote for who we want and believe whatever we want. I only stay Repub so I can vote for who I think should run for the party. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "threadID": "672198221_9440087322001",
        "time": "2009-05-20 12:18:00",
        "title": "General Powell Hits Back at Rush and Cheney",
        "userID": "Anbar7"
    },
    {
        "content": "My take on Powell is that he had very different ideas about the Republican party than Bush and Cheney did. So after being told to go to the UN and tell the assembley that Saddam had WMD's, and later find out that he didn't; Powell probably got disolusioned. He probably got disolusioned with a lot of things about the 2000-08 Republican party, I know I sure did. I don't blame him for endorsing Obama. The thing with that was that he was in a no win situation. If he'd endorsed McCain every black person in America would be calling him an Uncle Tom. Now he's a traitor to the GOP. In reality, I believe that Powell was sick of the neocons and realized he personally felt it was time for something different.",
        "intTime": 20090520,
        "postID": 13,
        "quote": "",
        "reply": "My take on Powell is that he had very different ideas about the Republican party than Bush and Cheney did. So after being told to go to the UN and tell the assembley that Saddam had WMD's, and later find out that he didn't; Powell probably got disolusioned. He probably got disolusioned with a lot of things about the 2000-08 Republican party, I know I sure did. I don't blame him for endorsing Obama. The thing with that was that he was in a no win situation. If he'd endorsed McCain every black person in America would be calling him an Uncle Tom. Now he's a traitor to the GOP. In reality, I believe that Powell was sick of the neocons and realized he personally felt it was time for something different.",
        "threadID": "672198221_9440087322001",
        "time": "2009-05-20 12:25:00",
        "title": "General Powell Hits Back at Rush and Cheney",
        "userID": "foxred03"
    },
    {
        "content": "quote: Originally posted by foxred03: The thing with that was that he was in a no win situation. If he'd endorsed McCain every black person in America would be calling him an Uncle Tom. Did you forget that Obama was called an Uncle Tom and he wasn't black enough? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "intTime": 20090520,
        "postID": 14,
        "quote": "Originally posted by foxred03: The thing with that was that he was in a no win situation. If he'd endorsed McCain every black person in America would be calling him an Uncle Tom.",
        "reply": " Did you forget that Obama was called an Uncle Tom and he wasn't black enough? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "threadID": "672198221_9440087322001",
        "time": "2009-05-20 12:27:00",
        "title": "General Powell Hits Back at Rush and Cheney",
        "userID": "Anbar7"
    },
    {
        "content": "No I didn't.",
        "intTime": 20090520,
        "postID": 15,
        "quote": "",
        "reply": "No I didn't.",
        "threadID": "672198221_9440087322001",
        "time": "2009-05-20 12:36:00",
        "title": "General Powell Hits Back at Rush and Cheney",
        "userID": "foxred03"
    },
    {
        "content": "quote: Originally posted by foxred03: My take on Powell is that he had very different ideas about the Republican party than Bush and Cheney did. So after being told to go to the UN and tell the assembley that Saddam had WMD's, and later find out that he didn't; Powell probably got disolusioned. He probably got disolusioned with a lot of things about the 2000-08 Republican party, I know I sure did. I don't blame him for endorsing Obama. The thing with that was that he was in a no win situation. If he'd endorsed McCain every black person in America would be calling him an Uncle Tom. Now he's a traitor to the GOP. In reality, I believe that Powell was sick of the neocons and realized he personally felt it was time for something different. Powell has already been called an Uncle Tom. The reason I lost respect for him is because he supported Obama but really couldn't give solid reasons why he supported Obama. That leaves plenty to the imagination on why he really endorsed and voted for him.",
        "intTime": 20090520,
        "postID": 16,
        "quote": "Originally posted by foxred03: My take on Powell is that he had very different ideas about the Republican party than Bush and Cheney did. So after being told to go to the UN and tell the assembley that Saddam had WMD's, and later find out that he didn't; Powell probably got disolusioned. He probably got disolusioned with a lot of things about the 2000-08 Republican party, I know I sure did. I don't blame him for endorsing Obama. The thing with that was that he was in a no win situation. If he'd endorsed McCain every black person in America would be calling him an Uncle Tom. Now he's a traitor to the GOP. In reality, I believe that Powell was sick of the neocons and realized he personally felt it was time for something different.",
        "reply": " Powell has already been called an Uncle Tom. The reason I lost respect for him is because he supported Obama but really couldn't give solid reasons why he supported Obama. That leaves plenty to the imagination on why he really endorsed and voted for him.",
        "threadID": "672198221_9440087322001",
        "time": "2009-05-20 12:47:00",
        "title": "General Powell Hits Back at Rush and Cheney",
        "userID": "stec74"
    },
    {
        "content": "++http://www.boston.com/news/nation/articles/2008/10/20/powells_backing_new_funds_lift_obama/ The reasons Powell gives here are as \"solid\" as anything similar I've heard.",
        "intTime": 20090520,
        "postID": 17,
        "quote": "",
        "reply": "++http://www.boston.com/news/nation/articles/2008/10/20/powells_backing_new_funds_lift_obama/ The reasons Powell gives here are as \"solid\" as anything similar I've heard.",
        "threadID": "672198221_9440087322001",
        "time": "2009-05-20 12:51:00",
        "title": "General Powell Hits Back at Rush and Cheney",
        "userID": "foxred03"
    },
    {
        "content": "Powell put his reputation on the line for Bush when he went to the UN and spoke of the certainty that there were WMDs in Saddam's Iraq. His more current opinions, whether one agrees with him or not, are reasonable and representative of those of a large segment of the Republican Party. Rush Limbaugh's and Dick Cheney's criticisms are unreasonable and unjust. These two ranting idiots do more damage to the Republican Party than they do to Colin Powell. Let Rush and Cheney rant on -- they'll alienate more good Americans from the Republican Party.",
        "intTime": 20090520,
        "postID": 18,
        "quote": "",
        "reply": "Powell put his reputation on the line for Bush when he went to the UN and spoke of the certainty that there were WMDs in Saddam's Iraq. His more current opinions, whether one agrees with him or not, are reasonable and representative of those of a large segment of the Republican Party. Rush Limbaugh's and Dick Cheney's criticisms are unreasonable and unjust. These two ranting idiots do more damage to the Republican Party than they do to Colin Powell. Let Rush and Cheney rant on -- they'll alienate more good Americans from the Republican Party.",
        "threadID": "672198221_9440087322001",
        "time": "2009-05-20 13:01:00",
        "title": "General Powell Hits Back at Rush and Cheney",
        "userID": "fnewt"
    },
    {
        "content": "quote: Originally posted by foxred03: ++http://www.boston.com/news/nation/articles/2008/10/20/powells_backing_new_funds_lift_obama/ The reasons Powell gives here are as \"solid\" as anything similar I've heard. Solid reasons? quote: I come to the conclusion that because of his ability to inspire, because of the inclusive nature of his campaign, because he is reaching out all across America, because of who he is and his rhetorical abilities -- and you have to take that into account -- as well as his substance -- he has both style and substance,\" Powell said. \"He has met the standard of being a successful president, being an exceptional president.\" So based off Powell's standards Tony Robbins would be a good President. What issues does he agree with Obama on? What policies of Obama's did he think were good ideas?",
        "intTime": 20090520,
        "postID": 19,
        "quote": "Originally posted by foxred03: ++http://www.boston.com/news/nation/articles/2008/10/20/powells_backing_new_funds_lift_obama/ The reasons Powell gives here are as \"solid\" as anything similar I've heard.",
        "reply": " Solid reasons? quote: I come to the conclusion that because of his ability to inspire, because of the inclusive nature of his campaign, because he is reaching out all across America, because of who he is and his rhetorical abilities -- and you have to take that into account -- as well as his substance -- he has both style and substance,\" Powell said. \"He has met the standard of being a successful president, being an exceptional president.\" So based off Powell's standards Tony Robbins would be a good President. What issues does he agree with Obama on? What policies of Obama's did he think were good ideas?",
        "threadID": "672198221_9440087322001",
        "time": "2009-05-20 13:01:00",
        "title": "General Powell Hits Back at Rush and Cheney",
        "userID": "stec74"
    },
    {
        "content": "\"http://www.boston.com/news/politics/politicalintelligence/2009/05/powell_to_rush.html\" The General WILL win this. It's the Republican's only chance of relevance and respect in not only the short, but the long run. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson",
        "intTime": 20090520,
        "postID": 20,
        "quote": "",
        "reply": "\"http://www.boston.com/news/politics/politicalintelligence/2009/05/powell_to_rush.html\" The General WILL win this. It's the Republican's only chance of relevance and respect in not only the short, but the long run. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson",
        "threadID": "672198221_9440087322001",
        "time": "2009-05-20 11:22:00",
        "title": "General Powell Hits Back at Rush and Cheney",
        "userID": "jack_flats"
    },
    {
        "content": "Powell backstabbed the Repubs. But I do agree that there needs to be a different party. The radicals that have hijacked it are out of their mind. I don't think Powell is the one to bring back the Repubs, but hey every little bit helps. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "intTime": 20090520,
        "postID": 21,
        "quote": "",
        "reply": "Powell backstabbed the Repubs. But I do agree that there needs to be a different party. The radicals that have hijacked it are out of their mind. I don't think Powell is the one to bring back the Repubs, but hey every little bit helps. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "threadID": "672198221_9440087322001",
        "time": "2009-05-20 11:27:00",
        "title": "General Powell Hits Back at Rush and Cheney",
        "userID": "Anbar7"
    },
    {
        "content": "Good for him, as a citizen he is entitled to his Opinion. Mine is Powells an azzhat backstabber. I trust Powell as far as I can throw a Connex",
        "intTime": 20090520,
        "postID": 22,
        "quote": "",
        "reply": "Good for him, as a citizen he is entitled to his Opinion. Mine is Powells an azzhat backstabber. I trust Powell as far as I can throw a Connex",
        "threadID": "672198221_9440087322001",
        "time": "2009-05-20 11:28:00",
        "title": "General Powell Hits Back at Rush and Cheney",
        "userID": "LineDoggie"
    },
    {
        "content": "He shouldn’t have even dignified them with a response. Anbar7, Are you saying everybody should vote according to party lines, regardless of candidates? \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe",
        "intTime": 20090520,
        "postID": 23,
        "quote": "",
        "reply": "He shouldn’t have even dignified them with a response. Anbar7, Are you saying everybody should vote according to party lines, regardless of candidates? \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe",
        "threadID": "672198221_9440087322001",
        "time": "2009-05-20 11:39:00",
        "title": "General Powell Hits Back at Rush and Cheney",
        "userID": "NSNN"
    },
    {
        "content": "quote: Originally posted by NSNN: He shouldn’t have even dignified them with a response. Anbar7, Are you saying everybody should vote according to party lines, regardless of candidates? No, I'm not. I'm saying if you are a prominent figure within your party you don't back the enemy. You stay support your party. If you don't want to support your party, become an independent. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "intTime": 20090520,
        "postID": 24,
        "quote": "Originally posted by NSNN: He shouldn’t have even dignified them with a response. Anbar7, Are you saying everybody should vote according to party lines, regardless of candidates?",
        "reply": " No, I'm not. I'm saying if you are a prominent figure within your party you don't back the enemy. You stay support your party. If you don't want to support your party, become an independent. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "threadID": "672198221_9440087322001",
        "time": "2009-05-20 11:44:00",
        "title": "General Powell Hits Back at Rush and Cheney",
        "userID": "Anbar7"
    },
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by NSNN: He shouldn’t have even dignified them with a response. Anbar7, Are you saying everybody should vote according to party lines, regardless of candidates? No, I'm not. I'm saying if you are a prominent figure within your party you don't back the enemy. You stay support your party. If you don't want to support your party, become an independent. The real enemy is the notion that the other party is in any shape or form the “enemy”! A person should vote for who ever they think will be better for the entire country, not just his or her political party! As a matter of fact, every American has a moral right obligation to do the same! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe",
        "intTime": 20090520,
        "postID": 25,
        "quote": "Originally posted by Anbar7: quote: Originally posted by NSNN: He shouldn’t have even dignified them with a response. Anbar7, Are you saying everybody should vote according to party lines, regardless of candidates? No, I'm not. I'm saying if you are a prominent figure within your party you don't back the enemy. You stay support your party. If you don't want to support your party, become an independent.",
        "reply": " The real enemy is the notion that the other party is in any shape or form the “enemy”! A person should vote for who ever they think will be better for the entire country, not just his or her political party! As a matter of fact, every American has a moral right obligation to do the same! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe",
        "threadID": "672198221_9440087322001",
        "time": "2009-05-20 11:49:00",
        "title": "General Powell Hits Back at Rush and Cheney",
        "userID": "NSNN"
    },
    {
        "content": "quote: Originally posted by NSNN: quote: Originally posted by Anbar7: quote: Originally posted by NSNN: He shouldn’t have even dignified them with a response. Anbar7, Are you saying everybody should vote according to party lines, regardless of candidates? No, I'm not. I'm saying if you are a prominent figure within your party you don't back the enemy. You stay support your party. If you don't want to support your party, become an independent. The real enemy is the notion that the other party is in any shape or form the “enemy”! A person should vote for who ever they think will be better for the entire country, not just his or her political party! As a matter of fact, every American has a moral right obligation to do the same! You are correct, but if I believe in one system the other system is my \"enemy\". Not the same enemy as a hadji, but a political enemy nonetheless. Every American shoudl vote for who is better, but then we wouldn't have political parties to be affiliated with now would we? We would all be Indys \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "intTime": 20090520,
        "postID": 26,
        "quote": "Originally posted by NSNN: quote: Originally posted by Anbar7: quote: Originally posted by NSNN: He shouldn’t have even dignified them with a response. Anbar7, Are you saying everybody should vote according to party lines, regardless of candidates? No, I'm not. I'm saying if you are a prominent figure within your party you don't back the enemy. You stay support your party. If you don't want to support your party, become an independent. The real enemy is the notion that the other party is in any shape or form the “enemy”! A person should vote for who ever they think will be better for the entire country, not just his or her political party! As a matter of fact, every American has a moral right obligation to do the same!",
        "reply": " You are correct, but if I believe in one system the other system is my \"enemy\". Not the same enemy as a hadji, but a political enemy nonetheless. Every American shoudl vote for who is better, but then we wouldn't have political parties to be affiliated with now would we? We would all be Indys \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "threadID": "672198221_9440087322001",
        "time": "2009-05-20 11:54:00",
        "title": "General Powell Hits Back at Rush and Cheney",
        "userID": "Anbar7"
    },
    {
        "content": "quote: Originally posted by klassylady25: He's a republican by registration and a rino by heart. When was the last time he did anything to help out his party? He backed O, he voted O, and he's waiting for the GOP to be revived without lifting a finger? Why? What's his point? Without lifting a finger? You been living in a cave? \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson",
        "intTime": 20090520,
        "postID": 27,
        "quote": "Originally posted by klassylady25: He's a republican by registration and a rino by heart. When was the last time he did anything to help out his party? He backed O, he voted O, and he's waiting for the GOP to be revived without lifting a finger? Why? What's his point?",
        "reply": " Without lifting a finger? You been living in a cave? \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson",
        "threadID": "672198221_9440087322001",
        "time": "2009-05-20 12:01:00",
        "title": "General Powell Hits Back at Rush and Cheney",
        "userID": "jack_flats"
    },
    {
        "content": "The days of Rush and Cheney's influence on the republican party is coming to an end It's the Gen. Powell's and the Meghan McCain types who will be the big winners here. It has to be. Otherwise the republican's will just keep on losing elections. Listen to the new people people republican fossil hardliners. It's your only hope again for relevance and respect. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson",
        "intTime": 20090520,
        "postID": 28,
        "quote": "",
        "reply": "The days of Rush and Cheney's influence on the republican party is coming to an end It's the Gen. Powell's and the Meghan McCain types who will be the big winners here. It has to be. Otherwise the republican's will just keep on losing elections. Listen to the new people people republican fossil hardliners. It's your only hope again for relevance and respect. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson",
        "threadID": "672198221_9440087322001",
        "time": "2009-05-20 12:04:00",
        "title": "General Powell Hits Back at Rush and Cheney",
        "userID": "jack_flats"
    },
    {
        "content": "quote: Originally posted by Anbar7: Every American shoudl vote for who is better, but then we wouldn't have political parties to be affiliated with now would we? We would all be Indys 20 I have already intimated to you the danger of parties in the state, with particular reference to the founding of them on geographical discriminations. Let me now take a more comprehensive view, and warn you in the most solemn manner against the baneful effects of the spirit of party, generally. 21 This spirit, unfortunately, is inseparable from our nature, having its root in the strongest passions of the human mind. It exists under different shapes in all governments, more or less stifled, controlled, or repressed; but, in those of the popular form, it is seen in its greatest rankness, and is truly their worst enemy. 22 The alternate domination of one faction over another, sharpened by the spirit of revenge, natural to party dissension, which in different ages and countries has perpetrated the most horrid enormities, is itself a frightful despotism. But this leads at length to a more formal and permanent despotism. The disorders and miseries, which result, gradually incline the minds of men to seek security and repose in the absolute power of an individual; and sooner or later the chief of some prevailing faction, more able or more fortunate than his competitors, turns this disposition to the purposes of his own elevation, on the ruins of Public Liberty. 23 Without looking forward to an extremity of this kind, (which nevertheless ought not to be entirely out of sight,) the common and continual mischiefs of the spirit of party are sufficient to make it the interest and duty of a wise people to discourage and restrain it. 24 It serves always to distract the Public Councils, and enfeeble the Public Administration. It agitates the Community with ill-founded jealousies and false alarms; kindles the animosity of one part against another, foments occasionally riot and insurrection. It opens the door to foreign influence and corruption, which find a facilitated access to the government itself through the channels of party passions. Thus the policy and the will of one country are subjected to the policy and will of another. 25 There is an opinion, that parties in free countries are useful checks upon the administration of the Government, and serve to keep alive the spirit of Liberty. This within certain limits is probably true; and in Governments of a Monarchical cast, Patriotism may look with indulgence, if not with favor, upon the spirit of party. But in those of the popular character, in Governments purely elective, it is a spirit not to be encouraged. From their natural tendency, it is certain there will always be enough of that spirit for every salutary purpose. And, there being constant danger of excess, the effort ought to be, by force of public opinion, to mitigate and assuage it. A fire not to be quenched, it demands a uniform vigilance to prevent its bursting into a flame, lest, instead of warming, it should consume George Washington's Farewell Address +http://en.wikipedia.org/wiki/George_Washington's_Farewell_Address \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe",
        "intTime": 20090520,
        "postID": 29,
        "quote": "Originally posted by Anbar7: Every American shoudl vote for who is better, but then we wouldn't have political parties to be affiliated with now would we? We would all be Indys",
        "reply": " 20 I have already intimated to you the danger of parties in the state, with particular reference to the founding of them on geographical discriminations. Let me now take a more comprehensive view, and warn you in the most solemn manner against the baneful effects of the spirit of party, generally. 21 This spirit, unfortunately, is inseparable from our nature, having its root in the strongest passions of the human mind. It exists under different shapes in all governments, more or less stifled, controlled, or repressed; but, in those of the popular form, it is seen in its greatest rankness, and is truly their worst enemy. 22 The alternate domination of one faction over another, sharpened by the spirit of revenge, natural to party dissension, which in different ages and countries has perpetrated the most horrid enormities, is itself a frightful despotism. But this leads at length to a more formal and permanent despotism. The disorders and miseries, which result, gradually incline the minds of men to seek security and repose in the absolute power of an individual; and sooner or later the chief of some prevailing faction, more able or more fortunate than his competitors, turns this disposition to the purposes of his own elevation, on the ruins of Public Liberty. 23 Without looking forward to an extremity of this kind, (which nevertheless ought not to be entirely out of sight,) the common and continual mischiefs of the spirit of party are sufficient to make it the interest and duty of a wise people to discourage and restrain it. 24 It serves always to distract the Public Councils, and enfeeble the Public Administration. It agitates the Community with ill-founded jealousies and false alarms; kindles the animosity of one part against another, foments occasionally riot and insurrection. It opens the door to foreign influence and corruption, which find a facilitated access to the government itself through the channels of party passions. Thus the policy and the will of one country are subjected to the policy and will of another. 25 There is an opinion, that parties in free countries are useful checks upon the administration of the Government, and serve to keep alive the spirit of Liberty. This within certain limits is probably true; and in Governments of a Monarchical cast, Patriotism may look with indulgence, if not with favor, upon the spirit of party. But in those of the popular character, in Governments purely elective, it is a spirit not to be encouraged. From their natural tendency, it is certain there will always be enough of that spirit for every salutary purpose. And, there being constant danger of excess, the effort ought to be, by force of public opinion, to mitigate and assuage it. A fire not to be quenched, it demands a uniform vigilance to prevent its bursting into a flame, lest, instead of warming, it should consume George Washington's Farewell Address +http://en.wikipedia.org/wiki/George_Washington's_Farewell_Address \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe",
        "threadID": "672198221_9440087322001",
        "time": "2009-05-20 12:10:00",
        "title": "General Powell Hits Back at Rush and Cheney",
        "userID": "NSNN"
    },
    {
        "content": "quote: Originally posted by Anbar7: You are correct, but if I believe in one system the other system is my \"enemy\". Not the same enemy as a hadji, but a political enemy nonetheless. Every American shoudl vote for who is better, but then we wouldn't have political parties to be affiliated with now would we? We would all be Indys See, IMO, this sort of thinking drives me nuts. Why SHOULD we have political parties? What, really, is their use? Brain washing? Making money? IMO, all they do is create \"enemies\" of your fellow Americans -- who pledge their allegiance to the same flag, and who fight for the same liberties we all love and cherish. And yes -- we should all be Independents. Personally, the day I chose to leave the democrats in 2004 to be a registered \"non-partisan\" was like being released from jail. I didn't have the knee-jerk reaction of feeling I HAD to defend that party; nor did I have the knee-jerk reaction of feeling ashamed of having a conservative/republican opinion, and voicing it out loud. Now ... both sides hate me!",
        "intTime": 20090520,
        "postID": 30,
        "quote": "Originally posted by Anbar7: You are correct, but if I believe in one system the other system is my \"enemy\". Not the same enemy as a hadji, but a political enemy nonetheless. Every American shoudl vote for who is better, but then we wouldn't have political parties to be affiliated with now would we? We would all be Indys",
        "reply": " See, IMO, this sort of thinking drives me nuts. Why SHOULD we have political parties? What, really, is their use? Brain washing? Making money? IMO, all they do is create \"enemies\" of your fellow Americans -- who pledge their allegiance to the same flag, and who fight for the same liberties we all love and cherish. And yes -- we should all be Independents. Personally, the day I chose to leave the democrats in 2004 to be a registered \"non-partisan\" was like being released from jail. I didn't have the knee-jerk reaction of feeling I HAD to defend that party; nor did I have the knee-jerk reaction of feeling ashamed of having a conservative/republican opinion, and voicing it out loud. Now ... both sides hate me!",
        "threadID": "672198221_9440087322001",
        "time": "2009-05-20 12:14:00",
        "title": "General Powell Hits Back at Rush and Cheney",
        "userID": "1WW"
    },
    {
        "content": "quote: Originally posted by 1WW: quote: Originally posted by Anbar7: You are correct, but if I believe in one system the other system is my \"enemy\". Not the same enemy as a hadji, but a political enemy nonetheless. Every American shoudl vote for who is better, but then we wouldn't have political parties to be affiliated with now would we? We would all be Indys See, IMO, this sort of thinking drives me nuts. Why SHOULD we have political parties? What, really, is their use? Brain washing? Making money? IMO, all they do is create \"enemies\" of your fellow Americans -- who pledge their allegiance to the same flag, and who fight for the same liberties we all love and cherish. And yes -- we should all be Independents. Personally, the day I chose to leave the democrats in 2004 to be a registered \"non-partisan\" was like being released from jail. I didn't have the knee-jerk reaction of feeling I HAD to defend that party; nor did I have the knee-jerk reaction of feeling ashamed of having a conservative/republican opinion, and voicing it out loud. Now ... both sides hate me! The only real purpose they serve is for checks and balances, but as we can see now, they don't work. I also believe that we should all be independents and vote for who we want and believe whatever we want. I only stay Repub so I can vote for who I think should run for the party. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "intTime": 20090520,
        "postID": 31,
        "quote": "Originally posted by 1WW: quote: Originally posted by Anbar7: You are correct, but if I believe in one system the other system is my \"enemy\". Not the same enemy as a hadji, but a political enemy nonetheless. Every American shoudl vote for who is better, but then we wouldn't have political parties to be affiliated with now would we? We would all be Indys See, IMO, this sort of thinking drives me nuts. Why SHOULD we have political parties? What, really, is their use? Brain washing? Making money? IMO, all they do is create \"enemies\" of your fellow Americans -- who pledge their allegiance to the same flag, and who fight for the same liberties we all love and cherish. And yes -- we should all be Independents. Personally, the day I chose to leave the democrats in 2004 to be a registered \"non-partisan\" was like being released from jail. I didn't have the knee-jerk reaction of feeling I HAD to defend that party; nor did I have the knee-jerk reaction of feeling ashamed of having a conservative/republican opinion, and voicing it out loud. Now ... both sides hate me!",
        "reply": " The only real purpose they serve is for checks and balances, but as we can see now, they don't work. I also believe that we should all be independents and vote for who we want and believe whatever we want. I only stay Repub so I can vote for who I think should run for the party. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "threadID": "672198221_9440087322001",
        "time": "2009-05-20 12:18:00",
        "title": "General Powell Hits Back at Rush and Cheney",
        "userID": "Anbar7"
    },
    {
        "content": "My take on Powell is that he had very different ideas about the Republican party than Bush and Cheney did. So after being told to go to the UN and tell the assembley that Saddam had WMD's, and later find out that he didn't; Powell probably got disolusioned. He probably got disolusioned with a lot of things about the 2000-08 Republican party, I know I sure did. I don't blame him for endorsing Obama. The thing with that was that he was in a no win situation. If he'd endorsed McCain every black person in America would be calling him an Uncle Tom. Now he's a traitor to the GOP. In reality, I believe that Powell was sick of the neocons and realized he personally felt it was time for something different.",
        "intTime": 20090520,
        "postID": 32,
        "quote": "",
        "reply": "My take on Powell is that he had very different ideas about the Republican party than Bush and Cheney did. So after being told to go to the UN and tell the assembley that Saddam had WMD's, and later find out that he didn't; Powell probably got disolusioned. He probably got disolusioned with a lot of things about the 2000-08 Republican party, I know I sure did. I don't blame him for endorsing Obama. The thing with that was that he was in a no win situation. If he'd endorsed McCain every black person in America would be calling him an Uncle Tom. Now he's a traitor to the GOP. In reality, I believe that Powell was sick of the neocons and realized he personally felt it was time for something different.",
        "threadID": "672198221_9440087322001",
        "time": "2009-05-20 12:25:00",
        "title": "General Powell Hits Back at Rush and Cheney",
        "userID": "foxred03"
    },
    {
        "content": "quote: Originally posted by foxred03: The thing with that was that he was in a no win situation. If he'd endorsed McCain every black person in America would be calling him an Uncle Tom. Did you forget that Obama was called an Uncle Tom and he wasn't black enough? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "intTime": 20090520,
        "postID": 33,
        "quote": "Originally posted by foxred03: The thing with that was that he was in a no win situation. If he'd endorsed McCain every black person in America would be calling him an Uncle Tom.",
        "reply": " Did you forget that Obama was called an Uncle Tom and he wasn't black enough? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "threadID": "672198221_9440087322001",
        "time": "2009-05-20 12:27:00",
        "title": "General Powell Hits Back at Rush and Cheney",
        "userID": "Anbar7"
    },
    {
        "content": "No I didn't.",
        "intTime": 20090520,
        "postID": 34,
        "quote": "",
        "reply": "No I didn't.",
        "threadID": "672198221_9440087322001",
        "time": "2009-05-20 12:36:00",
        "title": "General Powell Hits Back at Rush and Cheney",
        "userID": "foxred03"
    },
    {
        "content": "quote: Originally posted by foxred03: My take on Powell is that he had very different ideas about the Republican party than Bush and Cheney did. So after being told to go to the UN and tell the assembley that Saddam had WMD's, and later find out that he didn't; Powell probably got disolusioned. He probably got disolusioned with a lot of things about the 2000-08 Republican party, I know I sure did. I don't blame him for endorsing Obama. The thing with that was that he was in a no win situation. If he'd endorsed McCain every black person in America would be calling him an Uncle Tom. Now he's a traitor to the GOP. In reality, I believe that Powell was sick of the neocons and realized he personally felt it was time for something different. Powell has already been called an Uncle Tom. The reason I lost respect for him is because he supported Obama but really couldn't give solid reasons why he supported Obama. That leaves plenty to the imagination on why he really endorsed and voted for him.",
        "intTime": 20090520,
        "postID": 35,
        "quote": "Originally posted by foxred03: My take on Powell is that he had very different ideas about the Republican party than Bush and Cheney did. So after being told to go to the UN and tell the assembley that Saddam had WMD's, and later find out that he didn't; Powell probably got disolusioned. He probably got disolusioned with a lot of things about the 2000-08 Republican party, I know I sure did. I don't blame him for endorsing Obama. The thing with that was that he was in a no win situation. If he'd endorsed McCain every black person in America would be calling him an Uncle Tom. Now he's a traitor to the GOP. In reality, I believe that Powell was sick of the neocons and realized he personally felt it was time for something different.",
        "reply": " Powell has already been called an Uncle Tom. The reason I lost respect for him is because he supported Obama but really couldn't give solid reasons why he supported Obama. That leaves plenty to the imagination on why he really endorsed and voted for him.",
        "threadID": "672198221_9440087322001",
        "time": "2009-05-20 12:47:00",
        "title": "General Powell Hits Back at Rush and Cheney",
        "userID": "stec74"
    },
    {
        "content": "++http://www.boston.com/news/nation/articles/2008/10/20/powells_backing_new_funds_lift_obama/ The reasons Powell gives here are as \"solid\" as anything similar I've heard.",
        "intTime": 20090520,
        "postID": 36,
        "quote": "",
        "reply": "++http://www.boston.com/news/nation/articles/2008/10/20/powells_backing_new_funds_lift_obama/ The reasons Powell gives here are as \"solid\" as anything similar I've heard.",
        "threadID": "672198221_9440087322001",
        "time": "2009-05-20 12:51:00",
        "title": "General Powell Hits Back at Rush and Cheney",
        "userID": "foxred03"
    },
    {
        "content": "Powell put his reputation on the line for Bush when he went to the UN and spoke of the certainty that there were WMDs in Saddam's Iraq. His more current opinions, whether one agrees with him or not, are reasonable and representative of those of a large segment of the Republican Party. Rush Limbaugh's and Dick Cheney's criticisms are unreasonable and unjust. These two ranting idiots do more damage to the Republican Party than they do to Colin Powell. Let Rush and Cheney rant on -- they'll alienate more good Americans from the Republican Party.",
        "intTime": 20090520,
        "postID": 37,
        "quote": "",
        "reply": "Powell put his reputation on the line for Bush when he went to the UN and spoke of the certainty that there were WMDs in Saddam's Iraq. His more current opinions, whether one agrees with him or not, are reasonable and representative of those of a large segment of the Republican Party. Rush Limbaugh's and Dick Cheney's criticisms are unreasonable and unjust. These two ranting idiots do more damage to the Republican Party than they do to Colin Powell. Let Rush and Cheney rant on -- they'll alienate more good Americans from the Republican Party.",
        "threadID": "672198221_9440087322001",
        "time": "2009-05-20 13:01:00",
        "title": "General Powell Hits Back at Rush and Cheney",
        "userID": "fnewt"
    },
    {
        "content": "quote: Originally posted by foxred03: ++http://www.boston.com/news/nation/articles/2008/10/20/powells_backing_new_funds_lift_obama/ The reasons Powell gives here are as \"solid\" as anything similar I've heard. Solid reasons? quote: I come to the conclusion that because of his ability to inspire, because of the inclusive nature of his campaign, because he is reaching out all across America, because of who he is and his rhetorical abilities -- and you have to take that into account -- as well as his substance -- he has both style and substance,\" Powell said. \"He has met the standard of being a successful president, being an exceptional president.\" So based off Powell's standards Tony Robbins would be a good President. What issues does he agree with Obama on? What policies of Obama's did he think were good ideas?",
        "intTime": 20090520,
        "postID": 38,
        "quote": "Originally posted by foxred03: ++http://www.boston.com/news/nation/articles/2008/10/20/powells_backing_new_funds_lift_obama/ The reasons Powell gives here are as \"solid\" as anything similar I've heard.",
        "reply": " Solid reasons? quote: I come to the conclusion that because of his ability to inspire, because of the inclusive nature of his campaign, because he is reaching out all across America, because of who he is and his rhetorical abilities -- and you have to take that into account -- as well as his substance -- he has both style and substance,\" Powell said. \"He has met the standard of being a successful president, being an exceptional president.\" So based off Powell's standards Tony Robbins would be a good President. What issues does he agree with Obama on? What policies of Obama's did he think were good ideas?",
        "threadID": "672198221_9440087322001",
        "time": "2009-05-20 13:01:00",
        "title": "General Powell Hits Back at Rush and Cheney",
        "userID": "stec74"
    },
    {
        "content": "\"http://www.boston.com/news/politics/politicalintelligence/2009/05/powell_to_rush.html\" The General WILL win this. It's the Republican's only chance of relevance and respect in not only the short, but the long run. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson",
        "intTime": 20090520,
        "postID": 39,
        "quote": "",
        "reply": "\"http://www.boston.com/news/politics/politicalintelligence/2009/05/powell_to_rush.html\" The General WILL win this. It's the Republican's only chance of relevance and respect in not only the short, but the long run. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson",
        "threadID": "672198221_9440087322001",
        "time": "2009-05-20 11:22:00",
        "title": "General Powell Hits Back at Rush and Cheney",
        "userID": "jack_flats"
    },
    {
        "content": "Powell backstabbed the Repubs. But I do agree that there needs to be a different party. The radicals that have hijacked it are out of their mind. I don't think Powell is the one to bring back the Repubs, but hey every little bit helps. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "intTime": 20090520,
        "postID": 40,
        "quote": "",
        "reply": "Powell backstabbed the Repubs. But I do agree that there needs to be a different party. The radicals that have hijacked it are out of their mind. I don't think Powell is the one to bring back the Repubs, but hey every little bit helps. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "threadID": "672198221_9440087322001",
        "time": "2009-05-20 11:27:00",
        "title": "General Powell Hits Back at Rush and Cheney",
        "userID": "Anbar7"
    },
    {
        "content": "Good for him, as a citizen he is entitled to his Opinion. Mine is Powells an azzhat backstabber. I trust Powell as far as I can throw a Connex",
        "intTime": 20090520,
        "postID": 41,
        "quote": "",
        "reply": "Good for him, as a citizen he is entitled to his Opinion. Mine is Powells an azzhat backstabber. I trust Powell as far as I can throw a Connex",
        "threadID": "672198221_9440087322001",
        "time": "2009-05-20 11:28:00",
        "title": "General Powell Hits Back at Rush and Cheney",
        "userID": "LineDoggie"
    },
    {
        "content": "He shouldn’t have even dignified them with a response. Anbar7, Are you saying everybody should vote according to party lines, regardless of candidates? \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe",
        "intTime": 20090520,
        "postID": 42,
        "quote": "",
        "reply": "He shouldn’t have even dignified them with a response. Anbar7, Are you saying everybody should vote according to party lines, regardless of candidates? \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe",
        "threadID": "672198221_9440087322001",
        "time": "2009-05-20 11:39:00",
        "title": "General Powell Hits Back at Rush and Cheney",
        "userID": "NSNN"
    },
    {
        "content": "quote: Originally posted by NSNN: He shouldn’t have even dignified them with a response. Anbar7, Are you saying everybody should vote according to party lines, regardless of candidates? No, I'm not. I'm saying if you are a prominent figure within your party you don't back the enemy. You stay support your party. If you don't want to support your party, become an independent. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "intTime": 20090520,
        "postID": 43,
        "quote": "Originally posted by NSNN: He shouldn’t have even dignified them with a response. Anbar7, Are you saying everybody should vote according to party lines, regardless of candidates?",
        "reply": " No, I'm not. I'm saying if you are a prominent figure within your party you don't back the enemy. You stay support your party. If you don't want to support your party, become an independent. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "threadID": "672198221_9440087322001",
        "time": "2009-05-20 11:44:00",
        "title": "General Powell Hits Back at Rush and Cheney",
        "userID": "Anbar7"
    },
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by NSNN: He shouldn’t have even dignified them with a response. Anbar7, Are you saying everybody should vote according to party lines, regardless of candidates? No, I'm not. I'm saying if you are a prominent figure within your party you don't back the enemy. You stay support your party. If you don't want to support your party, become an independent. The real enemy is the notion that the other party is in any shape or form the “enemy”! A person should vote for who ever they think will be better for the entire country, not just his or her political party! As a matter of fact, every American has a moral right obligation to do the same! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe",
        "intTime": 20090520,
        "postID": 44,
        "quote": "Originally posted by Anbar7: quote: Originally posted by NSNN: He shouldn’t have even dignified them with a response. Anbar7, Are you saying everybody should vote according to party lines, regardless of candidates? No, I'm not. I'm saying if you are a prominent figure within your party you don't back the enemy. You stay support your party. If you don't want to support your party, become an independent.",
        "reply": " The real enemy is the notion that the other party is in any shape or form the “enemy”! A person should vote for who ever they think will be better for the entire country, not just his or her political party! As a matter of fact, every American has a moral right obligation to do the same! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe",
        "threadID": "672198221_9440087322001",
        "time": "2009-05-20 11:49:00",
        "title": "General Powell Hits Back at Rush and Cheney",
        "userID": "NSNN"
    },
    {
        "content": "quote: Originally posted by NSNN: quote: Originally posted by Anbar7: quote: Originally posted by NSNN: He shouldn’t have even dignified them with a response. Anbar7, Are you saying everybody should vote according to party lines, regardless of candidates? No, I'm not. I'm saying if you are a prominent figure within your party you don't back the enemy. You stay support your party. If you don't want to support your party, become an independent. The real enemy is the notion that the other party is in any shape or form the “enemy”! A person should vote for who ever they think will be better for the entire country, not just his or her political party! As a matter of fact, every American has a moral right obligation to do the same! You are correct, but if I believe in one system the other system is my \"enemy\". Not the same enemy as a hadji, but a political enemy nonetheless. Every American shoudl vote for who is better, but then we wouldn't have political parties to be affiliated with now would we? We would all be Indys \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "intTime": 20090520,
        "postID": 45,
        "quote": "Originally posted by NSNN: quote: Originally posted by Anbar7: quote: Originally posted by NSNN: He shouldn’t have even dignified them with a response. Anbar7, Are you saying everybody should vote according to party lines, regardless of candidates? No, I'm not. I'm saying if you are a prominent figure within your party you don't back the enemy. You stay support your party. If you don't want to support your party, become an independent. The real enemy is the notion that the other party is in any shape or form the “enemy”! A person should vote for who ever they think will be better for the entire country, not just his or her political party! As a matter of fact, every American has a moral right obligation to do the same!",
        "reply": " You are correct, but if I believe in one system the other system is my \"enemy\". Not the same enemy as a hadji, but a political enemy nonetheless. Every American shoudl vote for who is better, but then we wouldn't have political parties to be affiliated with now would we? We would all be Indys \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "threadID": "672198221_9440087322001",
        "time": "2009-05-20 11:54:00",
        "title": "General Powell Hits Back at Rush and Cheney",
        "userID": "Anbar7"
    },
    {
        "content": "quote: Originally posted by klassylady25: He's a republican by registration and a rino by heart. When was the last time he did anything to help out his party? He backed O, he voted O, and he's waiting for the GOP to be revived without lifting a finger? Why? What's his point? Without lifting a finger? You been living in a cave? \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson",
        "intTime": 20090520,
        "postID": 46,
        "quote": "Originally posted by klassylady25: He's a republican by registration and a rino by heart. When was the last time he did anything to help out his party? He backed O, he voted O, and he's waiting for the GOP to be revived without lifting a finger? Why? What's his point?",
        "reply": " Without lifting a finger? You been living in a cave? \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson",
        "threadID": "672198221_9440087322001",
        "time": "2009-05-20 12:01:00",
        "title": "General Powell Hits Back at Rush and Cheney",
        "userID": "jack_flats"
    },
    {
        "content": "The days of Rush and Cheney's influence on the republican party is coming to an end It's the Gen. Powell's and the Meghan McCain types who will be the big winners here. It has to be. Otherwise the republican's will just keep on losing elections. Listen to the new people people republican fossil hardliners. It's your only hope again for relevance and respect. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson",
        "intTime": 20090520,
        "postID": 47,
        "quote": "",
        "reply": "The days of Rush and Cheney's influence on the republican party is coming to an end It's the Gen. Powell's and the Meghan McCain types who will be the big winners here. It has to be. Otherwise the republican's will just keep on losing elections. Listen to the new people people republican fossil hardliners. It's your only hope again for relevance and respect. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson",
        "threadID": "672198221_9440087322001",
        "time": "2009-05-20 12:04:00",
        "title": "General Powell Hits Back at Rush and Cheney",
        "userID": "jack_flats"
    },
    {
        "content": "quote: Originally posted by Anbar7: Every American shoudl vote for who is better, but then we wouldn't have political parties to be affiliated with now would we? We would all be Indys 20 I have already intimated to you the danger of parties in the state, with particular reference to the founding of them on geographical discriminations. Let me now take a more comprehensive view, and warn you in the most solemn manner against the baneful effects of the spirit of party, generally. 21 This spirit, unfortunately, is inseparable from our nature, having its root in the strongest passions of the human mind. It exists under different shapes in all governments, more or less stifled, controlled, or repressed; but, in those of the popular form, it is seen in its greatest rankness, and is truly their worst enemy. 22 The alternate domination of one faction over another, sharpened by the spirit of revenge, natural to party dissension, which in different ages and countries has perpetrated the most horrid enormities, is itself a frightful despotism. But this leads at length to a more formal and permanent despotism. The disorders and miseries, which result, gradually incline the minds of men to seek security and repose in the absolute power of an individual; and sooner or later the chief of some prevailing faction, more able or more fortunate than his competitors, turns this disposition to the purposes of his own elevation, on the ruins of Public Liberty. 23 Without looking forward to an extremity of this kind, (which nevertheless ought not to be entirely out of sight,) the common and continual mischiefs of the spirit of party are sufficient to make it the interest and duty of a wise people to discourage and restrain it. 24 It serves always to distract the Public Councils, and enfeeble the Public Administration. It agitates the Community with ill-founded jealousies and false alarms; kindles the animosity of one part against another, foments occasionally riot and insurrection. It opens the door to foreign influence and corruption, which find a facilitated access to the government itself through the channels of party passions. Thus the policy and the will of one country are subjected to the policy and will of another. 25 There is an opinion, that parties in free countries are useful checks upon the administration of the Government, and serve to keep alive the spirit of Liberty. This within certain limits is probably true; and in Governments of a Monarchical cast, Patriotism may look with indulgence, if not with favor, upon the spirit of party. But in those of the popular character, in Governments purely elective, it is a spirit not to be encouraged. From their natural tendency, it is certain there will always be enough of that spirit for every salutary purpose. And, there being constant danger of excess, the effort ought to be, by force of public opinion, to mitigate and assuage it. A fire not to be quenched, it demands a uniform vigilance to prevent its bursting into a flame, lest, instead of warming, it should consume George Washington's Farewell Address +http://en.wikipedia.org/wiki/George_Washington's_Farewell_Address \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe",
        "intTime": 20090520,
        "postID": 48,
        "quote": "Originally posted by Anbar7: Every American shoudl vote for who is better, but then we wouldn't have political parties to be affiliated with now would we? We would all be Indys",
        "reply": " 20 I have already intimated to you the danger of parties in the state, with particular reference to the founding of them on geographical discriminations. Let me now take a more comprehensive view, and warn you in the most solemn manner against the baneful effects of the spirit of party, generally. 21 This spirit, unfortunately, is inseparable from our nature, having its root in the strongest passions of the human mind. It exists under different shapes in all governments, more or less stifled, controlled, or repressed; but, in those of the popular form, it is seen in its greatest rankness, and is truly their worst enemy. 22 The alternate domination of one faction over another, sharpened by the spirit of revenge, natural to party dissension, which in different ages and countries has perpetrated the most horrid enormities, is itself a frightful despotism. But this leads at length to a more formal and permanent despotism. The disorders and miseries, which result, gradually incline the minds of men to seek security and repose in the absolute power of an individual; and sooner or later the chief of some prevailing faction, more able or more fortunate than his competitors, turns this disposition to the purposes of his own elevation, on the ruins of Public Liberty. 23 Without looking forward to an extremity of this kind, (which nevertheless ought not to be entirely out of sight,) the common and continual mischiefs of the spirit of party are sufficient to make it the interest and duty of a wise people to discourage and restrain it. 24 It serves always to distract the Public Councils, and enfeeble the Public Administration. It agitates the Community with ill-founded jealousies and false alarms; kindles the animosity of one part against another, foments occasionally riot and insurrection. It opens the door to foreign influence and corruption, which find a facilitated access to the government itself through the channels of party passions. Thus the policy and the will of one country are subjected to the policy and will of another. 25 There is an opinion, that parties in free countries are useful checks upon the administration of the Government, and serve to keep alive the spirit of Liberty. This within certain limits is probably true; and in Governments of a Monarchical cast, Patriotism may look with indulgence, if not with favor, upon the spirit of party. But in those of the popular character, in Governments purely elective, it is a spirit not to be encouraged. From their natural tendency, it is certain there will always be enough of that spirit for every salutary purpose. And, there being constant danger of excess, the effort ought to be, by force of public opinion, to mitigate and assuage it. A fire not to be quenched, it demands a uniform vigilance to prevent its bursting into a flame, lest, instead of warming, it should consume George Washington's Farewell Address +http://en.wikipedia.org/wiki/George_Washington's_Farewell_Address \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe",
        "threadID": "672198221_9440087322001",
        "time": "2009-05-20 12:10:00",
        "title": "General Powell Hits Back at Rush and Cheney",
        "userID": "NSNN"
    },
    {
        "content": "quote: Originally posted by Anbar7: You are correct, but if I believe in one system the other system is my \"enemy\". Not the same enemy as a hadji, but a political enemy nonetheless. Every American shoudl vote for who is better, but then we wouldn't have political parties to be affiliated with now would we? We would all be Indys See, IMO, this sort of thinking drives me nuts. Why SHOULD we have political parties? What, really, is their use? Brain washing? Making money? IMO, all they do is create \"enemies\" of your fellow Americans -- who pledge their allegiance to the same flag, and who fight for the same liberties we all love and cherish. And yes -- we should all be Independents. Personally, the day I chose to leave the democrats in 2004 to be a registered \"non-partisan\" was like being released from jail. I didn't have the knee-jerk reaction of feeling I HAD to defend that party; nor did I have the knee-jerk reaction of feeling ashamed of having a conservative/republican opinion, and voicing it out loud. Now ... both sides hate me!",
        "intTime": 20090520,
        "postID": 49,
        "quote": "Originally posted by Anbar7: You are correct, but if I believe in one system the other system is my \"enemy\". Not the same enemy as a hadji, but a political enemy nonetheless. Every American shoudl vote for who is better, but then we wouldn't have political parties to be affiliated with now would we? We would all be Indys",
        "reply": " See, IMO, this sort of thinking drives me nuts. Why SHOULD we have political parties? What, really, is their use? Brain washing? Making money? IMO, all they do is create \"enemies\" of your fellow Americans -- who pledge their allegiance to the same flag, and who fight for the same liberties we all love and cherish. And yes -- we should all be Independents. Personally, the day I chose to leave the democrats in 2004 to be a registered \"non-partisan\" was like being released from jail. I didn't have the knee-jerk reaction of feeling I HAD to defend that party; nor did I have the knee-jerk reaction of feeling ashamed of having a conservative/republican opinion, and voicing it out loud. Now ... both sides hate me!",
        "threadID": "672198221_9440087322001",
        "time": "2009-05-20 12:14:00",
        "title": "General Powell Hits Back at Rush and Cheney",
        "userID": "1WW"
    },
    {
        "content": "quote: Originally posted by 1WW: quote: Originally posted by Anbar7: You are correct, but if I believe in one system the other system is my \"enemy\". Not the same enemy as a hadji, but a political enemy nonetheless. Every American shoudl vote for who is better, but then we wouldn't have political parties to be affiliated with now would we? We would all be Indys See, IMO, this sort of thinking drives me nuts. Why SHOULD we have political parties? What, really, is their use? Brain washing? Making money? IMO, all they do is create \"enemies\" of your fellow Americans -- who pledge their allegiance to the same flag, and who fight for the same liberties we all love and cherish. And yes -- we should all be Independents. Personally, the day I chose to leave the democrats in 2004 to be a registered \"non-partisan\" was like being released from jail. I didn't have the knee-jerk reaction of feeling I HAD to defend that party; nor did I have the knee-jerk reaction of feeling ashamed of having a conservative/republican opinion, and voicing it out loud. Now ... both sides hate me! The only real purpose they serve is for checks and balances, but as we can see now, they don't work. I also believe that we should all be independents and vote for who we want and believe whatever we want. I only stay Repub so I can vote for who I think should run for the party. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "intTime": 20090520,
        "postID": 50,
        "quote": "Originally posted by 1WW: quote: Originally posted by Anbar7: You are correct, but if I believe in one system the other system is my \"enemy\". Not the same enemy as a hadji, but a political enemy nonetheless. Every American shoudl vote for who is better, but then we wouldn't have political parties to be affiliated with now would we? We would all be Indys See, IMO, this sort of thinking drives me nuts. Why SHOULD we have political parties? What, really, is their use? Brain washing? Making money? IMO, all they do is create \"enemies\" of your fellow Americans -- who pledge their allegiance to the same flag, and who fight for the same liberties we all love and cherish. And yes -- we should all be Independents. Personally, the day I chose to leave the democrats in 2004 to be a registered \"non-partisan\" was like being released from jail. I didn't have the knee-jerk reaction of feeling I HAD to defend that party; nor did I have the knee-jerk reaction of feeling ashamed of having a conservative/republican opinion, and voicing it out loud. Now ... both sides hate me!",
        "reply": " The only real purpose they serve is for checks and balances, but as we can see now, they don't work. I also believe that we should all be independents and vote for who we want and believe whatever we want. I only stay Repub so I can vote for who I think should run for the party. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "threadID": "672198221_9440087322001",
        "time": "2009-05-20 12:18:00",
        "title": "General Powell Hits Back at Rush and Cheney",
        "userID": "Anbar7"
    },
    {
        "content": "My take on Powell is that he had very different ideas about the Republican party than Bush and Cheney did. So after being told to go to the UN and tell the assembley that Saddam had WMD's, and later find out that he didn't; Powell probably got disolusioned. He probably got disolusioned with a lot of things about the 2000-08 Republican party, I know I sure did. I don't blame him for endorsing Obama. The thing with that was that he was in a no win situation. If he'd endorsed McCain every black person in America would be calling him an Uncle Tom. Now he's a traitor to the GOP. In reality, I believe that Powell was sick of the neocons and realized he personally felt it was time for something different.",
        "intTime": 20090520,
        "postID": 51,
        "quote": "",
        "reply": "My take on Powell is that he had very different ideas about the Republican party than Bush and Cheney did. So after being told to go to the UN and tell the assembley that Saddam had WMD's, and later find out that he didn't; Powell probably got disolusioned. He probably got disolusioned with a lot of things about the 2000-08 Republican party, I know I sure did. I don't blame him for endorsing Obama. The thing with that was that he was in a no win situation. If he'd endorsed McCain every black person in America would be calling him an Uncle Tom. Now he's a traitor to the GOP. In reality, I believe that Powell was sick of the neocons and realized he personally felt it was time for something different.",
        "threadID": "672198221_9440087322001",
        "time": "2009-05-20 12:25:00",
        "title": "General Powell Hits Back at Rush and Cheney",
        "userID": "foxred03"
    },
    {
        "content": "quote: Originally posted by foxred03: The thing with that was that he was in a no win situation. If he'd endorsed McCain every black person in America would be calling him an Uncle Tom. Did you forget that Obama was called an Uncle Tom and he wasn't black enough? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "intTime": 20090520,
        "postID": 52,
        "quote": "Originally posted by foxred03: The thing with that was that he was in a no win situation. If he'd endorsed McCain every black person in America would be calling him an Uncle Tom.",
        "reply": " Did you forget that Obama was called an Uncle Tom and he wasn't black enough? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "threadID": "672198221_9440087322001",
        "time": "2009-05-20 12:27:00",
        "title": "General Powell Hits Back at Rush and Cheney",
        "userID": "Anbar7"
    },
    {
        "content": "No I didn't.",
        "intTime": 20090520,
        "postID": 53,
        "quote": "",
        "reply": "No I didn't.",
        "threadID": "672198221_9440087322001",
        "time": "2009-05-20 12:36:00",
        "title": "General Powell Hits Back at Rush and Cheney",
        "userID": "foxred03"
    },
    {
        "content": "quote: Originally posted by foxred03: My take on Powell is that he had very different ideas about the Republican party than Bush and Cheney did. So after being told to go to the UN and tell the assembley that Saddam had WMD's, and later find out that he didn't; Powell probably got disolusioned. He probably got disolusioned with a lot of things about the 2000-08 Republican party, I know I sure did. I don't blame him for endorsing Obama. The thing with that was that he was in a no win situation. If he'd endorsed McCain every black person in America would be calling him an Uncle Tom. Now he's a traitor to the GOP. In reality, I believe that Powell was sick of the neocons and realized he personally felt it was time for something different. Powell has already been called an Uncle Tom. The reason I lost respect for him is because he supported Obama but really couldn't give solid reasons why he supported Obama. That leaves plenty to the imagination on why he really endorsed and voted for him.",
        "intTime": 20090520,
        "postID": 54,
        "quote": "Originally posted by foxred03: My take on Powell is that he had very different ideas about the Republican party than Bush and Cheney did. So after being told to go to the UN and tell the assembley that Saddam had WMD's, and later find out that he didn't; Powell probably got disolusioned. He probably got disolusioned with a lot of things about the 2000-08 Republican party, I know I sure did. I don't blame him for endorsing Obama. The thing with that was that he was in a no win situation. If he'd endorsed McCain every black person in America would be calling him an Uncle Tom. Now he's a traitor to the GOP. In reality, I believe that Powell was sick of the neocons and realized he personally felt it was time for something different.",
        "reply": " Powell has already been called an Uncle Tom. The reason I lost respect for him is because he supported Obama but really couldn't give solid reasons why he supported Obama. That leaves plenty to the imagination on why he really endorsed and voted for him.",
        "threadID": "672198221_9440087322001",
        "time": "2009-05-20 12:47:00",
        "title": "General Powell Hits Back at Rush and Cheney",
        "userID": "stec74"
    },
    {
        "content": "++http://www.boston.com/news/nation/articles/2008/10/20/powells_backing_new_funds_lift_obama/ The reasons Powell gives here are as \"solid\" as anything similar I've heard.",
        "intTime": 20090520,
        "postID": 55,
        "quote": "",
        "reply": "++http://www.boston.com/news/nation/articles/2008/10/20/powells_backing_new_funds_lift_obama/ The reasons Powell gives here are as \"solid\" as anything similar I've heard.",
        "threadID": "672198221_9440087322001",
        "time": "2009-05-20 12:51:00",
        "title": "General Powell Hits Back at Rush and Cheney",
        "userID": "foxred03"
    },
    {
        "content": "Powell put his reputation on the line for Bush when he went to the UN and spoke of the certainty that there were WMDs in Saddam's Iraq. His more current opinions, whether one agrees with him or not, are reasonable and representative of those of a large segment of the Republican Party. Rush Limbaugh's and Dick Cheney's criticisms are unreasonable and unjust. These two ranting idiots do more damage to the Republican Party than they do to Colin Powell. Let Rush and Cheney rant on -- they'll alienate more good Americans from the Republican Party.",
        "intTime": 20090520,
        "postID": 56,
        "quote": "",
        "reply": "Powell put his reputation on the line for Bush when he went to the UN and spoke of the certainty that there were WMDs in Saddam's Iraq. His more current opinions, whether one agrees with him or not, are reasonable and representative of those of a large segment of the Republican Party. Rush Limbaugh's and Dick Cheney's criticisms are unreasonable and unjust. These two ranting idiots do more damage to the Republican Party than they do to Colin Powell. Let Rush and Cheney rant on -- they'll alienate more good Americans from the Republican Party.",
        "threadID": "672198221_9440087322001",
        "time": "2009-05-20 13:01:00",
        "title": "General Powell Hits Back at Rush and Cheney",
        "userID": "fnewt"
    },
    {
        "content": "quote: Originally posted by foxred03: ++http://www.boston.com/news/nation/articles/2008/10/20/powells_backing_new_funds_lift_obama/ The reasons Powell gives here are as \"solid\" as anything similar I've heard. Solid reasons? quote: I come to the conclusion that because of his ability to inspire, because of the inclusive nature of his campaign, because he is reaching out all across America, because of who he is and his rhetorical abilities -- and you have to take that into account -- as well as his substance -- he has both style and substance,\" Powell said. \"He has met the standard of being a successful president, being an exceptional president.\" So based off Powell's standards Tony Robbins would be a good President. What issues does he agree with Obama on? What policies of Obama's did he think were good ideas?",
        "intTime": 20090520,
        "postID": 57,
        "quote": "Originally posted by foxred03: ++http://www.boston.com/news/nation/articles/2008/10/20/powells_backing_new_funds_lift_obama/ The reasons Powell gives here are as \"solid\" as anything similar I've heard.",
        "reply": " Solid reasons? quote: I come to the conclusion that because of his ability to inspire, because of the inclusive nature of his campaign, because he is reaching out all across America, because of who he is and his rhetorical abilities -- and you have to take that into account -- as well as his substance -- he has both style and substance,\" Powell said. \"He has met the standard of being a successful president, being an exceptional president.\" So based off Powell's standards Tony Robbins would be a good President. What issues does he agree with Obama on? What policies of Obama's did he think were good ideas?",
        "threadID": "672198221_9440087322001",
        "time": "2009-05-20 13:01:00",
        "title": "General Powell Hits Back at Rush and Cheney",
        "userID": "stec74"
    }
]