[
    {
        "content": "More Ft.Apaches, drive by shoot-em-ups, bad intel night raids and tactically-applied high explosives may not secure anything. Eight years of low intensity lack of success might indicate that more of the same at a high intensity may not work either. The Afghan mission needs a corrective 'mulligan', not more of everything.",
        "intTime": 20090517,
        "postID": 1,
        "quote": "",
        "reply": "More Ft.Apaches, drive by shoot-em-ups, bad intel night raids and tactically-applied high explosives may not secure anything. Eight years of low intensity lack of success might indicate that more of the same at a high intensity may not work either. The Afghan mission needs a corrective 'mulligan', not more of everything.",
        "threadID": "672198221_9150094322001",
        "time": "2009-05-17 07:54:00",
        "title": "Obama Rethinking Troop Levels",
        "userID": "popsiq"
    },
    {
        "content": "quote: Originally posted by klassylady25: Stabalize security in the country? Wow, sounds vaguely familiar. If more are sent in are they going to be scrutinized over ever little move they make? Or are they going to be able to do their job. Not easy to send 17,000 troops into harms way, is it? ----------------------------------------------- http://www.military.com/news/article/obama-early-to-mull-more-troops.html President Barack Obama says he needs to see how fast Afghanistan can be stabilized and led toward a more democratic government before deciding whether more troops are needed. In an interview with Newsweek magazine, Obama said the hardest thing he has had to do so far in his administration was to order 17,000 troops to Afghanistan on top of an estimated 38,000 that were already in Afghanistan. The interview was released on the Web Saturday. He did not rule out the possibility of sending even more troops, while stressing such a decision was premature at this point and that U.S. military action is not the only answer to bringing stability to the region. \"We have to see our military action in the context of a broader effort to stabilize security in the country, allow national elections to take place in Afghanistan and then provide the space for the vital development work that's needed so that a tolerant and open, democratically elected government is considered far more legitimate than a Taliban alternative,\" Obama said. \"My strong view is that we are not going to succeed simply by piling on more and more troops,\" he added. \"The military component is critical to accomplishing that goal, but it is not a sufficient element by itself.\" Obama said he wrestled with his options before making the decision in February to order a surge of troops. He said he was sobered by the idea that many men and women could be harmed but that a surge was unavoidable. \"The starting point was a recognition that the existing trajectory was not working, that the Taliban had made advances, that our presence in Afghanistan was declining in popularity, that the instability along the border region was destabilizing Pakistan as well,\" Obama said. We basically abandoned the place for six years. Not to mention that we made the worst possible choices in local Afghans to run the place. Bascially the US is in a far worse position then we were when we first invaded. At that time we had tremendous support amongst the locals, A discredited bunch of religious fanatics, etc, etc. So after six years of corrupt \"tame\" Fundamentalists, dope dealing war lords, and the inevitable mitakes of being dependant on air power (It was the only force we had left in Afghanistan) the Taliban have made a successful come back. Well, at least the Adults are in charge now, and I hope they can turn things around. Dave",
        "intTime": 20090517,
        "postID": 2,
        "quote": "Originally posted by klassylady25: Stabalize security in the country? Wow, sounds vaguely familiar. If more are sent in are they going to be scrutinized over ever little move they make? Or are they going to be able to do their job. Not easy to send 17,000 troops into harms way, is it? ----------------------------------------------- http://www.military.com/news/article/obama-early-to-mull-more-troops.html President Barack Obama says he needs to see how fast Afghanistan can be stabilized and led toward a more democratic government before deciding whether more troops are needed. In an interview with Newsweek magazine, Obama said the hardest thing he has had to do so far in his administration was to order 17,000 troops to Afghanistan on top of an estimated 38,000 that were already in Afghanistan. The interview was released on the Web Saturday. He did not rule out the possibility of sending even more troops, while stressing such a decision was premature at this point and that U.S. military action is not the only answer to bringing stability to the region. \"We have to see our military action in the context of a broader effort to stabilize security in the country, allow national elections to take place in Afghanistan and then provide the space for the vital development work that's needed so that a tolerant and open, democratically elected government is considered far more legitimate than a Taliban alternative,\" Obama said. \"My strong view is that we are not going to succeed simply by piling on more and more troops,\" he added. \"The military component is critical to accomplishing that goal, but it is not a sufficient element by itself.\" Obama said he wrestled with his options before making the decision in February to order a surge of troops. He said he was sobered by the idea that many men and women could be harmed but that a surge was unavoidable. \"The starting point was a recognition that the existing trajectory was not working, that the Taliban had made advances, that our presence in Afghanistan was declining in popularity, that the instability along the border region was destabilizing Pakistan as well,\" Obama said.",
        "reply": " We basically abandoned the place for six years. Not to mention that we made the worst possible choices in local Afghans to run the place. Bascially the US is in a far worse position then we were when we first invaded. At that time we had tremendous support amongst the locals, A discredited bunch of religious fanatics, etc, etc. So after six years of corrupt \"tame\" Fundamentalists, dope dealing war lords, and the inevitable mitakes of being dependant on air power (It was the only force we had left in Afghanistan) the Taliban have made a successful come back. Well, at least the Adults are in charge now, and I hope they can turn things around. Dave",
        "threadID": "672198221_9150094322001",
        "time": "2009-05-17 08:49:00",
        "title": "Obama Rethinking Troop Levels",
        "userID": "Grachus"
    },
    {
        "content": "quote: Originally posted by klassylady25: IN EARLY 1998, the Clinton administration, following this same logic, prepared for war against Iraq. On February 17, President Clinton spoke on the steps of the Pentagon to explain to the American people why war was necessary. The speech is worth excerpting at length, because it was then and remains today the fundamental case for the invasion of Iraq and the removal of Saddam Hussein from power. (snip) The Clinton administration did not in fact respond. --Robert Kagan & William Kristol Actually while quoting from the Clinton speech, the authors ingeniously snipped away what Clinton suggested as the proper solution. quote: If Saddam rejects peace and we have to use force, our purpose is clear. We want to seriously diminish the threat posed by Iraq's weapons of mass destruction program. We want to seriously reduce his capacity to threaten his neighbors. I am quite confident, from the briefing I have just received from our military leaders, that we can achieve the objective and secure our vital strategic interests. Let me be clear: A military operation cannot destroy all the weapons of mass destruction capacity. But it can and will leave him significantly worse off than he is now in terms of the ability to threaten the world with these weapons or to attack his neighbors. And he will know that the international community continues to have a will to act if and when he threatens again. Following any strike, we will carefully monitor Iraq's activities with all the means at our disposal. If he seeks to rebuild his weapons of mass destruction, we will be prepared to strike him again. The economic sanctions will remain in place until Saddam complies fully with all U.N. resolutions. \"http://www.cnn.com/ALLPOLITICS/1998/02/17/transcripts/clinton.iraq/\" In fact, despite the careful editing of Clintons speech, he NEVER suggested armed invasion. And he did carry out his threats of massive bombings of Iraq. But I wonder that with all the buckets of schid that were tossed at Clinton, why you believe anything that he said? I certainly don't, expecially after the greatest lying campaign in American History to get us to back the Bosnians and Kossovars break up Yugoslavia under the name of stopping another Hitler. Dave",
        "intTime": 20090517,
        "postID": 3,
        "quote": "Originally posted by klassylady25: IN EARLY 1998, the Clinton administration, following this same logic, prepared for war against Iraq. On February 17, President Clinton spoke on the steps of the Pentagon to explain to the American people why war was necessary. The speech is worth excerpting at length, because it was then and remains today the fundamental case for the invasion of Iraq and the removal of Saddam Hussein from power. (snip) The Clinton administration did not in fact respond. --Robert Kagan & William Kristol",
        "reply": " Actually while quoting from the Clinton speech, the authors ingeniously snipped away what Clinton suggested as the proper solution. quote: If Saddam rejects peace and we have to use force, our purpose is clear. We want to seriously diminish the threat posed by Iraq's weapons of mass destruction program. We want to seriously reduce his capacity to threaten his neighbors. I am quite confident, from the briefing I have just received from our military leaders, that we can achieve the objective and secure our vital strategic interests. Let me be clear: A military operation cannot destroy all the weapons of mass destruction capacity. But it can and will leave him significantly worse off than he is now in terms of the ability to threaten the world with these weapons or to attack his neighbors. And he will know that the international community continues to have a will to act if and when he threatens again. Following any strike, we will carefully monitor Iraq's activities with all the means at our disposal. If he seeks to rebuild his weapons of mass destruction, we will be prepared to strike him again. The economic sanctions will remain in place until Saddam complies fully with all U.N. resolutions. \"http://www.cnn.com/ALLPOLITICS/1998/02/17/transcripts/clinton.iraq/\" In fact, despite the careful editing of Clintons speech, he NEVER suggested armed invasion. And he did carry out his threats of massive bombings of Iraq. But I wonder that with all the buckets of schid that were tossed at Clinton, why you believe anything that he said? I certainly don't, expecially after the greatest lying campaign in American History to get us to back the Bosnians and Kossovars break up Yugoslavia under the name of stopping another Hitler. Dave",
        "threadID": "672198221_9150094322001",
        "time": "2009-05-17 10:06:00",
        "title": "Obama Rethinking Troop Levels",
        "userID": "Grachus"
    },
    {
        "content": "quote: Originally posted by klassylady25: That being said, where do you think that the troops will go? Home or Afghanistan? You mean troops currently in Iraq? We're going home for a year then we're scheduled to return to Iraq again.",
        "intTime": 20090517,
        "postID": 4,
        "quote": "Originally posted by klassylady25: That being said, where do you think that the troops will go? Home or Afghanistan?",
        "reply": " You mean troops currently in Iraq? We're going home for a year then we're scheduled to return to Iraq again.",
        "threadID": "672198221_9150094322001",
        "time": "2009-05-17 10:12:00",
        "title": "Obama Rethinking Troop Levels",
        "userID": "mrmixitup"
    },
    {
        "content": "quote: Originally posted by klassylady25: The point being... that the same information that Clinton has was the one that was being passed on the Bush and now on to Obama. Each president is only as good as the intel given at or preceding the time before him. No one knows the future and really, it's hard to tell what's going to happen in the next hour. This is was was known: Here is what was known by 1998 based on Iraq's own admissions: * That in the years immediately prior to the first Gulf War, Iraq produced at least 3.9 tons of VX, a deadly nerve gas, and acquired 805 tons of precursor ingredients for the production of more VX. * That Iraq had produced or imported some 4,000 tons of ingredients to produce other types of poison gas. * That Iraq had produced 8,500 liters of anthrax. * That Iraq had produced 500 bombs fitted with parachutes for the purpose of delivering poison gas or germ payloads. * That Iraq had produced 550 artillery shells filled with mustard gas. * That Iraq had produced or imported 107,500 casings for chemical weapons. * That Iraq had produced at least 157 aerial bombs filled with germ agents. * That Iraq had produced 25 missile warheads containing germ agents (anthrax, aflatoxin, and botulinum). ------------------ Obama now has the same and more information that we never see. He's in the position of knowing the past while considering the present and looking toward the future. Dave and Mixy, that one year... if not very careful can bring on more changes than we all might like to think about. Whatever I think of Mr. Clinton (and that's not much) he didn't get us into an open ended war in Iraq. Scott Ritter, the guy in charge of the inspectors stated catagorically that they destroyed 95 percent of Iraqs weapons, and all of their means for making new ones. He also pointed out that those weapons left, if any, had expired. But this is all besides the point. Even if I granted that Iraq was a threat in the future, the question was how to deal with the threat that actually attacked us, and THAT was Afghanistan. I find it bizzare and beyond belief that we left Afghanistan with the job only barely begun, to go off and, well, basically attack someone ELSE because he didn't like us and said bad things about Georges's mother... Dave",
        "intTime": 20090517,
        "postID": 5,
        "quote": "Originally posted by klassylady25: The point being... that the same information that Clinton has was the one that was being passed on the Bush and now on to Obama. Each president is only as good as the intel given at or preceding the time before him. No one knows the future and really, it's hard to tell what's going to happen in the next hour. This is was was known: Here is what was known by 1998 based on Iraq's own admissions: * That in the years immediately prior to the first Gulf War, Iraq produced at least 3.9 tons of VX, a deadly nerve gas, and acquired 805 tons of precursor ingredients for the production of more VX. * That Iraq had produced or imported some 4,000 tons of ingredients to produce other types of poison gas. * That Iraq had produced 8,500 liters of anthrax. * That Iraq had produced 500 bombs fitted with parachutes for the purpose of delivering poison gas or germ payloads. * That Iraq had produced 550 artillery shells filled with mustard gas. * That Iraq had produced or imported 107,500 casings for chemical weapons. * That Iraq had produced at least 157 aerial bombs filled with germ agents. * That Iraq had produced 25 missile warheads containing germ agents (anthrax, aflatoxin, and botulinum). ------------------ Obama now has the same and more information that we never see. He's in the position of knowing the past while considering the present and looking toward the future. Dave and Mixy, that one year... if not very careful can bring on more changes than we all might like to think about.",
        "reply": " Whatever I think of Mr. Clinton (and that's not much) he didn't get us into an open ended war in Iraq. Scott Ritter, the guy in charge of the inspectors stated catagorically that they destroyed 95 percent of Iraqs weapons, and all of their means for making new ones. He also pointed out that those weapons left, if any, had expired. But this is all besides the point. Even if I granted that Iraq was a threat in the future, the question was how to deal with the threat that actually attacked us, and THAT was Afghanistan. I find it bizzare and beyond belief that we left Afghanistan with the job only barely begun, to go off and, well, basically attack someone ELSE because he didn't like us and said bad things about Georges's mother... Dave",
        "threadID": "672198221_9150094322001",
        "time": "2009-05-17 11:03:00",
        "title": "Obama Rethinking Troop Levels",
        "userID": "Grachus"
    },
    {
        "content": "I'll see your book author and raise you one! Scott Ritter is an opportunist, who was for it before he was against it. Non-important immaterial don't waste your time quoting him. Now the guy you want to quote and Klassy Lady did in a way, the head potentate of all undertable transactions and currently living off his book revenues in Sweden. He and El Baradei was doing every show in town until it got serious in March 2003, finding themselves as the heavies in a class B movie plot they both ran for cover. On the order of \"It's a slam dunk\" Tenet, information that was had, wasn't, but now is. Admittingly, he too was for it, before he was against it, but in both cases, the American administration broke their rice bowls. They had no more inspections to find nothing because the failed miserably and in a way lucky, they can blame a U S President. But then go find a legitimate job. U S Congress voted for Regime change in the middle east, (twice) Secretary Powell got famous by paraphasing it into democracy in the dictator middle east, and when its proven effective, the naysayers are still moaning. Anyhow: \"One might have expected,\" Mr. Blix wrote, that Iraq would have explained the following: - Evidence that it had tried to put VX, the deadliest form of nerve gas, into weapon-usable form. - One thousand tons of poison gas contained in 6,500 missing chemical bombs. - Several thousand missing rocket warheads for carrying poison gas. - Some 8,500 missing liters of anthrax and enough growth media to produce 5,000 liters more. - The illegal import of 300 rocket engines and other components for ballistic missiles. - Illegal tests of long-range missiles that Iraq is not supposed to possess. - Three-thousand pages of undeclared documents on the enrichment of uranium at the home of an Iraqi nuclear-weapon scientist. This is a terrifying list of destructive potential to leave in the hands of someone like Saddam Hussein. Failing to account for it is a lack of cooperation on \"substance,\" and surely a material breach of Iraq's obligations. But Mr. Blix is unable to say so. The report deliberately avoids taking any position on this point. The implication, however, is clear: With no progress on substance - that is, disarmament - the cooperation on process is irrelevant. \"http://www.iraqwatch.org/wmd/hansirrelevant.htm",
        "intTime": 20090517,
        "postID": 6,
        "quote": "",
        "reply": "I'll see your book author and raise you one! Scott Ritter is an opportunist, who was for it before he was against it. Non-important immaterial don't waste your time quoting him. Now the guy you want to quote and Klassy Lady did in a way, the head potentate of all undertable transactions and currently living off his book revenues in Sweden. He and El Baradei was doing every show in town until it got serious in March 2003, finding themselves as the heavies in a class B movie plot they both ran for cover. On the order of \"It's a slam dunk\" Tenet, information that was had, wasn't, but now is. Admittingly, he too was for it, before he was against it, but in both cases, the American administration broke their rice bowls. They had no more inspections to find nothing because the failed miserably and in a way lucky, they can blame a U S President. But then go find a legitimate job. U S Congress voted for Regime change in the middle east, (twice) Secretary Powell got famous by paraphasing it into democracy in the dictator middle east, and when its proven effective, the naysayers are still moaning. Anyhow: \"One might have expected,\" Mr. Blix wrote, that Iraq would have explained the following: - Evidence that it had tried to put VX, the deadliest form of nerve gas, into weapon-usable form. - One thousand tons of poison gas contained in 6,500 missing chemical bombs. - Several thousand missing rocket warheads for carrying poison gas. - Some 8,500 missing liters of anthrax and enough growth media to produce 5,000 liters more. - The illegal import of 300 rocket engines and other components for ballistic missiles. - Illegal tests of long-range missiles that Iraq is not supposed to possess. - Three-thousand pages of undeclared documents on the enrichment of uranium at the home of an Iraqi nuclear-weapon scientist. This is a terrifying list of destructive potential to leave in the hands of someone like Saddam Hussein. Failing to account for it is a lack of cooperation on \"substance,\" and surely a material breach of Iraq's obligations. But Mr. Blix is unable to say so. The report deliberately avoids taking any position on this point. The implication, however, is clear: With no progress on substance - that is, disarmament - the cooperation on process is irrelevant. \"http://www.iraqwatch.org/wmd/hansirrelevant.htm",
        "threadID": "672198221_9150094322001",
        "time": "2009-05-17 11:40:00",
        "title": "Obama Rethinking Troop Levels",
        "userID": "rayevinsonsr"
    },
    {
        "content": "We are going to win this war in Afghanistan if it takes us 10 years and 50,000 more troops. We need to put these Taliban troops into our jails and shave off their beards and head hair. Lights out every night by 21:30 hours.",
        "intTime": 20090517,
        "postID": 7,
        "quote": "",
        "reply": "We are going to win this war in Afghanistan if it takes us 10 years and 50,000 more troops. We need to put these Taliban troops into our jails and shave off their beards and head hair. Lights out every night by 21:30 hours.",
        "threadID": "672198221_9150094322001",
        "time": "2009-05-17 16:06:00",
        "title": "Obama Rethinking Troop Levels",
        "userID": "Duster6"
    },
    {
        "content": "quote: Originally posted by klassylady25: Here is what was known by 1998 based on Iraq's own admissions: Yea, we also knew that was all B.S. to make Iran think they had all that. They didn't. And anyone who had the least bit of sense also knew they didn't.",
        "intTime": 20090517,
        "postID": 8,
        "quote": "Originally posted by klassylady25: Here is what was known by 1998 based on Iraq's own admissions:",
        "reply": " Yea, we also knew that was all B.S. to make Iran think they had all that. They didn't. And anyone who had the least bit of sense also knew they didn't.",
        "threadID": "672198221_9150094322001",
        "time": "2009-05-17 16:10:00",
        "title": "Obama Rethinking Troop Levels",
        "userID": "mrmixitup"
    },
    {
        "content": "quote: Originally posted by rayevinsonsr: I'll see your book author and raise you one! Scott Ritter is an opportunist, who was for it before he was against it. Non-important immaterial don't waste your time quoting him. I love the way someones opinion doesn't count if they write a book. Obviously the only reason they write a book is to get rich... And let's just dismiss the FACT that everything Ritter said turned out to be true. One would think you would at least have the decency to say that he was wrong - Unfortunately you can't say that - Why not call this ex Marine, former member of the Republican Party as an Al Qaeda loving hippie, who just couldn't face up to reality... Dave",
        "intTime": 20090517,
        "postID": 9,
        "quote": "Originally posted by rayevinsonsr: I'll see your book author and raise you one! Scott Ritter is an opportunist, who was for it before he was against it. Non-important immaterial don't waste your time quoting him.",
        "reply": " I love the way someones opinion doesn't count if they write a book. Obviously the only reason they write a book is to get rich... And let's just dismiss the FACT that everything Ritter said turned out to be true. One would think you would at least have the decency to say that he was wrong - Unfortunately you can't say that - Why not call this ex Marine, former member of the Republican Party as an Al Qaeda loving hippie, who just couldn't face up to reality... Dave",
        "threadID": "672198221_9150094322001",
        "time": "2009-05-17 16:36:00",
        "title": "Obama Rethinking Troop Levels",
        "userID": "Grachus"
    },
    {
        "content": "It seams that this whole thread is off topic. In the begining it was about afganistan and the troop levels right? Well I dont know if an increase in troop levels will work but I do know they all we seem to be doing is pushing the enemy from one area to another. In the end it comes down to the same problem we are facing in Iraq. That problem would be the fact of the Locals being a big part of the problem. with out them working with us then it wont matter.",
        "intTime": 20090517,
        "postID": 10,
        "quote": "",
        "reply": "It seams that this whole thread is off topic. In the begining it was about afganistan and the troop levels right? Well I dont know if an increase in troop levels will work but I do know they all we seem to be doing is pushing the enemy from one area to another. In the end it comes down to the same problem we are facing in Iraq. That problem would be the fact of the Locals being a big part of the problem. with out them working with us then it wont matter.",
        "threadID": "672198221_9150094322001",
        "time": "2009-05-17 19:49:00",
        "title": "Obama Rethinking Troop Levels",
        "userID": "Usamp27"
    },
    {
        "content": "quote: Originally posted by Usamp27: It seams that this whole thread is off topic. In the begining it was about afganistan and the troop levels right? Well I dont know if an increase in troop levels will work but I do know they all we seem to be doing is pushing the enemy from one area to another. In the end it comes down to the same problem we are facing in Iraq. That problem would be the fact of the Locals being a big part of the problem. with out them working with us then it wont matter. There scared to them we are like the soviets. they don't know who to trust at night Taliban cames in and beats and scares the heck out of them. During the day they only see the rifles you all carry.",
        "intTime": 20090520,
        "postID": 11,
        "quote": "Originally posted by Usamp27: It seams that this whole thread is off topic. In the begining it was about afganistan and the troop levels right? Well I dont know if an increase in troop levels will work but I do know they all we seem to be doing is pushing the enemy from one area to another. In the end it comes down to the same problem we are facing in Iraq. That problem would be the fact of the Locals being a big part of the problem. with out them working with us then it wont matter.",
        "reply": " There scared to them we are like the soviets. they don't know who to trust at night Taliban cames in and beats and scares the heck out of them. During the day they only see the rifles you all carry.",
        "threadID": "672198221_9150094322001",
        "time": "2009-05-20 00:33:00",
        "title": "Obama Rethinking Troop Levels",
        "userID": "world_king377"
    }
]