[
    {
        "content": "\"http://www.thebostonchannel.com/cnn-news/19034811/detail.html\" quote: MIDDLEBOROUGH, Mass. -- A woman was viciously attacked in broad daylight Friday afternoon on a heavily traveled road, while other drivers passed by without stopping. The woman, in her mid-40s, was knocked unconscious, brutalized and sexually assaulted after pulling over on Route 28 in Middleborough after a fender bender, police said. Watch Report The woman was knocked unconscious and brutalized after pulling over. The attack, which began about 4:30 p.m., lasted for more than 10 minutes. \"She was definitely violently assaulted,\" said Middleborough police Lt. Charles Armanetti. Surveillance video shows the victim driving by before the attack. Surveillance video from a nearby gas station shows the victim driving on Route 28, followed by what police believe to be the attacker's car. Minutes later, the woman's car was bumped from behind. When she pulled over, the man got out of his car and began the attack. \"Within that 12-minute time frame, in heavy traffic, this individual got out of his car and attacked the woman,\" Armanetti said. \"At that point she went unconscious, and that's all she remembers.\" When police arrived, the man and his car were gone, and the woman was found unconscious. She was revived and taken to a nearby hospital. Armanetti said they received only one 911 call from a driver who stopped to help after the man had left. Police received only one 911 call from a driver who stopped to help after the man had left. The attacker is still at large and is described as a white man in a dark, zippered coat driving a dark-colored sedan. What a shame people have come the this.", 
        "intTime": 20090328, 
        "postID": 1, 
        "quote": "MIDDLEBOROUGH, Mass. -- A woman was viciously attacked in broad daylight Friday afternoon on a heavily traveled road, while other drivers passed by without stopping. The woman, in her mid-40s, was knocked unconscious, brutalized and sexually assaulted after pulling over on Route 28 in Middleborough after a fender bender, police said. Watch Report The woman was knocked unconscious and brutalized after pulling over. The attack, which began about 4:30 p.m., lasted for more than 10 minutes. \"She was definitely violently assaulted,\" said Middleborough police Lt. Charles Armanetti. Surveillance video shows the victim driving by before the attack. Surveillance video from a nearby gas station shows the victim driving on Route 28, followed by what police believe to be the attacker's car. Minutes later, the woman's car was bumped from behind. When she pulled over, the man got out of his car and began the attack. \"Within that 12-minute time frame, in heavy traffic, this individual got out of his car and attacked the woman,\" Armanetti said. \"At that point she went unconscious, and that's all she remembers.\" When police arrived, the man and his car were gone, and the woman was found unconscious. She was revived and taken to a nearby hospital. Armanetti said they received only one 911 call from a driver who stopped to help after the man had left. Police received only one 911 call from a driver who stopped to help after the man had left. The attacker is still at large and is described as a white man in a dark, zippered coat driving a dark-colored sedan.", 
        "reply": "\"http://www.thebostonchannel.com/cnn-news/19034811/detail.html\"  What a shame people have come the this.", 
        "threadID": "672198221_1400032912001", 
        "time": "2009-03-28 20:46:00", 
        "title": "Women attacked nobody stops to help", 
        "userID": "CombatNAC"
    }, 
    {
        "content": "Bomb scare divertions to rob banks and a man caught on camera in a dark hodded zipper sweatshirt useing stolen ATM card...All in that immediate area in the last week....Related ??", 
        "intTime": 20090328, 
        "postID": 2, 
        "quote": "", 
        "reply": "Bomb scare divertions to rob banks and a man caught on camera in a dark hodded zipper sweatshirt useing stolen ATM card...All in that immediate area in the last week....Related ??", 
        "threadID": "672198221_1400032912001", 
        "time": "2009-03-28 21:43:00", 
        "title": "Women attacked nobody stops to help", 
        "userID": "OddBall1st"
    }, 
    {
        "content": "One of the many reasons it frustrates me that my New Hampshire Concealed Weapons License is worthless in Mass. If I had seen that happening, I probably would have pulled over and gotten the pooch out of the truck.....praying the guy wasn't armed. Don", 
        "intTime": 20090329, 
        "postID": 3, 
        "quote": "", 
        "reply": "One of the many reasons it frustrates me that my New Hampshire Concealed Weapons License is worthless in Mass. If I had seen that happening, I probably would have pulled over and gotten the pooch out of the truck.....praying the guy wasn't armed. Don", 
        "threadID": "672198221_1400032912001", 
        "time": "2009-03-29 03:54:00", 
        "title": "Women attacked nobody stops to help", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "From what I heard, the incident took place inside the car,...you would have to stop and enter the car to actually see what was occurring,..How many people just stop and get out at every car or cars stopped on the side,..it`s not like she was in the street shouting, The perp knew what and how to do what he did,...and got away with it !! The most dangerous kind !!", 
        "intTime": 20090329, 
        "postID": 4, 
        "quote": "", 
        "reply": "From what I heard, the incident took place inside the car,...you would have to stop and enter the car to actually see what was occurring,..How many people just stop and get out at every car or cars stopped on the side,..it`s not like she was in the street shouting, The perp knew what and how to do what he did,...and got away with it !! The most dangerous kind !!", 
        "threadID": "672198221_1400032912001", 
        "time": "2009-03-29 05:51:00", 
        "title": "Women attacked nobody stops to help", 
        "userID": "OddBall1st"
    }, 
    {
        "content": "If I saw it happening there is no way on this earth I would stand by and do nothing. I have seen this happen before. At Ching Young Village in Hanalei town. A young man was dragging his ex girlfriend by the hair and hitting her as about 15 people looked on and did nothing (mostly tourist). I saw this as I was pulling into the parking lot and did not bother to park my truck. My response was immediate and extremely agressive. He was wanting to get her in his truck but never made it. I first yelled at the bystanders as I was approaching the man telling them what a bunch of p-ss-es they were. The first thing I did when I got to him was rap him up along side his head open handed to get his attention, all the while the women kicking and screaming for help. When this dirtbag turned and saw what he was confronted with and the knowing he could not defend himself while keeping his grasp on her, he released her. He dared not throw a punch, his end was obvious and it took every bit of control I had not to unleash a fury of bone breaking blows on him. Instead I kept him focused on me giving the women time to flee the area. Called 911 and gave them the scoop, dirtbag runs to his drivers side at this point, gets into his truck and huals azz. I follow, there is only one way in and out of the N. shore, Hanalei area. I stayed on line with the police dispatch letting them know where we were as we sped along the back roads, a cop finally cuaght up and I assisted in taking dirtbag into custody. A similer one happened in AZ and this scumbag was armed and threatened to kill me, I disarmed him and proceded to beat the hell out of this one, broke his nose, both cheek bones, his jaw in three places,broke out all his front teeth, broke every rib on the right side of his body and several ribs on the left side. Three months in the hospital for that one and disfigured for life. The Tempe police thanked me and said he was lucky, said they would have killed him. I was fortunate on this one, as scumbag held his gun to my head in the begining, a bystander distracted him,(we were face to face) all I needed was for his eyes to glance away for a split second and thats when I disarmed him while punching him, left hand on the gun and right a hand blow connecting squarely. This scumbag will never pull a gun on someone agian I would hope. Had I had my pistol with me I would have most likely shot him dead right at the git go. I blacked out in rage while beating this scumbag to near death and it took a bystander to break me from the trance I was in. Bystander was yelling at me \"stop, you're going to kill him\" over and over, finally shoved me while I was kicking him in the face with the heels of my cowboy boots. Stoned cold sober, I remember only bits and pieces of the beating, I understand since then how someone says they dont remember a incident becuase of a blackout, like a police officer that has fired several rounds, thinking he has only fired once. Things like this are disgusting when they happen. It is even more disgusting to see people do nothing. Armed or un-armed, I'm in and will do everything and use anything to put a stop to it. Best thing a person can do for themselves and society in general is to always have a pistol either on yourself or close by at all times. Even though Hawaii does not allow concealed carry, I am never far from at minimum a .38 S&W though my favorite is the old standard, a .45 ACP. I don't understand how someone can look on and do nothing, even with the possibility of great physical harm to ones self, it is completely foriegn to me.", 
        "intTime": 20090329, 
        "postID": 5, 
        "quote": "", 
        "reply": "If I saw it happening there is no way on this earth I would stand by and do nothing. I have seen this happen before. At Ching Young Village in Hanalei town. A young man was dragging his ex girlfriend by the hair and hitting her as about 15 people looked on and did nothing (mostly tourist). I saw this as I was pulling into the parking lot and did not bother to park my truck. My response was immediate and extremely agressive. He was wanting to get her in his truck but never made it. I first yelled at the bystanders as I was approaching the man telling them what a bunch of p-ss-es they were. The first thing I did when I got to him was rap him up along side his head open handed to get his attention, all the while the women kicking and screaming for help. When this dirtbag turned and saw what he was confronted with and the knowing he could not defend himself while keeping his grasp on her, he released her. He dared not throw a punch, his end was obvious and it took every bit of control I had not to unleash a fury of bone breaking blows on him. Instead I kept him focused on me giving the women time to flee the area. Called 911 and gave them the scoop, dirtbag runs to his drivers side at this point, gets into his truck and huals azz. I follow, there is only one way in and out of the N. shore, Hanalei area. I stayed on line with the police dispatch letting them know where we were as we sped along the back roads, a cop finally cuaght up and I assisted in taking dirtbag into custody. A similer one happened in AZ and this scumbag was armed and threatened to kill me, I disarmed him and proceded to beat the hell out of this one, broke his nose, both cheek bones, his jaw in three places,broke out all his front teeth, broke every rib on the right side of his body and several ribs on the left side. Three months in the hospital for that one and disfigured for life. The Tempe police thanked me and said he was lucky, said they would have killed him. I was fortunate on this one, as scumbag held his gun to my head in the begining, a bystander distracted him,(we were face to face) all I needed was for his eyes to glance away for a split second and thats when I disarmed him while punching him, left hand on the gun and right a hand blow connecting squarely. This scumbag will never pull a gun on someone agian I would hope. Had I had my pistol with me I would have most likely shot him dead right at the git go. I blacked out in rage while beating this scumbag to near death and it took a bystander to break me from the trance I was in. Bystander was yelling at me \"stop, you're going to kill him\" over and over, finally shoved me while I was kicking him in the face with the heels of my cowboy boots. Stoned cold sober, I remember only bits and pieces of the beating, I understand since then how someone says they dont remember a incident becuase of a blackout, like a police officer that has fired several rounds, thinking he has only fired once. Things like this are disgusting when they happen. It is even more disgusting to see people do nothing. Armed or un-armed, I'm in and will do everything and use anything to put a stop to it. Best thing a person can do for themselves and society in general is to always have a pistol either on yourself or close by at all times. Even though Hawaii does not allow concealed carry, I am never far from at minimum a .38 S&W though my favorite is the old standard, a .45 ACP. I don't understand how someone can look on and do nothing, even with the possibility of great physical harm to ones self, it is completely foriegn to me.", 
        "threadID": "672198221_1400032912001", 
        "time": "2009-03-29 10:55:00", 
        "title": "Women attacked nobody stops to help", 
        "userID": "BAGodbehere"
    }, 
    {
        "content": "This doesn't suprise me. Sean Hannity on Fox news radio proposed a scenario that your female neighbor was being raped and he asked the listeners what they would do and would they physicall try and stop the assault, and all callers said no. They said it is none of their concern and most even said that they would not call the police. They said they would not risk their safety for another. There was a case where a woman was raped and murdered in broad daylight in Central Park while about 40 people watched and did nothing. Central Park is notorious for murders and assaults occurring and no one even bothers calling the police. It is this way through out most of the country.", 
        "intTime": 20090329, 
        "postID": 6, 
        "quote": "", 
        "reply": "This doesn't suprise me. Sean Hannity on Fox news radio proposed a scenario that your female neighbor was being raped and he asked the listeners what they would do and would they physicall try and stop the assault, and all callers said no. They said it is none of their concern and most even said that they would not call the police. They said they would not risk their safety for another. There was a case where a woman was raped and murdered in broad daylight in Central Park while about 40 people watched and did nothing. Central Park is notorious for murders and assaults occurring and no one even bothers calling the police. It is this way through out most of the country.", 
        "threadID": "672198221_1400032912001", 
        "time": "2009-03-29 14:55:00", 
        "title": "Women attacked nobody stops to help", 
        "userID": "qsam6"
    }, 
    {
        "content": "I enjoy watching the British cop videos, you will see British citizens assisting even if doing so puts them in great danger.", 
        "intTime": 20090329, 
        "postID": 7, 
        "quote": "", 
        "reply": "I enjoy watching the British cop videos, you will see British citizens assisting even if doing so puts them in great danger.", 
        "threadID": "672198221_1400032912001", 
        "time": "2009-03-29 14:58:00", 
        "title": "Women attacked nobody stops to help", 
        "userID": "qsam6"
    }
]