[
    {
        "content": "The Pentagon is recruiting non U.S. citizens. It is a fast track way for U.S. citizenship and for volunteers. Thank you very much. Please look more into this if you wish. This information is coming directly from the Pentagon. Schmoopy", 
        "intTime": 20090512, 
        "postID": 1, 
        "quote": "", 
        "reply": "The Pentagon is recruiting non U.S. citizens. It is a fast track way for U.S. citizenship and for volunteers. Thank you very much. Please look more into this if you wish. This information is coming directly from the Pentagon. Schmoopy", 
        "threadID": "672198221_2450011322001", 
        "time": "2009-05-12 07:56:00", 
        "title": "The Pentagon", 
        "userID": "schmoopys"
    }, 
    {
        "content": "quote: Originally posted by schmoopys: The Pentagon is recruiting non U.S. citizens. It is a fast track way for U.S. citizenship and for volunteers. Thank you very much. Please look more into this if you wish. This information is coming directly from the Pentagon. Schmoopy No news here. The United States military has, to the best of my knowledge, always recruited non US citizens. While a member of the US Coast Guard I served with quite a number of citizens of the Philippians and Samoa. In the US Army I served with Australian and British nationals. This has been the pattern throughout US history, so what’s new?", 
        "intTime": 20090512, 
        "postID": 2, 
        "quote": "Originally posted by schmoopys: The Pentagon is recruiting non U.S. citizens. It is a fast track way for U.S. citizenship and for volunteers. Thank you very much. Please look more into this if you wish. This information is coming directly from the Pentagon. Schmoopy", 
        "reply": " No news here. The United States military has, to the best of my knowledge, always recruited non US citizens. While a member of the US Coast Guard I served with quite a number of citizens of the Philippians and Samoa. In the US Army I served with Australian and British nationals. This has been the pattern throughout US history, so what’s new?", 
        "threadID": "672198221_2450011322001", 
        "time": "2009-05-12 08:14:00", 
        "title": "The Pentagon", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "The Pentagon is recruiting overseas because Americans have better things to do than join today's military. Like going to college despite having no idea why you are going, no idea what you want to do when you graduate and no idea how you are going to pay for it. But hey, it's better than the militay! I suggest we contract out 100% of our military to Ugandans. I hear they work for as little as $700 a month, and it's working so well in Iraq.", 
        "intTime": 20090512, 
        "postID": 3, 
        "quote": "", 
        "reply": "The Pentagon is recruiting overseas because Americans have better things to do than join today's military. Like going to college despite having no idea why you are going, no idea what you want to do when you graduate and no idea how you are going to pay for it. But hey, it's better than the militay! I suggest we contract out 100% of our military to Ugandans. I hear they work for as little as $700 a month, and it's working so well in Iraq.", 
        "threadID": "672198221_2450011322001", 
        "time": "2009-05-12 08:18:00", 
        "title": "The Pentagon", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "That would certainly be the Republican answer...outsource the military to the lowest bidder. Cheney tried it (with quite a bit of success) with combat service support (something which WAS organic to the Army since its inception). But then I guess he had a vested interest didn't he? I can't speak for the Active Army but the National Guard isn't having a problem meeting quotas right now...thank corporate America for trashing the economy.", 
        "intTime": 20090512, 
        "postID": 4, 
        "quote": "", 
        "reply": "That would certainly be the Republican answer...outsource the military to the lowest bidder. Cheney tried it (with quite a bit of success) with combat service support (something which WAS organic to the Army since its inception). But then I guess he had a vested interest didn't he? I can't speak for the Active Army but the National Guard isn't having a problem meeting quotas right now...thank corporate America for trashing the economy.", 
        "threadID": "672198221_2450011322001", 
        "time": "2009-05-12 08:25:00", 
        "title": "The Pentagon", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "Our military is totally trashed right now because even after EIGHT YEARS OF WAR we are still trying to fight with a peacetime force. NO ONE SHOULD BE FORCED TO DEPLOY MORE THAN ONCE. NO ONE SHOULD BE DEPLOYED FOR MORE THAN 12 MONTHS AT A TIME. RECRUITERS SHOULD NOT BE KILLING THEMSELVES BECAUSE THEY CAN'T RECRUIT ENOUGH. WE SHOULDN'T BE CONTRACTING OUT 40% OF OUR MILITARY TO CIVILIANS. We need a draft and we need an active Army of 1,000,000. I'm ashamed that we have to resort to contracting to fight and win a war. How pathetic has our nation become.", 
        "intTime": 20090512, 
        "postID": 5, 
        "quote": "", 
        "reply": "Our military is totally trashed right now because even after EIGHT YEARS OF WAR we are still trying to fight with a peacetime force. NO ONE SHOULD BE FORCED TO DEPLOY MORE THAN ONCE. NO ONE SHOULD BE DEPLOYED FOR MORE THAN 12 MONTHS AT A TIME. RECRUITERS SHOULD NOT BE KILLING THEMSELVES BECAUSE THEY CAN'T RECRUIT ENOUGH. WE SHOULDN'T BE CONTRACTING OUT 40% OF OUR MILITARY TO CIVILIANS. We need a draft and we need an active Army of 1,000,000. I'm ashamed that we have to resort to contracting to fight and win a war. How pathetic has our nation become.", 
        "threadID": "672198221_2450011322001", 
        "time": "2009-05-12 08:30:00", 
        "title": "The Pentagon", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: Our military is totally trashed right now because even after EIGHT YEARS OF WAR we are still trying to fight with a peacetime force. NO ONE SHOULD BE FORCED TO DEPLOY MORE THAN ONCE. NO ONE SHOULD BE DEPLOYED FOR MORE THAN 12 MONTHS AT A TIME. RECRUITERS SHOULD NOT BE KILLING THEMSELVES BECAUSE THEY CAN'T RECRUIT ENOUGH. WE SHOULDN'T BE CONTRACTING OUT 40% OF OUR MILITARY TO CIVILIANS. We need a draft and we need an active Army of 1,000,000. I'm ashamed that we have to resort to contracting to fight and win a war. How pathetic has our nation become. Now you're talk'in!", 
        "intTime": 20090512, 
        "postID": 6, 
        "quote": "Originally posted by mrmixitup: Our military is totally trashed right now because even after EIGHT YEARS OF WAR we are still trying to fight with a peacetime force. NO ONE SHOULD BE FORCED TO DEPLOY MORE THAN ONCE. NO ONE SHOULD BE DEPLOYED FOR MORE THAN 12 MONTHS AT A TIME. RECRUITERS SHOULD NOT BE KILLING THEMSELVES BECAUSE THEY CAN'T RECRUIT ENOUGH. WE SHOULDN'T BE CONTRACTING OUT 40% OF OUR MILITARY TO CIVILIANS. We need a draft and we need an active Army of 1,000,000. I'm ashamed that we have to resort to contracting to fight and win a war. How pathetic has our nation become.", 
        "reply": " Now you're talk'in!", 
        "threadID": "672198221_2450011322001", 
        "time": "2009-05-12 08:33:00", 
        "title": "The Pentagon", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "Since we, the United States of America have decided a long time ago to be the self appointed policeman of the world, How in the world are we going to fulfill that role with a very small military when it seems that on the average of every ten years we get involve in a war. We need at least an Army the size of the one during the cold war or around a million. Remember, we are the world policeman, How are we going to protect the world with a peacetime Army?", 
        "intTime": 20090512, 
        "postID": 7, 
        "quote": "", 
        "reply": "Since we, the United States of America have decided a long time ago to be the self appointed policeman of the world, How in the world are we going to fulfill that role with a very small military when it seems that on the average of every ten years we get involve in a war. We need at least an Army the size of the one during the cold war or around a million. Remember, we are the world policeman, How are we going to protect the world with a peacetime Army?", 
        "threadID": "672198221_2450011322001", 
        "time": "2009-05-12 10:59:00", 
        "title": "The Pentagon", 
        "userID": "comestok"
    }, 
    {
        "content": "First we should re-evaluate the self-imposed mission of \"world police force\". Even without that mission, a larger active component would only make sense, especially with our tendency to dabble.", 
        "intTime": 20090512, 
        "postID": 8, 
        "quote": "", 
        "reply": "First we should re-evaluate the self-imposed mission of \"world police force\". Even without that mission, a larger active component would only make sense, especially with our tendency to dabble.", 
        "threadID": "672198221_2450011322001", 
        "time": "2009-05-12 11:02:00", 
        "title": "The Pentagon", 
        "userID": "Ol_Doc"
    }
]