[
    {
        "content": "RE: http://www.military.com/opinion/0,15202,190481,00.html Paul - I noticed you were going to be sitting across from Colbert and decided to stay up late to watch the interview (as I read your editorials and support your efforts to help our vets). Great job, and keep up the good fight. Cheers.",
        "intTime": 20090507,
        "postID": 1,
        "quote": "",
        "reply": "RE: http://www.military.com/opinion/0,15202,190481,00.html Paul - I noticed you were going to be sitting across from Colbert and decided to stay up late to watch the interview (as I read your editorials and support your efforts to help our vets). Great job, and keep up the good fight. Cheers.",
        "threadID": "672198221_9800067222001",
        "time": "2009-05-07 12:48:00",
        "title": "Colbert Steps Into The War Zone",
        "userID": "PolicyWonk"
    },
    {
        "content": "I hate to say this, but its sad when the American people get serious news from a comedian. In my opinion, the American people have tuned out from what the military is doing in Iraq and Afghanistan.",
        "intTime": 20090507,
        "postID": 2,
        "quote": "",
        "reply": "I hate to say this, but its sad when the American people get serious news from a comedian. In my opinion, the American people have tuned out from what the military is doing in Iraq and Afghanistan.",
        "threadID": "672198221_9800067222001",
        "time": "2009-05-07 14:24:00",
        "title": "Colbert Steps Into The War Zone",
        "userID": "Young57"
    },
    {
        "content": "I applaud Mr. Colbert for going over, and I certainly don't want to demean his efforts, but to me it seems like Mr. Rieckoff is making out to be as if he is the first to do anything of the sort. I suppose technically an entire TV show is going to broadcast from overseas, but you do have people like Olly North (as I duck from all the flying tomatoes) who were embedded numerous times during the most volatile periods. And radio hosts have been going over since right after the war began in Iraq. Our local afternoon guy went over about a year after he got on air in our area. I certainly don't want to throw water on Mr. Rieckoff's excitement. I just wish he could have expanded on the many other individuals that have gone in the past in order to bring the real stories home. As Young said it IS sad when a comedian has to make efforts to bring America's attention back to the war. Do any of you guys know if the IAVA does any \"lobbying\" or condemnation of the main stream media's lack of focus and good journalism on the wars?",
        "intTime": 20090507,
        "postID": 3,
        "quote": "",
        "reply": "I applaud Mr. Colbert for going over, and I certainly don't want to demean his efforts, but to me it seems like Mr. Rieckoff is making out to be as if he is the first to do anything of the sort. I suppose technically an entire TV show is going to broadcast from overseas, but you do have people like Olly North (as I duck from all the flying tomatoes) who were embedded numerous times during the most volatile periods. And radio hosts have been going over since right after the war began in Iraq. Our local afternoon guy went over about a year after he got on air in our area. I certainly don't want to throw water on Mr. Rieckoff's excitement. I just wish he could have expanded on the many other individuals that have gone in the past in order to bring the real stories home. As Young said it IS sad when a comedian has to make efforts to bring America's attention back to the war. Do any of you guys know if the IAVA does any \"lobbying\" or condemnation of the main stream media's lack of focus and good journalism on the wars?",
        "threadID": "672198221_9800067222001",
        "time": "2009-05-07 15:01:00",
        "title": "Colbert Steps Into The War Zone",
        "userID": "DevilDog2847"
    },
    {
        "content": "quote: Originally posted by DevilDog2847: I applaud Mr. Colbert for going over, and I certainly don't want to demean his efforts, but to me it seems like Mr. Rieckoff is making out to be as if he is the first to do anything of the sort. I suppose technically an entire TV show is going to broadcast from overseas, but you do have people like Olly North (as I duck from all the flying tomatoes) who were embedded numerous times during the most volatile periods. And radio hosts have been going over since right after the war began in Iraq. Our local afternoon guy went over about a year after he got on air in our area. I certainly don't want to throw water on Mr. Rieckoff's excitement. I just wish he could have expanded on the many other individuals that have gone in the past in order to bring the real stories home. As Young said it IS sad when a comedian has to make efforts to bring America's attention back to the war. Do any of you guys know if the IAVA does any \"lobbying\" or condemnation of the main stream media's lack of focus and good journalism on the wars? Ive been a member of the IAVA for quite some time now, following them from just about their infancy. Most of their efforts that I am aware of -- can't read everything they they print -- are more about lobbying in Congress and the Floor than they are about media matters. In fact, short of the applause for Bill O'Reilly's numerous trips, this is the first time I can recall the IAVA having much, if any, interest in the media trappings of visits to Iraq and Afghanistan. I may very well be wrong and have simply missed Mr. Rieckhoff's attention to media matters, and if I am then I humbly apologize, but to the best of my recollection the IAVA has (had) little interest in media affairs. In the report, Mr. Rieckhoff alludes to the importance of veteran awareness in the public spotlight as many of our men and women will be coming CONUS soon. I agree with this sentiment wholeheartedly. In light of these statements, it's very possible to infer that the IAVA is indeed turning a corner and will be focusing more attention on the pivotal role our mainstream media and editorialists plays in preparing the civilian populace for an influx of combat veterans. If this is the case, which at this time is mere speculation on my part, then I reiterate my applause for the collective efforts of the IAVA. There are many veterans' advocacy groups out there, but truly the IAVA is unsurpassed in their efforts to support our serving soldiers (Airmen, et al) and veterans alike. Richard, Proud IAVA member It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.",
        "intTime": 20090508,
        "postID": 4,
        "quote": "Originally posted by DevilDog2847: I applaud Mr. Colbert for going over, and I certainly don't want to demean his efforts, but to me it seems like Mr. Rieckoff is making out to be as if he is the first to do anything of the sort. I suppose technically an entire TV show is going to broadcast from overseas, but you do have people like Olly North (as I duck from all the flying tomatoes) who were embedded numerous times during the most volatile periods. And radio hosts have been going over since right after the war began in Iraq. Our local afternoon guy went over about a year after he got on air in our area. I certainly don't want to throw water on Mr. Rieckoff's excitement. I just wish he could have expanded on the many other individuals that have gone in the past in order to bring the real stories home. As Young said it IS sad when a comedian has to make efforts to bring America's attention back to the war. Do any of you guys know if the IAVA does any \"lobbying\" or condemnation of the main stream media's lack of focus and good journalism on the wars?",
        "reply": " Ive been a member of the IAVA for quite some time now, following them from just about their infancy. Most of their efforts that I am aware of -- can't read everything they they print -- are more about lobbying in Congress and the Floor than they are about media matters. In fact, short of the applause for Bill O'Reilly's numerous trips, this is the first time I can recall the IAVA having much, if any, interest in the media trappings of visits to Iraq and Afghanistan. I may very well be wrong and have simply missed Mr. Rieckhoff's attention to media matters, and if I am then I humbly apologize, but to the best of my recollection the IAVA has (had) little interest in media affairs. In the report, Mr. Rieckhoff alludes to the importance of veteran awareness in the public spotlight as many of our men and women will be coming CONUS soon. I agree with this sentiment wholeheartedly. In light of these statements, it's very possible to infer that the IAVA is indeed turning a corner and will be focusing more attention on the pivotal role our mainstream media and editorialists plays in preparing the civilian populace for an influx of combat veterans. If this is the case, which at this time is mere speculation on my part, then I reiterate my applause for the collective efforts of the IAVA. There are many veterans' advocacy groups out there, but truly the IAVA is unsurpassed in their efforts to support our serving soldiers (Airmen, et al) and veterans alike. Richard, Proud IAVA member It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.",
        "threadID": "672198221_9800067222001",
        "time": "2009-05-08 05:48:00",
        "title": "Colbert Steps Into The War Zone",
        "userID": "FollowMeInfantry"
    },
    {
        "content": "quote: Originally posted by Young57: I hate to say this, but its sad when the American people get serious news from a comedian. In my opinion, the American people have tuned out from what the military is doing in Iraq and Afghanistan. You could very well be correct. However, I must contend that any exposure is good exposure - our military has absolutely nothing to hide (outside of the obvious OPSEC needs), so even though Mr. Colbert is, by trade, a comedian, his audience is important to the awareness of the conditions our soldiers are returning from; they hint at what they will be returning to. Any support we can drum up for them is, in my opinion, and probably in the opinion of the vast majority here, worth every ounce of effort regardless of its originating source. One trend I have noticed is that the mainstream media rarely reports on the status of either theater unless it is to purport an increase in violence. Bad news sells? Probably. Then you have gentleman like Mr. Colbert and Mr. O'Reilly who are willing to put their personal safety in harm's way -- HA! Like they aren't well protected -- in order to take the American public to our deployed soldiers... They serve a vital mission that helps connect the existing rift that you mention. Even if their motives are less than pure and honorable, their results are admirable. I can live with that. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.",
        "intTime": 20090508,
        "postID": 5,
        "quote": "Originally posted by Young57: I hate to say this, but its sad when the American people get serious news from a comedian. In my opinion, the American people have tuned out from what the military is doing in Iraq and Afghanistan.",
        "reply": " You could very well be correct. However, I must contend that any exposure is good exposure - our military has absolutely nothing to hide (outside of the obvious OPSEC needs), so even though Mr. Colbert is, by trade, a comedian, his audience is important to the awareness of the conditions our soldiers are returning from; they hint at what they will be returning to. Any support we can drum up for them is, in my opinion, and probably in the opinion of the vast majority here, worth every ounce of effort regardless of its originating source. One trend I have noticed is that the mainstream media rarely reports on the status of either theater unless it is to purport an increase in violence. Bad news sells? Probably. Then you have gentleman like Mr. Colbert and Mr. O'Reilly who are willing to put their personal safety in harm's way -- HA! Like they aren't well protected -- in order to take the American public to our deployed soldiers... They serve a vital mission that helps connect the existing rift that you mention. Even if their motives are less than pure and honorable, their results are admirable. I can live with that. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.",
        "threadID": "672198221_9800067222001",
        "time": "2009-05-08 06:02:00",
        "title": "Colbert Steps Into The War Zone",
        "userID": "FollowMeInfantry"
    },
    {
        "content": "You know, I find it interesting that media coverage and handling of the war isn't on the list (or at least voiced) as one of the reasons many vets have a hard time readjusting. Since I've been back, do you know how many people I've talked to who do the whole \"Thank you for your service routine\" but then go into how stupid Bush was/is and how we never should have gone there. Not for a moment asking what it was I did. Now, I didn't see any action. I didn't even see an Iraqi until late in my tour. I fixed comm gear. I played my part, but for me that's all i was doing. Fine. My point is, what about the guys who got in the thick of it? Do people honestly believe they are being sympathetic with such statements? What about the guys (and gals) that provided medical treatment to thousands of children and poor families? That to me would seem rewarding work in of itself and then to come home and hear some goob say \"Oh, we never should have gone over there...\" I'm not a 4 star, but I would confidently guess that there is just as much humanitarian effort as there is combat over at least in Iraq at the moment and to maybe a bit lesser degree A'stan, that would NEVER happen had we not gone over. I apologize for starting to stray off topic, but IMO the media has had a huge effect on how returning vets reintegrate through their lack of reporting, and misreporting whether accidently or purposefully.",
        "intTime": 20090508,
        "postID": 6,
        "quote": "",
        "reply": "You know, I find it interesting that media coverage and handling of the war isn't on the list (or at least voiced) as one of the reasons many vets have a hard time readjusting. Since I've been back, do you know how many people I've talked to who do the whole \"Thank you for your service routine\" but then go into how stupid Bush was/is and how we never should have gone there. Not for a moment asking what it was I did. Now, I didn't see any action. I didn't even see an Iraqi until late in my tour. I fixed comm gear. I played my part, but for me that's all i was doing. Fine. My point is, what about the guys who got in the thick of it? Do people honestly believe they are being sympathetic with such statements? What about the guys (and gals) that provided medical treatment to thousands of children and poor families? That to me would seem rewarding work in of itself and then to come home and hear some goob say \"Oh, we never should have gone over there...\" I'm not a 4 star, but I would confidently guess that there is just as much humanitarian effort as there is combat over at least in Iraq at the moment and to maybe a bit lesser degree A'stan, that would NEVER happen had we not gone over. I apologize for starting to stray off topic, but IMO the media has had a huge effect on how returning vets reintegrate through their lack of reporting, and misreporting whether accidently or purposefully.",
        "threadID": "672198221_9800067222001",
        "time": "2009-05-08 06:23:00",
        "title": "Colbert Steps Into The War Zone",
        "userID": "DevilDog2847"
    },
    {
        "content": "quote: Originally posted by DevilDog2847: You know, I find it interesting that media coverage and handling of the war isn't on the list (or at least voiced) as one of the reasons many vets have a hard time readjusting. Since I've been back, do you know how many people I've talked to who do the whole \"Thank you for your service routine\" but then go into how stupid Bush was/is and how we never should have gone there. Not for a moment asking what it was I did. Now, I didn't see any action. I didn't even see an Iraqi until late in my tour. I fixed comm gear. I played my part, but for me that's all i was doing. Fine. My point is, what about the guys who got in the thick of it? Do people honestly believe they are being sympathetic with such statements? What about the guys (and gals) that provided medical treatment to thousands of children and poor families? That to me would seem rewarding work in of itself and then to come home and hear some goob say \"Oh, we never should have gone over there...\" I'm not a 4 star, but I would confidently guess that there is just as much humanitarian effort as there is combat over at least in Iraq at the moment and to maybe a bit lesser degree A'stan, that would NEVER happen had we not gone over. I apologize for starting to stray off topic, but IMO the media has had a huge effect on how returning vets reintegrate through their lack of reporting, and misreporting whether accidently or purposefully. I could not agree more - and thank you for your service (that's vet to vet, so you know it is sincere). When people tell me, \"I support the troops, but not the effort,\" I give them this analogy: If a carpenter builds a wonderful house, but the homeowner hates it because the architect screwed up, will the carpenter feel appreciated anyway? As we both know, that answer is a resounding NO. But civilians do not see it that way. And I need to add a disclaimer here: I was never in Iraq, as my unit didn't deploy during the Gulf War. Lost some friends that I personally trained that did deploy, and was with the First afterward, but anyway... I just don't want any misconceptions when I talk about support and \"us\" vets. I'm authorized the campaign ribbons, but never earned my CIB (long story there; typical Army drivel). I think civilians say thank you more out of public obligation than they do real, true, honest appreciation. I've seen and heard about exceptions, like a stranger picking up the tab for an expensive meal anonymously. But for the most part, I think people are brainwashed into believing that they're really saying something. But see, this is where I think men like O'Reilly and Colbert play such an important role. The MSM reports on the war, the progress (or lack thereof), the casualty figures, and et al. But guys like O'Reilly and Colbert report on the MEN AND WOMEN assigned to the war efforts. They bring a whole new aspect of the two theaters, of the military in general, by bringing real people into the living rooms of civilians. Instead of \"the soldiers,\" they become the fathers, mothers, sons, daughters and sisters and brothers that they are. It's Private so-and-so, not a \"troop.\" Has the MSN failed us all? I have to say yes. But they find redeeming qualities in some of the editorialists they employ. Sometimes. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.",
        "intTime": 20090508,
        "postID": 7,
        "quote": "Originally posted by DevilDog2847: You know, I find it interesting that media coverage and handling of the war isn't on the list (or at least voiced) as one of the reasons many vets have a hard time readjusting. Since I've been back, do you know how many people I've talked to who do the whole \"Thank you for your service routine\" but then go into how stupid Bush was/is and how we never should have gone there. Not for a moment asking what it was I did. Now, I didn't see any action. I didn't even see an Iraqi until late in my tour. I fixed comm gear. I played my part, but for me that's all i was doing. Fine. My point is, what about the guys who got in the thick of it? Do people honestly believe they are being sympathetic with such statements? What about the guys (and gals) that provided medical treatment to thousands of children and poor families? That to me would seem rewarding work in of itself and then to come home and hear some goob say \"Oh, we never should have gone over there...\" I'm not a 4 star, but I would confidently guess that there is just as much humanitarian effort as there is combat over at least in Iraq at the moment and to maybe a bit lesser degree A'stan, that would NEVER happen had we not gone over. I apologize for starting to stray off topic, but IMO the media has had a huge effect on how returning vets reintegrate through their lack of reporting, and misreporting whether accidently or purposefully.",
        "reply": " I could not agree more - and thank you for your service (that's vet to vet, so you know it is sincere). When people tell me, \"I support the troops, but not the effort,\" I give them this analogy: If a carpenter builds a wonderful house, but the homeowner hates it because the architect screwed up, will the carpenter feel appreciated anyway? As we both know, that answer is a resounding NO. But civilians do not see it that way. And I need to add a disclaimer here: I was never in Iraq, as my unit didn't deploy during the Gulf War. Lost some friends that I personally trained that did deploy, and was with the First afterward, but anyway... I just don't want any misconceptions when I talk about support and \"us\" vets. I'm authorized the campaign ribbons, but never earned my CIB (long story there; typical Army drivel). I think civilians say thank you more out of public obligation than they do real, true, honest appreciation. I've seen and heard about exceptions, like a stranger picking up the tab for an expensive meal anonymously. But for the most part, I think people are brainwashed into believing that they're really saying something. But see, this is where I think men like O'Reilly and Colbert play such an important role. The MSM reports on the war, the progress (or lack thereof), the casualty figures, and et al. But guys like O'Reilly and Colbert report on the MEN AND WOMEN assigned to the war efforts. They bring a whole new aspect of the two theaters, of the military in general, by bringing real people into the living rooms of civilians. Instead of \"the soldiers,\" they become the fathers, mothers, sons, daughters and sisters and brothers that they are. It's Private so-and-so, not a \"troop.\" Has the MSN failed us all? I have to say yes. But they find redeeming qualities in some of the editorialists they employ. Sometimes. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.",
        "threadID": "672198221_9800067222001",
        "time": "2009-05-08 06:55:00",
        "title": "Colbert Steps Into The War Zone",
        "userID": "FollowMeInfantry"
    },
    {
        "content": "quote: Originally posted by Young57: I hate to say this, but its sad when the American people get serious news from a comedian. In my opinion, the American people have tuned out from what the military is doing in Iraq and Afghanistan. Grumble. You are correct (of course, there is always PBS: they go into real depth without the sensationalism and BS, compared to standard network news outlets/talk radio). Both Jon Stewart and Steven Colbert (Daily Show, and Colbert Report respectively) have repeatedly said that they have no credibility (as they are comedians/entertainers). Yet they are the only ones that seem to have the guts to hold people accountable (and their feet to the fire) in their interviews and stories. Their humor (and sarcasm) has made the news far more digestible and tends to be more accurate and balanced (equally scathing) than the excuses for \"real\" or \"fair and balanced\" \"news\". Very funny - but also very sad.",
        "intTime": 20090508,
        "postID": 8,
        "quote": "Originally posted by Young57: I hate to say this, but its sad when the American people get serious news from a comedian. In my opinion, the American people have tuned out from what the military is doing in Iraq and Afghanistan.",
        "reply": " Grumble. You are correct (of course, there is always PBS: they go into real depth without the sensationalism and BS, compared to standard network news outlets/talk radio). Both Jon Stewart and Steven Colbert (Daily Show, and Colbert Report respectively) have repeatedly said that they have no credibility (as they are comedians/entertainers). Yet they are the only ones that seem to have the guts to hold people accountable (and their feet to the fire) in their interviews and stories. Their humor (and sarcasm) has made the news far more digestible and tends to be more accurate and balanced (equally scathing) than the excuses for \"real\" or \"fair and balanced\" \"news\". Very funny - but also very sad.",
        "threadID": "672198221_9800067222001",
        "time": "2009-05-08 06:57:00",
        "title": "Colbert Steps Into The War Zone",
        "userID": "PolicyWonk"
    },
    {
        "content": "I'd like to see Colbert make fun of the general quality of life and rules at the deployment locations to show our military leaders how fascist they've become in their attempts at discipline at times. Leave the left/right wing politics at home.",
        "intTime": 20090512,
        "postID": 9,
        "quote": "",
        "reply": "I'd like to see Colbert make fun of the general quality of life and rules at the deployment locations to show our military leaders how fascist they've become in their attempts at discipline at times. Leave the left/right wing politics at home.",
        "threadID": "672198221_9800067222001",
        "time": "2009-05-12 13:36:00",
        "title": "Colbert Steps Into The War Zone",
        "userID": "yanqui69"
    }
]