[
    {
        "content": "Not sure what to think of this..... quote: Each Memorial Day we honor the men and women in uniform who have paid the ultimate price for the freedom we enjoy. Traditionally, this is the day many people visit cemeteries and memorials, especially the Arlington National Cemetery. But not all of us can do that. Good news is this year there's an alternative. Sean Askay, a Google engineer, released on Sunday a Google Earth layer, called Map the Fallen, that contains detailed information of more than 5,700 service members who died in the Afghanistan and Iraq wars. This is an interactive tool that lets you see photos, learn about how each service member died, visit memorial Web sites with comments from friends and families, and explore the places they called home and where they died. Askay has no military affiliation or background and developed the project on his personal time. He said on his Map the Fallen blog that he came up with the idea when he was still a student and ran across icasualties.org, a public database of soldiers who have died since the beginning of the wars in Afghanistan and Iraq. (...) +http://news.cnet.com/8301-17938_105-10248763-1.html \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090526, 
        "postID": 1, 
        "quote": "Each Memorial Day we honor the men and women in uniform who have paid the ultimate price for the freedom we enjoy. Traditionally, this is the day many people visit cemeteries and memorials, especially the Arlington National Cemetery. But not all of us can do that. Good news is this year there's an alternative. Sean Askay, a Google engineer, released on Sunday a Google Earth layer, called Map the Fallen, that contains detailed information of more than 5,700 service members who died in the Afghanistan and Iraq wars. This is an interactive tool that lets you see photos, learn about how each service member died, visit memorial Web sites with comments from friends and families, and explore the places they called home and where they died. Askay has no military affiliation or background and developed the project on his personal time. He said on his Map the Fallen blog that he came up with the idea when he was still a student and ran across icasualties.org, a public database of soldiers who have died since the beginning of the wars in Afghanistan and Iraq. (...)", 
        "reply": "Not sure what to think of this.....  +http://news.cnet.com/8301-17938_105-10248763-1.html \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_2350082422001", 
        "time": "2009-05-26 06:15:00", 
        "title": "Honoring the fallen on a Google Earth map", 
        "userID": "NSNN"
    }, 
    {
        "content": "- Yes, causes mixed feelings. However I think ultimately, like the coffins at Dover, anything that opens the public's eyes to the cost of war is important for the health of a democracy. -", 
        "intTime": 20090526, 
        "postID": 2, 
        "quote": "", 
        "reply": "- Yes, causes mixed feelings. However I think ultimately, like the coffins at Dover, anything that opens the public's eyes to the cost of war is important for the health of a democracy. -", 
        "threadID": "672198221_2350082422001", 
        "time": "2009-05-26 21:02:00", 
        "title": "Honoring the fallen on a Google Earth map", 
        "userID": "ANZACbiscuit"
    }, 
    {
        "content": "quote: Not sure what to think of this..... I do. 1. Someone needs a life and 2. I see nothing wrong with it. It's locational information stats..part of the superinformationhighway Internet Al made, no big deal...", 
        "intTime": 20090531, 
        "postID": 3, 
        "quote": "Not sure what to think of this.....", 
        "reply": " I do. 1. Someone needs a life and 2. I see nothing wrong with it. It's locational information stats..part of the superinformationhighway Internet Al made, no big deal...", 
        "threadID": "672198221_2350082422001", 
        "time": "2009-05-31 01:48:00", 
        "title": "Honoring the fallen on a Google Earth map", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "Mixed feelings here as well, but I will say the screenshot alone opened my eyes.", 
        "intTime": 20090531, 
        "postID": 4, 
        "quote": "", 
        "reply": "Mixed feelings here as well, but I will say the screenshot alone opened my eyes.", 
        "threadID": "672198221_2350082422001", 
        "time": "2009-05-31 03:59:00", 
        "title": "Honoring the fallen on a Google Earth map", 
        "userID": "MrsCamo"
    }, 
    {
        "content": "As long as the home of record does not include address and/or GPS coordinates.", 
        "intTime": 20090531, 
        "postID": 5, 
        "quote": "", 
        "reply": "As long as the home of record does not include address and/or GPS coordinates.", 
        "threadID": "672198221_2350082422001", 
        "time": "2009-05-31 05:37:00", 
        "title": "Honoring the fallen on a Google Earth map", 
        "userID": "Bleah"
    }, 
    {
        "content": "http://www.cbn.com/cbnnews/us/...mber-Fallen-Heroes1/", 
        "intTime": 20090531, 
        "postID": 6, 
        "quote": "", 
        "reply": "http://www.cbn.com/cbnnews/us/...mber-Fallen-Heroes1/", 
        "threadID": "672198221_2350082422001", 
        "time": "2009-05-31 05:52:00", 
        "title": "Honoring the fallen on a Google Earth map", 
        "userID": "usnctia"
    }
]