[
    {
        "content": "\"\"http://content.usatoday.com/topics/article/People/Politicians,+Government+Officials,+Strategists/U.S.+Senators/John+McCain/0bNSbCm02u8GI/1\"\" Interesting piece, even if you hate the guy. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090306, 
        "postID": 1, 
        "quote": "", 
        "reply": "\"\"http://content.usatoday.com/topics/article/People/Politicians,+Government+Officials,+Strategists/U.S.+Senators/John+McCain/0bNSbCm02u8GI/1\"\" Interesting piece, even if you hate the guy. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_4370080712001", 
        "time": "2009-03-06 07:14:00", 
        "title": "Why I (Michael Moore) Am Not Now and Have Never Been the Democrats' \"Rush Limbaugh\"", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: \"\"http://content.usatoday.com/topics/article/People/Politicians,+Government+Officials,+Strategists/U.S.+Senators/John+McCain/0bNSbCm02u8GI/1\"\" Interesting piece, even if you hate the guy. I wouldn't give him even that much credit.", 
        "intTime": 20090306, 
        "postID": 2, 
        "quote": "Originally posted by jack_flats: \"\"http://content.usatoday.com/topics/article/People/Politicians,+Government+Officials,+Strategists/U.S.+Senators/John+McCain/0bNSbCm02u8GI/1\"\" Interesting piece, even if you hate the guy.", 
        "reply": " I wouldn't give him even that much credit.", 
        "threadID": "672198221_4370080712001", 
        "time": "2009-03-06 09:06:00", 
        "title": "Why I (Michael Moore) Am Not Now and Have Never Been the Democrats' \"Rush Limbaugh\"", 
        "userID": "busnrete8"
    }, 
    {
        "content": "Hate a flatulent blubber-butt? Never happen. Thought this thread had been posted by Wichita Kid. Something strange is going on here.", 
        "intTime": 20090306, 
        "postID": 3, 
        "quote": "", 
        "reply": "Hate a flatulent blubber-butt? Never happen. Thought this thread had been posted by Wichita Kid. Something strange is going on here.", 
        "threadID": "672198221_4370080712001", 
        "time": "2009-03-06 09:12:00", 
        "title": "Why I (Michael Moore) Am Not Now and Have Never Been the Democrats' \"Rush Limbaugh\"", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "I wouldnt Pizz on Shamu of the left if he were on fire", 
        "intTime": 20090306, 
        "postID": 4, 
        "quote": "", 
        "reply": "I wouldnt Pizz on Shamu of the left if he were on fire", 
        "threadID": "672198221_4370080712001", 
        "time": "2009-03-06 09:49:00", 
        "title": "Why I (Michael Moore) Am Not Now and Have Never Been the Democrats' \"Rush Limbaugh\"", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "\"Hate a flatulent blubber-butt?\" \"I wouldnt Pizz on Shamu of the left if he were on fire\" Wow, such intelligent responses. lol Fact is, the man was right, and the country agreed with him. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090306, 
        "postID": 5, 
        "quote": "", 
        "reply": "\"Hate a flatulent blubber-butt?\" \"I wouldnt Pizz on Shamu of the left if he were on fire\" Wow, such intelligent responses. lol Fact is, the man was right, and the country agreed with him. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_4370080712001", 
        "time": "2009-03-06 10:13:00", 
        "title": "Why I (Michael Moore) Am Not Now and Have Never Been the Democrats' \"Rush Limbaugh\"", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: \"Hate a flatulent blubber-butt?\" \"I wouldnt Pizz on Shamu of the left if he were on fire\" Wow, such intelligent responses. lol Fact is, the man was right, and the country agreed with him. Really?... What do you base this on?... Don't say the election, because it has nothing to do with Michael Moore... Respectfully, SUNLINER81", 
        "intTime": 20090306, 
        "postID": 6, 
        "quote": "Originally posted by jack_flats: \"Hate a flatulent blubber-butt?\" \"I wouldnt Pizz on Shamu of the left if he were on fire\" Wow, such intelligent responses. lol Fact is, the man was right, and the country agreed with him.", 
        "reply": " Really?... What do you base this on?... Don't say the election, because it has nothing to do with Michael Moore... Respectfully, SUNLINER81", 
        "threadID": "672198221_4370080712001", 
        "time": "2009-03-06 10:19:00", 
        "title": "Why I (Michael Moore) Am Not Now and Have Never Been the Democrats' \"Rush Limbaugh\"", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: quote: Originally posted by jack_flats: \"Hate a flatulent blubber-butt?\" \"I wouldnt Pizz on Shamu of the left if he were on fire\" Wow, such intelligent responses. lol Fact is, the man was right, and the country agreed with him. Really?... What do you base this on?... Don't say the election, because it has nothing to do with Michael Moore... Respectfully, SUNLINER81 Read his article and try and dispute what he has to say now, during the election campaign, and even before. In spite of every attempt to paint him an extremist left wing villain (even by George Bush personally, John McCain, and by the entire Republican spin machine) he prevailed and has won. Damn near everything Barack Obama was elected for, he stood for, and is being done by the President. The best part of the article was the Michigan Democrat who asked that he (Moore) endorse him for election to congress, unseating a Republican encumbent, Moore did, and the Republican's jumped all over it with a vengeance, thinking his endorsement was the kiss of death for the Democratic candidate, then showing Moore and the candidate together in TV commercials, hell, the Republicans truly believed Moore's endorsement was the candidates demise. Until after the election, the Democrat beat the Republican incumbent. So much for \"the people\" hating Michael Moore enough to bury his endorsee in humiliating defeat. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090306, 
        "postID": 7, 
        "quote": "Originally posted by SUNLINER81: quote: Originally posted by jack_flats: \"Hate a flatulent blubber-butt?\" \"I wouldnt Pizz on Shamu of the left if he were on fire\" Wow, such intelligent responses. lol Fact is, the man was right, and the country agreed with him. Really?... What do you base this on?... Don't say the election, because it has nothing to do with Michael Moore... Respectfully, SUNLINER81", 
        "reply": " Read his article and try and dispute what he has to say now, during the election campaign, and even before. In spite of every attempt to paint him an extremist left wing villain (even by George Bush personally, John McCain, and by the entire Republican spin machine) he prevailed and has won. Damn near everything Barack Obama was elected for, he stood for, and is being done by the President. The best part of the article was the Michigan Democrat who asked that he (Moore) endorse him for election to congress, unseating a Republican encumbent, Moore did, and the Republican's jumped all over it with a vengeance, thinking his endorsement was the kiss of death for the Democratic candidate, then showing Moore and the candidate together in TV commercials, hell, the Republicans truly believed Moore's endorsement was the candidates demise. Until after the election, the Democrat beat the Republican incumbent. So much for \"the people\" hating Michael Moore enough to bury his endorsee in humiliating defeat. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_4370080712001", 
        "time": "2009-03-06 12:50:00", 
        "title": "Why I (Michael Moore) Am Not Now and Have Never Been the Democrats' \"Rush Limbaugh\"", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: quote: Originally posted by SUNLINER81: quote: Originally posted by jack_flats: \"Hate a flatulent blubber-butt?\" \"I wouldnt Pizz on Shamu of the left if he were on fire\" Wow, such intelligent responses. lol Fact is, the man was right, and the country agreed with him. Really?... What do you base this on?... Don't say the election, because it has nothing to do with Michael Moore... Respectfully, SUNLINER81 Read his article and try and dispute what he has to say now, during the election campaign, and even before. In spite of every attempt to paint him an extremist left wing villain (even by George Bush personally, John McCain, and by the entire Republican spin machine) he prevailed and has won. Damn near everything Barack Obama was elected for, he stood for, and is being done by the President. The best part of the article was the Michigan Democrat who asked that he (Moore) endorse him for election to congress, unseating a Republican encumbent, Moore did, and the Republican's jumped all over it with a vengeance, thinking his endorsement was the kiss of death for the Democratic candidate, then showing Moore and the candidate together in TV commercials, hell, the Republicans truly believed Moore's endorsement was the candidates demise. Until after the election, the Democrat beat the Republican incumbent. So much for \"the people\" hating Michael Moore enough to bury his endorsee in humiliating defeat. Moore is just anoth commie America hater!", 
        "intTime": 20090306, 
        "postID": 8, 
        "quote": "Originally posted by jack_flats: quote: Originally posted by SUNLINER81: quote: Originally posted by jack_flats: \"Hate a flatulent blubber-butt?\" \"I wouldnt Pizz on Shamu of the left if he were on fire\" Wow, such intelligent responses. lol Fact is, the man was right, and the country agreed with him. Really?... What do you base this on?... Don't say the election, because it has nothing to do with Michael Moore... Respectfully, SUNLINER81 Read his article and try and dispute what he has to say now, during the election campaign, and even before. In spite of every attempt to paint him an extremist left wing villain (even by George Bush personally, John McCain, and by the entire Republican spin machine) he prevailed and has won. Damn near everything Barack Obama was elected for, he stood for, and is being done by the President. The best part of the article was the Michigan Democrat who asked that he (Moore) endorse him for election to congress, unseating a Republican encumbent, Moore did, and the Republican's jumped all over it with a vengeance, thinking his endorsement was the kiss of death for the Democratic candidate, then showing Moore and the candidate together in TV commercials, hell, the Republicans truly believed Moore's endorsement was the candidates demise. Until after the election, the Democrat beat the Republican incumbent. So much for \"the people\" hating Michael Moore enough to bury his endorsee in humiliating defeat.", 
        "reply": " Moore is just anoth commie America hater!", 
        "threadID": "672198221_4370080712001", 
        "time": "2009-03-06 13:45:00", 
        "title": "Why I (Michael Moore) Am Not Now and Have Never Been the Democrats' \"Rush Limbaugh\"", 
        "userID": "EAG154"
    }, 
    {
        "content": "Moore is another one of those 'spoons made me fat' kinda people.", 
        "intTime": 20090306, 
        "postID": 9, 
        "quote": "", 
        "reply": "Moore is another one of those 'spoons made me fat' kinda people.", 
        "threadID": "672198221_4370080712001", 
        "time": "2009-03-06 13:59:00", 
        "title": "Why I (Michael Moore) Am Not Now and Have Never Been the Democrats' \"Rush Limbaugh\"", 
        "userID": "MaddogK"
    }, 
    {
        "content": "I give him more credit than LimpNode Rush.", 
        "intTime": 20090306, 
        "postID": 10, 
        "quote": "", 
        "reply": "I give him more credit than LimpNode Rush.", 
        "threadID": "672198221_4370080712001", 
        "time": "2009-03-06 14:39:00", 
        "title": "Why I (Michael Moore) Am Not Now and Have Never Been the Democrats' \"Rush Limbaugh\"", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: I give him more credit than LimpNode Rush. This conversation wasn't about Rush.", 
        "intTime": 20090306, 
        "postID": 11, 
        "quote": "Originally posted by crackerjacks61: I give him more credit than LimpNode Rush.", 
        "reply": " This conversation wasn't about Rush.", 
        "threadID": "672198221_4370080712001", 
        "time": "2009-03-06 16:28:00", 
        "title": "Why I (Michael Moore) Am Not Now and Have Never Been the Democrats' \"Rush Limbaugh\"", 
        "userID": "busnrete8"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: \"Hate a flatulent blubber-butt?\" \"I wouldnt Pizz on Shamu of the left if he were on fire\" Wow, such intelligent responses. lol Fact is, the man was right, and the country agreed with him. your right he was right about one thing. America has a bunch of fat people. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090306, 
        "postID": 12, 
        "quote": "Originally posted by jack_flats: \"Hate a flatulent blubber-butt?\" \"I wouldnt Pizz on Shamu of the left if he were on fire\" Wow, such intelligent responses. lol Fact is, the man was right, and the country agreed with him.", 
        "reply": " your right he was right about one thing. America has a bunch of fat people. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_4370080712001", 
        "time": "2009-03-06 19:11:00", 
        "title": "Why I (Michael Moore) Am Not Now and Have Never Been the Democrats' \"Rush Limbaugh\"", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by busnrete8: quote: Originally posted by crackerjacks61: I give him more credit than LimpNode Rush. This conversation wasn't about Rush. It certainly is. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090306, 
        "postID": 13, 
        "quote": "Originally posted by busnrete8: quote: Originally posted by crackerjacks61: I give him more credit than LimpNode Rush. This conversation wasn't about Rush.", 
        "reply": " It certainly is. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_4370080712001", 
        "time": "2009-03-06 22:22:00", 
        "title": "Why I (Michael Moore) Am Not Now and Have Never Been the Democrats' \"Rush Limbaugh\"", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: quote: Originally posted by busnrete8: quote: Originally posted by crackerjacks61: I give him more credit than LimpNode Rush. This conversation wasn't about Rush. It certainly is. No Jack, it isn't. Check with an English major. The 'subject' was and IS Michael Moore. Even the article was about Michael Moore.", 
        "intTime": 20090307, 
        "postID": 14, 
        "quote": "Originally posted by jack_flats: quote: Originally posted by busnrete8: quote: Originally posted by crackerjacks61: I give him more credit than LimpNode Rush. This conversation wasn't about Rush. It certainly is.", 
        "reply": " No Jack, it isn't. Check with an English major. The 'subject' was and IS Michael Moore. Even the article was about Michael Moore.", 
        "threadID": "672198221_4370080712001", 
        "time": "2009-03-07 02:29:00", 
        "title": "Why I (Michael Moore) Am Not Now and Have Never Been the Democrats' \"Rush Limbaugh\"", 
        "userID": "busnrete8"
    }, 
    {
        "content": "quote: The 'subject' was and IS Michael Moore. and how Michael Moore's position with the DNC is or isn't comparable to Rush's position with the RNC.", 
        "intTime": 20090307, 
        "postID": 15, 
        "quote": "The 'subject' was and IS Michael Moore.", 
        "reply": " and how Michael Moore's position with the DNC is or isn't comparable to Rush's position with the RNC.", 
        "threadID": "672198221_4370080712001", 
        "time": "2009-03-07 02:47:00", 
        "title": "Why I (Michael Moore) Am Not Now and Have Never Been the Democrats' \"Rush Limbaugh\"", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by busnrete8: quote: Originally posted by jack_flats: quote: Originally posted by busnrete8: quote: Originally posted by crackerjacks61: I give him more credit than LimpNode Rush. This conversation wasn't about Rush. It certainly is. No Jack, it isn't. Check with an English major. The 'subject' was and IS Michael Moore. Even the article was about Michael Moore. This is my thread, I ought to know what the article is about. It has everything to do with Rush Limbaugh and with Micheal Moore. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090307, 
        "postID": 16, 
        "quote": "Originally posted by busnrete8: quote: Originally posted by jack_flats: quote: Originally posted by busnrete8: quote: Originally posted by crackerjacks61: I give him more credit than LimpNode Rush. This conversation wasn't about Rush. It certainly is. No Jack, it isn't. Check with an English major. The 'subject' was and IS Michael Moore. Even the article was about Michael Moore.", 
        "reply": " This is my thread, I ought to know what the article is about. It has everything to do with Rush Limbaugh and with Micheal Moore. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_4370080712001", 
        "time": "2009-03-07 05:57:00", 
        "title": "Why I (Michael Moore) Am Not Now and Have Never Been the Democrats' \"Rush Limbaugh\"", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: quote: Originally posted by busnrete8: quote: Originally posted by jack_flats: quote: Originally posted by busnrete8: quote: Originally posted by crackerjacks61: I give him more credit than LimpNode Rush. This conversation wasn't about Rush. It certainly is. No Jack, it isn't. Check with an English major. The 'subject' was and IS Michael Moore. Even the article was about Michael Moore. This is my thread, I ought to know what the article is about. It has everything to do with Rush Limbaugh and with Micheal Moore.", 
        "intTime": 20090307, 
        "postID": 17, 
        "quote": "Originally posted by jack_flats: quote: Originally posted by busnrete8: quote: Originally posted by jack_flats: quote: Originally posted by busnrete8: quote: Originally posted by crackerjacks61: I give him more credit than LimpNode Rush. This conversation wasn't about Rush. It certainly is. No Jack, it isn't. Check with an English major. The 'subject' was and IS Michael Moore. Even the article was about Michael Moore. This is my thread, I ought to know what the article is about. It has everything to do with Rush Limbaugh and with Micheal Moore.", 
        "reply": "", 
        "threadID": "672198221_4370080712001", 
        "time": "2009-03-07 15:49:00", 
        "title": "Why I (Michael Moore) Am Not Now and Have Never Been the Democrats' \"Rush Limbaugh\"", 
        "userID": "busnrete8"
    }, 
    {
        "content": "quote: Originally posted by busnrete8: quote: Originally posted by jack_flats: quote: Originally posted by busnrete8: quote: Originally posted by crackerjacks61: I give him more credit than LimpNode Rush. This conversation wasn't about Rush. It certainly is. No Jack, it isn't. Check with an English major. The 'subject' was and IS Michael Moore. Even the article was about Michael Moore. And if you read the article, Moore compares himself to Limbaugh. \"This\" thread IS about This article, as well as Moore himself. No doubt there have been threads about Moore without that comparison... Dave", 
        "intTime": 20090307, 
        "postID": 18, 
        "quote": "Originally posted by busnrete8: quote: Originally posted by jack_flats: quote: Originally posted by busnrete8: quote: Originally posted by crackerjacks61: I give him more credit than LimpNode Rush. This conversation wasn't about Rush. It certainly is. No Jack, it isn't. Check with an English major. The 'subject' was and IS Michael Moore. Even the article was about Michael Moore.", 
        "reply": " And if you read the article, Moore compares himself to Limbaugh. \"This\" thread IS about This article, as well as Moore himself. No doubt there have been threads about Moore without that comparison... Dave", 
        "threadID": "672198221_4370080712001", 
        "time": "2009-03-07 16:01:00", 
        "title": "Why I (Michael Moore) Am Not Now and Have Never Been the Democrats' \"Rush Limbaugh\"", 
        "userID": "Grachus"
    }, 
    {
        "content": "I'm not a big fan of Moore, not because I disagree with his politics, but because I don't like to praise those who mess around with the facts. Moore should be ashamed of fudging the facts, especially since the absolute truth is so much better. But it is true that the Republican campaign to integrally link him to the Democrats simply didn't hurt the Democrats, whereas the Democratic campaign to link Limbaugh to the Republicans has been a dramatic success. In the one case, the Republican campaign was simply ignored and just wilted, whereas thanks to Rush and the Republican leadership, more and more people are starting to see him as the face of the Republican Party - And that's going to hurt. Strangely enough the Democrats had more success LYING about Nader (my candidate) as a Republican stalking horse, and they benefited from these lies. Dave", 
        "intTime": 20090307, 
        "postID": 19, 
        "quote": "", 
        "reply": "I'm not a big fan of Moore, not because I disagree with his politics, but because I don't like to praise those who mess around with the facts. Moore should be ashamed of fudging the facts, especially since the absolute truth is so much better. But it is true that the Republican campaign to integrally link him to the Democrats simply didn't hurt the Democrats, whereas the Democratic campaign to link Limbaugh to the Republicans has been a dramatic success. In the one case, the Republican campaign was simply ignored and just wilted, whereas thanks to Rush and the Republican leadership, more and more people are starting to see him as the face of the Republican Party - And that's going to hurt. Strangely enough the Democrats had more success LYING about Nader (my candidate) as a Republican stalking horse, and they benefited from these lies. Dave", 
        "threadID": "672198221_4370080712001", 
        "time": "2009-03-07 16:07:00", 
        "title": "Why I (Michael Moore) Am Not Now and Have Never Been the Democrats' \"Rush Limbaugh\"", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: I'm not a big fan of Moore, not because I disagree with his politics, but because I don't like to praise those who mess around with the facts. Moore should be ashamed of fudging the facts, especially since the absolute truth is so much better. The premise of his \"documentary\" Roger and Me was that then GM president Roger Smith would not do an on camera interview to explain employee layoffs and plant closures. It turns out Smith did do at least one interview but Moore kept it out of his film. Don't mince words. The man is a lier. But it is true that the Republican campaign to integrally link him to the Democrats simply didn't hurt the Democrats, whereas the Democratic campaign to link Limbaugh to the Republicans has been a dramatic success. Baloney. The problem is that the GOP does not have a strong leader. In the one case, the Republican campaign was simply ignored and just wilted, whereas thanks to Rush and the Republican leadership, more and more people are starting to see him as the face of the Republican Party - And that's going to hurt. Rush has come out and insisted he is not the head of the GOP. Strangely enough the Democrats had more success LYING about Nader (my candidate) as a Republican stalking horse, and they benefited from these lies. I wonder what lies the Democrats told about Mr. Nader. Ralph Nader has a long history of fudging the facts going back to his auto safety work Unsafe at any Speed and VW; Small on Safety. In any election, this man does not have enough support to get himlelf elected but did have enough of a following ammong Democratic voters to get the Republican candidate voted in. On the other hand, Bill Clinton owes Ross Perot a debt of gratitude for his 1992 victory. Dave", 
        "intTime": 20090308, 
        "postID": 20, 
        "quote": "Originally posted by Grachus: I'm not a big fan of Moore, not because I disagree with his politics, but because I don't like to praise those who mess around with the facts. Moore should be ashamed of fudging the facts, especially since the absolute truth is so much better. The premise of his \"documentary\" Roger and Me was that then GM president Roger Smith would not do an on camera interview to explain employee layoffs and plant closures. It turns out Smith did do at least one interview but Moore kept it out of his film. Don't mince words. The man is a lier. But it is true that the Republican campaign to integrally link him to the Democrats simply didn't hurt the Democrats, whereas the Democratic campaign to link Limbaugh to the Republicans has been a dramatic success. Baloney. The problem is that the GOP does not have a strong leader. In the one case, the Republican campaign was simply ignored and just wilted, whereas thanks to Rush and the Republican leadership, more and more people are starting to see him as the face of the Republican Party - And that's going to hurt. Rush has come out and insisted he is not the head of the GOP. Strangely enough the Democrats had more success LYING about Nader (my candidate) as a Republican stalking horse, and they benefited from these lies. I wonder what lies the Democrats told about Mr. Nader. Ralph Nader has a long history of fudging the facts going back to his auto safety work Unsafe at any Speed and VW; Small on Safety. In any election, this man does not have enough support to get himlelf elected but did have enough of a following ammong Democratic voters to get the Republican candidate voted in. On the other hand, Bill Clinton owes Ross Perot a debt of gratitude for his 1992 victory. Dave", 
        "reply": "", 
        "threadID": "672198221_4370080712001", 
        "time": "2009-03-08 01:16:00", 
        "title": "Why I (Michael Moore) Am Not Now and Have Never Been the Democrats' \"Rush Limbaugh\"", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "\"\"http://content.usatoday.com/topics/article/People/Politicians,+Government+Officials,+Strategists/U.S.+Senators/John+McCain/0bNSbCm02u8GI/1\"\" Interesting piece, even if you hate the guy. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090306, 
        "postID": 21, 
        "quote": "", 
        "reply": "\"\"http://content.usatoday.com/topics/article/People/Politicians,+Government+Officials,+Strategists/U.S.+Senators/John+McCain/0bNSbCm02u8GI/1\"\" Interesting piece, even if you hate the guy. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_4370080712001", 
        "time": "2009-03-06 07:14:00", 
        "title": "Why I (Michael Moore) Am Not Now and Have Never Been the Democrats' \"Rush Limbaugh\"", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: \"\"http://content.usatoday.com/topics/article/People/Politicians,+Government+Officials,+Strategists/U.S.+Senators/John+McCain/0bNSbCm02u8GI/1\"\" Interesting piece, even if you hate the guy. I wouldn't give him even that much credit.", 
        "intTime": 20090306, 
        "postID": 22, 
        "quote": "Originally posted by jack_flats: \"\"http://content.usatoday.com/topics/article/People/Politicians,+Government+Officials,+Strategists/U.S.+Senators/John+McCain/0bNSbCm02u8GI/1\"\" Interesting piece, even if you hate the guy.", 
        "reply": " I wouldn't give him even that much credit.", 
        "threadID": "672198221_4370080712001", 
        "time": "2009-03-06 09:06:00", 
        "title": "Why I (Michael Moore) Am Not Now and Have Never Been the Democrats' \"Rush Limbaugh\"", 
        "userID": "busnrete8"
    }, 
    {
        "content": "Hate a flatulent blubber-butt? Never happen. Thought this thread had been posted by Wichita Kid. Something strange is going on here.", 
        "intTime": 20090306, 
        "postID": 23, 
        "quote": "", 
        "reply": "Hate a flatulent blubber-butt? Never happen. Thought this thread had been posted by Wichita Kid. Something strange is going on here.", 
        "threadID": "672198221_4370080712001", 
        "time": "2009-03-06 09:12:00", 
        "title": "Why I (Michael Moore) Am Not Now and Have Never Been the Democrats' \"Rush Limbaugh\"", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "I wouldnt Pizz on Shamu of the left if he were on fire", 
        "intTime": 20090306, 
        "postID": 24, 
        "quote": "", 
        "reply": "I wouldnt Pizz on Shamu of the left if he were on fire", 
        "threadID": "672198221_4370080712001", 
        "time": "2009-03-06 09:49:00", 
        "title": "Why I (Michael Moore) Am Not Now and Have Never Been the Democrats' \"Rush Limbaugh\"", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "\"Hate a flatulent blubber-butt?\" \"I wouldnt Pizz on Shamu of the left if he were on fire\" Wow, such intelligent responses. lol Fact is, the man was right, and the country agreed with him. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090306, 
        "postID": 25, 
        "quote": "", 
        "reply": "\"Hate a flatulent blubber-butt?\" \"I wouldnt Pizz on Shamu of the left if he were on fire\" Wow, such intelligent responses. lol Fact is, the man was right, and the country agreed with him. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_4370080712001", 
        "time": "2009-03-06 10:13:00", 
        "title": "Why I (Michael Moore) Am Not Now and Have Never Been the Democrats' \"Rush Limbaugh\"", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: \"Hate a flatulent blubber-butt?\" \"I wouldnt Pizz on Shamu of the left if he were on fire\" Wow, such intelligent responses. lol Fact is, the man was right, and the country agreed with him. Really?... What do you base this on?... Don't say the election, because it has nothing to do with Michael Moore... Respectfully, SUNLINER81", 
        "intTime": 20090306, 
        "postID": 26, 
        "quote": "Originally posted by jack_flats: \"Hate a flatulent blubber-butt?\" \"I wouldnt Pizz on Shamu of the left if he were on fire\" Wow, such intelligent responses. lol Fact is, the man was right, and the country agreed with him.", 
        "reply": " Really?... What do you base this on?... Don't say the election, because it has nothing to do with Michael Moore... Respectfully, SUNLINER81", 
        "threadID": "672198221_4370080712001", 
        "time": "2009-03-06 10:19:00", 
        "title": "Why I (Michael Moore) Am Not Now and Have Never Been the Democrats' \"Rush Limbaugh\"", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: quote: Originally posted by jack_flats: \"Hate a flatulent blubber-butt?\" \"I wouldnt Pizz on Shamu of the left if he were on fire\" Wow, such intelligent responses. lol Fact is, the man was right, and the country agreed with him. Really?... What do you base this on?... Don't say the election, because it has nothing to do with Michael Moore... Respectfully, SUNLINER81 Read his article and try and dispute what he has to say now, during the election campaign, and even before. In spite of every attempt to paint him an extremist left wing villain (even by George Bush personally, John McCain, and by the entire Republican spin machine) he prevailed and has won. Damn near everything Barack Obama was elected for, he stood for, and is being done by the President. The best part of the article was the Michigan Democrat who asked that he (Moore) endorse him for election to congress, unseating a Republican encumbent, Moore did, and the Republican's jumped all over it with a vengeance, thinking his endorsement was the kiss of death for the Democratic candidate, then showing Moore and the candidate together in TV commercials, hell, the Republicans truly believed Moore's endorsement was the candidates demise. Until after the election, the Democrat beat the Republican incumbent. So much for \"the people\" hating Michael Moore enough to bury his endorsee in humiliating defeat. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090306, 
        "postID": 27, 
        "quote": "Originally posted by SUNLINER81: quote: Originally posted by jack_flats: \"Hate a flatulent blubber-butt?\" \"I wouldnt Pizz on Shamu of the left if he were on fire\" Wow, such intelligent responses. lol Fact is, the man was right, and the country agreed with him. Really?... What do you base this on?... Don't say the election, because it has nothing to do with Michael Moore... Respectfully, SUNLINER81", 
        "reply": " Read his article and try and dispute what he has to say now, during the election campaign, and even before. In spite of every attempt to paint him an extremist left wing villain (even by George Bush personally, John McCain, and by the entire Republican spin machine) he prevailed and has won. Damn near everything Barack Obama was elected for, he stood for, and is being done by the President. The best part of the article was the Michigan Democrat who asked that he (Moore) endorse him for election to congress, unseating a Republican encumbent, Moore did, and the Republican's jumped all over it with a vengeance, thinking his endorsement was the kiss of death for the Democratic candidate, then showing Moore and the candidate together in TV commercials, hell, the Republicans truly believed Moore's endorsement was the candidates demise. Until after the election, the Democrat beat the Republican incumbent. So much for \"the people\" hating Michael Moore enough to bury his endorsee in humiliating defeat. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_4370080712001", 
        "time": "2009-03-06 12:50:00", 
        "title": "Why I (Michael Moore) Am Not Now and Have Never Been the Democrats' \"Rush Limbaugh\"", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: quote: Originally posted by SUNLINER81: quote: Originally posted by jack_flats: \"Hate a flatulent blubber-butt?\" \"I wouldnt Pizz on Shamu of the left if he were on fire\" Wow, such intelligent responses. lol Fact is, the man was right, and the country agreed with him. Really?... What do you base this on?... Don't say the election, because it has nothing to do with Michael Moore... Respectfully, SUNLINER81 Read his article and try and dispute what he has to say now, during the election campaign, and even before. In spite of every attempt to paint him an extremist left wing villain (even by George Bush personally, John McCain, and by the entire Republican spin machine) he prevailed and has won. Damn near everything Barack Obama was elected for, he stood for, and is being done by the President. The best part of the article was the Michigan Democrat who asked that he (Moore) endorse him for election to congress, unseating a Republican encumbent, Moore did, and the Republican's jumped all over it with a vengeance, thinking his endorsement was the kiss of death for the Democratic candidate, then showing Moore and the candidate together in TV commercials, hell, the Republicans truly believed Moore's endorsement was the candidates demise. Until after the election, the Democrat beat the Republican incumbent. So much for \"the people\" hating Michael Moore enough to bury his endorsee in humiliating defeat. Moore is just anoth commie America hater!", 
        "intTime": 20090306, 
        "postID": 28, 
        "quote": "Originally posted by jack_flats: quote: Originally posted by SUNLINER81: quote: Originally posted by jack_flats: \"Hate a flatulent blubber-butt?\" \"I wouldnt Pizz on Shamu of the left if he were on fire\" Wow, such intelligent responses. lol Fact is, the man was right, and the country agreed with him. Really?... What do you base this on?... Don't say the election, because it has nothing to do with Michael Moore... Respectfully, SUNLINER81 Read his article and try and dispute what he has to say now, during the election campaign, and even before. In spite of every attempt to paint him an extremist left wing villain (even by George Bush personally, John McCain, and by the entire Republican spin machine) he prevailed and has won. Damn near everything Barack Obama was elected for, he stood for, and is being done by the President. The best part of the article was the Michigan Democrat who asked that he (Moore) endorse him for election to congress, unseating a Republican encumbent, Moore did, and the Republican's jumped all over it with a vengeance, thinking his endorsement was the kiss of death for the Democratic candidate, then showing Moore and the candidate together in TV commercials, hell, the Republicans truly believed Moore's endorsement was the candidates demise. Until after the election, the Democrat beat the Republican incumbent. So much for \"the people\" hating Michael Moore enough to bury his endorsee in humiliating defeat.", 
        "reply": " Moore is just anoth commie America hater!", 
        "threadID": "672198221_4370080712001", 
        "time": "2009-03-06 13:45:00", 
        "title": "Why I (Michael Moore) Am Not Now and Have Never Been the Democrats' \"Rush Limbaugh\"", 
        "userID": "EAG154"
    }, 
    {
        "content": "Moore is another one of those 'spoons made me fat' kinda people.", 
        "intTime": 20090306, 
        "postID": 29, 
        "quote": "", 
        "reply": "Moore is another one of those 'spoons made me fat' kinda people.", 
        "threadID": "672198221_4370080712001", 
        "time": "2009-03-06 13:59:00", 
        "title": "Why I (Michael Moore) Am Not Now and Have Never Been the Democrats' \"Rush Limbaugh\"", 
        "userID": "MaddogK"
    }, 
    {
        "content": "I give him more credit than LimpNode Rush.", 
        "intTime": 20090306, 
        "postID": 30, 
        "quote": "", 
        "reply": "I give him more credit than LimpNode Rush.", 
        "threadID": "672198221_4370080712001", 
        "time": "2009-03-06 14:39:00", 
        "title": "Why I (Michael Moore) Am Not Now and Have Never Been the Democrats' \"Rush Limbaugh\"", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: I give him more credit than LimpNode Rush. This conversation wasn't about Rush.", 
        "intTime": 20090306, 
        "postID": 31, 
        "quote": "Originally posted by crackerjacks61: I give him more credit than LimpNode Rush.", 
        "reply": " This conversation wasn't about Rush.", 
        "threadID": "672198221_4370080712001", 
        "time": "2009-03-06 16:28:00", 
        "title": "Why I (Michael Moore) Am Not Now and Have Never Been the Democrats' \"Rush Limbaugh\"", 
        "userID": "busnrete8"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: \"Hate a flatulent blubber-butt?\" \"I wouldnt Pizz on Shamu of the left if he were on fire\" Wow, such intelligent responses. lol Fact is, the man was right, and the country agreed with him. your right he was right about one thing. America has a bunch of fat people. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090306, 
        "postID": 32, 
        "quote": "Originally posted by jack_flats: \"Hate a flatulent blubber-butt?\" \"I wouldnt Pizz on Shamu of the left if he were on fire\" Wow, such intelligent responses. lol Fact is, the man was right, and the country agreed with him.", 
        "reply": " your right he was right about one thing. America has a bunch of fat people. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_4370080712001", 
        "time": "2009-03-06 19:11:00", 
        "title": "Why I (Michael Moore) Am Not Now and Have Never Been the Democrats' \"Rush Limbaugh\"", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by busnrete8: quote: Originally posted by crackerjacks61: I give him more credit than LimpNode Rush. This conversation wasn't about Rush. It certainly is. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090306, 
        "postID": 33, 
        "quote": "Originally posted by busnrete8: quote: Originally posted by crackerjacks61: I give him more credit than LimpNode Rush. This conversation wasn't about Rush.", 
        "reply": " It certainly is. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_4370080712001", 
        "time": "2009-03-06 22:22:00", 
        "title": "Why I (Michael Moore) Am Not Now and Have Never Been the Democrats' \"Rush Limbaugh\"", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: quote: Originally posted by busnrete8: quote: Originally posted by crackerjacks61: I give him more credit than LimpNode Rush. This conversation wasn't about Rush. It certainly is. No Jack, it isn't. Check with an English major. The 'subject' was and IS Michael Moore. Even the article was about Michael Moore.", 
        "intTime": 20090307, 
        "postID": 34, 
        "quote": "Originally posted by jack_flats: quote: Originally posted by busnrete8: quote: Originally posted by crackerjacks61: I give him more credit than LimpNode Rush. This conversation wasn't about Rush. It certainly is.", 
        "reply": " No Jack, it isn't. Check with an English major. The 'subject' was and IS Michael Moore. Even the article was about Michael Moore.", 
        "threadID": "672198221_4370080712001", 
        "time": "2009-03-07 02:29:00", 
        "title": "Why I (Michael Moore) Am Not Now and Have Never Been the Democrats' \"Rush Limbaugh\"", 
        "userID": "busnrete8"
    }, 
    {
        "content": "quote: The 'subject' was and IS Michael Moore. and how Michael Moore's position with the DNC is or isn't comparable to Rush's position with the RNC.", 
        "intTime": 20090307, 
        "postID": 35, 
        "quote": "The 'subject' was and IS Michael Moore.", 
        "reply": " and how Michael Moore's position with the DNC is or isn't comparable to Rush's position with the RNC.", 
        "threadID": "672198221_4370080712001", 
        "time": "2009-03-07 02:47:00", 
        "title": "Why I (Michael Moore) Am Not Now and Have Never Been the Democrats' \"Rush Limbaugh\"", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by busnrete8: quote: Originally posted by jack_flats: quote: Originally posted by busnrete8: quote: Originally posted by crackerjacks61: I give him more credit than LimpNode Rush. This conversation wasn't about Rush. It certainly is. No Jack, it isn't. Check with an English major. The 'subject' was and IS Michael Moore. Even the article was about Michael Moore. This is my thread, I ought to know what the article is about. It has everything to do with Rush Limbaugh and with Micheal Moore. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090307, 
        "postID": 36, 
        "quote": "Originally posted by busnrete8: quote: Originally posted by jack_flats: quote: Originally posted by busnrete8: quote: Originally posted by crackerjacks61: I give him more credit than LimpNode Rush. This conversation wasn't about Rush. It certainly is. No Jack, it isn't. Check with an English major. The 'subject' was and IS Michael Moore. Even the article was about Michael Moore.", 
        "reply": " This is my thread, I ought to know what the article is about. It has everything to do with Rush Limbaugh and with Micheal Moore. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_4370080712001", 
        "time": "2009-03-07 05:57:00", 
        "title": "Why I (Michael Moore) Am Not Now and Have Never Been the Democrats' \"Rush Limbaugh\"", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: quote: Originally posted by busnrete8: quote: Originally posted by jack_flats: quote: Originally posted by busnrete8: quote: Originally posted by crackerjacks61: I give him more credit than LimpNode Rush. This conversation wasn't about Rush. It certainly is. No Jack, it isn't. Check with an English major. The 'subject' was and IS Michael Moore. Even the article was about Michael Moore. This is my thread, I ought to know what the article is about. It has everything to do with Rush Limbaugh and with Micheal Moore.", 
        "intTime": 20090307, 
        "postID": 37, 
        "quote": "Originally posted by jack_flats: quote: Originally posted by busnrete8: quote: Originally posted by jack_flats: quote: Originally posted by busnrete8: quote: Originally posted by crackerjacks61: I give him more credit than LimpNode Rush. This conversation wasn't about Rush. It certainly is. No Jack, it isn't. Check with an English major. The 'subject' was and IS Michael Moore. Even the article was about Michael Moore. This is my thread, I ought to know what the article is about. It has everything to do with Rush Limbaugh and with Micheal Moore.", 
        "reply": "", 
        "threadID": "672198221_4370080712001", 
        "time": "2009-03-07 15:49:00", 
        "title": "Why I (Michael Moore) Am Not Now and Have Never Been the Democrats' \"Rush Limbaugh\"", 
        "userID": "busnrete8"
    }, 
    {
        "content": "quote: Originally posted by busnrete8: quote: Originally posted by jack_flats: quote: Originally posted by busnrete8: quote: Originally posted by crackerjacks61: I give him more credit than LimpNode Rush. This conversation wasn't about Rush. It certainly is. No Jack, it isn't. Check with an English major. The 'subject' was and IS Michael Moore. Even the article was about Michael Moore. And if you read the article, Moore compares himself to Limbaugh. \"This\" thread IS about This article, as well as Moore himself. No doubt there have been threads about Moore without that comparison... Dave", 
        "intTime": 20090307, 
        "postID": 38, 
        "quote": "Originally posted by busnrete8: quote: Originally posted by jack_flats: quote: Originally posted by busnrete8: quote: Originally posted by crackerjacks61: I give him more credit than LimpNode Rush. This conversation wasn't about Rush. It certainly is. No Jack, it isn't. Check with an English major. The 'subject' was and IS Michael Moore. Even the article was about Michael Moore.", 
        "reply": " And if you read the article, Moore compares himself to Limbaugh. \"This\" thread IS about This article, as well as Moore himself. No doubt there have been threads about Moore without that comparison... Dave", 
        "threadID": "672198221_4370080712001", 
        "time": "2009-03-07 16:01:00", 
        "title": "Why I (Michael Moore) Am Not Now and Have Never Been the Democrats' \"Rush Limbaugh\"", 
        "userID": "Grachus"
    }, 
    {
        "content": "I'm not a big fan of Moore, not because I disagree with his politics, but because I don't like to praise those who mess around with the facts. Moore should be ashamed of fudging the facts, especially since the absolute truth is so much better. But it is true that the Republican campaign to integrally link him to the Democrats simply didn't hurt the Democrats, whereas the Democratic campaign to link Limbaugh to the Republicans has been a dramatic success. In the one case, the Republican campaign was simply ignored and just wilted, whereas thanks to Rush and the Republican leadership, more and more people are starting to see him as the face of the Republican Party - And that's going to hurt. Strangely enough the Democrats had more success LYING about Nader (my candidate) as a Republican stalking horse, and they benefited from these lies. Dave", 
        "intTime": 20090307, 
        "postID": 39, 
        "quote": "", 
        "reply": "I'm not a big fan of Moore, not because I disagree with his politics, but because I don't like to praise those who mess around with the facts. Moore should be ashamed of fudging the facts, especially since the absolute truth is so much better. But it is true that the Republican campaign to integrally link him to the Democrats simply didn't hurt the Democrats, whereas the Democratic campaign to link Limbaugh to the Republicans has been a dramatic success. In the one case, the Republican campaign was simply ignored and just wilted, whereas thanks to Rush and the Republican leadership, more and more people are starting to see him as the face of the Republican Party - And that's going to hurt. Strangely enough the Democrats had more success LYING about Nader (my candidate) as a Republican stalking horse, and they benefited from these lies. Dave", 
        "threadID": "672198221_4370080712001", 
        "time": "2009-03-07 16:07:00", 
        "title": "Why I (Michael Moore) Am Not Now and Have Never Been the Democrats' \"Rush Limbaugh\"", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: I'm not a big fan of Moore, not because I disagree with his politics, but because I don't like to praise those who mess around with the facts. Moore should be ashamed of fudging the facts, especially since the absolute truth is so much better. The premise of his \"documentary\" Roger and Me was that then GM president Roger Smith would not do an on camera interview to explain employee layoffs and plant closures. It turns out Smith did do at least one interview but Moore kept it out of his film. Don't mince words. The man is a lier. But it is true that the Republican campaign to integrally link him to the Democrats simply didn't hurt the Democrats, whereas the Democratic campaign to link Limbaugh to the Republicans has been a dramatic success. Baloney. The problem is that the GOP does not have a strong leader. In the one case, the Republican campaign was simply ignored and just wilted, whereas thanks to Rush and the Republican leadership, more and more people are starting to see him as the face of the Republican Party - And that's going to hurt. Rush has come out and insisted he is not the head of the GOP. Strangely enough the Democrats had more success LYING about Nader (my candidate) as a Republican stalking horse, and they benefited from these lies. I wonder what lies the Democrats told about Mr. Nader. Ralph Nader has a long history of fudging the facts going back to his auto safety work Unsafe at any Speed and VW; Small on Safety. In any election, this man does not have enough support to get himlelf elected but did have enough of a following ammong Democratic voters to get the Republican candidate voted in. On the other hand, Bill Clinton owes Ross Perot a debt of gratitude for his 1992 victory. Dave", 
        "intTime": 20090308, 
        "postID": 40, 
        "quote": "Originally posted by Grachus: I'm not a big fan of Moore, not because I disagree with his politics, but because I don't like to praise those who mess around with the facts. Moore should be ashamed of fudging the facts, especially since the absolute truth is so much better. The premise of his \"documentary\" Roger and Me was that then GM president Roger Smith would not do an on camera interview to explain employee layoffs and plant closures. It turns out Smith did do at least one interview but Moore kept it out of his film. Don't mince words. The man is a lier. But it is true that the Republican campaign to integrally link him to the Democrats simply didn't hurt the Democrats, whereas the Democratic campaign to link Limbaugh to the Republicans has been a dramatic success. Baloney. The problem is that the GOP does not have a strong leader. In the one case, the Republican campaign was simply ignored and just wilted, whereas thanks to Rush and the Republican leadership, more and more people are starting to see him as the face of the Republican Party - And that's going to hurt. Rush has come out and insisted he is not the head of the GOP. Strangely enough the Democrats had more success LYING about Nader (my candidate) as a Republican stalking horse, and they benefited from these lies. I wonder what lies the Democrats told about Mr. Nader. Ralph Nader has a long history of fudging the facts going back to his auto safety work Unsafe at any Speed and VW; Small on Safety. In any election, this man does not have enough support to get himlelf elected but did have enough of a following ammong Democratic voters to get the Republican candidate voted in. On the other hand, Bill Clinton owes Ross Perot a debt of gratitude for his 1992 victory. Dave", 
        "reply": "", 
        "threadID": "672198221_4370080712001", 
        "time": "2009-03-08 01:16:00", 
        "title": "Why I (Michael Moore) Am Not Now and Have Never Been the Democrats' \"Rush Limbaugh\"", 
        "userID": "scooter_mech"
    }
]