[
    {
        "content": "Yesterday the Stars and Stripes reported that the present administration has seen fit not only to release memo's authorizing the use of enhanced interrogation techniques, but now also wants to release photos of more abuse ala Guantanimo and Abu Ghraib. One then has to wonder how much sway will the Commander in Chief's Spouse have when it comes to being an \"advocate\" for military families? You cannot on one hand purport to support the military and \"feel\" for their families. While your Commander in Chief husband releases findings that put the Active Duty members of these families lives in unneccessary danger. We all remember the violent upswing that occured when the first photos were released, anyone want to doubt the same thing will not happen again? Seems very hypocritical to me to have your spouse travel to military bases and feign support for our military families. While at the same time releasing memo's and photo's that put these same families in jeopardy of losing their loved ones over evidence that could have remained confidential.", 
        "intTime": 20090425, 
        "postID": 1, 
        "quote": "", 
        "reply": "Yesterday the Stars and Stripes reported that the present administration has seen fit not only to release memo's authorizing the use of enhanced interrogation techniques, but now also wants to release photos of more abuse ala Guantanimo and Abu Ghraib. One then has to wonder how much sway will the Commander in Chief's Spouse have when it comes to being an \"advocate\" for military families? You cannot on one hand purport to support the military and \"feel\" for their families. While your Commander in Chief husband releases findings that put the Active Duty members of these families lives in unneccessary danger. We all remember the violent upswing that occured when the first photos were released, anyone want to doubt the same thing will not happen again? Seems very hypocritical to me to have your spouse travel to military bases and feign support for our military families. While at the same time releasing memo's and photo's that put these same families in jeopardy of losing their loved ones over evidence that could have remained confidential.", 
        "threadID": "672198221_5860087122001", 
        "time": "2009-04-25 21:35:00", 
        "title": "hypocrisy of present administration", 
        "userID": "ronald45"
    }, 
    {
        "content": "quote: Originally posted by ronald45: Yesterday the Stars and Stripes reported that the present administration has seen fit not only to release memo's authorizing the use of enhanced interrogation techniques, but now also wants to release photos of more abuse ala Guantanimo and Abu Ghraib. One then has to wonder how much sway will the Commander in Chief's Spouse have when it comes to being an \"advocate\" for military families? You cannot on one hand purport to support the military and \"feel\" for their families. While your Commander in Chief husband releases findings that put the Active Duty members of these families lives in unneccessary danger. We all remember the violent upswing that occured when the first photos were released, anyone want to doubt the same thing will not happen again? Seems very hypocritical to me to have your spouse travel to military bases and feign support for our military families. While at the same time releasing memo's and photo's that put these same families in jeopardy of losing their loved ones over evidence that could have remained confidential. Question for you? Who exactly was it that made the previous pictures a reality by green lighting the 'enhanced interrogation' TORTURE techniques.", 
        "intTime": 20090425, 
        "postID": 2, 
        "quote": "Originally posted by ronald45: Yesterday the Stars and Stripes reported that the present administration has seen fit not only to release memo's authorizing the use of enhanced interrogation techniques, but now also wants to release photos of more abuse ala Guantanimo and Abu Ghraib. One then has to wonder how much sway will the Commander in Chief's Spouse have when it comes to being an \"advocate\" for military families? You cannot on one hand purport to support the military and \"feel\" for their families. While your Commander in Chief husband releases findings that put the Active Duty members of these families lives in unneccessary danger. We all remember the violent upswing that occured when the first photos were released, anyone want to doubt the same thing will not happen again? Seems very hypocritical to me to have your spouse travel to military bases and feign support for our military families. While at the same time releasing memo's and photo's that put these same families in jeopardy of losing their loved ones over evidence that could have remained confidential.", 
        "reply": " Question for you? Who exactly was it that made the previous pictures a reality by green lighting the 'enhanced interrogation' TORTURE techniques.", 
        "threadID": "672198221_5860087122001", 
        "time": "2009-04-25 21:40:00", 
        "title": "hypocrisy of present administration", 
        "userID": "jdksfcret"
    }, 
    {
        "content": "yeah we all know it was Bush's fault, but didn't see his Spouse running around trying to be \"all friendly\" with the spouses of military members did we? I would just like to see one \"military spouse\" call Michelle on this little issue the next time she happens to visit a military instillation. While those on Active Duty are forbidden to question the CINC, I don't think military spouses are limited in such a manner.", 
        "intTime": 20090425, 
        "postID": 3, 
        "quote": "", 
        "reply": "yeah we all know it was Bush's fault, but didn't see his Spouse running around trying to be \"all friendly\" with the spouses of military members did we? I would just like to see one \"military spouse\" call Michelle on this little issue the next time she happens to visit a military instillation. While those on Active Duty are forbidden to question the CINC, I don't think military spouses are limited in such a manner.", 
        "threadID": "672198221_5860087122001", 
        "time": "2009-04-25 22:12:00", 
        "title": "hypocrisy of present administration", 
        "userID": "ronald45"
    }, 
    {
        "content": "What I don't get is that supposedly the worst photos have already been exposed so what is the point by releasing these as well?? No matter how much people deny it, this will inflame the region...", 
        "intTime": 20090425, 
        "postID": 4, 
        "quote": "", 
        "reply": "What I don't get is that supposedly the worst photos have already been exposed so what is the point by releasing these as well?? No matter how much people deny it, this will inflame the region...", 
        "threadID": "672198221_5860087122001", 
        "time": "2009-04-25 23:08:00", 
        "title": "hypocrisy of present administration", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "That's a pretty weak definition of hypocrisy. Evidence of torture and supporting the military are two completely different things.", 
        "intTime": 20090426, 
        "postID": 5, 
        "quote": "", 
        "reply": "That's a pretty weak definition of hypocrisy. Evidence of torture and supporting the military are two completely different things.", 
        "threadID": "672198221_5860087122001", 
        "time": "2009-04-26 00:15:00", 
        "title": "hypocrisy of present administration", 
        "userID": "foxred03"
    }, 
    {
        "content": "quote: Originally posted by ronald45: yeah we all know it was Bush's fault, but didn't see his Spouse running around trying to be \"all friendly\" with the spouses of military members did we? I would just like to see one \"military spouse\" call Michelle on this little issue the next time she happens to visit a military instillation. While those on Active Duty are forbidden to question the CINC, I don't think military spouses are limited in such a manner. but didn't see his Spouse running around trying to be \"all friendly\" with the spouses of military members did we? Uh, as a matter of fact she did. So I guess you are saying that the wife of the CinC shouldn't get all 'friendly' with the other 'wives'. Of all the ignorant statements recently about the current POTUS (and now former) and his family, this has to rate right up at the top of the list. Lets see I've found that the former first lady did the following for the soldiers and their families. 1. Hosted picnics on the south lawn and an annual Tee Ball game between teams representing the Air Force and Navy. http://www.littleleague.org/media/newsarchive/03_2006/06teeballgame14.htm 2. First Lady Laura Bush hosts a pair of fundraisers in Texas (Dallas and Houston) which are expected to raise more than $400,000 for the RNC. Approximately 40 attendees are expected at each one. RNC Chairman Ken Mehlman plans to attend the Dallas fundraiser. Tomorrow, Mrs. Bush will be in Galveston, TX for the commissioning ceremony of USS Texas. http://abcnews.go.com/Politics/TheNote/story?id=2424225&page=1 That is just two, I'm sure over the eight years there were hundreds of more visits and contacts. Yet now, the current First Lady doing the same and it is somehow different and hypocritical. It is truly amazing how low some are willing to go to disrespect the First Family.", 
        "intTime": 20090426, 
        "postID": 6, 
        "quote": "Originally posted by ronald45: yeah we all know it was Bush's fault, but didn't see his Spouse running around trying to be \"all friendly\" with the spouses of military members did we? I would just like to see one \"military spouse\" call Michelle on this little issue the next time she happens to visit a military instillation. While those on Active Duty are forbidden to question the CINC, I don't think military spouses are limited in such a manner.", 
        "reply": " but didn't see his Spouse running around trying to be \"all friendly\" with the spouses of military members did we? Uh, as a matter of fact she did. So I guess you are saying that the wife of the CinC shouldn't get all 'friendly' with the other 'wives'. Of all the ignorant statements recently about the current POTUS (and now former) and his family, this has to rate right up at the top of the list. Lets see I've found that the former first lady did the following for the soldiers and their families. 1. Hosted picnics on the south lawn and an annual Tee Ball game between teams representing the Air Force and Navy. http://www.littleleague.org/media/newsarchive/03_2006/06teeballgame14.htm 2. First Lady Laura Bush hosts a pair of fundraisers in Texas (Dallas and Houston) which are expected to raise more than $400,000 for the RNC. Approximately 40 attendees are expected at each one. RNC Chairman Ken Mehlman plans to attend the Dallas fundraiser. Tomorrow, Mrs. Bush will be in Galveston, TX for the commissioning ceremony of USS Texas. http://abcnews.go.com/Politics/TheNote/story?id=2424225&page=1 That is just two, I'm sure over the eight years there were hundreds of more visits and contacts. Yet now, the current First Lady doing the same and it is somehow different and hypocritical. It is truly amazing how low some are willing to go to disrespect the First Family.", 
        "threadID": "672198221_5860087122001", 
        "time": "2009-04-26 00:40:00", 
        "title": "hypocrisy of present administration", 
        "userID": "jdksfcret"
    }, 
    {
        "content": "That 'enhanced interrogation' led to the deployment of US troops in Iraq is no reflection on the troops. It is, however, the basis of a condemnation of their political masters. So whatever 'endangering' was, or is, being done is a direct consequence of the orders to deploy the troops. The media has little to do with the actions taken on intel derived from torture and the consequent negative effects on the 'mission'. The latter would have occurred anyway. Andrew Sullivan has an excellent piece in the Timesonline on the topic: >http://www.timesonline.co.uk/tol/comment/columnists/andrew_sullivan/article6168270.ece What may be hypocritical is that the President continues to allow those who executed such interrogations, and prepared contrived 'intel' reports, to continue to 'serve'. But there's a war on and a purge might really endanger the military.", 
        "intTime": 20090426, 
        "postID": 7, 
        "quote": "", 
        "reply": "That 'enhanced interrogation' led to the deployment of US troops in Iraq is no reflection on the troops. It is, however, the basis of a condemnation of their political masters. So whatever 'endangering' was, or is, being done is a direct consequence of the orders to deploy the troops. The media has little to do with the actions taken on intel derived from torture and the consequent negative effects on the 'mission'. The latter would have occurred anyway. Andrew Sullivan has an excellent piece in the Timesonline on the topic: >http://www.timesonline.co.uk/tol/comment/columnists/andrew_sullivan/article6168270.ece What may be hypocritical is that the President continues to allow those who executed such interrogations, and prepared contrived 'intel' reports, to continue to 'serve'. But there's a war on and a purge might really endanger the military.", 
        "threadID": "672198221_5860087122001", 
        "time": "2009-04-26 01:46:00", 
        "title": "hypocrisy of present administration", 
        "userID": "popsiq"
    }, 
    {
        "content": "All the above posts are good and to a large degree true. My view is that this country needs to pay more close attention to our economy, our health care system, and our military than to open up a can of unnecessary worms. I agree that more hatred and loss of lives will develop once these photos are shown. It seems that our Leaders in Congress and the Senate are more concerned with destroying a past President than they are with helping those they swore to help. Don't they know what the words \"Muslim Extremist\" means? I hate to say this but maybe we need another 9/11 to wake this country back up.", 
        "intTime": 20090426, 
        "postID": 8, 
        "quote": "", 
        "reply": "All the above posts are good and to a large degree true. My view is that this country needs to pay more close attention to our economy, our health care system, and our military than to open up a can of unnecessary worms. I agree that more hatred and loss of lives will develop once these photos are shown. It seems that our Leaders in Congress and the Senate are more concerned with destroying a past President than they are with helping those they swore to help. Don't they know what the words \"Muslim Extremist\" means? I hate to say this but maybe we need another 9/11 to wake this country back up.", 
        "threadID": "672198221_5860087122001", 
        "time": "2009-04-26 03:22:00", 
        "title": "hypocrisy of present administration", 
        "userID": "Duster6"
    }, 
    {
        "content": "As stated it will be interesting to see how the First Lady handles the question if it is posed by some Soldier's Spouse. I guess her answer will show just how \"sincere\" she truly is with her actions. The only thing remaining is will any Soldier's spouse have the gumption to put two and two together and pose the question. Excuse me if after many, many, year of serving under various politicians if I question all of their motives when it comes to the military as of late. I guess serving under the last 4 POTUS will do that to a person, when one sees the military used as a political means more and more instead of for true \"defense\" of the nation.", 
        "intTime": 20090426, 
        "postID": 9, 
        "quote": "", 
        "reply": "As stated it will be interesting to see how the First Lady handles the question if it is posed by some Soldier's Spouse. I guess her answer will show just how \"sincere\" she truly is with her actions. The only thing remaining is will any Soldier's spouse have the gumption to put two and two together and pose the question. Excuse me if after many, many, year of serving under various politicians if I question all of their motives when it comes to the military as of late. I guess serving under the last 4 POTUS will do that to a person, when one sees the military used as a political means more and more instead of for true \"defense\" of the nation.", 
        "threadID": "672198221_5860087122001", 
        "time": "2009-04-26 03:31:00", 
        "title": "hypocrisy of present administration", 
        "userID": "ronald45"
    }, 
    {
        "content": "quote: Originally posted by ronald45: As stated it will be interesting to see how the First Lady handles the question if it is posed by some Soldier's Spouse. I guess her answer will show just how \"sincere\" she truly is with her actions. The only thing remaining is will any Soldier's spouse have the gumption to put two and two together and pose the question. Excuse me if after many, many, year of serving under various politicians if I question all of their motives when it comes to the military as of late. I guess serving under the last 4 POTUS will do that to a person, when one sees the military used as a political means more and more instead of for true \"defense\" of the nation. Well said ronald. I served under 5 in 22 years-the last was Reagan. One item missing currently is a 'complete' education of the military--NOT just bullets and bombs!", 
        "intTime": 20090426, 
        "postID": 10, 
        "quote": "Originally posted by ronald45: As stated it will be interesting to see how the First Lady handles the question if it is posed by some Soldier's Spouse. I guess her answer will show just how \"sincere\" she truly is with her actions. The only thing remaining is will any Soldier's spouse have the gumption to put two and two together and pose the question. Excuse me if after many, many, year of serving under various politicians if I question all of their motives when it comes to the military as of late. I guess serving under the last 4 POTUS will do that to a person, when one sees the military used as a political means more and more instead of for true \"defense\" of the nation.", 
        "reply": " Well said ronald. I served under 5 in 22 years-the last was Reagan. One item missing currently is a 'complete' education of the military--NOT just bullets and bombs!", 
        "threadID": "672198221_5860087122001", 
        "time": "2009-04-26 06:31:00", 
        "title": "hypocrisy of present administration", 
        "userID": "busnrete8"
    }, 
    {
        "content": "quote: Originally posted by ronald45: You cannot on one hand purport to support the military and \"feel\" for their families. While your Commander in Chief husband releases findings that put the Active Duty members of these families lives in unneccessary danger. As opposed to \"necessary danger\"? Was Iraq necessary? Were Gitmo, \"EIT\", etc. necessary?", 
        "intTime": 20090426, 
        "postID": 11, 
        "quote": "Originally posted by ronald45: You cannot on one hand purport to support the military and \"feel\" for their families. While your Commander in Chief husband releases findings that put the Active Duty members of these families lives in unneccessary danger.", 
        "reply": " As opposed to \"necessary danger\"? Was Iraq necessary? Were Gitmo, \"EIT\", etc. necessary?", 
        "threadID": "672198221_5860087122001", 
        "time": "2009-04-26 06:39:00", 
        "title": "hypocrisy of present administration", 
        "userID": "Motive25"
    }, 
    {
        "content": "Obama has no credibilty after butt kissing the Saudy king and Castro and Chaves and any other enemys that come along! next in line is pupu Pelosi", 
        "intTime": 20090426, 
        "postID": 12, 
        "quote": "", 
        "reply": "Obama has no credibilty after butt kissing the Saudy king and Castro and Chaves and any other enemys that come along! next in line is pupu Pelosi", 
        "threadID": "672198221_5860087122001", 
        "time": "2009-04-26 06:42:00", 
        "title": "hypocrisy of present administration", 
        "userID": "EAG154"
    }
]