[
    {
        "content": "Thoughts anyone? quote: CHAD may rank among the most hostile missions Irish troops have ever embarked on, but it is no place for soccer or volleyball. Despite the soldiers’ extreme training at Camp Ciara in order to prepare for combat situations, the defence forces have decided contact sports are a step too far. Defence Minister Willie O’Dea said the decision was made for health and safety reasons. \"The reality in Chad is that the ground is extremely hard. Some of the sports are played out on open ground and when people fall, it tends to have a much greater impact on their bodies than falling in a field in Ireland, where the ground is not nearly as hard,\" he told the Dáil... ++http://www.examiner.ie/ireland/soldiers-primed-for-chad-combat-but-contact-sports-get-marching-orders-91194.html", 
        "intTime": 20090507, 
        "postID": 1, 
        "quote": "CHAD may rank among the most hostile missions Irish troops have ever embarked on, but it is no place for soccer or volleyball. Despite the soldiers’ extreme training at Camp Ciara in order to prepare for combat situations, the defence forces have decided contact sports are a step too far. Defence Minister Willie O’Dea said the decision was made for health and safety reasons. \"The reality in Chad is that the ground is extremely hard. Some of the sports are played out on open ground and when people fall, it tends to have a much greater impact on their bodies than falling in a field in Ireland, where the ground is not nearly as hard,\" he told the Dáil... ++http://www.examiner.ie/ireland/soldiers-primed-for-chad-combat-but-contact-sports-get-marching-orders-91194.html", 
        "reply": "Thoughts anyone? ", 
        "threadID": "672198221_1840027222001", 
        "time": "2009-05-07 07:19:00", 
        "title": "Irish Soldiers prevented from playing soccer in Chad since \"it's too dangerous\"", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "Sounds like someone from the US Army is in charge of the Irish military's new risk assessment program.", 
        "intTime": 20090507, 
        "postID": 2, 
        "quote": "", 
        "reply": "Sounds like someone from the US Army is in charge of the Irish military's new risk assessment program.", 
        "threadID": "672198221_1840027222001", 
        "time": "2009-05-07 07:20:00", 
        "title": "Irish Soldiers prevented from playing soccer in Chad since \"it's too dangerous\"", 
        "userID": "foxred03"
    }
]