[
    {
        "content": "Soldiers accused of photographing showers Several soldiers from the Virginia National Guard are under investigation for allegedly taking pictures of female soldiers in the shower during pre-deployment mobilization training. The soldiers being investigated are with the 266th Military Police Company and are assigned to Multi-National Force-Iraq in Baghdad, according to a Defense Department news release. The misconduct allegedly took place at Fort Dix, N.J., in the fall of 2008. More at ... >>>http://www.armytimes.com/news/2009/05/army_shower_pictures_052909w/", 
        "intTime": 20090530, 
        "postID": 1, 
        "quote": "", 
        "reply": "Soldiers accused of photographing showers Several soldiers from the Virginia National Guard are under investigation for allegedly taking pictures of female soldiers in the shower during pre-deployment mobilization training. The soldiers being investigated are with the 266th Military Police Company and are assigned to Multi-National Force-Iraq in Baghdad, according to a Defense Department news release. The misconduct allegedly took place at Fort Dix, N.J., in the fall of 2008. More at ... >>>http://www.armytimes.com/news/2009/05/army_shower_pictures_052909w/", 
        "threadID": "672198221_4860096422001", 
        "time": "2009-05-30 19:01:00", 
        "title": "Soldiers accused of photographing showers", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "Depends on the Barracks age. Some of the Refurbed have Individual Stalls and the Older ones have Communal with 6 shower heads I've used Dix's Barracks on and off for about 24 years, De-Mobilized twice there, and lived there as an O/C-T for a few weeks at a time The shower entrance in either case faces away from the Latrine entrance doors, so the only way I can think of to get a view would be: 1- Walk onto a female floor and enter the Female latrines (Pretty Ballzy if done). Your caught red handed, though some units have a low fraternization policy, IMO it always leads to trouble. 2- The Frosted Privacy Windows facing the Shower would have to be wide open, and someone across the quadrangle have just the right level for the older Buildings. For the Re-furbished ones the windows are about 2Sq ft all the way up the wall where the Ceiling/Wall meet. If they can prove it the book should be thrown at the Miscreants.", 
        "intTime": 20090530, 
        "postID": 2, 
        "quote": "", 
        "reply": "Depends on the Barracks age. Some of the Refurbed have Individual Stalls and the Older ones have Communal with 6 shower heads I've used Dix's Barracks on and off for about 24 years, De-Mobilized twice there, and lived there as an O/C-T for a few weeks at a time The shower entrance in either case faces away from the Latrine entrance doors, so the only way I can think of to get a view would be: 1- Walk onto a female floor and enter the Female latrines (Pretty Ballzy if done). Your caught red handed, though some units have a low fraternization policy, IMO it always leads to trouble. 2- The Frosted Privacy Windows facing the Shower would have to be wide open, and someone across the quadrangle have just the right level for the older Buildings. For the Re-furbished ones the windows are about 2Sq ft all the way up the wall where the Ceiling/Wall meet. If they can prove it the book should be thrown at the Miscreants.", 
        "threadID": "672198221_4860096422001", 
        "time": "2009-05-30 19:32:00", 
        "title": "Soldiers accused of photographing showers", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "At Ft Wood while I was a Drill, the WAC barracks were always getting bomb threats. When one would come in the MPs would swarm the place going from room to room rousting the WACs out of bed to evac the building. They would fly out of bed butt naked or just in knickers and exit the building. After awhile they finally caught the person making the calls, it was a fellow MP. Buddies...............", 
        "intTime": 20090530, 
        "postID": 3, 
        "quote": "", 
        "reply": "At Ft Wood while I was a Drill, the WAC barracks were always getting bomb threats. When one would come in the MPs would swarm the place going from room to room rousting the WACs out of bed to evac the building. They would fly out of bed butt naked or just in knickers and exit the building. After awhile they finally caught the person making the calls, it was a fellow MP. Buddies...............", 
        "threadID": "672198221_4860096422001", 
        "time": "2009-05-30 19:43:00", 
        "title": "Soldiers accused of photographing showers", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by SignalSgtWilliams: At Ft Wood while I was a Drill, the WAC barracks were always getting bomb threats. When one would come in the MPs would swarm the place going from room to room rousting the WACs out of bed to evac the building. They would fly out of bed butt naked or just in knickers and exit the building. After awhile they finally caught the person making the calls, it was a fellow MP. Buddies............... SignalSgt, LOL. Okay, I'm not supposed to laugh and will probably be branded a sexist for laughing. However, after all of the major charges our troops have faced lately, the \"crime\" committed by the MP responsible for rousting the WACs at FLW no longer seems significant. Jack", 
        "intTime": 20090530, 
        "postID": 4, 
        "quote": "Originally posted by SignalSgtWilliams: At Ft Wood while I was a Drill, the WAC barracks were always getting bomb threats. When one would come in the MPs would swarm the place going from room to room rousting the WACs out of bed to evac the building. They would fly out of bed butt naked or just in knickers and exit the building. After awhile they finally caught the person making the calls, it was a fellow MP. Buddies...............", 
        "reply": " SignalSgt, LOL. Okay, I'm not supposed to laugh and will probably be branded a sexist for laughing. However, after all of the major charges our troops have faced lately, the \"crime\" committed by the MP responsible for rousting the WACs at FLW no longer seems significant. Jack", 
        "threadID": "672198221_4860096422001", 
        "time": "2009-05-30 20:46:00", 
        "title": "Soldiers accused of photographing showers", 
        "userID": "jackhunter1"
    }, 
    {
        "content": "Just a bunch of good ole boys having a little fun. I bet some of those females knew they were watching and enjoyed it.", 
        "intTime": 20090531, 
        "postID": 5, 
        "quote": "", 
        "reply": "Just a bunch of good ole boys having a little fun. I bet some of those females knew they were watching and enjoyed it.", 
        "threadID": "672198221_4860096422001", 
        "time": "2009-05-31 02:51:00", 
        "title": "Soldiers accused of photographing showers", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Duster6: Just a bunch of good ole boys having a little fun. I bet some of those females knew they were watching and enjoyed it. Do I need to note that your perspective is 'interesting'. Were you born in the Ozarks? Do you think they were 'asking for it', too? Or perhaps you think those 'good ol' boys were able to avoid taking pictures of the other ones who weren't 'enjoying' it.", 
        "intTime": 20090531, 
        "postID": 6, 
        "quote": "Originally posted by Duster6: Just a bunch of good ole boys having a little fun. I bet some of those females knew they were watching and enjoyed it.", 
        "reply": " Do I need to note that your perspective is 'interesting'. Were you born in the Ozarks? Do you think they were 'asking for it', too? Or perhaps you think those 'good ol' boys were able to avoid taking pictures of the other ones who weren't 'enjoying' it.", 
        "threadID": "672198221_4860096422001", 
        "time": "2009-05-31 03:33:00", 
        "title": "Soldiers accused of photographing showers", 
        "userID": "AliBubba"
    }, 
    {
        "content": "should they have done it? no. should they be punished for doing it? yes. Is it worthy of an article? Not even close.", 
        "intTime": 20090531, 
        "postID": 7, 
        "quote": "", 
        "reply": "should they have done it? no. should they be punished for doing it? yes. Is it worthy of an article? Not even close.", 
        "threadID": "672198221_4860096422001", 
        "time": "2009-05-31 03:58:00", 
        "title": "Soldiers accused of photographing showers", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: should they have done it? no. should they be punished for doing it? yes. Is it worthy of an article? Not even close. karl, Agree. Jack", 
        "intTime": 20090531, 
        "postID": 8, 
        "quote": "Originally posted by karlhungusjr: should they have done it? no. should they be punished for doing it? yes. Is it worthy of an article? Not even close.", 
        "reply": " karl, Agree. Jack", 
        "threadID": "672198221_4860096422001", 
        "time": "2009-05-31 12:35:00", 
        "title": "Soldiers accused of photographing showers", 
        "userID": "jackhunter1"
    }, 
    {
        "content": "quote: Originally posted by Duster6: Just a bunch of good ole boys having a little fun. I bet some of those females knew they were watching and enjoyed it. Roger that Sgt..", 
        "intTime": 20090531, 
        "postID": 9, 
        "quote": "Originally posted by Duster6: Just a bunch of good ole boys having a little fun. I bet some of those females knew they were watching and enjoyed it.", 
        "reply": " Roger that Sgt..", 
        "threadID": "672198221_4860096422001", 
        "time": "2009-05-31 12:45:00", 
        "title": "Soldiers accused of photographing showers", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by jackhunter1: quote: Originally posted by karlhungusjr: should they have done it? no. should they be punished for doing it? yes. Is it worthy of an article? Not even close. karl, Agree. Jack Not to condone it but their action is nothing new, some recruits have done this before, and digital cameras were not available then. You had to use a Polaroid or develop the film yourself commercial developers blacked out those types of photos. Recruits did that in the 60's.", 
        "intTime": 20090531, 
        "postID": 10, 
        "quote": "Originally posted by jackhunter1: quote: Originally posted by karlhungusjr: should they have done it? no. should they be punished for doing it? yes. Is it worthy of an article? Not even close. karl, Agree. Jack", 
        "reply": " Not to condone it but their action is nothing new, some recruits have done this before, and digital cameras were not available then. You had to use a Polaroid or develop the film yourself commercial developers blacked out those types of photos. Recruits did that in the 60's.", 
        "threadID": "672198221_4860096422001", 
        "time": "2009-05-31 12:50:00", 
        "title": "Soldiers accused of photographing showers", 
        "userID": "ss_287"
    }, 
    {
        "content": "quote: Originally posted by AliBubba: quote: Originally posted by Duster6: Just a bunch of good ole boys having a little fun. I bet some of those females knew they were watching and enjoyed it. Do I need to note that your perspective is 'interesting'. Were you born in the Ozarks? Do you think they were 'asking for it', too? Or perhaps you think those 'good ol' boys were able to avoid taking pictures of the other ones who weren't 'enjoying' it. Well let's see, Someone had to leave the shower stall open, the door to the shower area unlocked/opened, and or the windows unlocked/open for the guys to get the pics. My guess here is that it WASN'T THE GUYS? Unless we have females taking photos of females in the showers and that opens up a whole new perspective on the situation doesn't it.", 
        "intTime": 20090531, 
        "postID": 11, 
        "quote": "Originally posted by AliBubba: quote: Originally posted by Duster6: Just a bunch of good ole boys having a little fun. I bet some of those females knew they were watching and enjoyed it. Do I need to note that your perspective is 'interesting'. Were you born in the Ozarks? Do you think they were 'asking for it', too? Or perhaps you think those 'good ol' boys were able to avoid taking pictures of the other ones who weren't 'enjoying' it.", 
        "reply": " Well let's see, Someone had to leave the shower stall open, the door to the shower area unlocked/opened, and or the windows unlocked/open for the guys to get the pics. My guess here is that it WASN'T THE GUYS? Unless we have females taking photos of females in the showers and that opens up a whole new perspective on the situation doesn't it.", 
        "threadID": "672198221_4860096422001", 
        "time": "2009-05-31 21:06:00", 
        "title": "Soldiers accused of photographing showers", 
        "userID": "ronald45"
    }, 
    {
        "content": "quote: Originally posted by ronald45: quote: Originally posted by AliBubba: quote: Originally posted by Duster6: Just a bunch of good ole boys having a little fun. I bet some of those females knew they were watching and enjoyed it. Do I need to note that your perspective is 'interesting'. Were you born in the Ozarks? Do you think they were 'asking for it', too? Or perhaps you think those 'good ol' boys were able to avoid taking pictures of the other ones who weren't 'enjoying' it. Well let's see, Someone had to leave the shower stall open, the door to the shower area unlocked/opened, and or the windows unlocked/open for the guys to get the pics. My guess here is that it WASN'T THE GUYS? Unless we have females taking photos of females in the showers and that opens up a whole new perspective on the situation doesn't it. If that is the case, then it would raise big questions about allowing Gays to serve at all..", 
        "intTime": 20090531, 
        "postID": 12, 
        "quote": "Originally posted by ronald45: quote: Originally posted by AliBubba: quote: Originally posted by Duster6: Just a bunch of good ole boys having a little fun. I bet some of those females knew they were watching and enjoyed it. Do I need to note that your perspective is 'interesting'. Were you born in the Ozarks? Do you think they were 'asking for it', too? Or perhaps you think those 'good ol' boys were able to avoid taking pictures of the other ones who weren't 'enjoying' it. Well let's see, Someone had to leave the shower stall open, the door to the shower area unlocked/opened, and or the windows unlocked/open for the guys to get the pics. My guess here is that it WASN'T THE GUYS? Unless we have females taking photos of females in the showers and that opens up a whole new perspective on the situation doesn't it.", 
        "reply": " If that is the case, then it would raise big questions about allowing Gays to serve at all..", 
        "threadID": "672198221_4860096422001", 
        "time": "2009-05-31 21:14:00", 
        "title": "Soldiers accused of photographing showers", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "Keep recruiting non-high school grads, and this is what you get. We need the Draft re-instituted so the services can draw from those who are best educated, and who don't have criminal or Juvenile law offenses. The military services urgently need an upgrading of personnel. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090531, 
        "postID": 13, 
        "quote": "", 
        "reply": "Keep recruiting non-high school grads, and this is what you get. We need the Draft re-instituted so the services can draw from those who are best educated, and who don't have criminal or Juvenile law offenses. The military services urgently need an upgrading of personnel. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_4860096422001", 
        "time": "2009-05-31 21:21:00", 
        "title": "Soldiers accused of photographing showers", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: Keep recruiting non-high school grads, and this is what you get. We need the Draft re-instituted so the services can draw from those who are best educated, and who don't have criminal or Juvenile law offenses. The military services urgently need an upgrading of personnel. Right, only a liberal could view our current Military as a bunch of malcontent criminals I served with the finest men America has to offer in Iraq and Afghanistan. PERIOD.", 
        "intTime": 20090531, 
        "postID": 14, 
        "quote": "Originally posted by jack_flats: Keep recruiting non-high school grads, and this is what you get. We need the Draft re-instituted so the services can draw from those who are best educated, and who don't have criminal or Juvenile law offenses. The military services urgently need an upgrading of personnel.", 
        "reply": " Right, only a liberal could view our current Military as a bunch of malcontent criminals I served with the finest men America has to offer in Iraq and Afghanistan. PERIOD.", 
        "threadID": "672198221_4860096422001", 
        "time": "2009-05-31 21:40:00", 
        "title": "Soldiers accused of photographing showers", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "Originally posted by jack_flats: Keep recruiting non-high school grads, and this is what you get. We need the Draft re-instituted so the services can draw from those who are best educated, and who don't have criminal or Juvenile law offenses. The military services urgently need an upgrading of personnel This guy was a Non-High School Grad How does that foot taste?", 
        "intTime": 20090531, 
        "postID": 15, 
        "quote": "", 
        "reply": "Originally posted by jack_flats: Keep recruiting non-high school grads, and this is what you get. We need the Draft re-instituted so the services can draw from those who are best educated, and who don't have criminal or Juvenile law offenses. The military services urgently need an upgrading of personnel This guy was a Non-High School Grad How does that foot taste?", 
        "threadID": "672198221_4860096422001", 
        "time": "2009-05-31 21:46:00", 
        "title": "Soldiers accused of photographing showers", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by jack_flats: Keep recruiting non-high school grads, and this is what you get. We need the Draft re-instituted so the services can draw from those who are best educated, and who don't have criminal or Juvenile law offenses. The military services urgently need an upgrading of personnel. Right, only a liberal could view our current Military as a bunch of malcontent criminals I served with the finest men America has to offer in Iraq and Afghanistan. PERIOD. I too served with some of the finest soldiers ever to wear an Army uniform, draftees who like myself, were mature, educated (many who attended college and had college degrees), polished, and who incidentally, served with pride. I experienced what it was like to serve with both enlistees and draftees. You didn't. I know better. Face it, we need to bring back national service. Our military needs a serious upgrading of personnel. This message has been edited. Last edited by: jack_flats, Sun 31 May 2009 10:20 PM \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090531, 
        "postID": 16, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Originally posted by jack_flats: Keep recruiting non-high school grads, and this is what you get. We need the Draft re-instituted so the services can draw from those who are best educated, and who don't have criminal or Juvenile law offenses. The military services urgently need an upgrading of personnel. Right, only a liberal could view our current Military as a bunch of malcontent criminals I served with the finest men America has to offer in Iraq and Afghanistan. PERIOD.", 
        "reply": " I too served with some of the finest soldiers ever to wear an Army uniform, draftees who like myself, were mature, educated (many who attended college and had college degrees), polished, and who incidentally, served with pride. I experienced what it was like to serve with both enlistees and draftees. You didn't. I know better. Face it, we need to bring back national service. Our military needs a serious upgrading of personnel. This message has been edited. Last edited by: jack_flats, Sun 31 May 2009 10:20 PM \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_4860096422001", 
        "time": "2009-05-31 22:05:00", 
        "title": "Soldiers accused of photographing showers", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by LineDoggie: Originally posted by jack_flats: Keep recruiting non-high school grads, and this is what you get. We need the Draft re-instituted so the services can draw from those who are best educated, and who don't have criminal or Juvenile law offenses. The military services urgently need an upgrading of personnel This guy was a Non-High School Grad How does that foot taste? Audie Murphy ... Incidentally, you know Murphy wasn't the most highly decorated soldier during WW2. That honor belonged to a then CPT Matthew Urban, who eventually retired a colonel. Murphy had the Hollywood looks and the Hollywood press agent, and the more interesting story behind him. But yes, Murphy wasn't a HS grad. There are exceptions. In WW2 we had a Draft, as we had up until the the start of the all-volunteer force. We need a serious upgrading of our armed forces that only a draft can provide. To many bad apples coming in, not offset by great numbers of more educated and mature inductees. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090531, 
        "postID": 17, 
        "quote": "Originally posted by LineDoggie: Originally posted by jack_flats: Keep recruiting non-high school grads, and this is what you get. We need the Draft re-instituted so the services can draw from those who are best educated, and who don't have criminal or Juvenile law offenses. The military services urgently need an upgrading of personnel This guy was a Non-High School Grad How does that foot taste?", 
        "reply": " Audie Murphy ... Incidentally, you know Murphy wasn't the most highly decorated soldier during WW2. That honor belonged to a then CPT Matthew Urban, who eventually retired a colonel. Murphy had the Hollywood looks and the Hollywood press agent, and the more interesting story behind him. But yes, Murphy wasn't a HS grad. There are exceptions. In WW2 we had a Draft, as we had up until the the start of the all-volunteer force. We need a serious upgrading of our armed forces that only a draft can provide. To many bad apples coming in, not offset by great numbers of more educated and mature inductees. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_4860096422001", 
        "time": "2009-05-31 22:17:00", 
        "title": "Soldiers accused of photographing showers", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: quote: Originally posted by LineDoggie: Originally posted by jack_flats: Keep recruiting non-high school grads, and this is what you get. We need the Draft re-instituted so the services can draw from those who are best educated, and who don't have criminal or Juvenile law offenses. The military services urgently need an upgrading of personnel This guy was a Non-High School Grad How does that foot taste? Audie Murphy ... Incidentally, you know Murphy wasn't the most highly decorated soldier during WW2. That honor belonged to a then CPT Matthew Urban, who eventually retired a colonel. Murphy had the Hollywood looks and the Hollywood press agent, and the more interesting story behind him. But yes, Murphy wasn't a HS grad. There are exceptions. In WW2 we had a Draft, as we had up until the the start of the all-volunteer force. We need a serious upgrading of our armed forces that only a draft can provide. To many bad apples coming in, not offset by great numbers of more educated and mature inductees. Audie Leon Murphy was a VOLUNTEER!... NEXT!... Respectfully, SUNLINER81", 
        "intTime": 20090531, 
        "postID": 18, 
        "quote": "Originally posted by jack_flats: quote: Originally posted by LineDoggie: Originally posted by jack_flats: Keep recruiting non-high school grads, and this is what you get. We need the Draft re-instituted so the services can draw from those who are best educated, and who don't have criminal or Juvenile law offenses. The military services urgently need an upgrading of personnel This guy was a Non-High School Grad How does that foot taste? Audie Murphy ... Incidentally, you know Murphy wasn't the most highly decorated soldier during WW2. That honor belonged to a then CPT Matthew Urban, who eventually retired a colonel. Murphy had the Hollywood looks and the Hollywood press agent, and the more interesting story behind him. But yes, Murphy wasn't a HS grad. There are exceptions. In WW2 we had a Draft, as we had up until the the start of the all-volunteer force. We need a serious upgrading of our armed forces that only a draft can provide. To many bad apples coming in, not offset by great numbers of more educated and mature inductees.", 
        "reply": " Audie Leon Murphy was a VOLUNTEER!... NEXT!... Respectfully, SUNLINER81", 
        "threadID": "672198221_4860096422001", 
        "time": "2009-05-31 22:19:00", 
        "title": "Soldiers accused of photographing showers", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: quote: Originally posted by jack_flats: quote: Originally posted by LineDoggie: Originally posted by jack_flats: Keep recruiting non-high school grads, and this is what you get. We need the Draft re-instituted so the services can draw from those who are best educated, and who don't have criminal or Juvenile law offenses. The military services urgently need an upgrading of personnel This guy was a Non-High School Grad How does that foot taste? Audie Murphy ... Incidentally, you know Murphy wasn't the most highly decorated soldier during WW2. That honor belonged to a then CPT Matthew Urban, who eventually retired a colonel. Murphy had the Hollywood looks and the Hollywood press agent, and the more interesting story behind him. But yes, Murphy wasn't a HS grad. There are exceptions. In WW2 we had a Draft, as we had up until the the start of the all-volunteer force. We need a serious upgrading of our armed forces that only a draft can provide. To many bad apples coming in, not offset by great numbers of more educated and mature inductees. Audie Leon Murphy was a VOLUNTEER!... NEXT!... Respectfully, SUNLINER81 Did I say Audie Murphy was a Draftee? I didn't. You reading into things I post that aren't there again? \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090531, 
        "postID": 19, 
        "quote": "Originally posted by SUNLINER81: quote: Originally posted by jack_flats: quote: Originally posted by LineDoggie: Originally posted by jack_flats: Keep recruiting non-high school grads, and this is what you get. We need the Draft re-instituted so the services can draw from those who are best educated, and who don't have criminal or Juvenile law offenses. The military services urgently need an upgrading of personnel This guy was a Non-High School Grad How does that foot taste? Audie Murphy ... Incidentally, you know Murphy wasn't the most highly decorated soldier during WW2. That honor belonged to a then CPT Matthew Urban, who eventually retired a colonel. Murphy had the Hollywood looks and the Hollywood press agent, and the more interesting story behind him. But yes, Murphy wasn't a HS grad. There are exceptions. In WW2 we had a Draft, as we had up until the the start of the all-volunteer force. We need a serious upgrading of our armed forces that only a draft can provide. To many bad apples coming in, not offset by great numbers of more educated and mature inductees. Audie Leon Murphy was a VOLUNTEER!... NEXT!... Respectfully, SUNLINER81", 
        "reply": " Did I say Audie Murphy was a Draftee? I didn't. You reading into things I post that aren't there again? \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_4860096422001", 
        "time": "2009-05-31 22:26:00", 
        "title": "Soldiers accused of photographing showers", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: quote: Originally posted by LineDoggie: Originally posted by jack_flats: Keep recruiting non-high school grads, and this is what you get. We need the Draft re-instituted so the services can draw from those who are best educated, and who don't have criminal or Juvenile law offenses. The military services urgently need an upgrading of personnel This guy was a Non-High School Grad How does that foot taste? Audie Murphy ... Incidentally, you know Murphy wasn't the most highly decorated soldier during WW2. That honor belonged to a then CPT Matthew Urban, who eventually retired a colonel. Murphy had the Hollywood looks and the Hollywood press agent, and the more interesting story behind him. But yes, Murphy wasn't a HS grad. There are exceptions. In WW2 we had a Draft, as we had up until the the start of the all-volunteer force. We need a serious upgrading of our armed forces that only a draft can provide. To many bad apples coming in, not offset by great numbers of more educated and mature inductees. Oh, wrong again, Matt Urban had 28 awards Murphy 29 awards and Urban could lay claim to only 3 of the top 4 Army decorations, Audie could lay claim to all 4... This is according to Military Times... Respectfully, SUNLINER81", 
        "intTime": 20090531, 
        "postID": 20, 
        "quote": "Originally posted by jack_flats: quote: Originally posted by LineDoggie: Originally posted by jack_flats: Keep recruiting non-high school grads, and this is what you get. We need the Draft re-instituted so the services can draw from those who are best educated, and who don't have criminal or Juvenile law offenses. The military services urgently need an upgrading of personnel This guy was a Non-High School Grad How does that foot taste? Audie Murphy ... Incidentally, you know Murphy wasn't the most highly decorated soldier during WW2. That honor belonged to a then CPT Matthew Urban, who eventually retired a colonel. Murphy had the Hollywood looks and the Hollywood press agent, and the more interesting story behind him. But yes, Murphy wasn't a HS grad. There are exceptions. In WW2 we had a Draft, as we had up until the the start of the all-volunteer force. We need a serious upgrading of our armed forces that only a draft can provide. To many bad apples coming in, not offset by great numbers of more educated and mature inductees.", 
        "reply": " Oh, wrong again, Matt Urban had 28 awards Murphy 29 awards and Urban could lay claim to only 3 of the top 4 Army decorations, Audie could lay claim to all 4... This is according to Military Times... Respectfully, SUNLINER81", 
        "threadID": "672198221_4860096422001", 
        "time": "2009-05-31 22:31:00", 
        "title": "Soldiers accused of photographing showers", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "Soldiers accused of photographing showers Several soldiers from the Virginia National Guard are under investigation for allegedly taking pictures of female soldiers in the shower during pre-deployment mobilization training. The soldiers being investigated are with the 266th Military Police Company and are assigned to Multi-National Force-Iraq in Baghdad, according to a Defense Department news release. The misconduct allegedly took place at Fort Dix, N.J., in the fall of 2008. More at ... >>>http://www.armytimes.com/news/2009/05/army_shower_pictures_052909w/", 
        "intTime": 20090530, 
        "postID": 21, 
        "quote": "", 
        "reply": "Soldiers accused of photographing showers Several soldiers from the Virginia National Guard are under investigation for allegedly taking pictures of female soldiers in the shower during pre-deployment mobilization training. The soldiers being investigated are with the 266th Military Police Company and are assigned to Multi-National Force-Iraq in Baghdad, according to a Defense Department news release. The misconduct allegedly took place at Fort Dix, N.J., in the fall of 2008. More at ... >>>http://www.armytimes.com/news/2009/05/army_shower_pictures_052909w/", 
        "threadID": "672198221_4860096422001", 
        "time": "2009-05-30 19:01:00", 
        "title": "Soldiers accused of photographing showers", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "Depends on the Barracks age. Some of the Refurbed have Individual Stalls and the Older ones have Communal with 6 shower heads I've used Dix's Barracks on and off for about 24 years, De-Mobilized twice there, and lived there as an O/C-T for a few weeks at a time The shower entrance in either case faces away from the Latrine entrance doors, so the only way I can think of to get a view would be: 1- Walk onto a female floor and enter the Female latrines (Pretty Ballzy if done). Your caught red handed, though some units have a low fraternization policy, IMO it always leads to trouble. 2- The Frosted Privacy Windows facing the Shower would have to be wide open, and someone across the quadrangle have just the right level for the older Buildings. For the Re-furbished ones the windows are about 2Sq ft all the way up the wall where the Ceiling/Wall meet. If they can prove it the book should be thrown at the Miscreants.", 
        "intTime": 20090530, 
        "postID": 22, 
        "quote": "", 
        "reply": "Depends on the Barracks age. Some of the Refurbed have Individual Stalls and the Older ones have Communal with 6 shower heads I've used Dix's Barracks on and off for about 24 years, De-Mobilized twice there, and lived there as an O/C-T for a few weeks at a time The shower entrance in either case faces away from the Latrine entrance doors, so the only way I can think of to get a view would be: 1- Walk onto a female floor and enter the Female latrines (Pretty Ballzy if done). Your caught red handed, though some units have a low fraternization policy, IMO it always leads to trouble. 2- The Frosted Privacy Windows facing the Shower would have to be wide open, and someone across the quadrangle have just the right level for the older Buildings. For the Re-furbished ones the windows are about 2Sq ft all the way up the wall where the Ceiling/Wall meet. If they can prove it the book should be thrown at the Miscreants.", 
        "threadID": "672198221_4860096422001", 
        "time": "2009-05-30 19:32:00", 
        "title": "Soldiers accused of photographing showers", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "At Ft Wood while I was a Drill, the WAC barracks were always getting bomb threats. When one would come in the MPs would swarm the place going from room to room rousting the WACs out of bed to evac the building. They would fly out of bed butt naked or just in knickers and exit the building. After awhile they finally caught the person making the calls, it was a fellow MP. Buddies...............", 
        "intTime": 20090530, 
        "postID": 23, 
        "quote": "", 
        "reply": "At Ft Wood while I was a Drill, the WAC barracks were always getting bomb threats. When one would come in the MPs would swarm the place going from room to room rousting the WACs out of bed to evac the building. They would fly out of bed butt naked or just in knickers and exit the building. After awhile they finally caught the person making the calls, it was a fellow MP. Buddies...............", 
        "threadID": "672198221_4860096422001", 
        "time": "2009-05-30 19:43:00", 
        "title": "Soldiers accused of photographing showers", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by SignalSgtWilliams: At Ft Wood while I was a Drill, the WAC barracks were always getting bomb threats. When one would come in the MPs would swarm the place going from room to room rousting the WACs out of bed to evac the building. They would fly out of bed butt naked or just in knickers and exit the building. After awhile they finally caught the person making the calls, it was a fellow MP. Buddies............... SignalSgt, LOL. Okay, I'm not supposed to laugh and will probably be branded a sexist for laughing. However, after all of the major charges our troops have faced lately, the \"crime\" committed by the MP responsible for rousting the WACs at FLW no longer seems significant. Jack", 
        "intTime": 20090530, 
        "postID": 24, 
        "quote": "Originally posted by SignalSgtWilliams: At Ft Wood while I was a Drill, the WAC barracks were always getting bomb threats. When one would come in the MPs would swarm the place going from room to room rousting the WACs out of bed to evac the building. They would fly out of bed butt naked or just in knickers and exit the building. After awhile they finally caught the person making the calls, it was a fellow MP. Buddies...............", 
        "reply": " SignalSgt, LOL. Okay, I'm not supposed to laugh and will probably be branded a sexist for laughing. However, after all of the major charges our troops have faced lately, the \"crime\" committed by the MP responsible for rousting the WACs at FLW no longer seems significant. Jack", 
        "threadID": "672198221_4860096422001", 
        "time": "2009-05-30 20:46:00", 
        "title": "Soldiers accused of photographing showers", 
        "userID": "jackhunter1"
    }, 
    {
        "content": "Just a bunch of good ole boys having a little fun. I bet some of those females knew they were watching and enjoyed it.", 
        "intTime": 20090531, 
        "postID": 25, 
        "quote": "", 
        "reply": "Just a bunch of good ole boys having a little fun. I bet some of those females knew they were watching and enjoyed it.", 
        "threadID": "672198221_4860096422001", 
        "time": "2009-05-31 02:51:00", 
        "title": "Soldiers accused of photographing showers", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Duster6: Just a bunch of good ole boys having a little fun. I bet some of those females knew they were watching and enjoyed it. Do I need to note that your perspective is 'interesting'. Were you born in the Ozarks? Do you think they were 'asking for it', too? Or perhaps you think those 'good ol' boys were able to avoid taking pictures of the other ones who weren't 'enjoying' it.", 
        "intTime": 20090531, 
        "postID": 26, 
        "quote": "Originally posted by Duster6: Just a bunch of good ole boys having a little fun. I bet some of those females knew they were watching and enjoyed it.", 
        "reply": " Do I need to note that your perspective is 'interesting'. Were you born in the Ozarks? Do you think they were 'asking for it', too? Or perhaps you think those 'good ol' boys were able to avoid taking pictures of the other ones who weren't 'enjoying' it.", 
        "threadID": "672198221_4860096422001", 
        "time": "2009-05-31 03:33:00", 
        "title": "Soldiers accused of photographing showers", 
        "userID": "AliBubba"
    }, 
    {
        "content": "should they have done it? no. should they be punished for doing it? yes. Is it worthy of an article? Not even close.", 
        "intTime": 20090531, 
        "postID": 27, 
        "quote": "", 
        "reply": "should they have done it? no. should they be punished for doing it? yes. Is it worthy of an article? Not even close.", 
        "threadID": "672198221_4860096422001", 
        "time": "2009-05-31 03:58:00", 
        "title": "Soldiers accused of photographing showers", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: should they have done it? no. should they be punished for doing it? yes. Is it worthy of an article? Not even close. karl, Agree. Jack", 
        "intTime": 20090531, 
        "postID": 28, 
        "quote": "Originally posted by karlhungusjr: should they have done it? no. should they be punished for doing it? yes. Is it worthy of an article? Not even close.", 
        "reply": " karl, Agree. Jack", 
        "threadID": "672198221_4860096422001", 
        "time": "2009-05-31 12:35:00", 
        "title": "Soldiers accused of photographing showers", 
        "userID": "jackhunter1"
    }, 
    {
        "content": "quote: Originally posted by Duster6: Just a bunch of good ole boys having a little fun. I bet some of those females knew they were watching and enjoyed it. Roger that Sgt..", 
        "intTime": 20090531, 
        "postID": 29, 
        "quote": "Originally posted by Duster6: Just a bunch of good ole boys having a little fun. I bet some of those females knew they were watching and enjoyed it.", 
        "reply": " Roger that Sgt..", 
        "threadID": "672198221_4860096422001", 
        "time": "2009-05-31 12:45:00", 
        "title": "Soldiers accused of photographing showers", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by jackhunter1: quote: Originally posted by karlhungusjr: should they have done it? no. should they be punished for doing it? yes. Is it worthy of an article? Not even close. karl, Agree. Jack Not to condone it but their action is nothing new, some recruits have done this before, and digital cameras were not available then. You had to use a Polaroid or develop the film yourself commercial developers blacked out those types of photos. Recruits did that in the 60's.", 
        "intTime": 20090531, 
        "postID": 30, 
        "quote": "Originally posted by jackhunter1: quote: Originally posted by karlhungusjr: should they have done it? no. should they be punished for doing it? yes. Is it worthy of an article? Not even close. karl, Agree. Jack", 
        "reply": " Not to condone it but their action is nothing new, some recruits have done this before, and digital cameras were not available then. You had to use a Polaroid or develop the film yourself commercial developers blacked out those types of photos. Recruits did that in the 60's.", 
        "threadID": "672198221_4860096422001", 
        "time": "2009-05-31 12:50:00", 
        "title": "Soldiers accused of photographing showers", 
        "userID": "ss_287"
    }, 
    {
        "content": "quote: Originally posted by AliBubba: quote: Originally posted by Duster6: Just a bunch of good ole boys having a little fun. I bet some of those females knew they were watching and enjoyed it. Do I need to note that your perspective is 'interesting'. Were you born in the Ozarks? Do you think they were 'asking for it', too? Or perhaps you think those 'good ol' boys were able to avoid taking pictures of the other ones who weren't 'enjoying' it. Well let's see, Someone had to leave the shower stall open, the door to the shower area unlocked/opened, and or the windows unlocked/open for the guys to get the pics. My guess here is that it WASN'T THE GUYS? Unless we have females taking photos of females in the showers and that opens up a whole new perspective on the situation doesn't it.", 
        "intTime": 20090531, 
        "postID": 31, 
        "quote": "Originally posted by AliBubba: quote: Originally posted by Duster6: Just a bunch of good ole boys having a little fun. I bet some of those females knew they were watching and enjoyed it. Do I need to note that your perspective is 'interesting'. Were you born in the Ozarks? Do you think they were 'asking for it', too? Or perhaps you think those 'good ol' boys were able to avoid taking pictures of the other ones who weren't 'enjoying' it.", 
        "reply": " Well let's see, Someone had to leave the shower stall open, the door to the shower area unlocked/opened, and or the windows unlocked/open for the guys to get the pics. My guess here is that it WASN'T THE GUYS? Unless we have females taking photos of females in the showers and that opens up a whole new perspective on the situation doesn't it.", 
        "threadID": "672198221_4860096422001", 
        "time": "2009-05-31 21:06:00", 
        "title": "Soldiers accused of photographing showers", 
        "userID": "ronald45"
    }, 
    {
        "content": "quote: Originally posted by ronald45: quote: Originally posted by AliBubba: quote: Originally posted by Duster6: Just a bunch of good ole boys having a little fun. I bet some of those females knew they were watching and enjoyed it. Do I need to note that your perspective is 'interesting'. Were you born in the Ozarks? Do you think they were 'asking for it', too? Or perhaps you think those 'good ol' boys were able to avoid taking pictures of the other ones who weren't 'enjoying' it. Well let's see, Someone had to leave the shower stall open, the door to the shower area unlocked/opened, and or the windows unlocked/open for the guys to get the pics. My guess here is that it WASN'T THE GUYS? Unless we have females taking photos of females in the showers and that opens up a whole new perspective on the situation doesn't it. If that is the case, then it would raise big questions about allowing Gays to serve at all..", 
        "intTime": 20090531, 
        "postID": 32, 
        "quote": "Originally posted by ronald45: quote: Originally posted by AliBubba: quote: Originally posted by Duster6: Just a bunch of good ole boys having a little fun. I bet some of those females knew they were watching and enjoyed it. Do I need to note that your perspective is 'interesting'. Were you born in the Ozarks? Do you think they were 'asking for it', too? Or perhaps you think those 'good ol' boys were able to avoid taking pictures of the other ones who weren't 'enjoying' it. Well let's see, Someone had to leave the shower stall open, the door to the shower area unlocked/opened, and or the windows unlocked/open for the guys to get the pics. My guess here is that it WASN'T THE GUYS? Unless we have females taking photos of females in the showers and that opens up a whole new perspective on the situation doesn't it.", 
        "reply": " If that is the case, then it would raise big questions about allowing Gays to serve at all..", 
        "threadID": "672198221_4860096422001", 
        "time": "2009-05-31 21:14:00", 
        "title": "Soldiers accused of photographing showers", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "Keep recruiting non-high school grads, and this is what you get. We need the Draft re-instituted so the services can draw from those who are best educated, and who don't have criminal or Juvenile law offenses. The military services urgently need an upgrading of personnel. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090531, 
        "postID": 33, 
        "quote": "", 
        "reply": "Keep recruiting non-high school grads, and this is what you get. We need the Draft re-instituted so the services can draw from those who are best educated, and who don't have criminal or Juvenile law offenses. The military services urgently need an upgrading of personnel. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_4860096422001", 
        "time": "2009-05-31 21:21:00", 
        "title": "Soldiers accused of photographing showers", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: Keep recruiting non-high school grads, and this is what you get. We need the Draft re-instituted so the services can draw from those who are best educated, and who don't have criminal or Juvenile law offenses. The military services urgently need an upgrading of personnel. Right, only a liberal could view our current Military as a bunch of malcontent criminals I served with the finest men America has to offer in Iraq and Afghanistan. PERIOD.", 
        "intTime": 20090531, 
        "postID": 34, 
        "quote": "Originally posted by jack_flats: Keep recruiting non-high school grads, and this is what you get. We need the Draft re-instituted so the services can draw from those who are best educated, and who don't have criminal or Juvenile law offenses. The military services urgently need an upgrading of personnel.", 
        "reply": " Right, only a liberal could view our current Military as a bunch of malcontent criminals I served with the finest men America has to offer in Iraq and Afghanistan. PERIOD.", 
        "threadID": "672198221_4860096422001", 
        "time": "2009-05-31 21:40:00", 
        "title": "Soldiers accused of photographing showers", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "Originally posted by jack_flats: Keep recruiting non-high school grads, and this is what you get. We need the Draft re-instituted so the services can draw from those who are best educated, and who don't have criminal or Juvenile law offenses. The military services urgently need an upgrading of personnel This guy was a Non-High School Grad How does that foot taste?", 
        "intTime": 20090531, 
        "postID": 35, 
        "quote": "", 
        "reply": "Originally posted by jack_flats: Keep recruiting non-high school grads, and this is what you get. We need the Draft re-instituted so the services can draw from those who are best educated, and who don't have criminal or Juvenile law offenses. The military services urgently need an upgrading of personnel This guy was a Non-High School Grad How does that foot taste?", 
        "threadID": "672198221_4860096422001", 
        "time": "2009-05-31 21:46:00", 
        "title": "Soldiers accused of photographing showers", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by jack_flats: Keep recruiting non-high school grads, and this is what you get. We need the Draft re-instituted so the services can draw from those who are best educated, and who don't have criminal or Juvenile law offenses. The military services urgently need an upgrading of personnel. Right, only a liberal could view our current Military as a bunch of malcontent criminals I served with the finest men America has to offer in Iraq and Afghanistan. PERIOD. I too served with some of the finest soldiers ever to wear an Army uniform, draftees who like myself, were mature, educated (many who attended college and had college degrees), polished, and who incidentally, served with pride. I experienced what it was like to serve with both enlistees and draftees. You didn't. I know better. Face it, we need to bring back national service. Our military needs a serious upgrading of personnel. This message has been edited. Last edited by: jack_flats, Sun 31 May 2009 10:20 PM \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090531, 
        "postID": 36, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Originally posted by jack_flats: Keep recruiting non-high school grads, and this is what you get. We need the Draft re-instituted so the services can draw from those who are best educated, and who don't have criminal or Juvenile law offenses. The military services urgently need an upgrading of personnel. Right, only a liberal could view our current Military as a bunch of malcontent criminals I served with the finest men America has to offer in Iraq and Afghanistan. PERIOD.", 
        "reply": " I too served with some of the finest soldiers ever to wear an Army uniform, draftees who like myself, were mature, educated (many who attended college and had college degrees), polished, and who incidentally, served with pride. I experienced what it was like to serve with both enlistees and draftees. You didn't. I know better. Face it, we need to bring back national service. Our military needs a serious upgrading of personnel. This message has been edited. Last edited by: jack_flats, Sun 31 May 2009 10:20 PM \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_4860096422001", 
        "time": "2009-05-31 22:05:00", 
        "title": "Soldiers accused of photographing showers", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by LineDoggie: Originally posted by jack_flats: Keep recruiting non-high school grads, and this is what you get. We need the Draft re-instituted so the services can draw from those who are best educated, and who don't have criminal or Juvenile law offenses. The military services urgently need an upgrading of personnel This guy was a Non-High School Grad How does that foot taste? Audie Murphy ... Incidentally, you know Murphy wasn't the most highly decorated soldier during WW2. That honor belonged to a then CPT Matthew Urban, who eventually retired a colonel. Murphy had the Hollywood looks and the Hollywood press agent, and the more interesting story behind him. But yes, Murphy wasn't a HS grad. There are exceptions. In WW2 we had a Draft, as we had up until the the start of the all-volunteer force. We need a serious upgrading of our armed forces that only a draft can provide. To many bad apples coming in, not offset by great numbers of more educated and mature inductees. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090531, 
        "postID": 37, 
        "quote": "Originally posted by LineDoggie: Originally posted by jack_flats: Keep recruiting non-high school grads, and this is what you get. We need the Draft re-instituted so the services can draw from those who are best educated, and who don't have criminal or Juvenile law offenses. The military services urgently need an upgrading of personnel This guy was a Non-High School Grad How does that foot taste?", 
        "reply": " Audie Murphy ... Incidentally, you know Murphy wasn't the most highly decorated soldier during WW2. That honor belonged to a then CPT Matthew Urban, who eventually retired a colonel. Murphy had the Hollywood looks and the Hollywood press agent, and the more interesting story behind him. But yes, Murphy wasn't a HS grad. There are exceptions. In WW2 we had a Draft, as we had up until the the start of the all-volunteer force. We need a serious upgrading of our armed forces that only a draft can provide. To many bad apples coming in, not offset by great numbers of more educated and mature inductees. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_4860096422001", 
        "time": "2009-05-31 22:17:00", 
        "title": "Soldiers accused of photographing showers", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: quote: Originally posted by LineDoggie: Originally posted by jack_flats: Keep recruiting non-high school grads, and this is what you get. We need the Draft re-instituted so the services can draw from those who are best educated, and who don't have criminal or Juvenile law offenses. The military services urgently need an upgrading of personnel This guy was a Non-High School Grad How does that foot taste? Audie Murphy ... Incidentally, you know Murphy wasn't the most highly decorated soldier during WW2. That honor belonged to a then CPT Matthew Urban, who eventually retired a colonel. Murphy had the Hollywood looks and the Hollywood press agent, and the more interesting story behind him. But yes, Murphy wasn't a HS grad. There are exceptions. In WW2 we had a Draft, as we had up until the the start of the all-volunteer force. We need a serious upgrading of our armed forces that only a draft can provide. To many bad apples coming in, not offset by great numbers of more educated and mature inductees. Audie Leon Murphy was a VOLUNTEER!... NEXT!... Respectfully, SUNLINER81", 
        "intTime": 20090531, 
        "postID": 38, 
        "quote": "Originally posted by jack_flats: quote: Originally posted by LineDoggie: Originally posted by jack_flats: Keep recruiting non-high school grads, and this is what you get. We need the Draft re-instituted so the services can draw from those who are best educated, and who don't have criminal or Juvenile law offenses. The military services urgently need an upgrading of personnel This guy was a Non-High School Grad How does that foot taste? Audie Murphy ... Incidentally, you know Murphy wasn't the most highly decorated soldier during WW2. That honor belonged to a then CPT Matthew Urban, who eventually retired a colonel. Murphy had the Hollywood looks and the Hollywood press agent, and the more interesting story behind him. But yes, Murphy wasn't a HS grad. There are exceptions. In WW2 we had a Draft, as we had up until the the start of the all-volunteer force. We need a serious upgrading of our armed forces that only a draft can provide. To many bad apples coming in, not offset by great numbers of more educated and mature inductees.", 
        "reply": " Audie Leon Murphy was a VOLUNTEER!... NEXT!... Respectfully, SUNLINER81", 
        "threadID": "672198221_4860096422001", 
        "time": "2009-05-31 22:19:00", 
        "title": "Soldiers accused of photographing showers", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: quote: Originally posted by jack_flats: quote: Originally posted by LineDoggie: Originally posted by jack_flats: Keep recruiting non-high school grads, and this is what you get. We need the Draft re-instituted so the services can draw from those who are best educated, and who don't have criminal or Juvenile law offenses. The military services urgently need an upgrading of personnel This guy was a Non-High School Grad How does that foot taste? Audie Murphy ... Incidentally, you know Murphy wasn't the most highly decorated soldier during WW2. That honor belonged to a then CPT Matthew Urban, who eventually retired a colonel. Murphy had the Hollywood looks and the Hollywood press agent, and the more interesting story behind him. But yes, Murphy wasn't a HS grad. There are exceptions. In WW2 we had a Draft, as we had up until the the start of the all-volunteer force. We need a serious upgrading of our armed forces that only a draft can provide. To many bad apples coming in, not offset by great numbers of more educated and mature inductees. Audie Leon Murphy was a VOLUNTEER!... NEXT!... Respectfully, SUNLINER81 Did I say Audie Murphy was a Draftee? I didn't. You reading into things I post that aren't there again? \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090531, 
        "postID": 39, 
        "quote": "Originally posted by SUNLINER81: quote: Originally posted by jack_flats: quote: Originally posted by LineDoggie: Originally posted by jack_flats: Keep recruiting non-high school grads, and this is what you get. We need the Draft re-instituted so the services can draw from those who are best educated, and who don't have criminal or Juvenile law offenses. The military services urgently need an upgrading of personnel This guy was a Non-High School Grad How does that foot taste? Audie Murphy ... Incidentally, you know Murphy wasn't the most highly decorated soldier during WW2. That honor belonged to a then CPT Matthew Urban, who eventually retired a colonel. Murphy had the Hollywood looks and the Hollywood press agent, and the more interesting story behind him. But yes, Murphy wasn't a HS grad. There are exceptions. In WW2 we had a Draft, as we had up until the the start of the all-volunteer force. We need a serious upgrading of our armed forces that only a draft can provide. To many bad apples coming in, not offset by great numbers of more educated and mature inductees. Audie Leon Murphy was a VOLUNTEER!... NEXT!... Respectfully, SUNLINER81", 
        "reply": " Did I say Audie Murphy was a Draftee? I didn't. You reading into things I post that aren't there again? \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_4860096422001", 
        "time": "2009-05-31 22:26:00", 
        "title": "Soldiers accused of photographing showers", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: quote: Originally posted by LineDoggie: Originally posted by jack_flats: Keep recruiting non-high school grads, and this is what you get. We need the Draft re-instituted so the services can draw from those who are best educated, and who don't have criminal or Juvenile law offenses. The military services urgently need an upgrading of personnel This guy was a Non-High School Grad How does that foot taste? Audie Murphy ... Incidentally, you know Murphy wasn't the most highly decorated soldier during WW2. That honor belonged to a then CPT Matthew Urban, who eventually retired a colonel. Murphy had the Hollywood looks and the Hollywood press agent, and the more interesting story behind him. But yes, Murphy wasn't a HS grad. There are exceptions. In WW2 we had a Draft, as we had up until the the start of the all-volunteer force. We need a serious upgrading of our armed forces that only a draft can provide. To many bad apples coming in, not offset by great numbers of more educated and mature inductees. Oh, wrong again, Matt Urban had 28 awards Murphy 29 awards and Urban could lay claim to only 3 of the top 4 Army decorations, Audie could lay claim to all 4... This is according to Military Times... Respectfully, SUNLINER81", 
        "intTime": 20090531, 
        "postID": 40, 
        "quote": "Originally posted by jack_flats: quote: Originally posted by LineDoggie: Originally posted by jack_flats: Keep recruiting non-high school grads, and this is what you get. We need the Draft re-instituted so the services can draw from those who are best educated, and who don't have criminal or Juvenile law offenses. The military services urgently need an upgrading of personnel This guy was a Non-High School Grad How does that foot taste? Audie Murphy ... Incidentally, you know Murphy wasn't the most highly decorated soldier during WW2. That honor belonged to a then CPT Matthew Urban, who eventually retired a colonel. Murphy had the Hollywood looks and the Hollywood press agent, and the more interesting story behind him. But yes, Murphy wasn't a HS grad. There are exceptions. In WW2 we had a Draft, as we had up until the the start of the all-volunteer force. We need a serious upgrading of our armed forces that only a draft can provide. To many bad apples coming in, not offset by great numbers of more educated and mature inductees.", 
        "reply": " Oh, wrong again, Matt Urban had 28 awards Murphy 29 awards and Urban could lay claim to only 3 of the top 4 Army decorations, Audie could lay claim to all 4... This is according to Military Times... Respectfully, SUNLINER81", 
        "threadID": "672198221_4860096422001", 
        "time": "2009-05-31 22:31:00", 
        "title": "Soldiers accused of photographing showers", 
        "userID": "SUNLINER81"
    }
]