[
    {
        "content": "\"http://online.wsj.com/article/SB124173070387297801.html\" quote: General Electric Co. launched its \"Healthymagination\" initiative Thursday in hopes of building a thematic presence in health care on par with its four-year-old \"Ecomagination\" campaign around environmental concerns. \"Health care needs new solutions,\" said Jeff Immelt, GE's chairman and chief executive. \"We must innovate with smarter processes and technologies that help doctors and hospitals deliver better health care to more people at a lower cost.\" GE said it will allocate $6 billion over the next six years for the effort, including $3 billion toward developing products it claims will lower costs, increase access and improve health-care quality. That is more than double the $1.2 billion GE said it had planned to spend on health-care research and development over the period. GE said its health-care-finance group will boost lending by $2 billion, or 10%, to $22 billion to prod hospitals to improve information technology, especially in rural areas. The remaining $1 billion will be spent on partnerships with Intel Corp. and others, efforts to provide clean water and marketing. The conglomerate disclosed the initiative in Washington, where the administration of President Barack Obama has been promoting heavier use of health-care information technology and advocating additional spending on public-health challenges such as malaria, tuberculosis and HIV-AIDS. Mr. Immelt said GE's health-care goals line up with the administration's but said executives at the Fairfield, Conn., company have been considering the project for several years. \"This entire program isn't dependent on the stimulus,\" said Mr. Immelt. $6 Billion dollars seems like a risky investment in this economy until you begin to peel back the layers. \"http://www.broadcastingcable.com/article/173718_Immelt_Named_To_Obama_s_New_Economic_Advisory_Board.php\" quote: Immelt Named To Obama's New Economic Advisory Board: GE CEO to join independent group that will advise president on programs to jump-start economy President Barack Obama has named Jeffrey Immelt, CEO of NBC Universal parent GE, to his new economic advisory board. The new board is modeled on the foreign intelligence advisory board created under President Dwight Eisenhower, according to the White House, and will \"provide an independent voice on economic issues and will be charged with offering independent advice to the President as he formulates and implements his plans for economic recovery.\" The board, which will meet regularly to advise the president on programs to \"jump-start\" the economy and how those programs are working, features a mix of executives from various industries, academics, a representative of the AFL-CIO, and others. So the CEO of the corporation who is starting this new \"health care initiative\" similar to what President Obama has proposed for reforming health care is on the President's Economic Advisory Board. Interesting. \"http://www.genewscenter.com/Content/Detail.asp?ReleaseID=6760&NewsAreaID=2&MenuSearchCategoryID=\" quote: Former U.S. Senator Tom Daschle, who will serve on GE's healthymagination advisory board, said, “We can only find real solutions in health care when business, government and their partners work together. The commitments GE made today on access, cost, and quality are a great start toward demonstrating their leadership in this debate. I look forward to working with them.” Wow, this has gotten even more interesting. Tom Daschle, President Obama's original pick for the Head of the Department of Health and Human Services is an advisor to this new $5 billion dollar plan. So the CEO of the corporation that gave the President the most favorable coverage during the election gets a spot on Obama's Economic advisory board. The same CEO has created a new $5 billion dollar health care initiative with goals that are almost identical to what the President has proposed for health care reform. Now Tom Daschle, the man who was the original choice to lead the President's health care reform initiatives, is now an advisor for above CEO's health care initiative. Could be a bunch of coincidences, but I doubt it. If it turns out that GE gets a massive government contract out of this initiative, will the same people who were screaming about Cheney and Haliburton be equally as upset?",
        "intTime": 20090509,
        "postID": 1,
        "quote": "General Electric Co. launched its \"Healthymagination\" initiative Thursday in hopes of building a thematic presence in health care on par with its four-year-old \"Ecomagination\" campaign around environmental concerns. \"Health care needs new solutions,\" said Jeff Immelt, GE's chairman and chief executive. \"We must innovate with smarter processes and technologies that help doctors and hospitals deliver better health care to more people at a lower cost.\" GE said it will allocate $6 billion over the next six years for the effort, including $3 billion toward developing products it claims will lower costs, increase access and improve health-care quality. That is more than double the $1.2 billion GE said it had planned to spend on health-care research and development over the period. GE said its health-care-finance group will boost lending by $2 billion, or 10%, to $22 billion to prod hospitals to improve information technology, especially in rural areas. The remaining $1 billion will be spent on partnerships with Intel Corp. and others, efforts to provide clean water and marketing. The conglomerate disclosed the initiative in Washington, where the administration of President Barack Obama has been promoting heavier use of health-care information technology and advocating additional spending on public-health challenges such as malaria, tuberculosis and HIV-AIDS. Mr. Immelt said GE's health-care goals line up with the administration's but said executives at the Fairfield, Conn., company have been considering the project for several years. \"This entire program isn't dependent on the stimulus,\" said Mr. Immelt.",
        "reply": "\"http://online.wsj.com/article/SB124173070387297801.html\"  $6 Billion dollars seems like a risky investment in this economy until you begin to peel back the layers. \"http://www.broadcastingcable.com/article/173718_Immelt_Named_To_Obama_s_New_Economic_Advisory_Board.php\" quote: Immelt Named To Obama's New Economic Advisory Board: GE CEO to join independent group that will advise president on programs to jump-start economy President Barack Obama has named Jeffrey Immelt, CEO of NBC Universal parent GE, to his new economic advisory board. The new board is modeled on the foreign intelligence advisory board created under President Dwight Eisenhower, according to the White House, and will \"provide an independent voice on economic issues and will be charged with offering independent advice to the President as he formulates and implements his plans for economic recovery.\" The board, which will meet regularly to advise the president on programs to \"jump-start\" the economy and how those programs are working, features a mix of executives from various industries, academics, a representative of the AFL-CIO, and others. So the CEO of the corporation who is starting this new \"health care initiative\" similar to what President Obama has proposed for reforming health care is on the President's Economic Advisory Board. Interesting. \"http://www.genewscenter.com/Content/Detail.asp?ReleaseID=6760&NewsAreaID=2&MenuSearchCategoryID=\" quote: Former U.S. Senator Tom Daschle, who will serve on GE's healthymagination advisory board, said, “We can only find real solutions in health care when business, government and their partners work together. The commitments GE made today on access, cost, and quality are a great start toward demonstrating their leadership in this debate. I look forward to working with them.” Wow, this has gotten even more interesting. Tom Daschle, President Obama's original pick for the Head of the Department of Health and Human Services is an advisor to this new $5 billion dollar plan. So the CEO of the corporation that gave the President the most favorable coverage during the election gets a spot on Obama's Economic advisory board. The same CEO has created a new $5 billion dollar health care initiative with goals that are almost identical to what the President has proposed for health care reform. Now Tom Daschle, the man who was the original choice to lead the President's health care reform initiatives, is now an advisor for above CEO's health care initiative. Could be a bunch of coincidences, but I doubt it. If it turns out that GE gets a massive government contract out of this initiative, will the same people who were screaming about Cheney and Haliburton be equally as upset?",
        "threadID": "672198221_9340039222001",
        "time": "2009-05-09 19:50:00",
        "title": "GE Unveils $6 Billion Health-Unit Plan",
        "userID": "stec74"
    }
]