[
    {
        "content": "Though I am against bonuses being given for failed companies, I do not CONDONE innocent people being prosecuted like they are quote: The following is a letter sent on Tuesday by Jake DeSantis, an executive vice president of the American International Group’s financial products unit, to Edward M. Liddy, the chief executive of A.I.G. quote: DEAR Mr. Liddy, It is with deep regret that I submit my notice of resignation from A.I.G. Financial Products. I hope you take the time to read this entire letter. Before describing the details of my decision, I want to offer some context: I am proud of everything I have done for the commodity and equity divisions of A.I.G.-F.P. I was in no way involved in — or responsible for — the credit default swap transactions that have hamstrung A.I.G. Nor were more than a handful of the 400 current employees of A.I.G.-F.P. Most of those responsible have left the company and have conspicuously escaped the public outrage. After 12 months of hard work dismantling the company — during which A.I.G. reassured us many times we would be rewarded in March 2009 — we in the financial products unit have been betrayed by A.I.G. and are being unfairly persecuted by elected officials. In response to this, I will now leave the company and donate my entire post-tax retention payment to those suffering from the global economic downturn. My intent is to keep none of the money myself. I take this action after 11 years of dedicated, honorable service to A.I.G. I can no longer effectively perform my duties in this dysfunctional environment, nor am I being paid to do so. Like you, I was asked to work for an annual salary of $1, and I agreed out of a sense of duty to the company and to the public officials who have come to its aid. Having now been let down by both, I can no longer justify spending 10, 12, 14 hours a day away from my family for the benefit of those who have let me down. You and I have never met or spoken to each other, so I’d like to tell you about myself. I was raised by schoolteachers working multiple jobs in a world of closing steel mills. My hard work earned me acceptance to M.I.T., and the institute’s generous financial aid enabled me to attend. I had fulfilled my American dream. I started at this company in 1998 as an equity trader, became the head of equity and commodity trading and, a couple of years before A.I.G.’s meltdown last September, was named the head of business development for commodities. Over this period the equity and commodity units were consistently profitable — in most years generating net profits of well over $100 million. Most recently, during the dismantling of A.I.G.-F.P., I was an integral player in the pending sale of its well-regarded commodity index business to UBS. As you know, business unit sales like this are crucial to A.I.G.’s effort to repay the American taxpayer. The profitability of the businesses with which I was associated clearly supported my compensation. I never received any pay resulting from the credit default swaps that are now losing so much money. I did, however, like many others here, lose a significant portion of my life savings in the form of deferred compensation invested in the capital of A.I.G.-F.P. because of those losses. In this way I have personally suffered from this controversial activity — directly as well as indirectly with the rest of the taxpayers. I have the utmost respect for the civic duty that you are now performing at A.I.G. You are as blameless for these credit default swap losses as I am. You answered your country’s call and you are taking a tremendous beating for it. But you also are aware that most of the employees of your financial products unit had nothing to do with the large losses. And I am disappointed and frustrated over your lack of support for us. I and many others in the unit feel betrayed that you failed to stand up for us in the face of untrue and unfair accusations from certain members of Congress last Wednesday and from the press over our retention payments, and that you didn’t defend us against the baseless and reckless comments made by the attorneys general of New York and Connecticut. My guess is that in October, when you learned of these retention contracts, you realized that the employees of the financial products unit needed some incentive to stay and that the contracts, being both ethical and useful, should be left to stand. That’s probably why A.I.G. management assured us on three occasions during that month that the company would “live up to its commitment” to honor the contract guarantees. That may be why you decided to accelerate by three months more than a quarter of the amounts due under the contracts. That action signified to us your support, and was hardly something that one would do if he truly found the contracts “distasteful.” That may also be why you authorized the balance of the payments on March 13. At no time during the past six months that you have been leading A.I.G. did you ask us to revise, renegotiate or break these contracts — until several hours before your appearance last week before Congress. Read the rest at \"http://www.nytimes.com/2009/03/25/opinion/25desantis.html\" This message has been edited. Last edited by: L0A1, Wed 25 March 2009 01:50 PM Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090325, 
        "postID": 1, 
        "quote": "The following is a letter sent on Tuesday by Jake DeSantis, an executive vice president of the American International Group’s financial products unit, to Edward M. Liddy, the chief executive of A.I.G.", 
        "reply": "Though I am against bonuses being given for failed companies, I do not CONDONE innocent people being prosecuted like they are  quote: DEAR Mr. Liddy, It is with deep regret that I submit my notice of resignation from A.I.G. Financial Products. I hope you take the time to read this entire letter. Before describing the details of my decision, I want to offer some context: I am proud of everything I have done for the commodity and equity divisions of A.I.G.-F.P. I was in no way involved in — or responsible for — the credit default swap transactions that have hamstrung A.I.G. Nor were more than a handful of the 400 current employees of A.I.G.-F.P. Most of those responsible have left the company and have conspicuously escaped the public outrage. After 12 months of hard work dismantling the company — during which A.I.G. reassured us many times we would be rewarded in March 2009 — we in the financial products unit have been betrayed by A.I.G. and are being unfairly persecuted by elected officials. In response to this, I will now leave the company and donate my entire post-tax retention payment to those suffering from the global economic downturn. My intent is to keep none of the money myself. I take this action after 11 years of dedicated, honorable service to A.I.G. I can no longer effectively perform my duties in this dysfunctional environment, nor am I being paid to do so. Like you, I was asked to work for an annual salary of $1, and I agreed out of a sense of duty to the company and to the public officials who have come to its aid. Having now been let down by both, I can no longer justify spending 10, 12, 14 hours a day away from my family for the benefit of those who have let me down. You and I have never met or spoken to each other, so I’d like to tell you about myself. I was raised by schoolteachers working multiple jobs in a world of closing steel mills. My hard work earned me acceptance to M.I.T., and the institute’s generous financial aid enabled me to attend. I had fulfilled my American dream. I started at this company in 1998 as an equity trader, became the head of equity and commodity trading and, a couple of years before A.I.G.’s meltdown last September, was named the head of business development for commodities. Over this period the equity and commodity units were consistently profitable — in most years generating net profits of well over $100 million. Most recently, during the dismantling of A.I.G.-F.P., I was an integral player in the pending sale of its well-regarded commodity index business to UBS. As you know, business unit sales like this are crucial to A.I.G.’s effort to repay the American taxpayer. The profitability of the businesses with which I was associated clearly supported my compensation. I never received any pay resulting from the credit default swaps that are now losing so much money. I did, however, like many others here, lose a significant portion of my life savings in the form of deferred compensation invested in the capital of A.I.G.-F.P. because of those losses. In this way I have personally suffered from this controversial activity — directly as well as indirectly with the rest of the taxpayers. I have the utmost respect for the civic duty that you are now performing at A.I.G. You are as blameless for these credit default swap losses as I am. You answered your country’s call and you are taking a tremendous beating for it. But you also are aware that most of the employees of your financial products unit had nothing to do with the large losses. And I am disappointed and frustrated over your lack of support for us. I and many others in the unit feel betrayed that you failed to stand up for us in the face of untrue and unfair accusations from certain members of Congress last Wednesday and from the press over our retention payments, and that you didn’t defend us against the baseless and reckless comments made by the attorneys general of New York and Connecticut. My guess is that in October, when you learned of these retention contracts, you realized that the employees of the financial products unit needed some incentive to stay and that the contracts, being both ethical and useful, should be left to stand. That’s probably why A.I.G. management assured us on three occasions during that month that the company would “live up to its commitment” to honor the contract guarantees. That may be why you decided to accelerate by three months more than a quarter of the amounts due under the contracts. That action signified to us your support, and was hardly something that one would do if he truly found the contracts “distasteful.” That may also be why you authorized the balance of the payments on March 13. At no time during the past six months that you have been leading A.I.G. did you ask us to revise, renegotiate or break these contracts — until several hours before your appearance last week before Congress. Read the rest at \"http://www.nytimes.com/2009/03/25/opinion/25desantis.html\" This message has been edited. Last edited by: L0A1, Wed 25 March 2009 01:50 PM Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_8420088812001", 
        "time": "2009-03-25 11:56:00", 
        "title": "Letter from AIG bunus receiptient to CEO", 
        "userID": "L0A1"
    }, 
    {
        "content": "SO where are the folks wanting to hang these people again? Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090325, 
        "postID": 2, 
        "quote": "", 
        "reply": "SO where are the folks wanting to hang these people again? Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_8420088812001", 
        "time": "2009-03-25 13:51:00", 
        "title": "Letter from AIG bunus receiptient to CEO", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: SO where are the folks wanting to hang these people again? Look on any street corner in any town. The problem is that it was all legal. Dodd and his ilk made sure they got their bonus money thinking the taxpayer wouldn't mind. They were wrong. Now AIG is the red herring thrown to the mob while Franks and Dodd and the like skulk back to their holes. \"Thank you, for your support.\" - Bartles & Jaymes", 
        "intTime": 20090325, 
        "postID": 3, 
        "quote": "Originally posted by L0A1: SO where are the folks wanting to hang these people again?", 
        "reply": " Look on any street corner in any town. The problem is that it was all legal. Dodd and his ilk made sure they got their bonus money thinking the taxpayer wouldn't mind. They were wrong. Now AIG is the red herring thrown to the mob while Franks and Dodd and the like skulk back to their holes. \"Thank you, for your support.\" - Bartles & Jaymes", 
        "threadID": "672198221_8420088812001", 
        "time": "2009-03-25 14:00:00", 
        "title": "Letter from AIG bunus receiptient to CEO", 
        "userID": "rm444"
    }, 
    {
        "content": "The only \"bonuses\" that I think need to come back to the taxpayer are the pay increases that those serving in Congress have received for the past two years ... and at a 100% rate, not 90%. If all at AIG are to be held responsible for the AIG train wreck, it seems only fair to hold Congress liable for our country's economic train wreck. Their job was to anticipate, legislate, and provide oversight ... and they failed miserably ... and are now obfuscating to divert attention from their own culpability.", 
        "intTime": 20090325, 
        "postID": 4, 
        "quote": "", 
        "reply": "The only \"bonuses\" that I think need to come back to the taxpayer are the pay increases that those serving in Congress have received for the past two years ... and at a 100% rate, not 90%. If all at AIG are to be held responsible for the AIG train wreck, it seems only fair to hold Congress liable for our country's economic train wreck. Their job was to anticipate, legislate, and provide oversight ... and they failed miserably ... and are now obfuscating to divert attention from their own culpability.", 
        "threadID": "672198221_8420088812001", 
        "time": "2009-03-25 14:09:00", 
        "title": "Letter from AIG bunus receiptient to CEO", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "They are all still guilty of being greedy, good buy to the hole lot.", 
        "intTime": 20090325, 
        "postID": 5, 
        "quote": "", 
        "reply": "They are all still guilty of being greedy, good buy to the hole lot.", 
        "threadID": "672198221_8420088812001", 
        "time": "2009-03-25 14:14:00", 
        "title": "Letter from AIG bunus receiptient to CEO", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: They are all still guilty of being greedy, good buy to the hole lot. So, even though this guy was part of a section of AIG that was NOT failing and had nothing to do with the crisis. This is how you feel about it? So using your logic, since Fannie and Freddie failed, most of the Dems in congress should be either fired or all their money taken. While we are at it, all the campain funds tossed to Dodd, Obama, McCain, etc. should also be returned. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090325, 
        "postID": 6, 
        "quote": "Originally posted by crackerjacks61: They are all still guilty of being greedy, good buy to the hole lot.", 
        "reply": " So, even though this guy was part of a section of AIG that was NOT failing and had nothing to do with the crisis. This is how you feel about it? So using your logic, since Fannie and Freddie failed, most of the Dems in congress should be either fired or all their money taken. While we are at it, all the campain funds tossed to Dodd, Obama, McCain, etc. should also be returned. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_8420088812001", 
        "time": "2009-03-25 14:36:00", 
        "title": "Letter from AIG bunus receiptient to CEO", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by crackerjacks61: They are all still guilty of being greedy, good buy to the hole lot. So, even though this guy was part of a section of AIG that was NOT failing and had nothing to do with the crisis. This is how you feel about it? So using your logic, since Fannie and Freddie failed, most of the Dems in congress should be either fired or all their money taken. While we are at it, all the campain funds tossed to Dodd, Obama, McCain, etc. should also be returned. They screwed the pooch, not the corporations and banks. The corporations and banks followed guidelines, dare I say LAWS that had them making loans they normally wouldn't have made. They wound up leveraged 35:1 so the bleeding hearts could help the downtrodden own a home. Shouldn't they be flogged? \"Thank you, for your support.\" - Bartles & Jaymes", 
        "intTime": 20090325, 
        "postID": 7, 
        "quote": "Originally posted by L0A1: quote: Originally posted by crackerjacks61: They are all still guilty of being greedy, good buy to the hole lot. So, even though this guy was part of a section of AIG that was NOT failing and had nothing to do with the crisis. This is how you feel about it? So using your logic, since Fannie and Freddie failed, most of the Dems in congress should be either fired or all their money taken. While we are at it, all the campain funds tossed to Dodd, Obama, McCain, etc. should also be returned.", 
        "reply": " They screwed the pooch, not the corporations and banks. The corporations and banks followed guidelines, dare I say LAWS that had them making loans they normally wouldn't have made. They wound up leveraged 35:1 so the bleeding hearts could help the downtrodden own a home. Shouldn't they be flogged? \"Thank you, for your support.\" - Bartles & Jaymes", 
        "threadID": "672198221_8420088812001", 
        "time": "2009-03-25 14:43:00", 
        "title": "Letter from AIG bunus receiptient to CEO", 
        "userID": "rm444"
    }, 
    {
        "content": "Doesn't the American Taxpayer own 80% of AIG? Isn't the idea behind a \"retention bonus\" to avoid exactly what happened in this case? If we are not retaining the people that work for AIG and continue to demonize the people that do work there, what is going to happen to this company? Why would anyone want to continue to work or begin working at AIG? Will every American Taxpayer have to sign the bankruptcy paperwork when AIG finally goes under? We all have an interest in this company becoming profitable again. Chasing away the employees that work there and who LEGALLY earned their bonuses is counterproductive to that goal.", 
        "intTime": 20090325, 
        "postID": 8, 
        "quote": "", 
        "reply": "Doesn't the American Taxpayer own 80% of AIG? Isn't the idea behind a \"retention bonus\" to avoid exactly what happened in this case? If we are not retaining the people that work for AIG and continue to demonize the people that do work there, what is going to happen to this company? Why would anyone want to continue to work or begin working at AIG? Will every American Taxpayer have to sign the bankruptcy paperwork when AIG finally goes under? We all have an interest in this company becoming profitable again. Chasing away the employees that work there and who LEGALLY earned their bonuses is counterproductive to that goal.", 
        "threadID": "672198221_8420088812001", 
        "time": "2009-03-25 14:48:00", 
        "title": "Letter from AIG bunus receiptient to CEO", 
        "userID": "stec74"
    }, 
    {
        "content": "The AIG brand is toast. It's all done. It will never recover. \"Thank you, for your support.\" - Bartles & Jaymes", 
        "intTime": 20090325, 
        "postID": 9, 
        "quote": "", 
        "reply": "The AIG brand is toast. It's all done. It will never recover. \"Thank you, for your support.\" - Bartles & Jaymes", 
        "threadID": "672198221_8420088812001", 
        "time": "2009-03-25 14:51:00", 
        "title": "Letter from AIG bunus receiptient to CEO", 
        "userID": "rm444"
    }, 
    {
        "content": "This guy can go F HIMSELF, crocodile tears....", 
        "intTime": 20090325, 
        "postID": 10, 
        "quote": "", 
        "reply": "This guy can go F HIMSELF, crocodile tears....", 
        "threadID": "672198221_8420088812001", 
        "time": "2009-03-25 14:58:00", 
        "title": "Letter from AIG bunus receiptient to CEO", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "AIG is now calling themselves AIU but they should call themselves IOU.", 
        "intTime": 20090325, 
        "postID": 11, 
        "quote": "", 
        "reply": "AIG is now calling themselves AIU but they should call themselves IOU.", 
        "threadID": "672198221_8420088812001", 
        "time": "2009-03-25 15:12:00", 
        "title": "Letter from AIG bunus receiptient to CEO", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by rm444: quote: Originally posted by L0A1: quote: Originally posted by crackerjacks61: They are all still guilty of being greedy, good buy to the hole lot. So, even though this guy was part of a section of AIG that was NOT failing and had nothing to do with the crisis. This is how you feel about it? So using your logic, since Fannie and Freddie failed, most of the Dems in congress should be either fired or all their money taken. While we are at it, all the campain funds tossed to Dodd, Obama, McCain, etc. should also be returned. They screwed the pooch, not the corporations and banks. The corporations and banks followed guidelines, dare I say LAWS that had them making loans they normally wouldn't have made. They wound up leveraged 35:1 so the bleeding hearts could help the downtrodden own a home. Shouldn't they be flogged? From what I have been reading, those folks that received the majority of the bonuses were the ones actually creating WEALTH for the company, yet these are the same folks that are being threatened with DEATH threats daily. Yet our Politicians that are even MORE guilty of greed and corruption egg it on and make themselves out to be the saviors of the American people. I am sick and tired of people not taking personal responsibility. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090325, 
        "postID": 12, 
        "quote": "Originally posted by rm444: quote: Originally posted by L0A1: quote: Originally posted by crackerjacks61: They are all still guilty of being greedy, good buy to the hole lot. So, even though this guy was part of a section of AIG that was NOT failing and had nothing to do with the crisis. This is how you feel about it? So using your logic, since Fannie and Freddie failed, most of the Dems in congress should be either fired or all their money taken. While we are at it, all the campain funds tossed to Dodd, Obama, McCain, etc. should also be returned. They screwed the pooch, not the corporations and banks. The corporations and banks followed guidelines, dare I say LAWS that had them making loans they normally wouldn't have made. They wound up leveraged 35:1 so the bleeding hearts could help the downtrodden own a home. Shouldn't they be flogged?", 
        "reply": " From what I have been reading, those folks that received the majority of the bonuses were the ones actually creating WEALTH for the company, yet these are the same folks that are being threatened with DEATH threats daily. Yet our Politicians that are even MORE guilty of greed and corruption egg it on and make themselves out to be the saviors of the American people. I am sick and tired of people not taking personal responsibility. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_8420088812001", 
        "time": "2009-03-25 15:18:00", 
        "title": "Letter from AIG bunus receiptient to CEO", 
        "userID": "L0A1"
    }, 
    {
        "content": "This really sounds fake....It just sounds too informal and juvenile for someone in his position. Had we only saved Lehman Bros the economy wouldn't have tank the way it did.....", 
        "intTime": 20090325, 
        "postID": 13, 
        "quote": "", 
        "reply": "This really sounds fake....It just sounds too informal and juvenile for someone in his position. Had we only saved Lehman Bros the economy wouldn't have tank the way it did.....", 
        "threadID": "672198221_8420088812001", 
        "time": "2009-03-25 15:20:00", 
        "title": "Letter from AIG bunus receiptient to CEO", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "They were creating wealth?? What parallel universe did you slither out of? 180BILLION and counting.....", 
        "intTime": 20090325, 
        "postID": 14, 
        "quote": "", 
        "reply": "They were creating wealth?? What parallel universe did you slither out of? 180BILLION and counting.....", 
        "threadID": "672198221_8420088812001", 
        "time": "2009-03-25 15:22:00", 
        "title": "Letter from AIG bunus receiptient to CEO", 
        "userID": "Irwin_R_Schyster"
    }
]