[
    {
        "content": "\"http://www.cnn.com/POLITICS/\" \"http://news.yahoo.com/s/ap/20090428/ap_on_go_co/us_specter_switch_1\" Smart man! Yessssssss!!!!! This message has been edited. Last edited by: jack_flats, Tue 28 April 2009 09:48 AM \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090428, 
        "postID": 1, 
        "quote": "", 
        "reply": "\"http://www.cnn.com/POLITICS/\" \"http://news.yahoo.com/s/ap/20090428/ap_on_go_co/us_specter_switch_1\" Smart man! Yessssssss!!!!! This message has been edited. Last edited by: jack_flats, Tue 28 April 2009 09:48 AM \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_1980069122001", 
        "time": "2009-04-28 09:09:00", 
        "title": "Sen. Arlen Specter (PA) Switching Political Party to Democrat", 
        "userID": "jack_flats"
    }, 
    {
        "content": "Got to be an interesting story about this.", 
        "intTime": 20090428, 
        "postID": 2, 
        "quote": "", 
        "reply": "Got to be an interesting story about this.", 
        "threadID": "672198221_1980069122001", 
        "time": "2009-04-28 09:11:00", 
        "title": "Sen. Arlen Specter (PA) Switching Political Party to Democrat", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "Well, when the face of the Republican party happens to be Rush Limbaugh things like this were inevitable. Its hard to be a Republican now a days, and its virtually impossible to be one AND hispanic like me... We'll turn it around, the old guard is going to have step aside...All minorities do not like big guvmint, and the liberal views of democrats(gay marriage, abortion in trimester...etc)", 
        "intTime": 20090428, 
        "postID": 3, 
        "quote": "", 
        "reply": "Well, when the face of the Republican party happens to be Rush Limbaugh things like this were inevitable. Its hard to be a Republican now a days, and its virtually impossible to be one AND hispanic like me... We'll turn it around, the old guard is going to have step aside...All minorities do not like big guvmint, and the liberal views of democrats(gay marriage, abortion in trimester...etc)", 
        "threadID": "672198221_1980069122001", 
        "time": "2009-04-28 09:14:00", 
        "title": "Sen. Arlen Specter (PA) Switching Political Party to Democrat", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "Here's the story. I’ve just confirmed with a spokeman for Governor Ed Rendell that he will do everything he can to help the Democratic candidate defeat Specter if the latter remains a Republican or if he pulls a Joe Lieberman from the right, switching to Independent while promising to caucus with Republicans. That’s key, for two reasons. First, because Rendell is a longtime close friend of Specter, and many thought he tacitly aided Specter in 2004. And second, because it ups the pressure on Specter to switch to the Dems. Here’s why: If Specter fears losing a Republican primary — as many expect him to do — and pulls out to run as an Indy in a general election, his chances of holding his seat are slim indeed. He’d be squeezed between his GOP challenger and a Democratic challenger who has full backing from Rendell. In other words, Rendell’s vow of opposition means his only hope of survival may be switching to the Dems. Rendell spokesperson Chuck Ardo tells me that Rendell will throw his full weight behind the Democrat if Specter stays Republican or becomes a GOP-caucusing Indy. “He will do everything he can to support the Democratic candidate,” Ardo says, “no matter what the circumstances.” What’s more, Rendell has to make good on this vow because with Senate Dems approaching 60, the stakes are excruciatingly high. Asked if Specter would have Rendell’s backing if he became a Dem, Ardo said: “If he became the Democratic candidate he would have the governor’s support.” \"http://theplumline.whorunsgov.com/employee-free-choice-act/rendell-will-throw-his-full-weight-behind-democrat-against-specter/\" Just a greedy politician. I say feck him and good-bye. Don't need that trash around. and if he stays a Repub he should lose. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090428, 
        "postID": 4, 
        "quote": "", 
        "reply": "Here's the story. I’ve just confirmed with a spokeman for Governor Ed Rendell that he will do everything he can to help the Democratic candidate defeat Specter if the latter remains a Republican or if he pulls a Joe Lieberman from the right, switching to Independent while promising to caucus with Republicans. That’s key, for two reasons. First, because Rendell is a longtime close friend of Specter, and many thought he tacitly aided Specter in 2004. And second, because it ups the pressure on Specter to switch to the Dems. Here’s why: If Specter fears losing a Republican primary — as many expect him to do — and pulls out to run as an Indy in a general election, his chances of holding his seat are slim indeed. He’d be squeezed between his GOP challenger and a Democratic challenger who has full backing from Rendell. In other words, Rendell’s vow of opposition means his only hope of survival may be switching to the Dems. Rendell spokesperson Chuck Ardo tells me that Rendell will throw his full weight behind the Democrat if Specter stays Republican or becomes a GOP-caucusing Indy. “He will do everything he can to support the Democratic candidate,” Ardo says, “no matter what the circumstances.” What’s more, Rendell has to make good on this vow because with Senate Dems approaching 60, the stakes are excruciatingly high. Asked if Specter would have Rendell’s backing if he became a Dem, Ardo said: “If he became the Democratic candidate he would have the governor’s support.” \"http://theplumline.whorunsgov.com/employee-free-choice-act/rendell-will-throw-his-full-weight-behind-democrat-against-specter/\" Just a greedy politician. I say feck him and good-bye. Don't need that trash around. and if he stays a Repub he should lose. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_1980069122001", 
        "time": "2009-04-28 09:17:00", 
        "title": "Sen. Arlen Specter (PA) Switching Political Party to Democrat", 
        "userID": "Anbar7"
    }, 
    {
        "content": "The Party of \"NO\" is getting to be the Party of \"NO-GO.\" Old-Line Republican's are going to have to start seriously listening to the Meghan McCain's, and drop the old divisive rhetoric that is gaining them nothing. Can Sen. Olympia Snow (ME) be next? Let's hope so. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090428, 
        "postID": 5, 
        "quote": "", 
        "reply": "The Party of \"NO\" is getting to be the Party of \"NO-GO.\" Old-Line Republican's are going to have to start seriously listening to the Meghan McCain's, and drop the old divisive rhetoric that is gaining them nothing. Can Sen. Olympia Snow (ME) be next? Let's hope so. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_1980069122001", 
        "time": "2009-04-28 09:23:00", 
        "title": "Sen. Arlen Specter (PA) Switching Political Party to Democrat", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: The Party of \"NO\" is getting to be the Party of \"NO-GO.\" Old-Line Republican's are going to have to start seriously listening to the Meghan McCain's, and drop the old divisive rhetoric that is gaining them nothing. Can Sen. Olympia Snow (ME) be next? Let's hope so. Maybe Rush will finally cross over too. Then you can't use him everytime you speak. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090428, 
        "postID": 6, 
        "quote": "Originally posted by jack_flats: The Party of \"NO\" is getting to be the Party of \"NO-GO.\" Old-Line Republican's are going to have to start seriously listening to the Meghan McCain's, and drop the old divisive rhetoric that is gaining them nothing. Can Sen. Olympia Snow (ME) be next? Let's hope so.", 
        "reply": " Maybe Rush will finally cross over too. Then you can't use him everytime you speak. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_1980069122001", 
        "time": "2009-04-28 09:28:00", 
        "title": "Sen. Arlen Specter (PA) Switching Political Party to Democrat", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by jack_flats: The Party of \"NO\" is getting to be the Party of \"NO-GO.\" Old-Line Republican's are going to have to start seriously listening to the Meghan McCain's, and drop the old divisive rhetoric that is gaining them nothing. Can Sen. Olympia Snow (ME) be next? Let's hope so. Maybe Rush will finally cross over too. Then you can't use him everytime you speak. Why aren't there any Democrat's looking to switch? \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090428, 
        "postID": 7, 
        "quote": "Originally posted by Anbar7: quote: Originally posted by jack_flats: The Party of \"NO\" is getting to be the Party of \"NO-GO.\" Old-Line Republican's are going to have to start seriously listening to the Meghan McCain's, and drop the old divisive rhetoric that is gaining them nothing. Can Sen. Olympia Snow (ME) be next? Let's hope so. Maybe Rush will finally cross over too. Then you can't use him everytime you speak.", 
        "reply": " Why aren't there any Democrat's looking to switch? \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_1980069122001", 
        "time": "2009-04-28 09:32:00", 
        "title": "Sen. Arlen Specter (PA) Switching Political Party to Democrat", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: quote: Originally posted by Anbar7: quote: Originally posted by jack_flats: The Party of \"NO\" is getting to be the Party of \"NO-GO.\" Old-Line Republican's are going to have to start seriously listening to the Meghan McCain's, and drop the old divisive rhetoric that is gaining them nothing. Can Sen. Olympia Snow (ME) be next? Let's hope so. Maybe Rush will finally cross over too. Then you can't use him everytime you speak. Why aren't there any Democrat's looking to switch? Because their Gay and they want abortions \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090428, 
        "postID": 8, 
        "quote": "Originally posted by jack_flats: quote: Originally posted by Anbar7: quote: Originally posted by jack_flats: The Party of \"NO\" is getting to be the Party of \"NO-GO.\" Old-Line Republican's are going to have to start seriously listening to the Meghan McCain's, and drop the old divisive rhetoric that is gaining them nothing. Can Sen. Olympia Snow (ME) be next? Let's hope so. Maybe Rush will finally cross over too. Then you can't use him everytime you speak. Why aren't there any Democrat's looking to switch?", 
        "reply": " Because their Gay and they want abortions \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_1980069122001", 
        "time": "2009-04-28 09:33:00", 
        "title": "Sen. Arlen Specter (PA) Switching Political Party to Democrat", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: quote: Originally posted by Anbar7: quote: Originally posted by jack_flats: The Party of \"NO\" is getting to be the Party of \"NO-GO.\" Old-Line Republican's are going to have to start seriously listening to the Meghan McCain's, and drop the old divisive rhetoric that is gaining them nothing. Can Sen. Olympia Snow (ME) be next? Let's hope so. Maybe Rush will finally cross over too. Then you can't use him everytime you speak. Why aren't there any Democrat's looking to switch? Probably because they aren't in any danger of losing office and don't need to. You take this one Repub who is worried he is going to lose his seat and he is changing for that reason then good i'm glad he wants to change. Yet if he still has his Repub beliefs then he is a conservative dem \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090428, 
        "postID": 9, 
        "quote": "Originally posted by jack_flats: quote: Originally posted by Anbar7: quote: Originally posted by jack_flats: The Party of \"NO\" is getting to be the Party of \"NO-GO.\" Old-Line Republican's are going to have to start seriously listening to the Meghan McCain's, and drop the old divisive rhetoric that is gaining them nothing. Can Sen. Olympia Snow (ME) be next? Let's hope so. Maybe Rush will finally cross over too. Then you can't use him everytime you speak. Why aren't there any Democrat's looking to switch?", 
        "reply": " Probably because they aren't in any danger of losing office and don't need to. You take this one Repub who is worried he is going to lose his seat and he is changing for that reason then good i'm glad he wants to change. Yet if he still has his Repub beliefs then he is a conservative dem \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_1980069122001", 
        "time": "2009-04-28 09:35:00", 
        "title": "Sen. Arlen Specter (PA) Switching Political Party to Democrat", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by jack_flats: The Party of \"NO\" is getting to be the Party of \"NO-GO.\" Old-Line Republican's are going to have to start seriously listening to the Meghan McCain's, and drop the old divisive rhetoric that is gaining them nothing. Can Sen. Olympia Snow (ME) be next? Let's hope so. Maybe Rush will finally cross over too. Then you can't use him everytime you speak. You may be on to something. If you can get Rush Limbaugh to switch parties, it’s pretty much a guarantee that all democrats will switch parties to republican. This could be the republican's big chance to win the next election. Who says republicans have no new ideas?", 
        "intTime": 20090428, 
        "postID": 10, 
        "quote": "Originally posted by Anbar7: quote: Originally posted by jack_flats: The Party of \"NO\" is getting to be the Party of \"NO-GO.\" Old-Line Republican's are going to have to start seriously listening to the Meghan McCain's, and drop the old divisive rhetoric that is gaining them nothing. Can Sen. Olympia Snow (ME) be next? Let's hope so. Maybe Rush will finally cross over too. Then you can't use him everytime you speak.", 
        "reply": " You may be on to something. If you can get Rush Limbaugh to switch parties, it’s pretty much a guarantee that all democrats will switch parties to republican. This could be the republican's big chance to win the next election. Who says republicans have no new ideas?", 
        "threadID": "672198221_1980069122001", 
        "time": "2009-04-28 09:41:00", 
        "title": "Sen. Arlen Specter (PA) Switching Political Party to Democrat", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "Good riddance. He is a liberal anyway and should be right at home in the democratic party. Meanwhile, the republican party will continue to clean house... \"The World's Finest\"", 
        "intTime": 20090428, 
        "postID": 11, 
        "quote": "", 
        "reply": "Good riddance. He is a liberal anyway and should be right at home in the democratic party. Meanwhile, the republican party will continue to clean house... \"The World's Finest\"", 
        "threadID": "672198221_1980069122001", 
        "time": "2009-04-28 09:46:00", 
        "title": "Sen. Arlen Specter (PA) Switching Political Party to Democrat", 
        "userID": "Kegler300"
    }, 
    {
        "content": "So essentially he is changing to stay in the good graces of the govenor and to try and extend his stay in Congress. It seems to me he has been ridiculed by those on these boards on the left. Now he is Ok since he is switching?", 
        "intTime": 20090428, 
        "postID": 12, 
        "quote": "", 
        "reply": "So essentially he is changing to stay in the good graces of the govenor and to try and extend his stay in Congress. It seems to me he has been ridiculed by those on these boards on the left. Now he is Ok since he is switching?", 
        "threadID": "672198221_1980069122001", 
        "time": "2009-04-28 09:53:00", 
        "title": "Sen. Arlen Specter (PA) Switching Political Party to Democrat", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by jack_flats: The Party of \"NO\" is getting to be the Party of \"NO-GO.\" Old-Line Republican's are going to have to start seriously listening to the Meghan McCain's, and drop the old divisive rhetoric that is gaining them nothing. Can Sen. Olympia Snow (ME) be next? Let's hope so. Maybe Rush will finally cross over too. Then you can't use him everytime you speak. Thirty years ago Spectre would have been regarded as a right wing Republican. It's been a slow change, and the far right extremists have gotten what they prayed for. They will soon have a pristine pure Party of the Far Right. Naturally, they're going to win every election now that their message is pristine pure... While I don't expect Gingrich to jump parties, he will soon be referred to as a \"Rino.,\" almost a \"Socialist.\" Dave", 
        "intTime": 20090428, 
        "postID": 13, 
        "quote": "Originally posted by Anbar7: quote: Originally posted by jack_flats: The Party of \"NO\" is getting to be the Party of \"NO-GO.\" Old-Line Republican's are going to have to start seriously listening to the Meghan McCain's, and drop the old divisive rhetoric that is gaining them nothing. Can Sen. Olympia Snow (ME) be next? Let's hope so. Maybe Rush will finally cross over too. Then you can't use him everytime you speak.", 
        "reply": " Thirty years ago Spectre would have been regarded as a right wing Republican. It's been a slow change, and the far right extremists have gotten what they prayed for. They will soon have a pristine pure Party of the Far Right. Naturally, they're going to win every election now that their message is pristine pure... While I don't expect Gingrich to jump parties, he will soon be referred to as a \"Rino.,\" almost a \"Socialist.\" Dave", 
        "threadID": "672198221_1980069122001", 
        "time": "2009-04-28 10:06:00", 
        "title": "Sen. Arlen Specter (PA) Switching Political Party to Democrat", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: and its virtually impossible to be one AND hispanic like me... Other than the God thing, I really don't know why Hispanics support the Republican party. The good news is it looks like they woke up a little in 2008.", 
        "intTime": 20090428, 
        "postID": 14, 
        "quote": "Originally posted by Irwin_R_Schyster: and its virtually impossible to be one AND hispanic like me...", 
        "reply": " Other than the God thing, I really don't know why Hispanics support the Republican party. The good news is it looks like they woke up a little in 2008.", 
        "threadID": "672198221_1980069122001", 
        "time": "2009-04-28 10:07:00", 
        "title": "Sen. Arlen Specter (PA) Switching Political Party to Democrat", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: Good riddance. He is a liberal anyway and should be right at home in the democratic party. Meanwhile, the republican party will continue to clean house... If by cleaning house you mean losing support and votes, then yes, they are certainly doing that.", 
        "intTime": 20090428, 
        "postID": 15, 
        "quote": "Originally posted by Kegler300: Good riddance. He is a liberal anyway and should be right at home in the democratic party. Meanwhile, the republican party will continue to clean house...", 
        "reply": " If by cleaning house you mean losing support and votes, then yes, they are certainly doing that.", 
        "threadID": "672198221_1980069122001", 
        "time": "2009-04-28 10:08:00", 
        "title": "Sen. Arlen Specter (PA) Switching Political Party to Democrat", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by Irwin_R_Schyster: and its virtually impossible to be one AND hispanic like me... Other than the God thing, I really don't know why Hispanics support the Republican party. The good news is it looks like they woke up a little in 2008. that is mainly it. Religion, abortion, and other things with that. I don't know why they would go Dem, except to free load off Americans. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090428, 
        "postID": 16, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by Irwin_R_Schyster: and its virtually impossible to be one AND hispanic like me... Other than the God thing, I really don't know why Hispanics support the Republican party. The good news is it looks like they woke up a little in 2008.", 
        "reply": " that is mainly it. Religion, abortion, and other things with that. I don't know why they would go Dem, except to free load off Americans. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_1980069122001", 
        "time": "2009-04-28 10:10:00", 
        "title": "Sen. Arlen Specter (PA) Switching Political Party to Democrat", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: \"http://www.cnn.com/POLITICS/\" \"http://news.yahoo.com/s/ap/20090428/ap_on_go_co/us_specter_switch_1\" Smart man! Yessssssss!!!!! Welcome to the party Senator Specter, glad to have you on board. My way of looking at this, just a job preservation move. However, I for one hope that the progressive wing of the Pennsylvania party put up someone as well. It will keep him (Specter) honest. He is my Senator and I'm drafting a long congratulatory e-mail to him now.", 
        "intTime": 20090428, 
        "postID": 17, 
        "quote": "Originally posted by jack_flats: \"http://www.cnn.com/POLITICS/\" \"http://news.yahoo.com/s/ap/20090428/ap_on_go_co/us_specter_switch_1\" Smart man! Yessssssss!!!!!", 
        "reply": " Welcome to the party Senator Specter, glad to have you on board. My way of looking at this, just a job preservation move. However, I for one hope that the progressive wing of the Pennsylvania party put up someone as well. It will keep him (Specter) honest. He is my Senator and I'm drafting a long congratulatory e-mail to him now.", 
        "threadID": "672198221_1980069122001", 
        "time": "2009-04-28 11:09:00", 
        "title": "Sen. Arlen Specter (PA) Switching Political Party to Democrat", 
        "userID": "jdksfcret"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: \"http://www.cnn.com/POLITICS/\" \"http://news.yahoo.com/s/ap/20090428/ap_on_go_co/us_specter_switch_1\" Smart man! Yessssssss!!!!! The fine people of Pennsylvania will wake up soon and realize that Spector was phoney anyway. They are getting fed up with murtha too and both will loose.", 
        "intTime": 20090428, 
        "postID": 18, 
        "quote": "Originally posted by jack_flats: \"http://www.cnn.com/POLITICS/\" \"http://news.yahoo.com/s/ap/20090428/ap_on_go_co/us_specter_switch_1\" Smart man! Yessssssss!!!!!", 
        "reply": " The fine people of Pennsylvania will wake up soon and realize that Spector was phoney anyway. They are getting fed up with murtha too and both will loose.", 
        "threadID": "672198221_1980069122001", 
        "time": "2009-04-28 14:19:00", 
        "title": "Sen. Arlen Specter (PA) Switching Political Party to Democrat", 
        "userID": "busnrete8"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: \"http://www.cnn.com/POLITICS/\" \"http://news.yahoo.com/s/ap/20090428/ap_on_go_co/us_specter_switch_1\" Smart man! Yessssssss!!!!! but Jack what if this happened, In theory what if Spector changed his mind and wanted to stay and for some reason became the fore-runner for the GOP, would would happen? would each and everyone of the GOPers here flip flop back with him faster than lighting? Wait that has already been proven...John McCain!", 
        "intTime": 20090428, 
        "postID": 19, 
        "quote": "Originally posted by jack_flats: \"http://www.cnn.com/POLITICS/\" \"http://news.yahoo.com/s/ap/20090428/ap_on_go_co/us_specter_switch_1\" Smart man! Yessssssss!!!!!", 
        "reply": " but Jack what if this happened, In theory what if Spector changed his mind and wanted to stay and for some reason became the fore-runner for the GOP, would would happen? would each and everyone of the GOPers here flip flop back with him faster than lighting? Wait that has already been proven...John McCain!", 
        "threadID": "672198221_1980069122001", 
        "time": "2009-04-28 16:31:00", 
        "title": "Sen. Arlen Specter (PA) Switching Political Party to Democrat", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: quote: Originally posted by jack_flats: \"http://www.cnn.com/POLITICS/\" \"http://news.yahoo.com/s/ap/20090428/ap_on_go_co/us_specter_switch_1\" Smart man! Yessssssss!!!!! but Jack what if this happened, In theory what if Spector changed his mind and wanted to stay and for some reason became the fore-runner for the GOP, would would happen? would each and everyone of the GOPers here flip flop back with him faster than lighting? Wait that has already been proven...John McCain! McCain ia a 25 year congressman and war hero! Spector is a turn coat turkey", 
        "intTime": 20090428, 
        "postID": 20, 
        "quote": "Originally posted by crackerjacks61: quote: Originally posted by jack_flats: \"http://www.cnn.com/POLITICS/\" \"http://news.yahoo.com/s/ap/20090428/ap_on_go_co/us_specter_switch_1\" Smart man! Yessssssss!!!!! but Jack what if this happened, In theory what if Spector changed his mind and wanted to stay and for some reason became the fore-runner for the GOP, would would happen? would each and everyone of the GOPers here flip flop back with him faster than lighting? Wait that has already been proven...John McCain!", 
        "reply": " McCain ia a 25 year congressman and war hero! Spector is a turn coat turkey", 
        "threadID": "672198221_1980069122001", 
        "time": "2009-04-28 16:52:00", 
        "title": "Sen. Arlen Specter (PA) Switching Political Party to Democrat", 
        "userID": "EAG154"
    }, 
    {
        "content": "\"http://www.cnn.com/POLITICS/\" \"http://news.yahoo.com/s/ap/20090428/ap_on_go_co/us_specter_switch_1\" Smart man! Yessssssss!!!!! This message has been edited. Last edited by: jack_flats, Tue 28 April 2009 09:48 AM \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090428, 
        "postID": 21, 
        "quote": "", 
        "reply": "\"http://www.cnn.com/POLITICS/\" \"http://news.yahoo.com/s/ap/20090428/ap_on_go_co/us_specter_switch_1\" Smart man! Yessssssss!!!!! This message has been edited. Last edited by: jack_flats, Tue 28 April 2009 09:48 AM \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_1980069122001", 
        "time": "2009-04-28 09:09:00", 
        "title": "Sen. Arlen Specter (PA) Switching Political Party to Democrat", 
        "userID": "jack_flats"
    }, 
    {
        "content": "Got to be an interesting story about this.", 
        "intTime": 20090428, 
        "postID": 22, 
        "quote": "", 
        "reply": "Got to be an interesting story about this.", 
        "threadID": "672198221_1980069122001", 
        "time": "2009-04-28 09:11:00", 
        "title": "Sen. Arlen Specter (PA) Switching Political Party to Democrat", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "Well, when the face of the Republican party happens to be Rush Limbaugh things like this were inevitable. Its hard to be a Republican now a days, and its virtually impossible to be one AND hispanic like me... We'll turn it around, the old guard is going to have step aside...All minorities do not like big guvmint, and the liberal views of democrats(gay marriage, abortion in trimester...etc)", 
        "intTime": 20090428, 
        "postID": 23, 
        "quote": "", 
        "reply": "Well, when the face of the Republican party happens to be Rush Limbaugh things like this were inevitable. Its hard to be a Republican now a days, and its virtually impossible to be one AND hispanic like me... We'll turn it around, the old guard is going to have step aside...All minorities do not like big guvmint, and the liberal views of democrats(gay marriage, abortion in trimester...etc)", 
        "threadID": "672198221_1980069122001", 
        "time": "2009-04-28 09:14:00", 
        "title": "Sen. Arlen Specter (PA) Switching Political Party to Democrat", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "Here's the story. I’ve just confirmed with a spokeman for Governor Ed Rendell that he will do everything he can to help the Democratic candidate defeat Specter if the latter remains a Republican or if he pulls a Joe Lieberman from the right, switching to Independent while promising to caucus with Republicans. That’s key, for two reasons. First, because Rendell is a longtime close friend of Specter, and many thought he tacitly aided Specter in 2004. And second, because it ups the pressure on Specter to switch to the Dems. Here’s why: If Specter fears losing a Republican primary — as many expect him to do — and pulls out to run as an Indy in a general election, his chances of holding his seat are slim indeed. He’d be squeezed between his GOP challenger and a Democratic challenger who has full backing from Rendell. In other words, Rendell’s vow of opposition means his only hope of survival may be switching to the Dems. Rendell spokesperson Chuck Ardo tells me that Rendell will throw his full weight behind the Democrat if Specter stays Republican or becomes a GOP-caucusing Indy. “He will do everything he can to support the Democratic candidate,” Ardo says, “no matter what the circumstances.” What’s more, Rendell has to make good on this vow because with Senate Dems approaching 60, the stakes are excruciatingly high. Asked if Specter would have Rendell’s backing if he became a Dem, Ardo said: “If he became the Democratic candidate he would have the governor’s support.” \"http://theplumline.whorunsgov.com/employee-free-choice-act/rendell-will-throw-his-full-weight-behind-democrat-against-specter/\" Just a greedy politician. I say feck him and good-bye. Don't need that trash around. and if he stays a Repub he should lose. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090428, 
        "postID": 24, 
        "quote": "", 
        "reply": "Here's the story. I’ve just confirmed with a spokeman for Governor Ed Rendell that he will do everything he can to help the Democratic candidate defeat Specter if the latter remains a Republican or if he pulls a Joe Lieberman from the right, switching to Independent while promising to caucus with Republicans. That’s key, for two reasons. First, because Rendell is a longtime close friend of Specter, and many thought he tacitly aided Specter in 2004. And second, because it ups the pressure on Specter to switch to the Dems. Here’s why: If Specter fears losing a Republican primary — as many expect him to do — and pulls out to run as an Indy in a general election, his chances of holding his seat are slim indeed. He’d be squeezed between his GOP challenger and a Democratic challenger who has full backing from Rendell. In other words, Rendell’s vow of opposition means his only hope of survival may be switching to the Dems. Rendell spokesperson Chuck Ardo tells me that Rendell will throw his full weight behind the Democrat if Specter stays Republican or becomes a GOP-caucusing Indy. “He will do everything he can to support the Democratic candidate,” Ardo says, “no matter what the circumstances.” What’s more, Rendell has to make good on this vow because with Senate Dems approaching 60, the stakes are excruciatingly high. Asked if Specter would have Rendell’s backing if he became a Dem, Ardo said: “If he became the Democratic candidate he would have the governor’s support.” \"http://theplumline.whorunsgov.com/employee-free-choice-act/rendell-will-throw-his-full-weight-behind-democrat-against-specter/\" Just a greedy politician. I say feck him and good-bye. Don't need that trash around. and if he stays a Repub he should lose. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_1980069122001", 
        "time": "2009-04-28 09:17:00", 
        "title": "Sen. Arlen Specter (PA) Switching Political Party to Democrat", 
        "userID": "Anbar7"
    }, 
    {
        "content": "The Party of \"NO\" is getting to be the Party of \"NO-GO.\" Old-Line Republican's are going to have to start seriously listening to the Meghan McCain's, and drop the old divisive rhetoric that is gaining them nothing. Can Sen. Olympia Snow (ME) be next? Let's hope so. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090428, 
        "postID": 25, 
        "quote": "", 
        "reply": "The Party of \"NO\" is getting to be the Party of \"NO-GO.\" Old-Line Republican's are going to have to start seriously listening to the Meghan McCain's, and drop the old divisive rhetoric that is gaining them nothing. Can Sen. Olympia Snow (ME) be next? Let's hope so. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_1980069122001", 
        "time": "2009-04-28 09:23:00", 
        "title": "Sen. Arlen Specter (PA) Switching Political Party to Democrat", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: The Party of \"NO\" is getting to be the Party of \"NO-GO.\" Old-Line Republican's are going to have to start seriously listening to the Meghan McCain's, and drop the old divisive rhetoric that is gaining them nothing. Can Sen. Olympia Snow (ME) be next? Let's hope so. Maybe Rush will finally cross over too. Then you can't use him everytime you speak. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090428, 
        "postID": 26, 
        "quote": "Originally posted by jack_flats: The Party of \"NO\" is getting to be the Party of \"NO-GO.\" Old-Line Republican's are going to have to start seriously listening to the Meghan McCain's, and drop the old divisive rhetoric that is gaining them nothing. Can Sen. Olympia Snow (ME) be next? Let's hope so.", 
        "reply": " Maybe Rush will finally cross over too. Then you can't use him everytime you speak. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_1980069122001", 
        "time": "2009-04-28 09:28:00", 
        "title": "Sen. Arlen Specter (PA) Switching Political Party to Democrat", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by jack_flats: The Party of \"NO\" is getting to be the Party of \"NO-GO.\" Old-Line Republican's are going to have to start seriously listening to the Meghan McCain's, and drop the old divisive rhetoric that is gaining them nothing. Can Sen. Olympia Snow (ME) be next? Let's hope so. Maybe Rush will finally cross over too. Then you can't use him everytime you speak. Why aren't there any Democrat's looking to switch? \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090428, 
        "postID": 27, 
        "quote": "Originally posted by Anbar7: quote: Originally posted by jack_flats: The Party of \"NO\" is getting to be the Party of \"NO-GO.\" Old-Line Republican's are going to have to start seriously listening to the Meghan McCain's, and drop the old divisive rhetoric that is gaining them nothing. Can Sen. Olympia Snow (ME) be next? Let's hope so. Maybe Rush will finally cross over too. Then you can't use him everytime you speak.", 
        "reply": " Why aren't there any Democrat's looking to switch? \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_1980069122001", 
        "time": "2009-04-28 09:32:00", 
        "title": "Sen. Arlen Specter (PA) Switching Political Party to Democrat", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: quote: Originally posted by Anbar7: quote: Originally posted by jack_flats: The Party of \"NO\" is getting to be the Party of \"NO-GO.\" Old-Line Republican's are going to have to start seriously listening to the Meghan McCain's, and drop the old divisive rhetoric that is gaining them nothing. Can Sen. Olympia Snow (ME) be next? Let's hope so. Maybe Rush will finally cross over too. Then you can't use him everytime you speak. Why aren't there any Democrat's looking to switch? Because their Gay and they want abortions \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090428, 
        "postID": 28, 
        "quote": "Originally posted by jack_flats: quote: Originally posted by Anbar7: quote: Originally posted by jack_flats: The Party of \"NO\" is getting to be the Party of \"NO-GO.\" Old-Line Republican's are going to have to start seriously listening to the Meghan McCain's, and drop the old divisive rhetoric that is gaining them nothing. Can Sen. Olympia Snow (ME) be next? Let's hope so. Maybe Rush will finally cross over too. Then you can't use him everytime you speak. Why aren't there any Democrat's looking to switch?", 
        "reply": " Because their Gay and they want abortions \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_1980069122001", 
        "time": "2009-04-28 09:33:00", 
        "title": "Sen. Arlen Specter (PA) Switching Political Party to Democrat", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: quote: Originally posted by Anbar7: quote: Originally posted by jack_flats: The Party of \"NO\" is getting to be the Party of \"NO-GO.\" Old-Line Republican's are going to have to start seriously listening to the Meghan McCain's, and drop the old divisive rhetoric that is gaining them nothing. Can Sen. Olympia Snow (ME) be next? Let's hope so. Maybe Rush will finally cross over too. Then you can't use him everytime you speak. Why aren't there any Democrat's looking to switch? Probably because they aren't in any danger of losing office and don't need to. You take this one Repub who is worried he is going to lose his seat and he is changing for that reason then good i'm glad he wants to change. Yet if he still has his Repub beliefs then he is a conservative dem \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090428, 
        "postID": 29, 
        "quote": "Originally posted by jack_flats: quote: Originally posted by Anbar7: quote: Originally posted by jack_flats: The Party of \"NO\" is getting to be the Party of \"NO-GO.\" Old-Line Republican's are going to have to start seriously listening to the Meghan McCain's, and drop the old divisive rhetoric that is gaining them nothing. Can Sen. Olympia Snow (ME) be next? Let's hope so. Maybe Rush will finally cross over too. Then you can't use him everytime you speak. Why aren't there any Democrat's looking to switch?", 
        "reply": " Probably because they aren't in any danger of losing office and don't need to. You take this one Repub who is worried he is going to lose his seat and he is changing for that reason then good i'm glad he wants to change. Yet if he still has his Repub beliefs then he is a conservative dem \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_1980069122001", 
        "time": "2009-04-28 09:35:00", 
        "title": "Sen. Arlen Specter (PA) Switching Political Party to Democrat", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by jack_flats: The Party of \"NO\" is getting to be the Party of \"NO-GO.\" Old-Line Republican's are going to have to start seriously listening to the Meghan McCain's, and drop the old divisive rhetoric that is gaining them nothing. Can Sen. Olympia Snow (ME) be next? Let's hope so. Maybe Rush will finally cross over too. Then you can't use him everytime you speak. You may be on to something. If you can get Rush Limbaugh to switch parties, it’s pretty much a guarantee that all democrats will switch parties to republican. This could be the republican's big chance to win the next election. Who says republicans have no new ideas?", 
        "intTime": 20090428, 
        "postID": 30, 
        "quote": "Originally posted by Anbar7: quote: Originally posted by jack_flats: The Party of \"NO\" is getting to be the Party of \"NO-GO.\" Old-Line Republican's are going to have to start seriously listening to the Meghan McCain's, and drop the old divisive rhetoric that is gaining them nothing. Can Sen. Olympia Snow (ME) be next? Let's hope so. Maybe Rush will finally cross over too. Then you can't use him everytime you speak.", 
        "reply": " You may be on to something. If you can get Rush Limbaugh to switch parties, it’s pretty much a guarantee that all democrats will switch parties to republican. This could be the republican's big chance to win the next election. Who says republicans have no new ideas?", 
        "threadID": "672198221_1980069122001", 
        "time": "2009-04-28 09:41:00", 
        "title": "Sen. Arlen Specter (PA) Switching Political Party to Democrat", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "Good riddance. He is a liberal anyway and should be right at home in the democratic party. Meanwhile, the republican party will continue to clean house... \"The World's Finest\"", 
        "intTime": 20090428, 
        "postID": 31, 
        "quote": "", 
        "reply": "Good riddance. He is a liberal anyway and should be right at home in the democratic party. Meanwhile, the republican party will continue to clean house... \"The World's Finest\"", 
        "threadID": "672198221_1980069122001", 
        "time": "2009-04-28 09:46:00", 
        "title": "Sen. Arlen Specter (PA) Switching Political Party to Democrat", 
        "userID": "Kegler300"
    }, 
    {
        "content": "So essentially he is changing to stay in the good graces of the govenor and to try and extend his stay in Congress. It seems to me he has been ridiculed by those on these boards on the left. Now he is Ok since he is switching?", 
        "intTime": 20090428, 
        "postID": 32, 
        "quote": "", 
        "reply": "So essentially he is changing to stay in the good graces of the govenor and to try and extend his stay in Congress. It seems to me he has been ridiculed by those on these boards on the left. Now he is Ok since he is switching?", 
        "threadID": "672198221_1980069122001", 
        "time": "2009-04-28 09:53:00", 
        "title": "Sen. Arlen Specter (PA) Switching Political Party to Democrat", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by jack_flats: The Party of \"NO\" is getting to be the Party of \"NO-GO.\" Old-Line Republican's are going to have to start seriously listening to the Meghan McCain's, and drop the old divisive rhetoric that is gaining them nothing. Can Sen. Olympia Snow (ME) be next? Let's hope so. Maybe Rush will finally cross over too. Then you can't use him everytime you speak. Thirty years ago Spectre would have been regarded as a right wing Republican. It's been a slow change, and the far right extremists have gotten what they prayed for. They will soon have a pristine pure Party of the Far Right. Naturally, they're going to win every election now that their message is pristine pure... While I don't expect Gingrich to jump parties, he will soon be referred to as a \"Rino.,\" almost a \"Socialist.\" Dave", 
        "intTime": 20090428, 
        "postID": 33, 
        "quote": "Originally posted by Anbar7: quote: Originally posted by jack_flats: The Party of \"NO\" is getting to be the Party of \"NO-GO.\" Old-Line Republican's are going to have to start seriously listening to the Meghan McCain's, and drop the old divisive rhetoric that is gaining them nothing. Can Sen. Olympia Snow (ME) be next? Let's hope so. Maybe Rush will finally cross over too. Then you can't use him everytime you speak.", 
        "reply": " Thirty years ago Spectre would have been regarded as a right wing Republican. It's been a slow change, and the far right extremists have gotten what they prayed for. They will soon have a pristine pure Party of the Far Right. Naturally, they're going to win every election now that their message is pristine pure... While I don't expect Gingrich to jump parties, he will soon be referred to as a \"Rino.,\" almost a \"Socialist.\" Dave", 
        "threadID": "672198221_1980069122001", 
        "time": "2009-04-28 10:06:00", 
        "title": "Sen. Arlen Specter (PA) Switching Political Party to Democrat", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: and its virtually impossible to be one AND hispanic like me... Other than the God thing, I really don't know why Hispanics support the Republican party. The good news is it looks like they woke up a little in 2008.", 
        "intTime": 20090428, 
        "postID": 34, 
        "quote": "Originally posted by Irwin_R_Schyster: and its virtually impossible to be one AND hispanic like me...", 
        "reply": " Other than the God thing, I really don't know why Hispanics support the Republican party. The good news is it looks like they woke up a little in 2008.", 
        "threadID": "672198221_1980069122001", 
        "time": "2009-04-28 10:07:00", 
        "title": "Sen. Arlen Specter (PA) Switching Political Party to Democrat", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: Good riddance. He is a liberal anyway and should be right at home in the democratic party. Meanwhile, the republican party will continue to clean house... If by cleaning house you mean losing support and votes, then yes, they are certainly doing that.", 
        "intTime": 20090428, 
        "postID": 35, 
        "quote": "Originally posted by Kegler300: Good riddance. He is a liberal anyway and should be right at home in the democratic party. Meanwhile, the republican party will continue to clean house...", 
        "reply": " If by cleaning house you mean losing support and votes, then yes, they are certainly doing that.", 
        "threadID": "672198221_1980069122001", 
        "time": "2009-04-28 10:08:00", 
        "title": "Sen. Arlen Specter (PA) Switching Political Party to Democrat", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by Irwin_R_Schyster: and its virtually impossible to be one AND hispanic like me... Other than the God thing, I really don't know why Hispanics support the Republican party. The good news is it looks like they woke up a little in 2008. that is mainly it. Religion, abortion, and other things with that. I don't know why they would go Dem, except to free load off Americans. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090428, 
        "postID": 36, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by Irwin_R_Schyster: and its virtually impossible to be one AND hispanic like me... Other than the God thing, I really don't know why Hispanics support the Republican party. The good news is it looks like they woke up a little in 2008.", 
        "reply": " that is mainly it. Religion, abortion, and other things with that. I don't know why they would go Dem, except to free load off Americans. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_1980069122001", 
        "time": "2009-04-28 10:10:00", 
        "title": "Sen. Arlen Specter (PA) Switching Political Party to Democrat", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: \"http://www.cnn.com/POLITICS/\" \"http://news.yahoo.com/s/ap/20090428/ap_on_go_co/us_specter_switch_1\" Smart man! Yessssssss!!!!! Welcome to the party Senator Specter, glad to have you on board. My way of looking at this, just a job preservation move. However, I for one hope that the progressive wing of the Pennsylvania party put up someone as well. It will keep him (Specter) honest. He is my Senator and I'm drafting a long congratulatory e-mail to him now.", 
        "intTime": 20090428, 
        "postID": 37, 
        "quote": "Originally posted by jack_flats: \"http://www.cnn.com/POLITICS/\" \"http://news.yahoo.com/s/ap/20090428/ap_on_go_co/us_specter_switch_1\" Smart man! Yessssssss!!!!!", 
        "reply": " Welcome to the party Senator Specter, glad to have you on board. My way of looking at this, just a job preservation move. However, I for one hope that the progressive wing of the Pennsylvania party put up someone as well. It will keep him (Specter) honest. He is my Senator and I'm drafting a long congratulatory e-mail to him now.", 
        "threadID": "672198221_1980069122001", 
        "time": "2009-04-28 11:09:00", 
        "title": "Sen. Arlen Specter (PA) Switching Political Party to Democrat", 
        "userID": "jdksfcret"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: \"http://www.cnn.com/POLITICS/\" \"http://news.yahoo.com/s/ap/20090428/ap_on_go_co/us_specter_switch_1\" Smart man! Yessssssss!!!!! The fine people of Pennsylvania will wake up soon and realize that Spector was phoney anyway. They are getting fed up with murtha too and both will loose.", 
        "intTime": 20090428, 
        "postID": 38, 
        "quote": "Originally posted by jack_flats: \"http://www.cnn.com/POLITICS/\" \"http://news.yahoo.com/s/ap/20090428/ap_on_go_co/us_specter_switch_1\" Smart man! Yessssssss!!!!!", 
        "reply": " The fine people of Pennsylvania will wake up soon and realize that Spector was phoney anyway. They are getting fed up with murtha too and both will loose.", 
        "threadID": "672198221_1980069122001", 
        "time": "2009-04-28 14:19:00", 
        "title": "Sen. Arlen Specter (PA) Switching Political Party to Democrat", 
        "userID": "busnrete8"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: \"http://www.cnn.com/POLITICS/\" \"http://news.yahoo.com/s/ap/20090428/ap_on_go_co/us_specter_switch_1\" Smart man! Yessssssss!!!!! but Jack what if this happened, In theory what if Spector changed his mind and wanted to stay and for some reason became the fore-runner for the GOP, would would happen? would each and everyone of the GOPers here flip flop back with him faster than lighting? Wait that has already been proven...John McCain!", 
        "intTime": 20090428, 
        "postID": 39, 
        "quote": "Originally posted by jack_flats: \"http://www.cnn.com/POLITICS/\" \"http://news.yahoo.com/s/ap/20090428/ap_on_go_co/us_specter_switch_1\" Smart man! Yessssssss!!!!!", 
        "reply": " but Jack what if this happened, In theory what if Spector changed his mind and wanted to stay and for some reason became the fore-runner for the GOP, would would happen? would each and everyone of the GOPers here flip flop back with him faster than lighting? Wait that has already been proven...John McCain!", 
        "threadID": "672198221_1980069122001", 
        "time": "2009-04-28 16:31:00", 
        "title": "Sen. Arlen Specter (PA) Switching Political Party to Democrat", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: quote: Originally posted by jack_flats: \"http://www.cnn.com/POLITICS/\" \"http://news.yahoo.com/s/ap/20090428/ap_on_go_co/us_specter_switch_1\" Smart man! Yessssssss!!!!! but Jack what if this happened, In theory what if Spector changed his mind and wanted to stay and for some reason became the fore-runner for the GOP, would would happen? would each and everyone of the GOPers here flip flop back with him faster than lighting? Wait that has already been proven...John McCain! McCain ia a 25 year congressman and war hero! Spector is a turn coat turkey", 
        "intTime": 20090428, 
        "postID": 40, 
        "quote": "Originally posted by crackerjacks61: quote: Originally posted by jack_flats: \"http://www.cnn.com/POLITICS/\" \"http://news.yahoo.com/s/ap/20090428/ap_on_go_co/us_specter_switch_1\" Smart man! Yessssssss!!!!! but Jack what if this happened, In theory what if Spector changed his mind and wanted to stay and for some reason became the fore-runner for the GOP, would would happen? would each and everyone of the GOPers here flip flop back with him faster than lighting? Wait that has already been proven...John McCain!", 
        "reply": " McCain ia a 25 year congressman and war hero! Spector is a turn coat turkey", 
        "threadID": "672198221_1980069122001", 
        "time": "2009-04-28 16:52:00", 
        "title": "Sen. Arlen Specter (PA) Switching Political Party to Democrat", 
        "userID": "EAG154"
    }, 
    {
        "content": "\"http://www.cnn.com/POLITICS/\" \"http://news.yahoo.com/s/ap/20090428/ap_on_go_co/us_specter_switch_1\" Smart man! Yessssssss!!!!! This message has been edited. Last edited by: jack_flats, Tue 28 April 2009 09:48 AM \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090428, 
        "postID": 41, 
        "quote": "", 
        "reply": "\"http://www.cnn.com/POLITICS/\" \"http://news.yahoo.com/s/ap/20090428/ap_on_go_co/us_specter_switch_1\" Smart man! Yessssssss!!!!! This message has been edited. Last edited by: jack_flats, Tue 28 April 2009 09:48 AM \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_1980069122001", 
        "time": "2009-04-28 09:09:00", 
        "title": "Sen. Arlen Specter (PA) Switching Political Party to Democrat", 
        "userID": "jack_flats"
    }, 
    {
        "content": "Got to be an interesting story about this.", 
        "intTime": 20090428, 
        "postID": 42, 
        "quote": "", 
        "reply": "Got to be an interesting story about this.", 
        "threadID": "672198221_1980069122001", 
        "time": "2009-04-28 09:11:00", 
        "title": "Sen. Arlen Specter (PA) Switching Political Party to Democrat", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "Well, when the face of the Republican party happens to be Rush Limbaugh things like this were inevitable. Its hard to be a Republican now a days, and its virtually impossible to be one AND hispanic like me... We'll turn it around, the old guard is going to have step aside...All minorities do not like big guvmint, and the liberal views of democrats(gay marriage, abortion in trimester...etc)", 
        "intTime": 20090428, 
        "postID": 43, 
        "quote": "", 
        "reply": "Well, when the face of the Republican party happens to be Rush Limbaugh things like this were inevitable. Its hard to be a Republican now a days, and its virtually impossible to be one AND hispanic like me... We'll turn it around, the old guard is going to have step aside...All minorities do not like big guvmint, and the liberal views of democrats(gay marriage, abortion in trimester...etc)", 
        "threadID": "672198221_1980069122001", 
        "time": "2009-04-28 09:14:00", 
        "title": "Sen. Arlen Specter (PA) Switching Political Party to Democrat", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "Here's the story. I’ve just confirmed with a spokeman for Governor Ed Rendell that he will do everything he can to help the Democratic candidate defeat Specter if the latter remains a Republican or if he pulls a Joe Lieberman from the right, switching to Independent while promising to caucus with Republicans. That’s key, for two reasons. First, because Rendell is a longtime close friend of Specter, and many thought he tacitly aided Specter in 2004. And second, because it ups the pressure on Specter to switch to the Dems. Here’s why: If Specter fears losing a Republican primary — as many expect him to do — and pulls out to run as an Indy in a general election, his chances of holding his seat are slim indeed. He’d be squeezed between his GOP challenger and a Democratic challenger who has full backing from Rendell. In other words, Rendell’s vow of opposition means his only hope of survival may be switching to the Dems. Rendell spokesperson Chuck Ardo tells me that Rendell will throw his full weight behind the Democrat if Specter stays Republican or becomes a GOP-caucusing Indy. “He will do everything he can to support the Democratic candidate,” Ardo says, “no matter what the circumstances.” What’s more, Rendell has to make good on this vow because with Senate Dems approaching 60, the stakes are excruciatingly high. Asked if Specter would have Rendell’s backing if he became a Dem, Ardo said: “If he became the Democratic candidate he would have the governor’s support.” \"http://theplumline.whorunsgov.com/employee-free-choice-act/rendell-will-throw-his-full-weight-behind-democrat-against-specter/\" Just a greedy politician. I say feck him and good-bye. Don't need that trash around. and if he stays a Repub he should lose. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090428, 
        "postID": 44, 
        "quote": "", 
        "reply": "Here's the story. I’ve just confirmed with a spokeman for Governor Ed Rendell that he will do everything he can to help the Democratic candidate defeat Specter if the latter remains a Republican or if he pulls a Joe Lieberman from the right, switching to Independent while promising to caucus with Republicans. That’s key, for two reasons. First, because Rendell is a longtime close friend of Specter, and many thought he tacitly aided Specter in 2004. And second, because it ups the pressure on Specter to switch to the Dems. Here’s why: If Specter fears losing a Republican primary — as many expect him to do — and pulls out to run as an Indy in a general election, his chances of holding his seat are slim indeed. He’d be squeezed between his GOP challenger and a Democratic challenger who has full backing from Rendell. In other words, Rendell’s vow of opposition means his only hope of survival may be switching to the Dems. Rendell spokesperson Chuck Ardo tells me that Rendell will throw his full weight behind the Democrat if Specter stays Republican or becomes a GOP-caucusing Indy. “He will do everything he can to support the Democratic candidate,” Ardo says, “no matter what the circumstances.” What’s more, Rendell has to make good on this vow because with Senate Dems approaching 60, the stakes are excruciatingly high. Asked if Specter would have Rendell’s backing if he became a Dem, Ardo said: “If he became the Democratic candidate he would have the governor’s support.” \"http://theplumline.whorunsgov.com/employee-free-choice-act/rendell-will-throw-his-full-weight-behind-democrat-against-specter/\" Just a greedy politician. I say feck him and good-bye. Don't need that trash around. and if he stays a Repub he should lose. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_1980069122001", 
        "time": "2009-04-28 09:17:00", 
        "title": "Sen. Arlen Specter (PA) Switching Political Party to Democrat", 
        "userID": "Anbar7"
    }, 
    {
        "content": "The Party of \"NO\" is getting to be the Party of \"NO-GO.\" Old-Line Republican's are going to have to start seriously listening to the Meghan McCain's, and drop the old divisive rhetoric that is gaining them nothing. Can Sen. Olympia Snow (ME) be next? Let's hope so. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090428, 
        "postID": 45, 
        "quote": "", 
        "reply": "The Party of \"NO\" is getting to be the Party of \"NO-GO.\" Old-Line Republican's are going to have to start seriously listening to the Meghan McCain's, and drop the old divisive rhetoric that is gaining them nothing. Can Sen. Olympia Snow (ME) be next? Let's hope so. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_1980069122001", 
        "time": "2009-04-28 09:23:00", 
        "title": "Sen. Arlen Specter (PA) Switching Political Party to Democrat", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: The Party of \"NO\" is getting to be the Party of \"NO-GO.\" Old-Line Republican's are going to have to start seriously listening to the Meghan McCain's, and drop the old divisive rhetoric that is gaining them nothing. Can Sen. Olympia Snow (ME) be next? Let's hope so. Maybe Rush will finally cross over too. Then you can't use him everytime you speak. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090428, 
        "postID": 46, 
        "quote": "Originally posted by jack_flats: The Party of \"NO\" is getting to be the Party of \"NO-GO.\" Old-Line Republican's are going to have to start seriously listening to the Meghan McCain's, and drop the old divisive rhetoric that is gaining them nothing. Can Sen. Olympia Snow (ME) be next? Let's hope so.", 
        "reply": " Maybe Rush will finally cross over too. Then you can't use him everytime you speak. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_1980069122001", 
        "time": "2009-04-28 09:28:00", 
        "title": "Sen. Arlen Specter (PA) Switching Political Party to Democrat", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by jack_flats: The Party of \"NO\" is getting to be the Party of \"NO-GO.\" Old-Line Republican's are going to have to start seriously listening to the Meghan McCain's, and drop the old divisive rhetoric that is gaining them nothing. Can Sen. Olympia Snow (ME) be next? Let's hope so. Maybe Rush will finally cross over too. Then you can't use him everytime you speak. Why aren't there any Democrat's looking to switch? \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090428, 
        "postID": 47, 
        "quote": "Originally posted by Anbar7: quote: Originally posted by jack_flats: The Party of \"NO\" is getting to be the Party of \"NO-GO.\" Old-Line Republican's are going to have to start seriously listening to the Meghan McCain's, and drop the old divisive rhetoric that is gaining them nothing. Can Sen. Olympia Snow (ME) be next? Let's hope so. Maybe Rush will finally cross over too. Then you can't use him everytime you speak.", 
        "reply": " Why aren't there any Democrat's looking to switch? \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_1980069122001", 
        "time": "2009-04-28 09:32:00", 
        "title": "Sen. Arlen Specter (PA) Switching Political Party to Democrat", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: quote: Originally posted by Anbar7: quote: Originally posted by jack_flats: The Party of \"NO\" is getting to be the Party of \"NO-GO.\" Old-Line Republican's are going to have to start seriously listening to the Meghan McCain's, and drop the old divisive rhetoric that is gaining them nothing. Can Sen. Olympia Snow (ME) be next? Let's hope so. Maybe Rush will finally cross over too. Then you can't use him everytime you speak. Why aren't there any Democrat's looking to switch? Because their Gay and they want abortions \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090428, 
        "postID": 48, 
        "quote": "Originally posted by jack_flats: quote: Originally posted by Anbar7: quote: Originally posted by jack_flats: The Party of \"NO\" is getting to be the Party of \"NO-GO.\" Old-Line Republican's are going to have to start seriously listening to the Meghan McCain's, and drop the old divisive rhetoric that is gaining them nothing. Can Sen. Olympia Snow (ME) be next? Let's hope so. Maybe Rush will finally cross over too. Then you can't use him everytime you speak. Why aren't there any Democrat's looking to switch?", 
        "reply": " Because their Gay and they want abortions \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_1980069122001", 
        "time": "2009-04-28 09:33:00", 
        "title": "Sen. Arlen Specter (PA) Switching Political Party to Democrat", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: quote: Originally posted by Anbar7: quote: Originally posted by jack_flats: The Party of \"NO\" is getting to be the Party of \"NO-GO.\" Old-Line Republican's are going to have to start seriously listening to the Meghan McCain's, and drop the old divisive rhetoric that is gaining them nothing. Can Sen. Olympia Snow (ME) be next? Let's hope so. Maybe Rush will finally cross over too. Then you can't use him everytime you speak. Why aren't there any Democrat's looking to switch? Probably because they aren't in any danger of losing office and don't need to. You take this one Repub who is worried he is going to lose his seat and he is changing for that reason then good i'm glad he wants to change. Yet if he still has his Repub beliefs then he is a conservative dem \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090428, 
        "postID": 49, 
        "quote": "Originally posted by jack_flats: quote: Originally posted by Anbar7: quote: Originally posted by jack_flats: The Party of \"NO\" is getting to be the Party of \"NO-GO.\" Old-Line Republican's are going to have to start seriously listening to the Meghan McCain's, and drop the old divisive rhetoric that is gaining them nothing. Can Sen. Olympia Snow (ME) be next? Let's hope so. Maybe Rush will finally cross over too. Then you can't use him everytime you speak. Why aren't there any Democrat's looking to switch?", 
        "reply": " Probably because they aren't in any danger of losing office and don't need to. You take this one Repub who is worried he is going to lose his seat and he is changing for that reason then good i'm glad he wants to change. Yet if he still has his Repub beliefs then he is a conservative dem \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_1980069122001", 
        "time": "2009-04-28 09:35:00", 
        "title": "Sen. Arlen Specter (PA) Switching Political Party to Democrat", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by jack_flats: The Party of \"NO\" is getting to be the Party of \"NO-GO.\" Old-Line Republican's are going to have to start seriously listening to the Meghan McCain's, and drop the old divisive rhetoric that is gaining them nothing. Can Sen. Olympia Snow (ME) be next? Let's hope so. Maybe Rush will finally cross over too. Then you can't use him everytime you speak. You may be on to something. If you can get Rush Limbaugh to switch parties, it’s pretty much a guarantee that all democrats will switch parties to republican. This could be the republican's big chance to win the next election. Who says republicans have no new ideas?", 
        "intTime": 20090428, 
        "postID": 50, 
        "quote": "Originally posted by Anbar7: quote: Originally posted by jack_flats: The Party of \"NO\" is getting to be the Party of \"NO-GO.\" Old-Line Republican's are going to have to start seriously listening to the Meghan McCain's, and drop the old divisive rhetoric that is gaining them nothing. Can Sen. Olympia Snow (ME) be next? Let's hope so. Maybe Rush will finally cross over too. Then you can't use him everytime you speak.", 
        "reply": " You may be on to something. If you can get Rush Limbaugh to switch parties, it’s pretty much a guarantee that all democrats will switch parties to republican. This could be the republican's big chance to win the next election. Who says republicans have no new ideas?", 
        "threadID": "672198221_1980069122001", 
        "time": "2009-04-28 09:41:00", 
        "title": "Sen. Arlen Specter (PA) Switching Political Party to Democrat", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "Good riddance. He is a liberal anyway and should be right at home in the democratic party. Meanwhile, the republican party will continue to clean house... \"The World's Finest\"", 
        "intTime": 20090428, 
        "postID": 51, 
        "quote": "", 
        "reply": "Good riddance. He is a liberal anyway and should be right at home in the democratic party. Meanwhile, the republican party will continue to clean house... \"The World's Finest\"", 
        "threadID": "672198221_1980069122001", 
        "time": "2009-04-28 09:46:00", 
        "title": "Sen. Arlen Specter (PA) Switching Political Party to Democrat", 
        "userID": "Kegler300"
    }, 
    {
        "content": "So essentially he is changing to stay in the good graces of the govenor and to try and extend his stay in Congress. It seems to me he has been ridiculed by those on these boards on the left. Now he is Ok since he is switching?", 
        "intTime": 20090428, 
        "postID": 52, 
        "quote": "", 
        "reply": "So essentially he is changing to stay in the good graces of the govenor and to try and extend his stay in Congress. It seems to me he has been ridiculed by those on these boards on the left. Now he is Ok since he is switching?", 
        "threadID": "672198221_1980069122001", 
        "time": "2009-04-28 09:53:00", 
        "title": "Sen. Arlen Specter (PA) Switching Political Party to Democrat", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by jack_flats: The Party of \"NO\" is getting to be the Party of \"NO-GO.\" Old-Line Republican's are going to have to start seriously listening to the Meghan McCain's, and drop the old divisive rhetoric that is gaining them nothing. Can Sen. Olympia Snow (ME) be next? Let's hope so. Maybe Rush will finally cross over too. Then you can't use him everytime you speak. Thirty years ago Spectre would have been regarded as a right wing Republican. It's been a slow change, and the far right extremists have gotten what they prayed for. They will soon have a pristine pure Party of the Far Right. Naturally, they're going to win every election now that their message is pristine pure... While I don't expect Gingrich to jump parties, he will soon be referred to as a \"Rino.,\" almost a \"Socialist.\" Dave", 
        "intTime": 20090428, 
        "postID": 53, 
        "quote": "Originally posted by Anbar7: quote: Originally posted by jack_flats: The Party of \"NO\" is getting to be the Party of \"NO-GO.\" Old-Line Republican's are going to have to start seriously listening to the Meghan McCain's, and drop the old divisive rhetoric that is gaining them nothing. Can Sen. Olympia Snow (ME) be next? Let's hope so. Maybe Rush will finally cross over too. Then you can't use him everytime you speak.", 
        "reply": " Thirty years ago Spectre would have been regarded as a right wing Republican. It's been a slow change, and the far right extremists have gotten what they prayed for. They will soon have a pristine pure Party of the Far Right. Naturally, they're going to win every election now that their message is pristine pure... While I don't expect Gingrich to jump parties, he will soon be referred to as a \"Rino.,\" almost a \"Socialist.\" Dave", 
        "threadID": "672198221_1980069122001", 
        "time": "2009-04-28 10:06:00", 
        "title": "Sen. Arlen Specter (PA) Switching Political Party to Democrat", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: and its virtually impossible to be one AND hispanic like me... Other than the God thing, I really don't know why Hispanics support the Republican party. The good news is it looks like they woke up a little in 2008.", 
        "intTime": 20090428, 
        "postID": 54, 
        "quote": "Originally posted by Irwin_R_Schyster: and its virtually impossible to be one AND hispanic like me...", 
        "reply": " Other than the God thing, I really don't know why Hispanics support the Republican party. The good news is it looks like they woke up a little in 2008.", 
        "threadID": "672198221_1980069122001", 
        "time": "2009-04-28 10:07:00", 
        "title": "Sen. Arlen Specter (PA) Switching Political Party to Democrat", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: Good riddance. He is a liberal anyway and should be right at home in the democratic party. Meanwhile, the republican party will continue to clean house... If by cleaning house you mean losing support and votes, then yes, they are certainly doing that.", 
        "intTime": 20090428, 
        "postID": 55, 
        "quote": "Originally posted by Kegler300: Good riddance. He is a liberal anyway and should be right at home in the democratic party. Meanwhile, the republican party will continue to clean house...", 
        "reply": " If by cleaning house you mean losing support and votes, then yes, they are certainly doing that.", 
        "threadID": "672198221_1980069122001", 
        "time": "2009-04-28 10:08:00", 
        "title": "Sen. Arlen Specter (PA) Switching Political Party to Democrat", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by Irwin_R_Schyster: and its virtually impossible to be one AND hispanic like me... Other than the God thing, I really don't know why Hispanics support the Republican party. The good news is it looks like they woke up a little in 2008. that is mainly it. Religion, abortion, and other things with that. I don't know why they would go Dem, except to free load off Americans. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090428, 
        "postID": 56, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by Irwin_R_Schyster: and its virtually impossible to be one AND hispanic like me... Other than the God thing, I really don't know why Hispanics support the Republican party. The good news is it looks like they woke up a little in 2008.", 
        "reply": " that is mainly it. Religion, abortion, and other things with that. I don't know why they would go Dem, except to free load off Americans. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_1980069122001", 
        "time": "2009-04-28 10:10:00", 
        "title": "Sen. Arlen Specter (PA) Switching Political Party to Democrat", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: \"http://www.cnn.com/POLITICS/\" \"http://news.yahoo.com/s/ap/20090428/ap_on_go_co/us_specter_switch_1\" Smart man! Yessssssss!!!!! Welcome to the party Senator Specter, glad to have you on board. My way of looking at this, just a job preservation move. However, I for one hope that the progressive wing of the Pennsylvania party put up someone as well. It will keep him (Specter) honest. He is my Senator and I'm drafting a long congratulatory e-mail to him now.", 
        "intTime": 20090428, 
        "postID": 57, 
        "quote": "Originally posted by jack_flats: \"http://www.cnn.com/POLITICS/\" \"http://news.yahoo.com/s/ap/20090428/ap_on_go_co/us_specter_switch_1\" Smart man! Yessssssss!!!!!", 
        "reply": " Welcome to the party Senator Specter, glad to have you on board. My way of looking at this, just a job preservation move. However, I for one hope that the progressive wing of the Pennsylvania party put up someone as well. It will keep him (Specter) honest. He is my Senator and I'm drafting a long congratulatory e-mail to him now.", 
        "threadID": "672198221_1980069122001", 
        "time": "2009-04-28 11:09:00", 
        "title": "Sen. Arlen Specter (PA) Switching Political Party to Democrat", 
        "userID": "jdksfcret"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: \"http://www.cnn.com/POLITICS/\" \"http://news.yahoo.com/s/ap/20090428/ap_on_go_co/us_specter_switch_1\" Smart man! Yessssssss!!!!! The fine people of Pennsylvania will wake up soon and realize that Spector was phoney anyway. They are getting fed up with murtha too and both will loose.", 
        "intTime": 20090428, 
        "postID": 58, 
        "quote": "Originally posted by jack_flats: \"http://www.cnn.com/POLITICS/\" \"http://news.yahoo.com/s/ap/20090428/ap_on_go_co/us_specter_switch_1\" Smart man! Yessssssss!!!!!", 
        "reply": " The fine people of Pennsylvania will wake up soon and realize that Spector was phoney anyway. They are getting fed up with murtha too and both will loose.", 
        "threadID": "672198221_1980069122001", 
        "time": "2009-04-28 14:19:00", 
        "title": "Sen. Arlen Specter (PA) Switching Political Party to Democrat", 
        "userID": "busnrete8"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: \"http://www.cnn.com/POLITICS/\" \"http://news.yahoo.com/s/ap/20090428/ap_on_go_co/us_specter_switch_1\" Smart man! Yessssssss!!!!! but Jack what if this happened, In theory what if Spector changed his mind and wanted to stay and for some reason became the fore-runner for the GOP, would would happen? would each and everyone of the GOPers here flip flop back with him faster than lighting? Wait that has already been proven...John McCain!", 
        "intTime": 20090428, 
        "postID": 59, 
        "quote": "Originally posted by jack_flats: \"http://www.cnn.com/POLITICS/\" \"http://news.yahoo.com/s/ap/20090428/ap_on_go_co/us_specter_switch_1\" Smart man! Yessssssss!!!!!", 
        "reply": " but Jack what if this happened, In theory what if Spector changed his mind and wanted to stay and for some reason became the fore-runner for the GOP, would would happen? would each and everyone of the GOPers here flip flop back with him faster than lighting? Wait that has already been proven...John McCain!", 
        "threadID": "672198221_1980069122001", 
        "time": "2009-04-28 16:31:00", 
        "title": "Sen. Arlen Specter (PA) Switching Political Party to Democrat", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: quote: Originally posted by jack_flats: \"http://www.cnn.com/POLITICS/\" \"http://news.yahoo.com/s/ap/20090428/ap_on_go_co/us_specter_switch_1\" Smart man! Yessssssss!!!!! but Jack what if this happened, In theory what if Spector changed his mind and wanted to stay and for some reason became the fore-runner for the GOP, would would happen? would each and everyone of the GOPers here flip flop back with him faster than lighting? Wait that has already been proven...John McCain! McCain ia a 25 year congressman and war hero! Spector is a turn coat turkey", 
        "intTime": 20090428, 
        "postID": 60, 
        "quote": "Originally posted by crackerjacks61: quote: Originally posted by jack_flats: \"http://www.cnn.com/POLITICS/\" \"http://news.yahoo.com/s/ap/20090428/ap_on_go_co/us_specter_switch_1\" Smart man! Yessssssss!!!!! but Jack what if this happened, In theory what if Spector changed his mind and wanted to stay and for some reason became the fore-runner for the GOP, would would happen? would each and everyone of the GOPers here flip flop back with him faster than lighting? Wait that has already been proven...John McCain!", 
        "reply": " McCain ia a 25 year congressman and war hero! Spector is a turn coat turkey", 
        "threadID": "672198221_1980069122001", 
        "time": "2009-04-28 16:52:00", 
        "title": "Sen. Arlen Specter (PA) Switching Political Party to Democrat", 
        "userID": "EAG154"
    }
]