[
    {
        "content": "Reuters, 12 Mar 09 (http moneynews.newsmax.com/streettalk/obama_geithner_low_grades/2009/03/12/191096.html): \"President Barack Obama and Treasury Secretary Timothy Geithner received failing grades for their efforts to revive the world's largest economy, according to participants in the latest Wall Street Journal forecasting survey. \"A majority of the 49 economists polled said they were dissatisfied with the administration's economic policies, according to the paper, a stark contrast to Obama's popularity ratings with the general public. \"On average, the economists gave the president a grade of 59 out of 100, and although there was a broad range of marks, 42 percent of respondents rated Obama below 60, the paper said. \"Geithner received an average grade of 51, while Federal Reserve Chairman Ben Bernanke scored better, with an average 71, the paper said. \"On average, the economists now expect the economic downturn to end in October, according to the paper. In the previous survey, they had expected the bottom would arrive in August. \"The economists' main criticism of the Obama team centered on delays in enacting key parts of plans to rescue banks, the paper said. \"The economists' negative ratings mark a turnaround in opinion, the paper said. In December, before Obama took office, three-quarters of respondents said the incoming administration's economic team was better than the departing team under former President George W. Bush.\" - - - - - - - - - - - - - - Hey, no matter the truth, the real causes and effects, we know the score with regard to the jackass media mavens, who will try to ignore the above: if anything good happens about the economy--no matter the absurd or astounding the waste of resources to bring about small changes (we can believe in?)--they will bow to the brilliance of The One; if anything bad happens, it is Bush's fault (ala Bush Derangement Syndrome).", 
        "intTime": 20090312, 
        "postID": 1, 
        "quote": "", 
        "reply": "Reuters, 12 Mar 09 (http moneynews.newsmax.com/streettalk/obama_geithner_low_grades/2009/03/12/191096.html): \"President Barack Obama and Treasury Secretary Timothy Geithner received failing grades for their efforts to revive the world's largest economy, according to participants in the latest Wall Street Journal forecasting survey. \"A majority of the 49 economists polled said they were dissatisfied with the administration's economic policies, according to the paper, a stark contrast to Obama's popularity ratings with the general public. \"On average, the economists gave the president a grade of 59 out of 100, and although there was a broad range of marks, 42 percent of respondents rated Obama below 60, the paper said. \"Geithner received an average grade of 51, while Federal Reserve Chairman Ben Bernanke scored better, with an average 71, the paper said. \"On average, the economists now expect the economic downturn to end in October, according to the paper. In the previous survey, they had expected the bottom would arrive in August. \"The economists' main criticism of the Obama team centered on delays in enacting key parts of plans to rescue banks, the paper said. \"The economists' negative ratings mark a turnaround in opinion, the paper said. In December, before Obama took office, three-quarters of respondents said the incoming administration's economic team was better than the departing team under former President George W. Bush.\" - - - - - - - - - - - - - - Hey, no matter the truth, the real causes and effects, we know the score with regard to the jackass media mavens, who will try to ignore the above: if anything good happens about the economy--no matter the absurd or astounding the waste of resources to bring about small changes (we can believe in?)--they will bow to the brilliance of The One; if anything bad happens, it is Bush's fault (ala Bush Derangement Syndrome).", 
        "threadID": "672198221_2370036712001", 
        "time": "2009-03-12 07:46:00", 
        "title": "Economists Getting Smart about the Obamanation", 
        "userID": "RRR52"
    }, 
    {
        "content": "I disagree with your comment. It is the case now, but if the economy continues to decline, all of the charisma in the world won't help President Obama. Americans are fair-weather friends, and are quick to get angry. The same thing happened to President Bush, and the same thing can happen to President Obama. Now, if things do get better, Obama will receive credit for it, even if it wasn't due to his efforts.", 
        "intTime": 20090312, 
        "postID": 2, 
        "quote": "", 
        "reply": "I disagree with your comment. It is the case now, but if the economy continues to decline, all of the charisma in the world won't help President Obama. Americans are fair-weather friends, and are quick to get angry. The same thing happened to President Bush, and the same thing can happen to President Obama. Now, if things do get better, Obama will receive credit for it, even if it wasn't due to his efforts.", 
        "threadID": "672198221_2370036712001", 
        "time": "2009-03-12 08:02:00", 
        "title": "Economists Getting Smart about the Obamanation", 
        "userID": "Philhelm"
    }, 
    {
        "content": "quote: Originally posted by Philhelm: I disagree with your comment. It is the case now, but if the economy continues to decline, all of the charisma in the world won't help President Obama. Americans are fair-weather friends, and are quick to get angry. The same thing happened to President Bush, and the same thing can happen to President Obama. Now, if things do get better, Obama will receive credit for it, even if it wasn't due to his efforts. OK far as you go. But the typical ACORNite, Obama voter is not as well educated as many and will remain more adamently jackass, no matter what, since their sit-on-your-arse-in-the-Promised-Land \"livelihoods\" depend on handouts from guvmint. They have sold out to the obamanation. Bush never sought such degradation of American voters. Thus, the obamanite types will tend to be more unwilling to change their minds. This message has been edited. Last edited by: OldArmyLove, Fri 20 March 2009 07:34 PM", 
        "intTime": 20090320, 
        "postID": 3, 
        "quote": "Originally posted by Philhelm: I disagree with your comment. It is the case now, but if the economy continues to decline, all of the charisma in the world won't help President Obama. Americans are fair-weather friends, and are quick to get angry. The same thing happened to President Bush, and the same thing can happen to President Obama. Now, if things do get better, Obama will receive credit for it, even if it wasn't due to his efforts.", 
        "reply": " OK far as you go. But the typical ACORNite, Obama voter is not as well educated as many and will remain more adamently jackass, no matter what, since their sit-on-your-arse-in-the-Promised-Land \"livelihoods\" depend on handouts from guvmint. They have sold out to the obamanation. Bush never sought such degradation of American voters. Thus, the obamanite types will tend to be more unwilling to change their minds. This message has been edited. Last edited by: OldArmyLove, Fri 20 March 2009 07:34 PM", 
        "threadID": "672198221_2370036712001", 
        "time": "2009-03-20 18:44:00", 
        "title": "Economists Getting Smart about the Obamanation", 
        "userID": "RRR52"
    }, 
    {
        "content": "Well, Obama certainly got a lot of support from people who don't really understand what is going on in the world at all. I can respect someone who disagrees, but it angers me when people have a conviction which far exceeds their knowledge. With all of the \"stupid conservative\" rhetoric I have heard, I have come across oceans of stupid Obama supporters. All too often, when I have asked people why they had voted for Obama, they could not give *any* specific reasons. It's very clear that the anti-Bush/anti-Republican rhetoric has done its job admirably. Despite this, I believe that many of these know-nothings will have a change of tune if things get worse.", 
        "intTime": 20090320, 
        "postID": 4, 
        "quote": "", 
        "reply": "Well, Obama certainly got a lot of support from people who don't really understand what is going on in the world at all. I can respect someone who disagrees, but it angers me when people have a conviction which far exceeds their knowledge. With all of the \"stupid conservative\" rhetoric I have heard, I have come across oceans of stupid Obama supporters. All too often, when I have asked people why they had voted for Obama, they could not give *any* specific reasons. It's very clear that the anti-Bush/anti-Republican rhetoric has done its job admirably. Despite this, I believe that many of these know-nothings will have a change of tune if things get worse.", 
        "threadID": "672198221_2370036712001", 
        "time": "2009-03-20 19:05:00", 
        "title": "Economists Getting Smart about the Obamanation", 
        "userID": "Philhelm"
    }
]