[
    {
        "content": "I supported President Obama because he seemed to be very smart, and he claimed to dedicated to the Rule of Law. He is not. \"Back in February, the Obama administration shocked many civil libertarians by filing a brief in federal court that, in two sentences, declared that it embraced the most extremist Bush theory on this issue -- the Obama DOJ argued, as The New York Times's Charlie Savage put it, \"that military detainees in Afghanistan have no legal right to challenge their imprisonment there, embracing a key argument of former President Bush’s legal team.\" Remember: these are not prisoners captured in Afghanistan on a battlefield. Many of them have nothing to do with Afghanistan and were captured far, far away from that country -- abducted from their homes and workplaces -- and then flown to Bagram to be imprisoned. Indeed, the Bagram detainees in the particular case in which the Obama DOJ filed its brief were Yemenis and Tunisians captured outside of Afghanistan (in Thailand or the UAE, for instance) and then flown to Bagram and locked away there as much as six years without any charges. That is what the Obama DOJ defended, and they argued that those individuals can be imprisoned indefinitely with no rights of any kind -- as long as they are kept in Bagram rather than Guantanamo. Last month, a federal judge emphatically rejected the Bush/Obama position and held that the rationale of Boudemiene applies every bit as much to Bagram as it does to Guantanamo. Notably, the district judge who so ruled -- John Bates -- is an appointee of George W. Bush, a former Whitewater prosecutor, and a very pro-executive-power judge. In his decision (.pdf), Judge Bates made clear how identical are the constitutional rights of detainees flown to Guantanamo and Bagram and underscored how dangerous is the Bush/Obama claim that the President has the right to abduct people from around the world and imprison them at Bagram with no due process of any kind.\" This is very bad. Remember that the Constitution had to be sent back for a 'do-over' to add the Bill of Rights back in 1787. This included the right to Habeas Corpus review. Obama's DOJ, like Bush's DOJ is just tossing the pillars upon which the country is built -- what makes the United States a special place. This is what Senator Obama said in September 2006 on the floor of the Senate: The bottom line is this: Current procedures under the CSRT are such that a perfectly innocent individual could be held and could not rebut the Government's case and has no way of proving his innocence. I would like somebody in this Chamber, somebody in this Government, to tell me why this is necessary. I do not want to hear that this is a new world and we face a new kind of enemy. I know that. . . . But as a parent, I can also imagine the terror I would feel if one of my family members were rounded up in the middle of the night and sent to Guantanamo without even getting one chance to ask why they were being held and being able to prove their innocence.\" I know you are not supposed to live links so go to salon.com and click on Glen Greenwald's link for a lot more information and links to these court cases where the Obama DOJ makes a mockery of everything we stand for. Walt", 
        "intTime": 20090411, 
        "postID": 1, 
        "quote": "", 
        "reply": "I supported President Obama because he seemed to be very smart, and he claimed to dedicated to the Rule of Law. He is not. \"Back in February, the Obama administration shocked many civil libertarians by filing a brief in federal court that, in two sentences, declared that it embraced the most extremist Bush theory on this issue -- the Obama DOJ argued, as The New York Times's Charlie Savage put it, \"that military detainees in Afghanistan have no legal right to challenge their imprisonment there, embracing a key argument of former President Bush’s legal team.\" Remember: these are not prisoners captured in Afghanistan on a battlefield. Many of them have nothing to do with Afghanistan and were captured far, far away from that country -- abducted from their homes and workplaces -- and then flown to Bagram to be imprisoned. Indeed, the Bagram detainees in the particular case in which the Obama DOJ filed its brief were Yemenis and Tunisians captured outside of Afghanistan (in Thailand or the UAE, for instance) and then flown to Bagram and locked away there as much as six years without any charges. That is what the Obama DOJ defended, and they argued that those individuals can be imprisoned indefinitely with no rights of any kind -- as long as they are kept in Bagram rather than Guantanamo. Last month, a federal judge emphatically rejected the Bush/Obama position and held that the rationale of Boudemiene applies every bit as much to Bagram as it does to Guantanamo. Notably, the district judge who so ruled -- John Bates -- is an appointee of George W. Bush, a former Whitewater prosecutor, and a very pro-executive-power judge. In his decision (.pdf), Judge Bates made clear how identical are the constitutional rights of detainees flown to Guantanamo and Bagram and underscored how dangerous is the Bush/Obama claim that the President has the right to abduct people from around the world and imprison them at Bagram with no due process of any kind.\" This is very bad. Remember that the Constitution had to be sent back for a 'do-over' to add the Bill of Rights back in 1787. This included the right to Habeas Corpus review. Obama's DOJ, like Bush's DOJ is just tossing the pillars upon which the country is built -- what makes the United States a special place. This is what Senator Obama said in September 2006 on the floor of the Senate: The bottom line is this: Current procedures under the CSRT are such that a perfectly innocent individual could be held and could not rebut the Government's case and has no way of proving his innocence. I would like somebody in this Chamber, somebody in this Government, to tell me why this is necessary. I do not want to hear that this is a new world and we face a new kind of enemy. I know that. . . . But as a parent, I can also imagine the terror I would feel if one of my family members were rounded up in the middle of the night and sent to Guantanamo without even getting one chance to ask why they were being held and being able to prove their innocence.\" I know you are not supposed to live links so go to salon.com and click on Glen Greenwald's link for a lot more information and links to these court cases where the Obama DOJ makes a mockery of everything we stand for. Walt", 
        "threadID": "672198221_6620084022001", 
        "time": "2009-04-11 19:44:00", 
        "title": "Obama DOJ Mimics Bush DOJ in Ignoring the Rule of Law", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "\"Meet the new Boss, same as the old Boss.\" I think that pretty well covers it. Frisco", 
        "intTime": 20090411, 
        "postID": 2, 
        "quote": "", 
        "reply": "\"Meet the new Boss, same as the old Boss.\" I think that pretty well covers it. Frisco", 
        "threadID": "672198221_6620084022001", 
        "time": "2009-04-11 22:13:00", 
        "title": "Obama DOJ Mimics Bush DOJ in Ignoring the Rule of Law", 
        "userID": "FriscoLady01"
    }, 
    {
        "content": "I predict much anger over this from the same people who supported it a year ago.", 
        "intTime": 20090411, 
        "postID": 3, 
        "quote": "", 
        "reply": "I predict much anger over this from the same people who supported it a year ago.", 
        "threadID": "672198221_6620084022001", 
        "time": "2009-04-11 22:21:00", 
        "title": "Obama DOJ Mimics Bush DOJ in Ignoring the Rule of Law", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "What is this? Like the 100th time they have tried to deny habaeus corpus to detainees? And like the 100th time in a row they've lost? APPRENTLY YOU PEOPLE DON'T GET IT: YOU ARE NOT GOING TO GET A JUDGE TO SUSPEND HABAEUS CORPUS!!! STOP TRYING!! DIDN'T YOUR LOSS AT THE SUPREME COURT TEACH YOU ANYTHING? No judge is going to be the one to suspend a law that's been in effect since Roman times!!", 
        "intTime": 20090412, 
        "postID": 4, 
        "quote": "", 
        "reply": "What is this? Like the 100th time they have tried to deny habaeus corpus to detainees? And like the 100th time in a row they've lost? APPRENTLY YOU PEOPLE DON'T GET IT: YOU ARE NOT GOING TO GET A JUDGE TO SUSPEND HABAEUS CORPUS!!! STOP TRYING!! DIDN'T YOUR LOSS AT THE SUPREME COURT TEACH YOU ANYTHING? No judge is going to be the one to suspend a law that's been in effect since Roman times!!", 
        "threadID": "672198221_6620084022001", 
        "time": "2009-04-12 02:59:00", 
        "title": "Obama DOJ Mimics Bush DOJ in Ignoring the Rule of Law", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: What is this? Like the 100th time they have tried to deny habaeus corpus to detainees? And like the 100th time in a row they've lost? APPRENTLY YOU PEOPLE DON'T GET IT: YOU ARE NOT GOING TO GET A JUDGE TO SUSPEND HABAEUS CORPUS!!! STOP TRYING!! DIDN'T YOUR LOSS AT THE SUPREME COURT TEACH YOU ANYTHING? No judge is going to be the one to suspend a law that's been in effect since Roman times!! One thing that seems to apply here is that the Supreme Court (or a lower court) can say \"A\" and the Administration can file a motion or whatever and that makes it drag on foe 1-2 more years. The Bush Administration held an American citizen for 3.5 years with no charges and no trial. They did it by stringing out in the courts by denying a what is clearly required in the Bill of Rights -- a speedy and public trial. This really does apply: \"In Germany, they came first for the Communists, And I didn’t speak up because I wasn’t a Communist; And then they came for the trade unionists, And I didn’t speak up because I wasn’t a trade unionist; And then they came for the Jews, And I didn’t speak up because I wasn’t a Jew; And then . . . they came for me . . . And by that time there was no one left to speak up.\" --Martin Niemoller Walt", 
        "intTime": 20090412, 
        "postID": 5, 
        "quote": "Originally posted by mrmixitup: What is this? Like the 100th time they have tried to deny habaeus corpus to detainees? And like the 100th time in a row they've lost? APPRENTLY YOU PEOPLE DON'T GET IT: YOU ARE NOT GOING TO GET A JUDGE TO SUSPEND HABAEUS CORPUS!!! STOP TRYING!! DIDN'T YOUR LOSS AT THE SUPREME COURT TEACH YOU ANYTHING? No judge is going to be the one to suspend a law that's been in effect since Roman times!!", 
        "reply": " One thing that seems to apply here is that the Supreme Court (or a lower court) can say \"A\" and the Administration can file a motion or whatever and that makes it drag on foe 1-2 more years. The Bush Administration held an American citizen for 3.5 years with no charges and no trial. They did it by stringing out in the courts by denying a what is clearly required in the Bill of Rights -- a speedy and public trial. This really does apply: \"In Germany, they came first for the Communists, And I didn’t speak up because I wasn’t a Communist; And then they came for the trade unionists, And I didn’t speak up because I wasn’t a trade unionist; And then they came for the Jews, And I didn’t speak up because I wasn’t a Jew; And then . . . they came for me . . . And by that time there was no one left to speak up.\" --Martin Niemoller Walt", 
        "threadID": "672198221_6620084022001", 
        "time": "2009-04-12 03:07:00", 
        "title": "Obama DOJ Mimics Bush DOJ in Ignoring the Rule of Law", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "quote: Originally posted by WhiskeyPapa: I supported President Obama because he seemed to be very smart, and he claimed to dedicated to the Rule of Law. He is not.... This is what Senator Obama said in September 2006 on the floor of the Senate: The bottom line is this: Current procedures under the CSRT are such that a perfectly innocent individual could be held and could not rebut the Government's case and has no way of proving his innocence. I would like somebody in this Chamber, somebody in this Government, to tell me why this is necessary. I do not want to hear that this is a new world and we face a new kind of enemy. I know that. . . . But as a parent, I can also imagine the terror I would feel if one of my family members were rounded up in the middle of the night and sent to Guantanamo without even getting one chance to ask why they were being held and being able to prove their innocence.\" It would appear that the President has set aside emotion and opted for reason when establishing US policy.", 
        "intTime": 20090412, 
        "postID": 6, 
        "quote": "Originally posted by WhiskeyPapa: I supported President Obama because he seemed to be very smart, and he claimed to dedicated to the Rule of Law. He is not.... This is what Senator Obama said in September 2006 on the floor of the Senate: The bottom line is this: Current procedures under the CSRT are such that a perfectly innocent individual could be held and could not rebut the Government's case and has no way of proving his innocence. I would like somebody in this Chamber, somebody in this Government, to tell me why this is necessary. I do not want to hear that this is a new world and we face a new kind of enemy. I know that. . . . But as a parent, I can also imagine the terror I would feel if one of my family members were rounded up in the middle of the night and sent to Guantanamo without even getting one chance to ask why they were being held and being able to prove their innocence.\"", 
        "reply": " It would appear that the President has set aside emotion and opted for reason when establishing US policy.", 
        "threadID": "672198221_6620084022001", 
        "time": "2009-04-12 03:52:00", 
        "title": "Obama DOJ Mimics Bush DOJ in Ignoring the Rule of Law", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: This really does apply: \"In Germany, they came first for the Communists, And I didn’t speak up because I wasn’t a Communist; And then they came for the trade unionists, And I didn’t speak up because I wasn’t a trade unionist; And then they came for the Jews, And I didn’t speak up because I wasn’t a Jew; And then . . . they came for me . . . And by that time there was no one left to speak up.\" --Martin Niemoller Indeed it does and what many people that read these forums do not understand is that this has been repeated over and over in history. They thought they be The Righteous and Only Just to find out They were now the Victims of that same Self-Righteous, twisted concept. The Witch Hunters will continue though until they either a) discover they were wrong all along or b) get hunted down, convicted with little to no justice and then with a dumb look on their faces, wonder why? As for Obama, The courts rule allot on this stuff now that W opened room for the civil authorities to get involved. Had W set up a legal system utilizing the military ranks that was fair and just to handle whoever was taken into custody, all of this could have been avoided. How dumb of these so called \"college educated buffoons\".", 
        "intTime": 20090412, 
        "postID": 7, 
        "quote": "This really does apply: \"In Germany, they came first for the Communists, And I didn’t speak up because I wasn’t a Communist; And then they came for the trade unionists, And I didn’t speak up because I wasn’t a trade unionist; And then they came for the Jews, And I didn’t speak up because I wasn’t a Jew; And then . . . they came for me . . . And by that time there was no one left to speak up.\" --Martin Niemoller", 
        "reply": " Indeed it does and what many people that read these forums do not understand is that this has been repeated over and over in history. They thought they be The Righteous and Only Just to find out They were now the Victims of that same Self-Righteous, twisted concept. The Witch Hunters will continue though until they either a) discover they were wrong all along or b) get hunted down, convicted with little to no justice and then with a dumb look on their faces, wonder why? As for Obama, The courts rule allot on this stuff now that W opened room for the civil authorities to get involved. Had W set up a legal system utilizing the military ranks that was fair and just to handle whoever was taken into custody, all of this could have been avoided. How dumb of these so called \"college educated buffoons\".", 
        "threadID": "672198221_6620084022001", 
        "time": "2009-04-12 04:01:00", 
        "title": "Obama DOJ Mimics Bush DOJ in Ignoring the Rule of Law", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by FriscoLady01: \"Meet the new Boss, same as the old Boss.\" I think that pretty well covers it. Frisco ewww not quite, but keep trying...", 
        "intTime": 20090412, 
        "postID": 8, 
        "quote": "Originally posted by FriscoLady01: \"Meet the new Boss, same as the old Boss.\" I think that pretty well covers it. Frisco", 
        "reply": " ewww not quite, but keep trying...", 
        "threadID": "672198221_6620084022001", 
        "time": "2009-04-12 04:04:00", 
        "title": "Obama DOJ Mimics Bush DOJ in Ignoring the Rule of Law", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: quote: This really does apply: \"In Germany, they came first for the Communists, And I didn’t speak up because I wasn’t a Communist; And then they came for the trade unionists, And I didn’t speak up because I wasn’t a trade unionist; And then they came for the Jews, And I didn’t speak up because I wasn’t a Jew; And then . . . they came for me . . . And by that time there was no one left to speak up.\" --Martin Niemoller Indeed it does and what many people that read these forums do not understand is that this has been repeated over and over in history. They thought they be The Righteous and Only Just to find out They were now the Victims of that same Self-Righteous, twisted concept. The Witch Hunters will continue though until they either a) discover they were wrong all along or b) get hunted down, convicted with little to no justice and then with a dumb look on their faces, wonder why? As for Obama, The courts rule allot on this stuff now that W opened room for the civil authorities to get involved. Had W set up a legal system utilizing the military ranks that was fair and just to handle whoever was taken into custody, all of this could have been avoided. How dumb of these so called \"college educated buffoons\". If nothing else at least you have the chance to whine about W a little bit more", 
        "intTime": 20090412, 
        "postID": 9, 
        "quote": "Originally posted by crackerjacks61: quote: This really does apply: \"In Germany, they came first for the Communists, And I didn’t speak up because I wasn’t a Communist; And then they came for the trade unionists, And I didn’t speak up because I wasn’t a trade unionist; And then they came for the Jews, And I didn’t speak up because I wasn’t a Jew; And then . . . they came for me . . . And by that time there was no one left to speak up.\" --Martin Niemoller Indeed it does and what many people that read these forums do not understand is that this has been repeated over and over in history. They thought they be The Righteous and Only Just to find out They were now the Victims of that same Self-Righteous, twisted concept. The Witch Hunters will continue though until they either a) discover they were wrong all along or b) get hunted down, convicted with little to no justice and then with a dumb look on their faces, wonder why? As for Obama, The courts rule allot on this stuff now that W opened room for the civil authorities to get involved. Had W set up a legal system utilizing the military ranks that was fair and just to handle whoever was taken into custody, all of this could have been avoided. How dumb of these so called \"college educated buffoons\".", 
        "reply": " If nothing else at least you have the chance to whine about W a little bit more", 
        "threadID": "672198221_6620084022001", 
        "time": "2009-04-12 04:08:00", 
        "title": "Obama DOJ Mimics Bush DOJ in Ignoring the Rule of Law", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by crackerjacks61: quote: This really does apply: \"In Germany, they came first for the Communists, And I didn’t speak up because I wasn’t a Communist; And then they came for the trade unionists, And I didn’t speak up because I wasn’t a trade unionist; And then they came for the Jews, And I didn’t speak up because I wasn’t a Jew; And then . . . they came for me . . . And by that time there was no one left to speak up.\" --Martin Niemoller Indeed it does and what many people that read these forums do not understand is that this has been repeated over and over in history. They thought they be The Righteous and Only Just to find out They were now the Victims of that same Self-Righteous, twisted concept. The Witch Hunters will continue though until they either a) discover they were wrong all along or b) get hunted down, convicted with little to no justice and then with a dumb look on their faces, wonder why? As for Obama, The courts rule allot on this stuff now that W opened room for the civil authorities to get involved. Had W set up a legal system utilizing the military ranks that was fair and just to handle whoever was taken into custody, all of this could have been avoided. How dumb of these so called \"college educated buffoons\". If nothing else at least you have the chance to whine about W a little bit more Like we don't read whining about how it's Obama's fault everyday. Paint the whole picture, not just your partisan propaganda.", 
        "intTime": 20090412, 
        "postID": 10, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by crackerjacks61: quote: This really does apply: \"In Germany, they came first for the Communists, And I didn’t speak up because I wasn’t a Communist; And then they came for the trade unionists, And I didn’t speak up because I wasn’t a trade unionist; And then they came for the Jews, And I didn’t speak up because I wasn’t a Jew; And then . . . they came for me . . . And by that time there was no one left to speak up.\" --Martin Niemoller Indeed it does and what many people that read these forums do not understand is that this has been repeated over and over in history. They thought they be The Righteous and Only Just to find out They were now the Victims of that same Self-Righteous, twisted concept. The Witch Hunters will continue though until they either a) discover they were wrong all along or b) get hunted down, convicted with little to no justice and then with a dumb look on their faces, wonder why? As for Obama, The courts rule allot on this stuff now that W opened room for the civil authorities to get involved. Had W set up a legal system utilizing the military ranks that was fair and just to handle whoever was taken into custody, all of this could have been avoided. How dumb of these so called \"college educated buffoons\". If nothing else at least you have the chance to whine about W a little bit more", 
        "reply": " Like we don't read whining about how it's Obama's fault everyday. Paint the whole picture, not just your partisan propaganda.", 
        "threadID": "672198221_6620084022001", 
        "time": "2009-04-12 04:46:00", 
        "title": "Obama DOJ Mimics Bush DOJ in Ignoring the Rule of Law", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by crackerjacks61: quote: This really does apply: \"In Germany, they came first for the Communists, And I didn’t speak up because I wasn’t a Communist; And then they came for the trade unionists, And I didn’t speak up because I wasn’t a trade unionist; And then they came for the Jews, And I didn’t speak up because I wasn’t a Jew; And then . . . they came for me . . . And by that time there was no one left to speak up.\" --Martin Niemoller Indeed it does and what many people that read these forums do not understand is that this has been repeated over and over in history. They thought they be The Righteous and Only Just to find out They were now the Victims of that same Self-Righteous, twisted concept. The Witch Hunters will continue though until they either a) discover they were wrong all along or b) get hunted down, convicted with little to no justice and then with a dumb look on their faces, wonder why? As for Obama, The courts rule allot on this stuff now that W opened room for the civil authorities to get involved. Had W set up a legal system utilizing the military ranks that was fair and just to handle whoever was taken into custody, all of this could have been avoided. How dumb of these so called \"college educated buffoons\". If nothing else at least you have the chance to whine about W a little bit more For my part I am whining about Obama acting just like Bush. Walt", 
        "intTime": 20090412, 
        "postID": 11, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by crackerjacks61: quote: This really does apply: \"In Germany, they came first for the Communists, And I didn’t speak up because I wasn’t a Communist; And then they came for the trade unionists, And I didn’t speak up because I wasn’t a trade unionist; And then they came for the Jews, And I didn’t speak up because I wasn’t a Jew; And then . . . they came for me . . . And by that time there was no one left to speak up.\" --Martin Niemoller Indeed it does and what many people that read these forums do not understand is that this has been repeated over and over in history. They thought they be The Righteous and Only Just to find out They were now the Victims of that same Self-Righteous, twisted concept. The Witch Hunters will continue though until they either a) discover they were wrong all along or b) get hunted down, convicted with little to no justice and then with a dumb look on their faces, wonder why? As for Obama, The courts rule allot on this stuff now that W opened room for the civil authorities to get involved. Had W set up a legal system utilizing the military ranks that was fair and just to handle whoever was taken into custody, all of this could have been avoided. How dumb of these so called \"college educated buffoons\". If nothing else at least you have the chance to whine about W a little bit more", 
        "reply": " For my part I am whining about Obama acting just like Bush. Walt", 
        "threadID": "672198221_6620084022001", 
        "time": "2009-04-12 05:02:00", 
        "title": "Obama DOJ Mimics Bush DOJ in Ignoring the Rule of Law", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: quote: Originally posted by adminnco1: quote: Originally posted by crackerjacks61: quote: This really does apply: \"In Germany, they came first for the Communists, And I didn’t speak up because I wasn’t a Communist; And then they came for the trade unionists, And I didn’t speak up because I wasn’t a trade unionist; And then they came for the Jews, And I didn’t speak up because I wasn’t a Jew; And then . . . they came for me . . . And by that time there was no one left to speak up.\" --Martin Niemoller Indeed it does and what many people that read these forums do not understand is that this has been repeated over and over in history. They thought they be The Righteous and Only Just to find out They were now the Victims of that same Self-Righteous, twisted concept. The Witch Hunters will continue though until they either a) discover they were wrong all along or b) get hunted down, convicted with little to no justice and then with a dumb look on their faces, wonder why? As for Obama, The courts rule allot on this stuff now that W opened room for the civil authorities to get involved. Had W set up a legal system utilizing the military ranks that was fair and just to handle whoever was taken into custody, all of this could have been avoided. How dumb of these so called \"college educated buffoons\". If nothing else at least you have the chance to whine about W a little bit more Like we don't read whining about how it's Obama's fault everyday. Paint the whole picture, not just your partisan propaganda. Who is \"we\"? All I have observed is obfuscation and denial of responsibility except, of course, in the case of the VP who apparently has the magical power to rewrite past events to serve his current agenda.", 
        "intTime": 20090412, 
        "postID": 12, 
        "quote": "Originally posted by crackerjacks61: quote: Originally posted by adminnco1: quote: Originally posted by crackerjacks61: quote: This really does apply: \"In Germany, they came first for the Communists, And I didn’t speak up because I wasn’t a Communist; And then they came for the trade unionists, And I didn’t speak up because I wasn’t a trade unionist; And then they came for the Jews, And I didn’t speak up because I wasn’t a Jew; And then . . . they came for me . . . And by that time there was no one left to speak up.\" --Martin Niemoller Indeed it does and what many people that read these forums do not understand is that this has been repeated over and over in history. They thought they be The Righteous and Only Just to find out They were now the Victims of that same Self-Righteous, twisted concept. The Witch Hunters will continue though until they either a) discover they were wrong all along or b) get hunted down, convicted with little to no justice and then with a dumb look on their faces, wonder why? As for Obama, The courts rule allot on this stuff now that W opened room for the civil authorities to get involved. Had W set up a legal system utilizing the military ranks that was fair and just to handle whoever was taken into custody, all of this could have been avoided. How dumb of these so called \"college educated buffoons\". If nothing else at least you have the chance to whine about W a little bit more Like we don't read whining about how it's Obama's fault everyday. Paint the whole picture, not just your partisan propaganda.", 
        "reply": " Who is \"we\"? All I have observed is obfuscation and denial of responsibility except, of course, in the case of the VP who apparently has the magical power to rewrite past events to serve his current agenda.", 
        "threadID": "672198221_6620084022001", 
        "time": "2009-04-12 06:07:00", 
        "title": "Obama DOJ Mimics Bush DOJ in Ignoring the Rule of Law", 
        "userID": "adminnco1"
    }, 
    {
        "content": "1. Habeas Corpus is not granted in the U.S. Constitution, it is recognized by the Constitution as long standing law agreed to by all civilized nations that safeguards a person’s freedom against arbitrary state action. So granting Habeas Corpus to anyone who is not a U.S. citizen is not granting them Constitutional rights, it is recognizing that “We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness.” 2. The Obama Administration filed a motion to be able to hold enemies in Afghanistan as prisoners of war. That motion has been denied, now the Justice Department is considering appealing that decision. No rule of law has been broken, as the thread suggests. Breaking the law is when the Bush Administation held a U.S. citizen in jail without trial, or held prisoners in secret prisons, or wire tapped American citizens without a warrant. Just getting the facts straight.", 
        "intTime": 20090412, 
        "postID": 13, 
        "quote": "", 
        "reply": "1. Habeas Corpus is not granted in the U.S. Constitution, it is recognized by the Constitution as long standing law agreed to by all civilized nations that safeguards a person’s freedom against arbitrary state action. So granting Habeas Corpus to anyone who is not a U.S. citizen is not granting them Constitutional rights, it is recognizing that “We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness.” 2. The Obama Administration filed a motion to be able to hold enemies in Afghanistan as prisoners of war. That motion has been denied, now the Justice Department is considering appealing that decision. No rule of law has been broken, as the thread suggests. Breaking the law is when the Bush Administation held a U.S. citizen in jail without trial, or held prisoners in secret prisons, or wire tapped American citizens without a warrant. Just getting the facts straight.", 
        "threadID": "672198221_6620084022001", 
        "time": "2009-04-12 06:39:00", 
        "title": "Obama DOJ Mimics Bush DOJ in Ignoring the Rule of Law", 
        "userID": "xerello"
    }, 
    {
        "content": "quote: Originally posted by xerello: 1. Habeas Corpus is not granted in the U.S. Constitution, it is recognized by the Constitution as long standing law agreed to by all civilized nations that safeguards a person’s freedom against arbitrary state action. So granting Habeas Corpus to anyone who is not a U.S. citizen is not granting them Constitutional rights, it is recognizing that “We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness.” 2. The Obama Administration filed a motion to be able to hold enemies in Afghanistan as prisoners of war. That motion has been denied, now the Justice Department is considering appealing that decision. No rule of law has been broken, as the thread suggests. Breaking the law is when the Bush Administation held a U.S. citizen in jail without trial, or held prisoners in secret prisons, or wire tapped American citizens without a warrant. Just getting the facts straight. Standard liberal bilge: \"Breaking the law is when the Bush Administration ____________ \". Just fill in the blank with your rant(s) of choice.", 
        "intTime": 20090412, 
        "postID": 14, 
        "quote": "Originally posted by xerello: 1. Habeas Corpus is not granted in the U.S. Constitution, it is recognized by the Constitution as long standing law agreed to by all civilized nations that safeguards a person’s freedom against arbitrary state action. So granting Habeas Corpus to anyone who is not a U.S. citizen is not granting them Constitutional rights, it is recognizing that “We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness.” 2. The Obama Administration filed a motion to be able to hold enemies in Afghanistan as prisoners of war. That motion has been denied, now the Justice Department is considering appealing that decision. No rule of law has been broken, as the thread suggests. Breaking the law is when the Bush Administation held a U.S. citizen in jail without trial, or held prisoners in secret prisons, or wire tapped American citizens without a warrant. Just getting the facts straight.", 
        "reply": " Standard liberal bilge: \"Breaking the law is when the Bush Administration ____________ \". Just fill in the blank with your rant(s) of choice.", 
        "threadID": "672198221_6620084022001", 
        "time": "2009-04-12 06:51:00", 
        "title": "Obama DOJ Mimics Bush DOJ in Ignoring the Rule of Law", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by WhiskeyPapa: This is very bad. Remember that the Constitution had to be sent back for a 'do-over' to add the Bill of Rights back in 1787. This included the right to Habeas Corpus review. Walt A small BUT relevant correction. The Founders embedded Habeaus in the orginal text. In the Federalist Papers, they argue that without this right, no other right is safe. They in fact argued that we don't need a Bill of Rights as long as we have Habeaus. The redo to add a Bill of Rights was only added because otherwise the Constitution would not have been ratified without promising to add them. I believe the authors were wrong - Nevertheless their point about Habeaus is valid. You cannot exercise any of your other rights, if you don't have this most basic of rights. Habeaus is the first guarranttee against a Police State. Dave", 
        "intTime": 20090412, 
        "postID": 15, 
        "quote": "Originally posted by WhiskeyPapa: This is very bad. Remember that the Constitution had to be sent back for a 'do-over' to add the Bill of Rights back in 1787. This included the right to Habeas Corpus review. Walt", 
        "reply": " A small BUT relevant correction. The Founders embedded Habeaus in the orginal text. In the Federalist Papers, they argue that without this right, no other right is safe. They in fact argued that we don't need a Bill of Rights as long as we have Habeaus. The redo to add a Bill of Rights was only added because otherwise the Constitution would not have been ratified without promising to add them. I believe the authors were wrong - Nevertheless their point about Habeaus is valid. You cannot exercise any of your other rights, if you don't have this most basic of rights. Habeaus is the first guarranttee against a Police State. Dave", 
        "threadID": "672198221_6620084022001", 
        "time": "2009-04-12 08:02:00", 
        "title": "Obama DOJ Mimics Bush DOJ in Ignoring the Rule of Law", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by xerello: 1. Habeas Corpus is not granted in the U.S. Constitution, it is recognized by the Constitution as long standing law agreed to by all civilized nations that safeguards a person’s freedom against arbitrary state action. So granting Habeas Corpus to anyone who is not a U.S. citizen is not granting them Constitutional rights, it is recognizing that “We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness.” 2. The Obama Administration filed a motion to be able to hold enemies in Afghanistan as prisoners of war. That motion has been denied, now the Justice Department is considering appealing that decision. No rule of law has been broken, as the thread suggests. Breaking the law is when the Bush Administation held a U.S. citizen in jail without trial, or held prisoners in secret prisons, or wire tapped American citizens without a warrant. Just getting the facts straight. Standard liberal bilge: \"Breaking the law is when the Bush Administration ____________ \". Just fill in the blank with your rant(s) of choice. News flash! This thread is about OBAMA violating the Constitution. The fact that Bush did it too is utterly irrelevant.", 
        "intTime": 20090412, 
        "postID": 16, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by xerello: 1. Habeas Corpus is not granted in the U.S. Constitution, it is recognized by the Constitution as long standing law agreed to by all civilized nations that safeguards a person’s freedom against arbitrary state action. So granting Habeas Corpus to anyone who is not a U.S. citizen is not granting them Constitutional rights, it is recognizing that “We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness.” 2. The Obama Administration filed a motion to be able to hold enemies in Afghanistan as prisoners of war. That motion has been denied, now the Justice Department is considering appealing that decision. No rule of law has been broken, as the thread suggests. Breaking the law is when the Bush Administation held a U.S. citizen in jail without trial, or held prisoners in secret prisons, or wire tapped American citizens without a warrant. Just getting the facts straight. Standard liberal bilge: \"Breaking the law is when the Bush Administration ____________ \". Just fill in the blank with your rant(s) of choice.", 
        "reply": " News flash! This thread is about OBAMA violating the Constitution. The fact that Bush did it too is utterly irrelevant.", 
        "threadID": "672198221_6620084022001", 
        "time": "2009-04-12 08:34:00", 
        "title": "Obama DOJ Mimics Bush DOJ in Ignoring the Rule of Law", 
        "userID": "thorin001"
    }, 
    {
        "content": "It is wrong no matter which administration is doing it. Violations of the Constitution do not change depending on who is the President. Wrong is wrong and holding people without charging them with a crime is WRONG (so is torture and the Obama admin HAS addressed that)", 
        "intTime": 20090412, 
        "postID": 17, 
        "quote": "", 
        "reply": "It is wrong no matter which administration is doing it. Violations of the Constitution do not change depending on who is the President. Wrong is wrong and holding people without charging them with a crime is WRONG (so is torture and the Obama admin HAS addressed that)", 
        "threadID": "672198221_6620084022001", 
        "time": "2009-04-12 09:02:00", 
        "title": "Obama DOJ Mimics Bush DOJ in Ignoring the Rule of Law", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by xerello: 1. Habeas Corpus is not granted in the U.S. Constitution, it is recognized by the Constitution as long standing law agreed to by all civilized nations that safeguards a person’s freedom against arbitrary state action. So granting Habeas Corpus to anyone who is not a U.S. citizen is not granting them Constitutional rights, it is recognizing that “We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness.” 2. The Obama Administration filed a motion to be able to hold enemies in Afghanistan as prisoners of war. That motion has been denied, now the Justice Department is considering appealing that decision. No rule of law has been broken, as the thread suggests. Breaking the law is when the Bush Administation held a U.S. citizen in jail without trial, or held prisoners in secret prisons, or wire tapped American citizens without a warrant. Just getting the facts straight. How odd of you to try and slip this in. Habaeus Corpus is absolutely granted in the Constitution. The United States Constitution specifically included the English common law procedure in Article One, Section 9 which states: “The privilege of the writ of habeas corpus shall not be suspended, unless when in cases of rebellion or invasion the public safety may require it.\" So it is not specifically in the Bill of Rights, but it IS part of our common law heritage that both the Bush and Obama Administrations are tossing at our common peril. I did misspeak in suggesting that the ratfication 'do-over' included HC. BUT it did definitely include the right to a speedy and public trial. Walt Walt", 
        "intTime": 20090412, 
        "postID": 18, 
        "quote": "Originally posted by xerello: 1. Habeas Corpus is not granted in the U.S. Constitution, it is recognized by the Constitution as long standing law agreed to by all civilized nations that safeguards a person’s freedom against arbitrary state action. So granting Habeas Corpus to anyone who is not a U.S. citizen is not granting them Constitutional rights, it is recognizing that “We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness.” 2. The Obama Administration filed a motion to be able to hold enemies in Afghanistan as prisoners of war. That motion has been denied, now the Justice Department is considering appealing that decision. No rule of law has been broken, as the thread suggests. Breaking the law is when the Bush Administation held a U.S. citizen in jail without trial, or held prisoners in secret prisons, or wire tapped American citizens without a warrant. Just getting the facts straight.", 
        "reply": " How odd of you to try and slip this in. Habaeus Corpus is absolutely granted in the Constitution. The United States Constitution specifically included the English common law procedure in Article One, Section 9 which states: “The privilege of the writ of habeas corpus shall not be suspended, unless when in cases of rebellion or invasion the public safety may require it.\" So it is not specifically in the Bill of Rights, but it IS part of our common law heritage that both the Bush and Obama Administrations are tossing at our common peril. I did misspeak in suggesting that the ratfication 'do-over' included HC. BUT it did definitely include the right to a speedy and public trial. Walt Walt", 
        "threadID": "672198221_6620084022001", 
        "time": "2009-04-12 09:29:00", 
        "title": "Obama DOJ Mimics Bush DOJ in Ignoring the Rule of Law", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by xerello: 1. Habeas Corpus is not granted in the U.S. Constitution, it is recognized by the Constitution as long standing law agreed to by all civilized nations that safeguards a person’s freedom against arbitrary state action. So granting Habeas Corpus to anyone who is not a U.S. citizen is not granting them Constitutional rights, it is recognizing that “We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness.” 2. The Obama Administration filed a motion to be able to hold enemies in Afghanistan as prisoners of war. That motion has been denied, now the Justice Department is considering appealing that decision. No rule of law has been broken, as the thread suggests. Breaking the law is when the Bush Administation held a U.S. citizen in jail without trial, or held prisoners in secret prisons, or wire tapped American citizens without a warrant. Just getting the facts straight. Standard liberal bilge: \"Breaking the law is when the Bush Administration ____________ \". Just fill in the blank with your rant(s) of choice. The original article is comparing the actions of the Obama administration to the actions of the Bush administration as violating the constitution. He is pointing out that it's not the same thing. You go from thread to thread pointing out any mention of Bush, while disregarding the point of the entire post. Was Bush your cousin or something?", 
        "intTime": 20090412, 
        "postID": 19, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by xerello: 1. Habeas Corpus is not granted in the U.S. Constitution, it is recognized by the Constitution as long standing law agreed to by all civilized nations that safeguards a person’s freedom against arbitrary state action. So granting Habeas Corpus to anyone who is not a U.S. citizen is not granting them Constitutional rights, it is recognizing that “We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness.” 2. The Obama Administration filed a motion to be able to hold enemies in Afghanistan as prisoners of war. That motion has been denied, now the Justice Department is considering appealing that decision. No rule of law has been broken, as the thread suggests. Breaking the law is when the Bush Administation held a U.S. citizen in jail without trial, or held prisoners in secret prisons, or wire tapped American citizens without a warrant. Just getting the facts straight. Standard liberal bilge: \"Breaking the law is when the Bush Administration ____________ \". Just fill in the blank with your rant(s) of choice.", 
        "reply": " The original article is comparing the actions of the Obama administration to the actions of the Bush administration as violating the constitution. He is pointing out that it's not the same thing. You go from thread to thread pointing out any mention of Bush, while disregarding the point of the entire post. Was Bush your cousin or something?", 
        "threadID": "672198221_6620084022001", 
        "time": "2009-04-12 09:35:00", 
        "title": "Obama DOJ Mimics Bush DOJ in Ignoring the Rule of Law", 
        "userID": "Esample1"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by WhiskeyPapa: This is very bad. Remember that the Constitution had to be sent back for a 'do-over' to add the Bill of Rights back in 1787. This included the right to Habeas Corpus review. Walt A small BUT relevant correction. The Founders embedded Habeaus in the orginal text. In the Federalist Papers, they argue that without this right, no other right is safe. They in fact argued that we don't need a Bill of Rights as long as we have Habeaus. The redo to add a Bill of Rights was only added because otherwise the Constitution would not have been ratified without promising to add them. I believe the authors were wrong - Nevertheless their point about Habeaus is valid. You cannot exercise any of your other rights, if you don't have this most basic of rights. Habeaus is the first guarranttee against a Police State. Dave That is exactly right. And what is happening now is that the Obama Administration is going to be an accessory --is already an accessory -- to the crimes committed by the Bush Administration. Really, if we face the truth - we already live in a police state when the executive has the uncontested power to detain anyone they want outside the rule of law. Walt", 
        "intTime": 20090412, 
        "postID": 20, 
        "quote": "Originally posted by Grachus: quote: Originally posted by WhiskeyPapa: This is very bad. Remember that the Constitution had to be sent back for a 'do-over' to add the Bill of Rights back in 1787. This included the right to Habeas Corpus review. Walt A small BUT relevant correction. The Founders embedded Habeaus in the orginal text. In the Federalist Papers, they argue that without this right, no other right is safe. They in fact argued that we don't need a Bill of Rights as long as we have Habeaus. The redo to add a Bill of Rights was only added because otherwise the Constitution would not have been ratified without promising to add them. I believe the authors were wrong - Nevertheless their point about Habeaus is valid. You cannot exercise any of your other rights, if you don't have this most basic of rights. Habeaus is the first guarranttee against a Police State. Dave", 
        "reply": " That is exactly right. And what is happening now is that the Obama Administration is going to be an accessory --is already an accessory -- to the crimes committed by the Bush Administration. Really, if we face the truth - we already live in a police state when the executive has the uncontested power to detain anyone they want outside the rule of law. Walt", 
        "threadID": "672198221_6620084022001", 
        "time": "2009-04-12 09:41:00", 
        "title": "Obama DOJ Mimics Bush DOJ in Ignoring the Rule of Law", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "I supported President Obama because he seemed to be very smart, and he claimed to dedicated to the Rule of Law. He is not. \"Back in February, the Obama administration shocked many civil libertarians by filing a brief in federal court that, in two sentences, declared that it embraced the most extremist Bush theory on this issue -- the Obama DOJ argued, as The New York Times's Charlie Savage put it, \"that military detainees in Afghanistan have no legal right to challenge their imprisonment there, embracing a key argument of former President Bush’s legal team.\" Remember: these are not prisoners captured in Afghanistan on a battlefield. Many of them have nothing to do with Afghanistan and were captured far, far away from that country -- abducted from their homes and workplaces -- and then flown to Bagram to be imprisoned. Indeed, the Bagram detainees in the particular case in which the Obama DOJ filed its brief were Yemenis and Tunisians captured outside of Afghanistan (in Thailand or the UAE, for instance) and then flown to Bagram and locked away there as much as six years without any charges. That is what the Obama DOJ defended, and they argued that those individuals can be imprisoned indefinitely with no rights of any kind -- as long as they are kept in Bagram rather than Guantanamo. Last month, a federal judge emphatically rejected the Bush/Obama position and held that the rationale of Boudemiene applies every bit as much to Bagram as it does to Guantanamo. Notably, the district judge who so ruled -- John Bates -- is an appointee of George W. Bush, a former Whitewater prosecutor, and a very pro-executive-power judge. In his decision (.pdf), Judge Bates made clear how identical are the constitutional rights of detainees flown to Guantanamo and Bagram and underscored how dangerous is the Bush/Obama claim that the President has the right to abduct people from around the world and imprison them at Bagram with no due process of any kind.\" This is very bad. Remember that the Constitution had to be sent back for a 'do-over' to add the Bill of Rights back in 1787. This included the right to Habeas Corpus review. Obama's DOJ, like Bush's DOJ is just tossing the pillars upon which the country is built -- what makes the United States a special place. This is what Senator Obama said in September 2006 on the floor of the Senate: The bottom line is this: Current procedures under the CSRT are such that a perfectly innocent individual could be held and could not rebut the Government's case and has no way of proving his innocence. I would like somebody in this Chamber, somebody in this Government, to tell me why this is necessary. I do not want to hear that this is a new world and we face a new kind of enemy. I know that. . . . But as a parent, I can also imagine the terror I would feel if one of my family members were rounded up in the middle of the night and sent to Guantanamo without even getting one chance to ask why they were being held and being able to prove their innocence.\" I know you are not supposed to live links so go to salon.com and click on Glen Greenwald's link for a lot more information and links to these court cases where the Obama DOJ makes a mockery of everything we stand for. Walt", 
        "intTime": 20090411, 
        "postID": 21, 
        "quote": "", 
        "reply": "I supported President Obama because he seemed to be very smart, and he claimed to dedicated to the Rule of Law. He is not. \"Back in February, the Obama administration shocked many civil libertarians by filing a brief in federal court that, in two sentences, declared that it embraced the most extremist Bush theory on this issue -- the Obama DOJ argued, as The New York Times's Charlie Savage put it, \"that military detainees in Afghanistan have no legal right to challenge their imprisonment there, embracing a key argument of former President Bush’s legal team.\" Remember: these are not prisoners captured in Afghanistan on a battlefield. Many of them have nothing to do with Afghanistan and were captured far, far away from that country -- abducted from their homes and workplaces -- and then flown to Bagram to be imprisoned. Indeed, the Bagram detainees in the particular case in which the Obama DOJ filed its brief were Yemenis and Tunisians captured outside of Afghanistan (in Thailand or the UAE, for instance) and then flown to Bagram and locked away there as much as six years without any charges. That is what the Obama DOJ defended, and they argued that those individuals can be imprisoned indefinitely with no rights of any kind -- as long as they are kept in Bagram rather than Guantanamo. Last month, a federal judge emphatically rejected the Bush/Obama position and held that the rationale of Boudemiene applies every bit as much to Bagram as it does to Guantanamo. Notably, the district judge who so ruled -- John Bates -- is an appointee of George W. Bush, a former Whitewater prosecutor, and a very pro-executive-power judge. In his decision (.pdf), Judge Bates made clear how identical are the constitutional rights of detainees flown to Guantanamo and Bagram and underscored how dangerous is the Bush/Obama claim that the President has the right to abduct people from around the world and imprison them at Bagram with no due process of any kind.\" This is very bad. Remember that the Constitution had to be sent back for a 'do-over' to add the Bill of Rights back in 1787. This included the right to Habeas Corpus review. Obama's DOJ, like Bush's DOJ is just tossing the pillars upon which the country is built -- what makes the United States a special place. This is what Senator Obama said in September 2006 on the floor of the Senate: The bottom line is this: Current procedures under the CSRT are such that a perfectly innocent individual could be held and could not rebut the Government's case and has no way of proving his innocence. I would like somebody in this Chamber, somebody in this Government, to tell me why this is necessary. I do not want to hear that this is a new world and we face a new kind of enemy. I know that. . . . But as a parent, I can also imagine the terror I would feel if one of my family members were rounded up in the middle of the night and sent to Guantanamo without even getting one chance to ask why they were being held and being able to prove their innocence.\" I know you are not supposed to live links so go to salon.com and click on Glen Greenwald's link for a lot more information and links to these court cases where the Obama DOJ makes a mockery of everything we stand for. Walt", 
        "threadID": "672198221_6620084022001", 
        "time": "2009-04-11 19:44:00", 
        "title": "Obama DOJ Mimics Bush DOJ in Ignoring the Rule of Law", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "\"Meet the new Boss, same as the old Boss.\" I think that pretty well covers it. Frisco", 
        "intTime": 20090411, 
        "postID": 22, 
        "quote": "", 
        "reply": "\"Meet the new Boss, same as the old Boss.\" I think that pretty well covers it. Frisco", 
        "threadID": "672198221_6620084022001", 
        "time": "2009-04-11 22:13:00", 
        "title": "Obama DOJ Mimics Bush DOJ in Ignoring the Rule of Law", 
        "userID": "FriscoLady01"
    }, 
    {
        "content": "I predict much anger over this from the same people who supported it a year ago.", 
        "intTime": 20090411, 
        "postID": 23, 
        "quote": "", 
        "reply": "I predict much anger over this from the same people who supported it a year ago.", 
        "threadID": "672198221_6620084022001", 
        "time": "2009-04-11 22:21:00", 
        "title": "Obama DOJ Mimics Bush DOJ in Ignoring the Rule of Law", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "What is this? Like the 100th time they have tried to deny habaeus corpus to detainees? And like the 100th time in a row they've lost? APPRENTLY YOU PEOPLE DON'T GET IT: YOU ARE NOT GOING TO GET A JUDGE TO SUSPEND HABAEUS CORPUS!!! STOP TRYING!! DIDN'T YOUR LOSS AT THE SUPREME COURT TEACH YOU ANYTHING? No judge is going to be the one to suspend a law that's been in effect since Roman times!!", 
        "intTime": 20090412, 
        "postID": 24, 
        "quote": "", 
        "reply": "What is this? Like the 100th time they have tried to deny habaeus corpus to detainees? And like the 100th time in a row they've lost? APPRENTLY YOU PEOPLE DON'T GET IT: YOU ARE NOT GOING TO GET A JUDGE TO SUSPEND HABAEUS CORPUS!!! STOP TRYING!! DIDN'T YOUR LOSS AT THE SUPREME COURT TEACH YOU ANYTHING? No judge is going to be the one to suspend a law that's been in effect since Roman times!!", 
        "threadID": "672198221_6620084022001", 
        "time": "2009-04-12 02:59:00", 
        "title": "Obama DOJ Mimics Bush DOJ in Ignoring the Rule of Law", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: What is this? Like the 100th time they have tried to deny habaeus corpus to detainees? And like the 100th time in a row they've lost? APPRENTLY YOU PEOPLE DON'T GET IT: YOU ARE NOT GOING TO GET A JUDGE TO SUSPEND HABAEUS CORPUS!!! STOP TRYING!! DIDN'T YOUR LOSS AT THE SUPREME COURT TEACH YOU ANYTHING? No judge is going to be the one to suspend a law that's been in effect since Roman times!! One thing that seems to apply here is that the Supreme Court (or a lower court) can say \"A\" and the Administration can file a motion or whatever and that makes it drag on foe 1-2 more years. The Bush Administration held an American citizen for 3.5 years with no charges and no trial. They did it by stringing out in the courts by denying a what is clearly required in the Bill of Rights -- a speedy and public trial. This really does apply: \"In Germany, they came first for the Communists, And I didn’t speak up because I wasn’t a Communist; And then they came for the trade unionists, And I didn’t speak up because I wasn’t a trade unionist; And then they came for the Jews, And I didn’t speak up because I wasn’t a Jew; And then . . . they came for me . . . And by that time there was no one left to speak up.\" --Martin Niemoller Walt", 
        "intTime": 20090412, 
        "postID": 25, 
        "quote": "Originally posted by mrmixitup: What is this? Like the 100th time they have tried to deny habaeus corpus to detainees? And like the 100th time in a row they've lost? APPRENTLY YOU PEOPLE DON'T GET IT: YOU ARE NOT GOING TO GET A JUDGE TO SUSPEND HABAEUS CORPUS!!! STOP TRYING!! DIDN'T YOUR LOSS AT THE SUPREME COURT TEACH YOU ANYTHING? No judge is going to be the one to suspend a law that's been in effect since Roman times!!", 
        "reply": " One thing that seems to apply here is that the Supreme Court (or a lower court) can say \"A\" and the Administration can file a motion or whatever and that makes it drag on foe 1-2 more years. The Bush Administration held an American citizen for 3.5 years with no charges and no trial. They did it by stringing out in the courts by denying a what is clearly required in the Bill of Rights -- a speedy and public trial. This really does apply: \"In Germany, they came first for the Communists, And I didn’t speak up because I wasn’t a Communist; And then they came for the trade unionists, And I didn’t speak up because I wasn’t a trade unionist; And then they came for the Jews, And I didn’t speak up because I wasn’t a Jew; And then . . . they came for me . . . And by that time there was no one left to speak up.\" --Martin Niemoller Walt", 
        "threadID": "672198221_6620084022001", 
        "time": "2009-04-12 03:07:00", 
        "title": "Obama DOJ Mimics Bush DOJ in Ignoring the Rule of Law", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "quote: Originally posted by WhiskeyPapa: I supported President Obama because he seemed to be very smart, and he claimed to dedicated to the Rule of Law. He is not.... This is what Senator Obama said in September 2006 on the floor of the Senate: The bottom line is this: Current procedures under the CSRT are such that a perfectly innocent individual could be held and could not rebut the Government's case and has no way of proving his innocence. I would like somebody in this Chamber, somebody in this Government, to tell me why this is necessary. I do not want to hear that this is a new world and we face a new kind of enemy. I know that. . . . But as a parent, I can also imagine the terror I would feel if one of my family members were rounded up in the middle of the night and sent to Guantanamo without even getting one chance to ask why they were being held and being able to prove their innocence.\" It would appear that the President has set aside emotion and opted for reason when establishing US policy.", 
        "intTime": 20090412, 
        "postID": 26, 
        "quote": "Originally posted by WhiskeyPapa: I supported President Obama because he seemed to be very smart, and he claimed to dedicated to the Rule of Law. He is not.... This is what Senator Obama said in September 2006 on the floor of the Senate: The bottom line is this: Current procedures under the CSRT are such that a perfectly innocent individual could be held and could not rebut the Government's case and has no way of proving his innocence. I would like somebody in this Chamber, somebody in this Government, to tell me why this is necessary. I do not want to hear that this is a new world and we face a new kind of enemy. I know that. . . . But as a parent, I can also imagine the terror I would feel if one of my family members were rounded up in the middle of the night and sent to Guantanamo without even getting one chance to ask why they were being held and being able to prove their innocence.\"", 
        "reply": " It would appear that the President has set aside emotion and opted for reason when establishing US policy.", 
        "threadID": "672198221_6620084022001", 
        "time": "2009-04-12 03:52:00", 
        "title": "Obama DOJ Mimics Bush DOJ in Ignoring the Rule of Law", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: This really does apply: \"In Germany, they came first for the Communists, And I didn’t speak up because I wasn’t a Communist; And then they came for the trade unionists, And I didn’t speak up because I wasn’t a trade unionist; And then they came for the Jews, And I didn’t speak up because I wasn’t a Jew; And then . . . they came for me . . . And by that time there was no one left to speak up.\" --Martin Niemoller Indeed it does and what many people that read these forums do not understand is that this has been repeated over and over in history. They thought they be The Righteous and Only Just to find out They were now the Victims of that same Self-Righteous, twisted concept. The Witch Hunters will continue though until they either a) discover they were wrong all along or b) get hunted down, convicted with little to no justice and then with a dumb look on their faces, wonder why? As for Obama, The courts rule allot on this stuff now that W opened room for the civil authorities to get involved. Had W set up a legal system utilizing the military ranks that was fair and just to handle whoever was taken into custody, all of this could have been avoided. How dumb of these so called \"college educated buffoons\".", 
        "intTime": 20090412, 
        "postID": 27, 
        "quote": "This really does apply: \"In Germany, they came first for the Communists, And I didn’t speak up because I wasn’t a Communist; And then they came for the trade unionists, And I didn’t speak up because I wasn’t a trade unionist; And then they came for the Jews, And I didn’t speak up because I wasn’t a Jew; And then . . . they came for me . . . And by that time there was no one left to speak up.\" --Martin Niemoller", 
        "reply": " Indeed it does and what many people that read these forums do not understand is that this has been repeated over and over in history. They thought they be The Righteous and Only Just to find out They were now the Victims of that same Self-Righteous, twisted concept. The Witch Hunters will continue though until they either a) discover they were wrong all along or b) get hunted down, convicted with little to no justice and then with a dumb look on their faces, wonder why? As for Obama, The courts rule allot on this stuff now that W opened room for the civil authorities to get involved. Had W set up a legal system utilizing the military ranks that was fair and just to handle whoever was taken into custody, all of this could have been avoided. How dumb of these so called \"college educated buffoons\".", 
        "threadID": "672198221_6620084022001", 
        "time": "2009-04-12 04:01:00", 
        "title": "Obama DOJ Mimics Bush DOJ in Ignoring the Rule of Law", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by FriscoLady01: \"Meet the new Boss, same as the old Boss.\" I think that pretty well covers it. Frisco ewww not quite, but keep trying...", 
        "intTime": 20090412, 
        "postID": 28, 
        "quote": "Originally posted by FriscoLady01: \"Meet the new Boss, same as the old Boss.\" I think that pretty well covers it. Frisco", 
        "reply": " ewww not quite, but keep trying...", 
        "threadID": "672198221_6620084022001", 
        "time": "2009-04-12 04:04:00", 
        "title": "Obama DOJ Mimics Bush DOJ in Ignoring the Rule of Law", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: quote: This really does apply: \"In Germany, they came first for the Communists, And I didn’t speak up because I wasn’t a Communist; And then they came for the trade unionists, And I didn’t speak up because I wasn’t a trade unionist; And then they came for the Jews, And I didn’t speak up because I wasn’t a Jew; And then . . . they came for me . . . And by that time there was no one left to speak up.\" --Martin Niemoller Indeed it does and what many people that read these forums do not understand is that this has been repeated over and over in history. They thought they be The Righteous and Only Just to find out They were now the Victims of that same Self-Righteous, twisted concept. The Witch Hunters will continue though until they either a) discover they were wrong all along or b) get hunted down, convicted with little to no justice and then with a dumb look on their faces, wonder why? As for Obama, The courts rule allot on this stuff now that W opened room for the civil authorities to get involved. Had W set up a legal system utilizing the military ranks that was fair and just to handle whoever was taken into custody, all of this could have been avoided. How dumb of these so called \"college educated buffoons\". If nothing else at least you have the chance to whine about W a little bit more", 
        "intTime": 20090412, 
        "postID": 29, 
        "quote": "Originally posted by crackerjacks61: quote: This really does apply: \"In Germany, they came first for the Communists, And I didn’t speak up because I wasn’t a Communist; And then they came for the trade unionists, And I didn’t speak up because I wasn’t a trade unionist; And then they came for the Jews, And I didn’t speak up because I wasn’t a Jew; And then . . . they came for me . . . And by that time there was no one left to speak up.\" --Martin Niemoller Indeed it does and what many people that read these forums do not understand is that this has been repeated over and over in history. They thought they be The Righteous and Only Just to find out They were now the Victims of that same Self-Righteous, twisted concept. The Witch Hunters will continue though until they either a) discover they were wrong all along or b) get hunted down, convicted with little to no justice and then with a dumb look on their faces, wonder why? As for Obama, The courts rule allot on this stuff now that W opened room for the civil authorities to get involved. Had W set up a legal system utilizing the military ranks that was fair and just to handle whoever was taken into custody, all of this could have been avoided. How dumb of these so called \"college educated buffoons\".", 
        "reply": " If nothing else at least you have the chance to whine about W a little bit more", 
        "threadID": "672198221_6620084022001", 
        "time": "2009-04-12 04:08:00", 
        "title": "Obama DOJ Mimics Bush DOJ in Ignoring the Rule of Law", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by crackerjacks61: quote: This really does apply: \"In Germany, they came first for the Communists, And I didn’t speak up because I wasn’t a Communist; And then they came for the trade unionists, And I didn’t speak up because I wasn’t a trade unionist; And then they came for the Jews, And I didn’t speak up because I wasn’t a Jew; And then . . . they came for me . . . And by that time there was no one left to speak up.\" --Martin Niemoller Indeed it does and what many people that read these forums do not understand is that this has been repeated over and over in history. They thought they be The Righteous and Only Just to find out They were now the Victims of that same Self-Righteous, twisted concept. The Witch Hunters will continue though until they either a) discover they were wrong all along or b) get hunted down, convicted with little to no justice and then with a dumb look on their faces, wonder why? As for Obama, The courts rule allot on this stuff now that W opened room for the civil authorities to get involved. Had W set up a legal system utilizing the military ranks that was fair and just to handle whoever was taken into custody, all of this could have been avoided. How dumb of these so called \"college educated buffoons\". If nothing else at least you have the chance to whine about W a little bit more Like we don't read whining about how it's Obama's fault everyday. Paint the whole picture, not just your partisan propaganda.", 
        "intTime": 20090412, 
        "postID": 30, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by crackerjacks61: quote: This really does apply: \"In Germany, they came first for the Communists, And I didn’t speak up because I wasn’t a Communist; And then they came for the trade unionists, And I didn’t speak up because I wasn’t a trade unionist; And then they came for the Jews, And I didn’t speak up because I wasn’t a Jew; And then . . . they came for me . . . And by that time there was no one left to speak up.\" --Martin Niemoller Indeed it does and what many people that read these forums do not understand is that this has been repeated over and over in history. They thought they be The Righteous and Only Just to find out They were now the Victims of that same Self-Righteous, twisted concept. The Witch Hunters will continue though until they either a) discover they were wrong all along or b) get hunted down, convicted with little to no justice and then with a dumb look on their faces, wonder why? As for Obama, The courts rule allot on this stuff now that W opened room for the civil authorities to get involved. Had W set up a legal system utilizing the military ranks that was fair and just to handle whoever was taken into custody, all of this could have been avoided. How dumb of these so called \"college educated buffoons\". If nothing else at least you have the chance to whine about W a little bit more", 
        "reply": " Like we don't read whining about how it's Obama's fault everyday. Paint the whole picture, not just your partisan propaganda.", 
        "threadID": "672198221_6620084022001", 
        "time": "2009-04-12 04:46:00", 
        "title": "Obama DOJ Mimics Bush DOJ in Ignoring the Rule of Law", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by crackerjacks61: quote: This really does apply: \"In Germany, they came first for the Communists, And I didn’t speak up because I wasn’t a Communist; And then they came for the trade unionists, And I didn’t speak up because I wasn’t a trade unionist; And then they came for the Jews, And I didn’t speak up because I wasn’t a Jew; And then . . . they came for me . . . And by that time there was no one left to speak up.\" --Martin Niemoller Indeed it does and what many people that read these forums do not understand is that this has been repeated over and over in history. They thought they be The Righteous and Only Just to find out They were now the Victims of that same Self-Righteous, twisted concept. The Witch Hunters will continue though until they either a) discover they were wrong all along or b) get hunted down, convicted with little to no justice and then with a dumb look on their faces, wonder why? As for Obama, The courts rule allot on this stuff now that W opened room for the civil authorities to get involved. Had W set up a legal system utilizing the military ranks that was fair and just to handle whoever was taken into custody, all of this could have been avoided. How dumb of these so called \"college educated buffoons\". If nothing else at least you have the chance to whine about W a little bit more For my part I am whining about Obama acting just like Bush. Walt", 
        "intTime": 20090412, 
        "postID": 31, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by crackerjacks61: quote: This really does apply: \"In Germany, they came first for the Communists, And I didn’t speak up because I wasn’t a Communist; And then they came for the trade unionists, And I didn’t speak up because I wasn’t a trade unionist; And then they came for the Jews, And I didn’t speak up because I wasn’t a Jew; And then . . . they came for me . . . And by that time there was no one left to speak up.\" --Martin Niemoller Indeed it does and what many people that read these forums do not understand is that this has been repeated over and over in history. They thought they be The Righteous and Only Just to find out They were now the Victims of that same Self-Righteous, twisted concept. The Witch Hunters will continue though until they either a) discover they were wrong all along or b) get hunted down, convicted with little to no justice and then with a dumb look on their faces, wonder why? As for Obama, The courts rule allot on this stuff now that W opened room for the civil authorities to get involved. Had W set up a legal system utilizing the military ranks that was fair and just to handle whoever was taken into custody, all of this could have been avoided. How dumb of these so called \"college educated buffoons\". If nothing else at least you have the chance to whine about W a little bit more", 
        "reply": " For my part I am whining about Obama acting just like Bush. Walt", 
        "threadID": "672198221_6620084022001", 
        "time": "2009-04-12 05:02:00", 
        "title": "Obama DOJ Mimics Bush DOJ in Ignoring the Rule of Law", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: quote: Originally posted by adminnco1: quote: Originally posted by crackerjacks61: quote: This really does apply: \"In Germany, they came first for the Communists, And I didn’t speak up because I wasn’t a Communist; And then they came for the trade unionists, And I didn’t speak up because I wasn’t a trade unionist; And then they came for the Jews, And I didn’t speak up because I wasn’t a Jew; And then . . . they came for me . . . And by that time there was no one left to speak up.\" --Martin Niemoller Indeed it does and what many people that read these forums do not understand is that this has been repeated over and over in history. They thought they be The Righteous and Only Just to find out They were now the Victims of that same Self-Righteous, twisted concept. The Witch Hunters will continue though until they either a) discover they were wrong all along or b) get hunted down, convicted with little to no justice and then with a dumb look on their faces, wonder why? As for Obama, The courts rule allot on this stuff now that W opened room for the civil authorities to get involved. Had W set up a legal system utilizing the military ranks that was fair and just to handle whoever was taken into custody, all of this could have been avoided. How dumb of these so called \"college educated buffoons\". If nothing else at least you have the chance to whine about W a little bit more Like we don't read whining about how it's Obama's fault everyday. Paint the whole picture, not just your partisan propaganda. Who is \"we\"? All I have observed is obfuscation and denial of responsibility except, of course, in the case of the VP who apparently has the magical power to rewrite past events to serve his current agenda.", 
        "intTime": 20090412, 
        "postID": 32, 
        "quote": "Originally posted by crackerjacks61: quote: Originally posted by adminnco1: quote: Originally posted by crackerjacks61: quote: This really does apply: \"In Germany, they came first for the Communists, And I didn’t speak up because I wasn’t a Communist; And then they came for the trade unionists, And I didn’t speak up because I wasn’t a trade unionist; And then they came for the Jews, And I didn’t speak up because I wasn’t a Jew; And then . . . they came for me . . . And by that time there was no one left to speak up.\" --Martin Niemoller Indeed it does and what many people that read these forums do not understand is that this has been repeated over and over in history. They thought they be The Righteous and Only Just to find out They were now the Victims of that same Self-Righteous, twisted concept. The Witch Hunters will continue though until they either a) discover they were wrong all along or b) get hunted down, convicted with little to no justice and then with a dumb look on their faces, wonder why? As for Obama, The courts rule allot on this stuff now that W opened room for the civil authorities to get involved. Had W set up a legal system utilizing the military ranks that was fair and just to handle whoever was taken into custody, all of this could have been avoided. How dumb of these so called \"college educated buffoons\". If nothing else at least you have the chance to whine about W a little bit more Like we don't read whining about how it's Obama's fault everyday. Paint the whole picture, not just your partisan propaganda.", 
        "reply": " Who is \"we\"? All I have observed is obfuscation and denial of responsibility except, of course, in the case of the VP who apparently has the magical power to rewrite past events to serve his current agenda.", 
        "threadID": "672198221_6620084022001", 
        "time": "2009-04-12 06:07:00", 
        "title": "Obama DOJ Mimics Bush DOJ in Ignoring the Rule of Law", 
        "userID": "adminnco1"
    }, 
    {
        "content": "1. Habeas Corpus is not granted in the U.S. Constitution, it is recognized by the Constitution as long standing law agreed to by all civilized nations that safeguards a person’s freedom against arbitrary state action. So granting Habeas Corpus to anyone who is not a U.S. citizen is not granting them Constitutional rights, it is recognizing that “We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness.” 2. The Obama Administration filed a motion to be able to hold enemies in Afghanistan as prisoners of war. That motion has been denied, now the Justice Department is considering appealing that decision. No rule of law has been broken, as the thread suggests. Breaking the law is when the Bush Administation held a U.S. citizen in jail without trial, or held prisoners in secret prisons, or wire tapped American citizens without a warrant. Just getting the facts straight.", 
        "intTime": 20090412, 
        "postID": 33, 
        "quote": "", 
        "reply": "1. Habeas Corpus is not granted in the U.S. Constitution, it is recognized by the Constitution as long standing law agreed to by all civilized nations that safeguards a person’s freedom against arbitrary state action. So granting Habeas Corpus to anyone who is not a U.S. citizen is not granting them Constitutional rights, it is recognizing that “We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness.” 2. The Obama Administration filed a motion to be able to hold enemies in Afghanistan as prisoners of war. That motion has been denied, now the Justice Department is considering appealing that decision. No rule of law has been broken, as the thread suggests. Breaking the law is when the Bush Administation held a U.S. citizen in jail without trial, or held prisoners in secret prisons, or wire tapped American citizens without a warrant. Just getting the facts straight.", 
        "threadID": "672198221_6620084022001", 
        "time": "2009-04-12 06:39:00", 
        "title": "Obama DOJ Mimics Bush DOJ in Ignoring the Rule of Law", 
        "userID": "xerello"
    }, 
    {
        "content": "quote: Originally posted by xerello: 1. Habeas Corpus is not granted in the U.S. Constitution, it is recognized by the Constitution as long standing law agreed to by all civilized nations that safeguards a person’s freedom against arbitrary state action. So granting Habeas Corpus to anyone who is not a U.S. citizen is not granting them Constitutional rights, it is recognizing that “We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness.” 2. The Obama Administration filed a motion to be able to hold enemies in Afghanistan as prisoners of war. That motion has been denied, now the Justice Department is considering appealing that decision. No rule of law has been broken, as the thread suggests. Breaking the law is when the Bush Administation held a U.S. citizen in jail without trial, or held prisoners in secret prisons, or wire tapped American citizens without a warrant. Just getting the facts straight. Standard liberal bilge: \"Breaking the law is when the Bush Administration ____________ \". Just fill in the blank with your rant(s) of choice.", 
        "intTime": 20090412, 
        "postID": 34, 
        "quote": "Originally posted by xerello: 1. Habeas Corpus is not granted in the U.S. Constitution, it is recognized by the Constitution as long standing law agreed to by all civilized nations that safeguards a person’s freedom against arbitrary state action. So granting Habeas Corpus to anyone who is not a U.S. citizen is not granting them Constitutional rights, it is recognizing that “We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness.” 2. The Obama Administration filed a motion to be able to hold enemies in Afghanistan as prisoners of war. That motion has been denied, now the Justice Department is considering appealing that decision. No rule of law has been broken, as the thread suggests. Breaking the law is when the Bush Administation held a U.S. citizen in jail without trial, or held prisoners in secret prisons, or wire tapped American citizens without a warrant. Just getting the facts straight.", 
        "reply": " Standard liberal bilge: \"Breaking the law is when the Bush Administration ____________ \". Just fill in the blank with your rant(s) of choice.", 
        "threadID": "672198221_6620084022001", 
        "time": "2009-04-12 06:51:00", 
        "title": "Obama DOJ Mimics Bush DOJ in Ignoring the Rule of Law", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by WhiskeyPapa: This is very bad. Remember that the Constitution had to be sent back for a 'do-over' to add the Bill of Rights back in 1787. This included the right to Habeas Corpus review. Walt A small BUT relevant correction. The Founders embedded Habeaus in the orginal text. In the Federalist Papers, they argue that without this right, no other right is safe. They in fact argued that we don't need a Bill of Rights as long as we have Habeaus. The redo to add a Bill of Rights was only added because otherwise the Constitution would not have been ratified without promising to add them. I believe the authors were wrong - Nevertheless their point about Habeaus is valid. You cannot exercise any of your other rights, if you don't have this most basic of rights. Habeaus is the first guarranttee against a Police State. Dave", 
        "intTime": 20090412, 
        "postID": 35, 
        "quote": "Originally posted by WhiskeyPapa: This is very bad. Remember that the Constitution had to be sent back for a 'do-over' to add the Bill of Rights back in 1787. This included the right to Habeas Corpus review. Walt", 
        "reply": " A small BUT relevant correction. The Founders embedded Habeaus in the orginal text. In the Federalist Papers, they argue that without this right, no other right is safe. They in fact argued that we don't need a Bill of Rights as long as we have Habeaus. The redo to add a Bill of Rights was only added because otherwise the Constitution would not have been ratified without promising to add them. I believe the authors were wrong - Nevertheless their point about Habeaus is valid. You cannot exercise any of your other rights, if you don't have this most basic of rights. Habeaus is the first guarranttee against a Police State. Dave", 
        "threadID": "672198221_6620084022001", 
        "time": "2009-04-12 08:02:00", 
        "title": "Obama DOJ Mimics Bush DOJ in Ignoring the Rule of Law", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by xerello: 1. Habeas Corpus is not granted in the U.S. Constitution, it is recognized by the Constitution as long standing law agreed to by all civilized nations that safeguards a person’s freedom against arbitrary state action. So granting Habeas Corpus to anyone who is not a U.S. citizen is not granting them Constitutional rights, it is recognizing that “We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness.” 2. The Obama Administration filed a motion to be able to hold enemies in Afghanistan as prisoners of war. That motion has been denied, now the Justice Department is considering appealing that decision. No rule of law has been broken, as the thread suggests. Breaking the law is when the Bush Administation held a U.S. citizen in jail without trial, or held prisoners in secret prisons, or wire tapped American citizens without a warrant. Just getting the facts straight. Standard liberal bilge: \"Breaking the law is when the Bush Administration ____________ \". Just fill in the blank with your rant(s) of choice. News flash! This thread is about OBAMA violating the Constitution. The fact that Bush did it too is utterly irrelevant.", 
        "intTime": 20090412, 
        "postID": 36, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by xerello: 1. Habeas Corpus is not granted in the U.S. Constitution, it is recognized by the Constitution as long standing law agreed to by all civilized nations that safeguards a person’s freedom against arbitrary state action. So granting Habeas Corpus to anyone who is not a U.S. citizen is not granting them Constitutional rights, it is recognizing that “We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness.” 2. The Obama Administration filed a motion to be able to hold enemies in Afghanistan as prisoners of war. That motion has been denied, now the Justice Department is considering appealing that decision. No rule of law has been broken, as the thread suggests. Breaking the law is when the Bush Administation held a U.S. citizen in jail without trial, or held prisoners in secret prisons, or wire tapped American citizens without a warrant. Just getting the facts straight. Standard liberal bilge: \"Breaking the law is when the Bush Administration ____________ \". Just fill in the blank with your rant(s) of choice.", 
        "reply": " News flash! This thread is about OBAMA violating the Constitution. The fact that Bush did it too is utterly irrelevant.", 
        "threadID": "672198221_6620084022001", 
        "time": "2009-04-12 08:34:00", 
        "title": "Obama DOJ Mimics Bush DOJ in Ignoring the Rule of Law", 
        "userID": "thorin001"
    }, 
    {
        "content": "It is wrong no matter which administration is doing it. Violations of the Constitution do not change depending on who is the President. Wrong is wrong and holding people without charging them with a crime is WRONG (so is torture and the Obama admin HAS addressed that)", 
        "intTime": 20090412, 
        "postID": 37, 
        "quote": "", 
        "reply": "It is wrong no matter which administration is doing it. Violations of the Constitution do not change depending on who is the President. Wrong is wrong and holding people without charging them with a crime is WRONG (so is torture and the Obama admin HAS addressed that)", 
        "threadID": "672198221_6620084022001", 
        "time": "2009-04-12 09:02:00", 
        "title": "Obama DOJ Mimics Bush DOJ in Ignoring the Rule of Law", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by xerello: 1. Habeas Corpus is not granted in the U.S. Constitution, it is recognized by the Constitution as long standing law agreed to by all civilized nations that safeguards a person’s freedom against arbitrary state action. So granting Habeas Corpus to anyone who is not a U.S. citizen is not granting them Constitutional rights, it is recognizing that “We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness.” 2. The Obama Administration filed a motion to be able to hold enemies in Afghanistan as prisoners of war. That motion has been denied, now the Justice Department is considering appealing that decision. No rule of law has been broken, as the thread suggests. Breaking the law is when the Bush Administation held a U.S. citizen in jail without trial, or held prisoners in secret prisons, or wire tapped American citizens without a warrant. Just getting the facts straight. How odd of you to try and slip this in. Habaeus Corpus is absolutely granted in the Constitution. The United States Constitution specifically included the English common law procedure in Article One, Section 9 which states: “The privilege of the writ of habeas corpus shall not be suspended, unless when in cases of rebellion or invasion the public safety may require it.\" So it is not specifically in the Bill of Rights, but it IS part of our common law heritage that both the Bush and Obama Administrations are tossing at our common peril. I did misspeak in suggesting that the ratfication 'do-over' included HC. BUT it did definitely include the right to a speedy and public trial. Walt Walt", 
        "intTime": 20090412, 
        "postID": 38, 
        "quote": "Originally posted by xerello: 1. Habeas Corpus is not granted in the U.S. Constitution, it is recognized by the Constitution as long standing law agreed to by all civilized nations that safeguards a person’s freedom against arbitrary state action. So granting Habeas Corpus to anyone who is not a U.S. citizen is not granting them Constitutional rights, it is recognizing that “We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness.” 2. The Obama Administration filed a motion to be able to hold enemies in Afghanistan as prisoners of war. That motion has been denied, now the Justice Department is considering appealing that decision. No rule of law has been broken, as the thread suggests. Breaking the law is when the Bush Administation held a U.S. citizen in jail without trial, or held prisoners in secret prisons, or wire tapped American citizens without a warrant. Just getting the facts straight.", 
        "reply": " How odd of you to try and slip this in. Habaeus Corpus is absolutely granted in the Constitution. The United States Constitution specifically included the English common law procedure in Article One, Section 9 which states: “The privilege of the writ of habeas corpus shall not be suspended, unless when in cases of rebellion or invasion the public safety may require it.\" So it is not specifically in the Bill of Rights, but it IS part of our common law heritage that both the Bush and Obama Administrations are tossing at our common peril. I did misspeak in suggesting that the ratfication 'do-over' included HC. BUT it did definitely include the right to a speedy and public trial. Walt Walt", 
        "threadID": "672198221_6620084022001", 
        "time": "2009-04-12 09:29:00", 
        "title": "Obama DOJ Mimics Bush DOJ in Ignoring the Rule of Law", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by xerello: 1. Habeas Corpus is not granted in the U.S. Constitution, it is recognized by the Constitution as long standing law agreed to by all civilized nations that safeguards a person’s freedom against arbitrary state action. So granting Habeas Corpus to anyone who is not a U.S. citizen is not granting them Constitutional rights, it is recognizing that “We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness.” 2. The Obama Administration filed a motion to be able to hold enemies in Afghanistan as prisoners of war. That motion has been denied, now the Justice Department is considering appealing that decision. No rule of law has been broken, as the thread suggests. Breaking the law is when the Bush Administation held a U.S. citizen in jail without trial, or held prisoners in secret prisons, or wire tapped American citizens without a warrant. Just getting the facts straight. Standard liberal bilge: \"Breaking the law is when the Bush Administration ____________ \". Just fill in the blank with your rant(s) of choice. The original article is comparing the actions of the Obama administration to the actions of the Bush administration as violating the constitution. He is pointing out that it's not the same thing. You go from thread to thread pointing out any mention of Bush, while disregarding the point of the entire post. Was Bush your cousin or something?", 
        "intTime": 20090412, 
        "postID": 39, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by xerello: 1. Habeas Corpus is not granted in the U.S. Constitution, it is recognized by the Constitution as long standing law agreed to by all civilized nations that safeguards a person’s freedom against arbitrary state action. So granting Habeas Corpus to anyone who is not a U.S. citizen is not granting them Constitutional rights, it is recognizing that “We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness.” 2. The Obama Administration filed a motion to be able to hold enemies in Afghanistan as prisoners of war. That motion has been denied, now the Justice Department is considering appealing that decision. No rule of law has been broken, as the thread suggests. Breaking the law is when the Bush Administation held a U.S. citizen in jail without trial, or held prisoners in secret prisons, or wire tapped American citizens without a warrant. Just getting the facts straight. Standard liberal bilge: \"Breaking the law is when the Bush Administration ____________ \". Just fill in the blank with your rant(s) of choice.", 
        "reply": " The original article is comparing the actions of the Obama administration to the actions of the Bush administration as violating the constitution. He is pointing out that it's not the same thing. You go from thread to thread pointing out any mention of Bush, while disregarding the point of the entire post. Was Bush your cousin or something?", 
        "threadID": "672198221_6620084022001", 
        "time": "2009-04-12 09:35:00", 
        "title": "Obama DOJ Mimics Bush DOJ in Ignoring the Rule of Law", 
        "userID": "Esample1"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by WhiskeyPapa: This is very bad. Remember that the Constitution had to be sent back for a 'do-over' to add the Bill of Rights back in 1787. This included the right to Habeas Corpus review. Walt A small BUT relevant correction. The Founders embedded Habeaus in the orginal text. In the Federalist Papers, they argue that without this right, no other right is safe. They in fact argued that we don't need a Bill of Rights as long as we have Habeaus. The redo to add a Bill of Rights was only added because otherwise the Constitution would not have been ratified without promising to add them. I believe the authors were wrong - Nevertheless their point about Habeaus is valid. You cannot exercise any of your other rights, if you don't have this most basic of rights. Habeaus is the first guarranttee against a Police State. Dave That is exactly right. And what is happening now is that the Obama Administration is going to be an accessory --is already an accessory -- to the crimes committed by the Bush Administration. Really, if we face the truth - we already live in a police state when the executive has the uncontested power to detain anyone they want outside the rule of law. Walt", 
        "intTime": 20090412, 
        "postID": 40, 
        "quote": "Originally posted by Grachus: quote: Originally posted by WhiskeyPapa: This is very bad. Remember that the Constitution had to be sent back for a 'do-over' to add the Bill of Rights back in 1787. This included the right to Habeas Corpus review. Walt A small BUT relevant correction. The Founders embedded Habeaus in the orginal text. In the Federalist Papers, they argue that without this right, no other right is safe. They in fact argued that we don't need a Bill of Rights as long as we have Habeaus. The redo to add a Bill of Rights was only added because otherwise the Constitution would not have been ratified without promising to add them. I believe the authors were wrong - Nevertheless their point about Habeaus is valid. You cannot exercise any of your other rights, if you don't have this most basic of rights. Habeaus is the first guarranttee against a Police State. Dave", 
        "reply": " That is exactly right. And what is happening now is that the Obama Administration is going to be an accessory --is already an accessory -- to the crimes committed by the Bush Administration. Really, if we face the truth - we already live in a police state when the executive has the uncontested power to detain anyone they want outside the rule of law. Walt", 
        "threadID": "672198221_6620084022001", 
        "time": "2009-04-12 09:41:00", 
        "title": "Obama DOJ Mimics Bush DOJ in Ignoring the Rule of Law", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "I supported President Obama because he seemed to be very smart, and he claimed to dedicated to the Rule of Law. He is not. \"Back in February, the Obama administration shocked many civil libertarians by filing a brief in federal court that, in two sentences, declared that it embraced the most extremist Bush theory on this issue -- the Obama DOJ argued, as The New York Times's Charlie Savage put it, \"that military detainees in Afghanistan have no legal right to challenge their imprisonment there, embracing a key argument of former President Bush’s legal team.\" Remember: these are not prisoners captured in Afghanistan on a battlefield. Many of them have nothing to do with Afghanistan and were captured far, far away from that country -- abducted from their homes and workplaces -- and then flown to Bagram to be imprisoned. Indeed, the Bagram detainees in the particular case in which the Obama DOJ filed its brief were Yemenis and Tunisians captured outside of Afghanistan (in Thailand or the UAE, for instance) and then flown to Bagram and locked away there as much as six years without any charges. That is what the Obama DOJ defended, and they argued that those individuals can be imprisoned indefinitely with no rights of any kind -- as long as they are kept in Bagram rather than Guantanamo. Last month, a federal judge emphatically rejected the Bush/Obama position and held that the rationale of Boudemiene applies every bit as much to Bagram as it does to Guantanamo. Notably, the district judge who so ruled -- John Bates -- is an appointee of George W. Bush, a former Whitewater prosecutor, and a very pro-executive-power judge. In his decision (.pdf), Judge Bates made clear how identical are the constitutional rights of detainees flown to Guantanamo and Bagram and underscored how dangerous is the Bush/Obama claim that the President has the right to abduct people from around the world and imprison them at Bagram with no due process of any kind.\" This is very bad. Remember that the Constitution had to be sent back for a 'do-over' to add the Bill of Rights back in 1787. This included the right to Habeas Corpus review. Obama's DOJ, like Bush's DOJ is just tossing the pillars upon which the country is built -- what makes the United States a special place. This is what Senator Obama said in September 2006 on the floor of the Senate: The bottom line is this: Current procedures under the CSRT are such that a perfectly innocent individual could be held and could not rebut the Government's case and has no way of proving his innocence. I would like somebody in this Chamber, somebody in this Government, to tell me why this is necessary. I do not want to hear that this is a new world and we face a new kind of enemy. I know that. . . . But as a parent, I can also imagine the terror I would feel if one of my family members were rounded up in the middle of the night and sent to Guantanamo without even getting one chance to ask why they were being held and being able to prove their innocence.\" I know you are not supposed to live links so go to salon.com and click on Glen Greenwald's link for a lot more information and links to these court cases where the Obama DOJ makes a mockery of everything we stand for. Walt", 
        "intTime": 20090411, 
        "postID": 41, 
        "quote": "", 
        "reply": "I supported President Obama because he seemed to be very smart, and he claimed to dedicated to the Rule of Law. He is not. \"Back in February, the Obama administration shocked many civil libertarians by filing a brief in federal court that, in two sentences, declared that it embraced the most extremist Bush theory on this issue -- the Obama DOJ argued, as The New York Times's Charlie Savage put it, \"that military detainees in Afghanistan have no legal right to challenge their imprisonment there, embracing a key argument of former President Bush’s legal team.\" Remember: these are not prisoners captured in Afghanistan on a battlefield. Many of them have nothing to do with Afghanistan and were captured far, far away from that country -- abducted from their homes and workplaces -- and then flown to Bagram to be imprisoned. Indeed, the Bagram detainees in the particular case in which the Obama DOJ filed its brief were Yemenis and Tunisians captured outside of Afghanistan (in Thailand or the UAE, for instance) and then flown to Bagram and locked away there as much as six years without any charges. That is what the Obama DOJ defended, and they argued that those individuals can be imprisoned indefinitely with no rights of any kind -- as long as they are kept in Bagram rather than Guantanamo. Last month, a federal judge emphatically rejected the Bush/Obama position and held that the rationale of Boudemiene applies every bit as much to Bagram as it does to Guantanamo. Notably, the district judge who so ruled -- John Bates -- is an appointee of George W. Bush, a former Whitewater prosecutor, and a very pro-executive-power judge. In his decision (.pdf), Judge Bates made clear how identical are the constitutional rights of detainees flown to Guantanamo and Bagram and underscored how dangerous is the Bush/Obama claim that the President has the right to abduct people from around the world and imprison them at Bagram with no due process of any kind.\" This is very bad. Remember that the Constitution had to be sent back for a 'do-over' to add the Bill of Rights back in 1787. This included the right to Habeas Corpus review. Obama's DOJ, like Bush's DOJ is just tossing the pillars upon which the country is built -- what makes the United States a special place. This is what Senator Obama said in September 2006 on the floor of the Senate: The bottom line is this: Current procedures under the CSRT are such that a perfectly innocent individual could be held and could not rebut the Government's case and has no way of proving his innocence. I would like somebody in this Chamber, somebody in this Government, to tell me why this is necessary. I do not want to hear that this is a new world and we face a new kind of enemy. I know that. . . . But as a parent, I can also imagine the terror I would feel if one of my family members were rounded up in the middle of the night and sent to Guantanamo without even getting one chance to ask why they were being held and being able to prove their innocence.\" I know you are not supposed to live links so go to salon.com and click on Glen Greenwald's link for a lot more information and links to these court cases where the Obama DOJ makes a mockery of everything we stand for. Walt", 
        "threadID": "672198221_6620084022001", 
        "time": "2009-04-11 19:44:00", 
        "title": "Obama DOJ Mimics Bush DOJ in Ignoring the Rule of Law", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "\"Meet the new Boss, same as the old Boss.\" I think that pretty well covers it. Frisco", 
        "intTime": 20090411, 
        "postID": 42, 
        "quote": "", 
        "reply": "\"Meet the new Boss, same as the old Boss.\" I think that pretty well covers it. Frisco", 
        "threadID": "672198221_6620084022001", 
        "time": "2009-04-11 22:13:00", 
        "title": "Obama DOJ Mimics Bush DOJ in Ignoring the Rule of Law", 
        "userID": "FriscoLady01"
    }, 
    {
        "content": "I predict much anger over this from the same people who supported it a year ago.", 
        "intTime": 20090411, 
        "postID": 43, 
        "quote": "", 
        "reply": "I predict much anger over this from the same people who supported it a year ago.", 
        "threadID": "672198221_6620084022001", 
        "time": "2009-04-11 22:21:00", 
        "title": "Obama DOJ Mimics Bush DOJ in Ignoring the Rule of Law", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "What is this? Like the 100th time they have tried to deny habaeus corpus to detainees? And like the 100th time in a row they've lost? APPRENTLY YOU PEOPLE DON'T GET IT: YOU ARE NOT GOING TO GET A JUDGE TO SUSPEND HABAEUS CORPUS!!! STOP TRYING!! DIDN'T YOUR LOSS AT THE SUPREME COURT TEACH YOU ANYTHING? No judge is going to be the one to suspend a law that's been in effect since Roman times!!", 
        "intTime": 20090412, 
        "postID": 44, 
        "quote": "", 
        "reply": "What is this? Like the 100th time they have tried to deny habaeus corpus to detainees? And like the 100th time in a row they've lost? APPRENTLY YOU PEOPLE DON'T GET IT: YOU ARE NOT GOING TO GET A JUDGE TO SUSPEND HABAEUS CORPUS!!! STOP TRYING!! DIDN'T YOUR LOSS AT THE SUPREME COURT TEACH YOU ANYTHING? No judge is going to be the one to suspend a law that's been in effect since Roman times!!", 
        "threadID": "672198221_6620084022001", 
        "time": "2009-04-12 02:59:00", 
        "title": "Obama DOJ Mimics Bush DOJ in Ignoring the Rule of Law", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: What is this? Like the 100th time they have tried to deny habaeus corpus to detainees? And like the 100th time in a row they've lost? APPRENTLY YOU PEOPLE DON'T GET IT: YOU ARE NOT GOING TO GET A JUDGE TO SUSPEND HABAEUS CORPUS!!! STOP TRYING!! DIDN'T YOUR LOSS AT THE SUPREME COURT TEACH YOU ANYTHING? No judge is going to be the one to suspend a law that's been in effect since Roman times!! One thing that seems to apply here is that the Supreme Court (or a lower court) can say \"A\" and the Administration can file a motion or whatever and that makes it drag on foe 1-2 more years. The Bush Administration held an American citizen for 3.5 years with no charges and no trial. They did it by stringing out in the courts by denying a what is clearly required in the Bill of Rights -- a speedy and public trial. This really does apply: \"In Germany, they came first for the Communists, And I didn’t speak up because I wasn’t a Communist; And then they came for the trade unionists, And I didn’t speak up because I wasn’t a trade unionist; And then they came for the Jews, And I didn’t speak up because I wasn’t a Jew; And then . . . they came for me . . . And by that time there was no one left to speak up.\" --Martin Niemoller Walt", 
        "intTime": 20090412, 
        "postID": 45, 
        "quote": "Originally posted by mrmixitup: What is this? Like the 100th time they have tried to deny habaeus corpus to detainees? And like the 100th time in a row they've lost? APPRENTLY YOU PEOPLE DON'T GET IT: YOU ARE NOT GOING TO GET A JUDGE TO SUSPEND HABAEUS CORPUS!!! STOP TRYING!! DIDN'T YOUR LOSS AT THE SUPREME COURT TEACH YOU ANYTHING? No judge is going to be the one to suspend a law that's been in effect since Roman times!!", 
        "reply": " One thing that seems to apply here is that the Supreme Court (or a lower court) can say \"A\" and the Administration can file a motion or whatever and that makes it drag on foe 1-2 more years. The Bush Administration held an American citizen for 3.5 years with no charges and no trial. They did it by stringing out in the courts by denying a what is clearly required in the Bill of Rights -- a speedy and public trial. This really does apply: \"In Germany, they came first for the Communists, And I didn’t speak up because I wasn’t a Communist; And then they came for the trade unionists, And I didn’t speak up because I wasn’t a trade unionist; And then they came for the Jews, And I didn’t speak up because I wasn’t a Jew; And then . . . they came for me . . . And by that time there was no one left to speak up.\" --Martin Niemoller Walt", 
        "threadID": "672198221_6620084022001", 
        "time": "2009-04-12 03:07:00", 
        "title": "Obama DOJ Mimics Bush DOJ in Ignoring the Rule of Law", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "quote: Originally posted by WhiskeyPapa: I supported President Obama because he seemed to be very smart, and he claimed to dedicated to the Rule of Law. He is not.... This is what Senator Obama said in September 2006 on the floor of the Senate: The bottom line is this: Current procedures under the CSRT are such that a perfectly innocent individual could be held and could not rebut the Government's case and has no way of proving his innocence. I would like somebody in this Chamber, somebody in this Government, to tell me why this is necessary. I do not want to hear that this is a new world and we face a new kind of enemy. I know that. . . . But as a parent, I can also imagine the terror I would feel if one of my family members were rounded up in the middle of the night and sent to Guantanamo without even getting one chance to ask why they were being held and being able to prove their innocence.\" It would appear that the President has set aside emotion and opted for reason when establishing US policy.", 
        "intTime": 20090412, 
        "postID": 46, 
        "quote": "Originally posted by WhiskeyPapa: I supported President Obama because he seemed to be very smart, and he claimed to dedicated to the Rule of Law. He is not.... This is what Senator Obama said in September 2006 on the floor of the Senate: The bottom line is this: Current procedures under the CSRT are such that a perfectly innocent individual could be held and could not rebut the Government's case and has no way of proving his innocence. I would like somebody in this Chamber, somebody in this Government, to tell me why this is necessary. I do not want to hear that this is a new world and we face a new kind of enemy. I know that. . . . But as a parent, I can also imagine the terror I would feel if one of my family members were rounded up in the middle of the night and sent to Guantanamo without even getting one chance to ask why they were being held and being able to prove their innocence.\"", 
        "reply": " It would appear that the President has set aside emotion and opted for reason when establishing US policy.", 
        "threadID": "672198221_6620084022001", 
        "time": "2009-04-12 03:52:00", 
        "title": "Obama DOJ Mimics Bush DOJ in Ignoring the Rule of Law", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: This really does apply: \"In Germany, they came first for the Communists, And I didn’t speak up because I wasn’t a Communist; And then they came for the trade unionists, And I didn’t speak up because I wasn’t a trade unionist; And then they came for the Jews, And I didn’t speak up because I wasn’t a Jew; And then . . . they came for me . . . And by that time there was no one left to speak up.\" --Martin Niemoller Indeed it does and what many people that read these forums do not understand is that this has been repeated over and over in history. They thought they be The Righteous and Only Just to find out They were now the Victims of that same Self-Righteous, twisted concept. The Witch Hunters will continue though until they either a) discover they were wrong all along or b) get hunted down, convicted with little to no justice and then with a dumb look on their faces, wonder why? As for Obama, The courts rule allot on this stuff now that W opened room for the civil authorities to get involved. Had W set up a legal system utilizing the military ranks that was fair and just to handle whoever was taken into custody, all of this could have been avoided. How dumb of these so called \"college educated buffoons\".", 
        "intTime": 20090412, 
        "postID": 47, 
        "quote": "This really does apply: \"In Germany, they came first for the Communists, And I didn’t speak up because I wasn’t a Communist; And then they came for the trade unionists, And I didn’t speak up because I wasn’t a trade unionist; And then they came for the Jews, And I didn’t speak up because I wasn’t a Jew; And then . . . they came for me . . . And by that time there was no one left to speak up.\" --Martin Niemoller", 
        "reply": " Indeed it does and what many people that read these forums do not understand is that this has been repeated over and over in history. They thought they be The Righteous and Only Just to find out They were now the Victims of that same Self-Righteous, twisted concept. The Witch Hunters will continue though until they either a) discover they were wrong all along or b) get hunted down, convicted with little to no justice and then with a dumb look on their faces, wonder why? As for Obama, The courts rule allot on this stuff now that W opened room for the civil authorities to get involved. Had W set up a legal system utilizing the military ranks that was fair and just to handle whoever was taken into custody, all of this could have been avoided. How dumb of these so called \"college educated buffoons\".", 
        "threadID": "672198221_6620084022001", 
        "time": "2009-04-12 04:01:00", 
        "title": "Obama DOJ Mimics Bush DOJ in Ignoring the Rule of Law", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by FriscoLady01: \"Meet the new Boss, same as the old Boss.\" I think that pretty well covers it. Frisco ewww not quite, but keep trying...", 
        "intTime": 20090412, 
        "postID": 48, 
        "quote": "Originally posted by FriscoLady01: \"Meet the new Boss, same as the old Boss.\" I think that pretty well covers it. Frisco", 
        "reply": " ewww not quite, but keep trying...", 
        "threadID": "672198221_6620084022001", 
        "time": "2009-04-12 04:04:00", 
        "title": "Obama DOJ Mimics Bush DOJ in Ignoring the Rule of Law", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: quote: This really does apply: \"In Germany, they came first for the Communists, And I didn’t speak up because I wasn’t a Communist; And then they came for the trade unionists, And I didn’t speak up because I wasn’t a trade unionist; And then they came for the Jews, And I didn’t speak up because I wasn’t a Jew; And then . . . they came for me . . . And by that time there was no one left to speak up.\" --Martin Niemoller Indeed it does and what many people that read these forums do not understand is that this has been repeated over and over in history. They thought they be The Righteous and Only Just to find out They were now the Victims of that same Self-Righteous, twisted concept. The Witch Hunters will continue though until they either a) discover they were wrong all along or b) get hunted down, convicted with little to no justice and then with a dumb look on their faces, wonder why? As for Obama, The courts rule allot on this stuff now that W opened room for the civil authorities to get involved. Had W set up a legal system utilizing the military ranks that was fair and just to handle whoever was taken into custody, all of this could have been avoided. How dumb of these so called \"college educated buffoons\". If nothing else at least you have the chance to whine about W a little bit more", 
        "intTime": 20090412, 
        "postID": 49, 
        "quote": "Originally posted by crackerjacks61: quote: This really does apply: \"In Germany, they came first for the Communists, And I didn’t speak up because I wasn’t a Communist; And then they came for the trade unionists, And I didn’t speak up because I wasn’t a trade unionist; And then they came for the Jews, And I didn’t speak up because I wasn’t a Jew; And then . . . they came for me . . . And by that time there was no one left to speak up.\" --Martin Niemoller Indeed it does and what many people that read these forums do not understand is that this has been repeated over and over in history. They thought they be The Righteous and Only Just to find out They were now the Victims of that same Self-Righteous, twisted concept. The Witch Hunters will continue though until they either a) discover they were wrong all along or b) get hunted down, convicted with little to no justice and then with a dumb look on their faces, wonder why? As for Obama, The courts rule allot on this stuff now that W opened room for the civil authorities to get involved. Had W set up a legal system utilizing the military ranks that was fair and just to handle whoever was taken into custody, all of this could have been avoided. How dumb of these so called \"college educated buffoons\".", 
        "reply": " If nothing else at least you have the chance to whine about W a little bit more", 
        "threadID": "672198221_6620084022001", 
        "time": "2009-04-12 04:08:00", 
        "title": "Obama DOJ Mimics Bush DOJ in Ignoring the Rule of Law", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by crackerjacks61: quote: This really does apply: \"In Germany, they came first for the Communists, And I didn’t speak up because I wasn’t a Communist; And then they came for the trade unionists, And I didn’t speak up because I wasn’t a trade unionist; And then they came for the Jews, And I didn’t speak up because I wasn’t a Jew; And then . . . they came for me . . . And by that time there was no one left to speak up.\" --Martin Niemoller Indeed it does and what many people that read these forums do not understand is that this has been repeated over and over in history. They thought they be The Righteous and Only Just to find out They were now the Victims of that same Self-Righteous, twisted concept. The Witch Hunters will continue though until they either a) discover they were wrong all along or b) get hunted down, convicted with little to no justice and then with a dumb look on their faces, wonder why? As for Obama, The courts rule allot on this stuff now that W opened room for the civil authorities to get involved. Had W set up a legal system utilizing the military ranks that was fair and just to handle whoever was taken into custody, all of this could have been avoided. How dumb of these so called \"college educated buffoons\". If nothing else at least you have the chance to whine about W a little bit more Like we don't read whining about how it's Obama's fault everyday. Paint the whole picture, not just your partisan propaganda.", 
        "intTime": 20090412, 
        "postID": 50, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by crackerjacks61: quote: This really does apply: \"In Germany, they came first for the Communists, And I didn’t speak up because I wasn’t a Communist; And then they came for the trade unionists, And I didn’t speak up because I wasn’t a trade unionist; And then they came for the Jews, And I didn’t speak up because I wasn’t a Jew; And then . . . they came for me . . . And by that time there was no one left to speak up.\" --Martin Niemoller Indeed it does and what many people that read these forums do not understand is that this has been repeated over and over in history. They thought they be The Righteous and Only Just to find out They were now the Victims of that same Self-Righteous, twisted concept. The Witch Hunters will continue though until they either a) discover they were wrong all along or b) get hunted down, convicted with little to no justice and then with a dumb look on their faces, wonder why? As for Obama, The courts rule allot on this stuff now that W opened room for the civil authorities to get involved. Had W set up a legal system utilizing the military ranks that was fair and just to handle whoever was taken into custody, all of this could have been avoided. How dumb of these so called \"college educated buffoons\". If nothing else at least you have the chance to whine about W a little bit more", 
        "reply": " Like we don't read whining about how it's Obama's fault everyday. Paint the whole picture, not just your partisan propaganda.", 
        "threadID": "672198221_6620084022001", 
        "time": "2009-04-12 04:46:00", 
        "title": "Obama DOJ Mimics Bush DOJ in Ignoring the Rule of Law", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by crackerjacks61: quote: This really does apply: \"In Germany, they came first for the Communists, And I didn’t speak up because I wasn’t a Communist; And then they came for the trade unionists, And I didn’t speak up because I wasn’t a trade unionist; And then they came for the Jews, And I didn’t speak up because I wasn’t a Jew; And then . . . they came for me . . . And by that time there was no one left to speak up.\" --Martin Niemoller Indeed it does and what many people that read these forums do not understand is that this has been repeated over and over in history. They thought they be The Righteous and Only Just to find out They were now the Victims of that same Self-Righteous, twisted concept. The Witch Hunters will continue though until they either a) discover they were wrong all along or b) get hunted down, convicted with little to no justice and then with a dumb look on their faces, wonder why? As for Obama, The courts rule allot on this stuff now that W opened room for the civil authorities to get involved. Had W set up a legal system utilizing the military ranks that was fair and just to handle whoever was taken into custody, all of this could have been avoided. How dumb of these so called \"college educated buffoons\". If nothing else at least you have the chance to whine about W a little bit more For my part I am whining about Obama acting just like Bush. Walt", 
        "intTime": 20090412, 
        "postID": 51, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by crackerjacks61: quote: This really does apply: \"In Germany, they came first for the Communists, And I didn’t speak up because I wasn’t a Communist; And then they came for the trade unionists, And I didn’t speak up because I wasn’t a trade unionist; And then they came for the Jews, And I didn’t speak up because I wasn’t a Jew; And then . . . they came for me . . . And by that time there was no one left to speak up.\" --Martin Niemoller Indeed it does and what many people that read these forums do not understand is that this has been repeated over and over in history. They thought they be The Righteous and Only Just to find out They were now the Victims of that same Self-Righteous, twisted concept. The Witch Hunters will continue though until they either a) discover they were wrong all along or b) get hunted down, convicted with little to no justice and then with a dumb look on their faces, wonder why? As for Obama, The courts rule allot on this stuff now that W opened room for the civil authorities to get involved. Had W set up a legal system utilizing the military ranks that was fair and just to handle whoever was taken into custody, all of this could have been avoided. How dumb of these so called \"college educated buffoons\". If nothing else at least you have the chance to whine about W a little bit more", 
        "reply": " For my part I am whining about Obama acting just like Bush. Walt", 
        "threadID": "672198221_6620084022001", 
        "time": "2009-04-12 05:02:00", 
        "title": "Obama DOJ Mimics Bush DOJ in Ignoring the Rule of Law", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: quote: Originally posted by adminnco1: quote: Originally posted by crackerjacks61: quote: This really does apply: \"In Germany, they came first for the Communists, And I didn’t speak up because I wasn’t a Communist; And then they came for the trade unionists, And I didn’t speak up because I wasn’t a trade unionist; And then they came for the Jews, And I didn’t speak up because I wasn’t a Jew; And then . . . they came for me . . . And by that time there was no one left to speak up.\" --Martin Niemoller Indeed it does and what many people that read these forums do not understand is that this has been repeated over and over in history. They thought they be The Righteous and Only Just to find out They were now the Victims of that same Self-Righteous, twisted concept. The Witch Hunters will continue though until they either a) discover they were wrong all along or b) get hunted down, convicted with little to no justice and then with a dumb look on their faces, wonder why? As for Obama, The courts rule allot on this stuff now that W opened room for the civil authorities to get involved. Had W set up a legal system utilizing the military ranks that was fair and just to handle whoever was taken into custody, all of this could have been avoided. How dumb of these so called \"college educated buffoons\". If nothing else at least you have the chance to whine about W a little bit more Like we don't read whining about how it's Obama's fault everyday. Paint the whole picture, not just your partisan propaganda. Who is \"we\"? All I have observed is obfuscation and denial of responsibility except, of course, in the case of the VP who apparently has the magical power to rewrite past events to serve his current agenda.", 
        "intTime": 20090412, 
        "postID": 52, 
        "quote": "Originally posted by crackerjacks61: quote: Originally posted by adminnco1: quote: Originally posted by crackerjacks61: quote: This really does apply: \"In Germany, they came first for the Communists, And I didn’t speak up because I wasn’t a Communist; And then they came for the trade unionists, And I didn’t speak up because I wasn’t a trade unionist; And then they came for the Jews, And I didn’t speak up because I wasn’t a Jew; And then . . . they came for me . . . And by that time there was no one left to speak up.\" --Martin Niemoller Indeed it does and what many people that read these forums do not understand is that this has been repeated over and over in history. They thought they be The Righteous and Only Just to find out They were now the Victims of that same Self-Righteous, twisted concept. The Witch Hunters will continue though until they either a) discover they were wrong all along or b) get hunted down, convicted with little to no justice and then with a dumb look on their faces, wonder why? As for Obama, The courts rule allot on this stuff now that W opened room for the civil authorities to get involved. Had W set up a legal system utilizing the military ranks that was fair and just to handle whoever was taken into custody, all of this could have been avoided. How dumb of these so called \"college educated buffoons\". If nothing else at least you have the chance to whine about W a little bit more Like we don't read whining about how it's Obama's fault everyday. Paint the whole picture, not just your partisan propaganda.", 
        "reply": " Who is \"we\"? All I have observed is obfuscation and denial of responsibility except, of course, in the case of the VP who apparently has the magical power to rewrite past events to serve his current agenda.", 
        "threadID": "672198221_6620084022001", 
        "time": "2009-04-12 06:07:00", 
        "title": "Obama DOJ Mimics Bush DOJ in Ignoring the Rule of Law", 
        "userID": "adminnco1"
    }, 
    {
        "content": "1. Habeas Corpus is not granted in the U.S. Constitution, it is recognized by the Constitution as long standing law agreed to by all civilized nations that safeguards a person’s freedom against arbitrary state action. So granting Habeas Corpus to anyone who is not a U.S. citizen is not granting them Constitutional rights, it is recognizing that “We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness.” 2. The Obama Administration filed a motion to be able to hold enemies in Afghanistan as prisoners of war. That motion has been denied, now the Justice Department is considering appealing that decision. No rule of law has been broken, as the thread suggests. Breaking the law is when the Bush Administation held a U.S. citizen in jail without trial, or held prisoners in secret prisons, or wire tapped American citizens without a warrant. Just getting the facts straight.", 
        "intTime": 20090412, 
        "postID": 53, 
        "quote": "", 
        "reply": "1. Habeas Corpus is not granted in the U.S. Constitution, it is recognized by the Constitution as long standing law agreed to by all civilized nations that safeguards a person’s freedom against arbitrary state action. So granting Habeas Corpus to anyone who is not a U.S. citizen is not granting them Constitutional rights, it is recognizing that “We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness.” 2. The Obama Administration filed a motion to be able to hold enemies in Afghanistan as prisoners of war. That motion has been denied, now the Justice Department is considering appealing that decision. No rule of law has been broken, as the thread suggests. Breaking the law is when the Bush Administation held a U.S. citizen in jail without trial, or held prisoners in secret prisons, or wire tapped American citizens without a warrant. Just getting the facts straight.", 
        "threadID": "672198221_6620084022001", 
        "time": "2009-04-12 06:39:00", 
        "title": "Obama DOJ Mimics Bush DOJ in Ignoring the Rule of Law", 
        "userID": "xerello"
    }, 
    {
        "content": "quote: Originally posted by xerello: 1. Habeas Corpus is not granted in the U.S. Constitution, it is recognized by the Constitution as long standing law agreed to by all civilized nations that safeguards a person’s freedom against arbitrary state action. So granting Habeas Corpus to anyone who is not a U.S. citizen is not granting them Constitutional rights, it is recognizing that “We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness.” 2. The Obama Administration filed a motion to be able to hold enemies in Afghanistan as prisoners of war. That motion has been denied, now the Justice Department is considering appealing that decision. No rule of law has been broken, as the thread suggests. Breaking the law is when the Bush Administation held a U.S. citizen in jail without trial, or held prisoners in secret prisons, or wire tapped American citizens without a warrant. Just getting the facts straight. Standard liberal bilge: \"Breaking the law is when the Bush Administration ____________ \". Just fill in the blank with your rant(s) of choice.", 
        "intTime": 20090412, 
        "postID": 54, 
        "quote": "Originally posted by xerello: 1. Habeas Corpus is not granted in the U.S. Constitution, it is recognized by the Constitution as long standing law agreed to by all civilized nations that safeguards a person’s freedom against arbitrary state action. So granting Habeas Corpus to anyone who is not a U.S. citizen is not granting them Constitutional rights, it is recognizing that “We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness.” 2. The Obama Administration filed a motion to be able to hold enemies in Afghanistan as prisoners of war. That motion has been denied, now the Justice Department is considering appealing that decision. No rule of law has been broken, as the thread suggests. Breaking the law is when the Bush Administation held a U.S. citizen in jail without trial, or held prisoners in secret prisons, or wire tapped American citizens without a warrant. Just getting the facts straight.", 
        "reply": " Standard liberal bilge: \"Breaking the law is when the Bush Administration ____________ \". Just fill in the blank with your rant(s) of choice.", 
        "threadID": "672198221_6620084022001", 
        "time": "2009-04-12 06:51:00", 
        "title": "Obama DOJ Mimics Bush DOJ in Ignoring the Rule of Law", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by WhiskeyPapa: This is very bad. Remember that the Constitution had to be sent back for a 'do-over' to add the Bill of Rights back in 1787. This included the right to Habeas Corpus review. Walt A small BUT relevant correction. The Founders embedded Habeaus in the orginal text. In the Federalist Papers, they argue that without this right, no other right is safe. They in fact argued that we don't need a Bill of Rights as long as we have Habeaus. The redo to add a Bill of Rights was only added because otherwise the Constitution would not have been ratified without promising to add them. I believe the authors were wrong - Nevertheless their point about Habeaus is valid. You cannot exercise any of your other rights, if you don't have this most basic of rights. Habeaus is the first guarranttee against a Police State. Dave", 
        "intTime": 20090412, 
        "postID": 55, 
        "quote": "Originally posted by WhiskeyPapa: This is very bad. Remember that the Constitution had to be sent back for a 'do-over' to add the Bill of Rights back in 1787. This included the right to Habeas Corpus review. Walt", 
        "reply": " A small BUT relevant correction. The Founders embedded Habeaus in the orginal text. In the Federalist Papers, they argue that without this right, no other right is safe. They in fact argued that we don't need a Bill of Rights as long as we have Habeaus. The redo to add a Bill of Rights was only added because otherwise the Constitution would not have been ratified without promising to add them. I believe the authors were wrong - Nevertheless their point about Habeaus is valid. You cannot exercise any of your other rights, if you don't have this most basic of rights. Habeaus is the first guarranttee against a Police State. Dave", 
        "threadID": "672198221_6620084022001", 
        "time": "2009-04-12 08:02:00", 
        "title": "Obama DOJ Mimics Bush DOJ in Ignoring the Rule of Law", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by xerello: 1. Habeas Corpus is not granted in the U.S. Constitution, it is recognized by the Constitution as long standing law agreed to by all civilized nations that safeguards a person’s freedom against arbitrary state action. So granting Habeas Corpus to anyone who is not a U.S. citizen is not granting them Constitutional rights, it is recognizing that “We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness.” 2. The Obama Administration filed a motion to be able to hold enemies in Afghanistan as prisoners of war. That motion has been denied, now the Justice Department is considering appealing that decision. No rule of law has been broken, as the thread suggests. Breaking the law is when the Bush Administation held a U.S. citizen in jail without trial, or held prisoners in secret prisons, or wire tapped American citizens without a warrant. Just getting the facts straight. Standard liberal bilge: \"Breaking the law is when the Bush Administration ____________ \". Just fill in the blank with your rant(s) of choice. News flash! This thread is about OBAMA violating the Constitution. The fact that Bush did it too is utterly irrelevant.", 
        "intTime": 20090412, 
        "postID": 56, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by xerello: 1. Habeas Corpus is not granted in the U.S. Constitution, it is recognized by the Constitution as long standing law agreed to by all civilized nations that safeguards a person’s freedom against arbitrary state action. So granting Habeas Corpus to anyone who is not a U.S. citizen is not granting them Constitutional rights, it is recognizing that “We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness.” 2. The Obama Administration filed a motion to be able to hold enemies in Afghanistan as prisoners of war. That motion has been denied, now the Justice Department is considering appealing that decision. No rule of law has been broken, as the thread suggests. Breaking the law is when the Bush Administation held a U.S. citizen in jail without trial, or held prisoners in secret prisons, or wire tapped American citizens without a warrant. Just getting the facts straight. Standard liberal bilge: \"Breaking the law is when the Bush Administration ____________ \". Just fill in the blank with your rant(s) of choice.", 
        "reply": " News flash! This thread is about OBAMA violating the Constitution. The fact that Bush did it too is utterly irrelevant.", 
        "threadID": "672198221_6620084022001", 
        "time": "2009-04-12 08:34:00", 
        "title": "Obama DOJ Mimics Bush DOJ in Ignoring the Rule of Law", 
        "userID": "thorin001"
    }, 
    {
        "content": "It is wrong no matter which administration is doing it. Violations of the Constitution do not change depending on who is the President. Wrong is wrong and holding people without charging them with a crime is WRONG (so is torture and the Obama admin HAS addressed that)", 
        "intTime": 20090412, 
        "postID": 57, 
        "quote": "", 
        "reply": "It is wrong no matter which administration is doing it. Violations of the Constitution do not change depending on who is the President. Wrong is wrong and holding people without charging them with a crime is WRONG (so is torture and the Obama admin HAS addressed that)", 
        "threadID": "672198221_6620084022001", 
        "time": "2009-04-12 09:02:00", 
        "title": "Obama DOJ Mimics Bush DOJ in Ignoring the Rule of Law", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by xerello: 1. Habeas Corpus is not granted in the U.S. Constitution, it is recognized by the Constitution as long standing law agreed to by all civilized nations that safeguards a person’s freedom against arbitrary state action. So granting Habeas Corpus to anyone who is not a U.S. citizen is not granting them Constitutional rights, it is recognizing that “We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness.” 2. The Obama Administration filed a motion to be able to hold enemies in Afghanistan as prisoners of war. That motion has been denied, now the Justice Department is considering appealing that decision. No rule of law has been broken, as the thread suggests. Breaking the law is when the Bush Administation held a U.S. citizen in jail without trial, or held prisoners in secret prisons, or wire tapped American citizens without a warrant. Just getting the facts straight. How odd of you to try and slip this in. Habaeus Corpus is absolutely granted in the Constitution. The United States Constitution specifically included the English common law procedure in Article One, Section 9 which states: “The privilege of the writ of habeas corpus shall not be suspended, unless when in cases of rebellion or invasion the public safety may require it.\" So it is not specifically in the Bill of Rights, but it IS part of our common law heritage that both the Bush and Obama Administrations are tossing at our common peril. I did misspeak in suggesting that the ratfication 'do-over' included HC. BUT it did definitely include the right to a speedy and public trial. Walt Walt", 
        "intTime": 20090412, 
        "postID": 58, 
        "quote": "Originally posted by xerello: 1. Habeas Corpus is not granted in the U.S. Constitution, it is recognized by the Constitution as long standing law agreed to by all civilized nations that safeguards a person’s freedom against arbitrary state action. So granting Habeas Corpus to anyone who is not a U.S. citizen is not granting them Constitutional rights, it is recognizing that “We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness.” 2. The Obama Administration filed a motion to be able to hold enemies in Afghanistan as prisoners of war. That motion has been denied, now the Justice Department is considering appealing that decision. No rule of law has been broken, as the thread suggests. Breaking the law is when the Bush Administation held a U.S. citizen in jail without trial, or held prisoners in secret prisons, or wire tapped American citizens without a warrant. Just getting the facts straight.", 
        "reply": " How odd of you to try and slip this in. Habaeus Corpus is absolutely granted in the Constitution. The United States Constitution specifically included the English common law procedure in Article One, Section 9 which states: “The privilege of the writ of habeas corpus shall not be suspended, unless when in cases of rebellion or invasion the public safety may require it.\" So it is not specifically in the Bill of Rights, but it IS part of our common law heritage that both the Bush and Obama Administrations are tossing at our common peril. I did misspeak in suggesting that the ratfication 'do-over' included HC. BUT it did definitely include the right to a speedy and public trial. Walt Walt", 
        "threadID": "672198221_6620084022001", 
        "time": "2009-04-12 09:29:00", 
        "title": "Obama DOJ Mimics Bush DOJ in Ignoring the Rule of Law", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by xerello: 1. Habeas Corpus is not granted in the U.S. Constitution, it is recognized by the Constitution as long standing law agreed to by all civilized nations that safeguards a person’s freedom against arbitrary state action. So granting Habeas Corpus to anyone who is not a U.S. citizen is not granting them Constitutional rights, it is recognizing that “We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness.” 2. The Obama Administration filed a motion to be able to hold enemies in Afghanistan as prisoners of war. That motion has been denied, now the Justice Department is considering appealing that decision. No rule of law has been broken, as the thread suggests. Breaking the law is when the Bush Administation held a U.S. citizen in jail without trial, or held prisoners in secret prisons, or wire tapped American citizens without a warrant. Just getting the facts straight. Standard liberal bilge: \"Breaking the law is when the Bush Administration ____________ \". Just fill in the blank with your rant(s) of choice. The original article is comparing the actions of the Obama administration to the actions of the Bush administration as violating the constitution. He is pointing out that it's not the same thing. You go from thread to thread pointing out any mention of Bush, while disregarding the point of the entire post. Was Bush your cousin or something?", 
        "intTime": 20090412, 
        "postID": 59, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by xerello: 1. Habeas Corpus is not granted in the U.S. Constitution, it is recognized by the Constitution as long standing law agreed to by all civilized nations that safeguards a person’s freedom against arbitrary state action. So granting Habeas Corpus to anyone who is not a U.S. citizen is not granting them Constitutional rights, it is recognizing that “We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness.” 2. The Obama Administration filed a motion to be able to hold enemies in Afghanistan as prisoners of war. That motion has been denied, now the Justice Department is considering appealing that decision. No rule of law has been broken, as the thread suggests. Breaking the law is when the Bush Administation held a U.S. citizen in jail without trial, or held prisoners in secret prisons, or wire tapped American citizens without a warrant. Just getting the facts straight. Standard liberal bilge: \"Breaking the law is when the Bush Administration ____________ \". Just fill in the blank with your rant(s) of choice.", 
        "reply": " The original article is comparing the actions of the Obama administration to the actions of the Bush administration as violating the constitution. He is pointing out that it's not the same thing. You go from thread to thread pointing out any mention of Bush, while disregarding the point of the entire post. Was Bush your cousin or something?", 
        "threadID": "672198221_6620084022001", 
        "time": "2009-04-12 09:35:00", 
        "title": "Obama DOJ Mimics Bush DOJ in Ignoring the Rule of Law", 
        "userID": "Esample1"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by WhiskeyPapa: This is very bad. Remember that the Constitution had to be sent back for a 'do-over' to add the Bill of Rights back in 1787. This included the right to Habeas Corpus review. Walt A small BUT relevant correction. The Founders embedded Habeaus in the orginal text. In the Federalist Papers, they argue that without this right, no other right is safe. They in fact argued that we don't need a Bill of Rights as long as we have Habeaus. The redo to add a Bill of Rights was only added because otherwise the Constitution would not have been ratified without promising to add them. I believe the authors were wrong - Nevertheless their point about Habeaus is valid. You cannot exercise any of your other rights, if you don't have this most basic of rights. Habeaus is the first guarranttee against a Police State. Dave That is exactly right. And what is happening now is that the Obama Administration is going to be an accessory --is already an accessory -- to the crimes committed by the Bush Administration. Really, if we face the truth - we already live in a police state when the executive has the uncontested power to detain anyone they want outside the rule of law. Walt", 
        "intTime": 20090412, 
        "postID": 60, 
        "quote": "Originally posted by Grachus: quote: Originally posted by WhiskeyPapa: This is very bad. Remember that the Constitution had to be sent back for a 'do-over' to add the Bill of Rights back in 1787. This included the right to Habeas Corpus review. Walt A small BUT relevant correction. The Founders embedded Habeaus in the orginal text. In the Federalist Papers, they argue that without this right, no other right is safe. They in fact argued that we don't need a Bill of Rights as long as we have Habeaus. The redo to add a Bill of Rights was only added because otherwise the Constitution would not have been ratified without promising to add them. I believe the authors were wrong - Nevertheless their point about Habeaus is valid. You cannot exercise any of your other rights, if you don't have this most basic of rights. Habeaus is the first guarranttee against a Police State. Dave", 
        "reply": " That is exactly right. And what is happening now is that the Obama Administration is going to be an accessory --is already an accessory -- to the crimes committed by the Bush Administration. Really, if we face the truth - we already live in a police state when the executive has the uncontested power to detain anyone they want outside the rule of law. Walt", 
        "threadID": "672198221_6620084022001", 
        "time": "2009-04-12 09:41:00", 
        "title": "Obama DOJ Mimics Bush DOJ in Ignoring the Rule of Law", 
        "userID": "WhiskeyPapa"
    }
]