[
    {
        "content": "quote: US President Barack Obama is to lift some restrictions that will allow Cuban Americans to travel more freely to Cuba, White House sources say. Cuban-Americans will also be allowed to send more money to relatives in Cuba. The move, to be officially announced later on Monday, comes after Mr Obama last month signed a spending bill easing some economic sanctions on Cuba. \"Restrictions on the families will be lifted,\" an unnamed White House official told news agency AFP. The Associated Press quoted an unnamed \"senior administration official\" as saying that President Obama had directed his administration to allow unlimited travel and money transfers by Cuban Americans to family in Cuba. President Obama has indicated he would be open to dialogue with Cuba's leaders. But he has said that, like previous American presidents, he will only consider a full lifting of the embargo once Cuba's communist government makes significant moves such as the holding of democratic elections. Cuba's President Raul Castro has said he is prepared to negotiate with the new US administration, providing there are no preconditions. A step in the right direction...... +http://news.bbc.co.uk/1/hi/world/americas/7997063.stm \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090413, 
        "postID": 1, 
        "quote": "US President Barack Obama is to lift some restrictions that will allow Cuban Americans to travel more freely to Cuba, White House sources say. Cuban-Americans will also be allowed to send more money to relatives in Cuba. The move, to be officially announced later on Monday, comes after Mr Obama last month signed a spending bill easing some economic sanctions on Cuba. \"Restrictions on the families will be lifted,\" an unnamed White House official told news agency AFP. The Associated Press quoted an unnamed \"senior administration official\" as saying that President Obama had directed his administration to allow unlimited travel and money transfers by Cuban Americans to family in Cuba. President Obama has indicated he would be open to dialogue with Cuba's leaders. But he has said that, like previous American presidents, he will only consider a full lifting of the embargo once Cuba's communist government makes significant moves such as the holding of democratic elections. Cuba's President Raul Castro has said he is prepared to negotiate with the new US administration, providing there are no preconditions.", 
        "reply": " A step in the right direction...... +http://news.bbc.co.uk/1/hi/world/americas/7997063.stm \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_6930006022001", 
        "time": "2009-04-13 10:21:00", 
        "title": "Obama 'to lift Cuba restrictions'", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by NSNN: quote: US President Barack Obama is to lift some restrictions that will allow Cuban Americans to travel more freely to Cuba, White House sources say. Cuban-Americans will also be allowed to send more money to relatives in Cuba. The move, to be officially announced later on Monday, comes after Mr Obama last month signed a spending bill easing some economic sanctions on Cuba. \"Restrictions on the families will be lifted,\" an unnamed White House official told news agency AFP. The Associated Press quoted an unnamed \"senior administration official\" as saying that President Obama had directed his administration to allow unlimited travel and money transfers by Cuban Americans to family in Cuba. President Obama has indicated he would be open to dialogue with Cuba's leaders. But he has said that, like previous American presidents, he will only consider a full lifting of the embargo once Cuba's communist government makes significant moves such as the holding of democratic elections. Cuba's President Raul Castro has said he is prepared to negotiate with the new US administration, providing there are no preconditions. A step in the right direction...... +http://news.bbc.co.uk/1/hi/world/americas/7997063.stm It's about time! \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090413, 
        "postID": 2, 
        "quote": "Originally posted by NSNN: quote: US President Barack Obama is to lift some restrictions that will allow Cuban Americans to travel more freely to Cuba, White House sources say. Cuban-Americans will also be allowed to send more money to relatives in Cuba. The move, to be officially announced later on Monday, comes after Mr Obama last month signed a spending bill easing some economic sanctions on Cuba. \"Restrictions on the families will be lifted,\" an unnamed White House official told news agency AFP. The Associated Press quoted an unnamed \"senior administration official\" as saying that President Obama had directed his administration to allow unlimited travel and money transfers by Cuban Americans to family in Cuba. President Obama has indicated he would be open to dialogue with Cuba's leaders. But he has said that, like previous American presidents, he will only consider a full lifting of the embargo once Cuba's communist government makes significant moves such as the holding of democratic elections. Cuba's President Raul Castro has said he is prepared to negotiate with the new US administration, providing there are no preconditions. A step in the right direction...... +http://news.bbc.co.uk/1/hi/world/americas/7997063.stm", 
        "reply": " It's about time! \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_6930006022001", 
        "time": "2009-04-13 10:28:00", 
        "title": "Obama 'to lift Cuba restrictions'", 
        "userID": "jack_flats"
    }, 
    {
        "content": "Great, the Cold War is over. We've been doing buisness with Russia, China, Vietnam, and other countries for a long time now. Cuba is a close neighbor and I look forward to the time when I can take a vacation there.", 
        "intTime": 20090413, 
        "postID": 3, 
        "quote": "", 
        "reply": "Great, the Cold War is over. We've been doing buisness with Russia, China, Vietnam, and other countries for a long time now. Cuba is a close neighbor and I look forward to the time when I can take a vacation there.", 
        "threadID": "672198221_6930006022001", 
        "time": "2009-04-13 10:32:00", 
        "title": "Obama 'to lift Cuba restrictions'", 
        "userID": "foxred03"
    }, 
    {
        "content": "The embargo and restrictions have probably outlived their usefullness. Does anyone know what this will mean for Cubans coming to then US? Are we going to have a repeat of the Mariel Boatlift or some other mad exodus from Cuba? Or is this just to ease conditions between families? Havana as a cruise port. I could do that.", 
        "intTime": 20090413, 
        "postID": 4, 
        "quote": "", 
        "reply": "The embargo and restrictions have probably outlived their usefullness. Does anyone know what this will mean for Cubans coming to then US? Are we going to have a repeat of the Mariel Boatlift or some other mad exodus from Cuba? Or is this just to ease conditions between families? Havana as a cruise port. I could do that.", 
        "threadID": "672198221_6930006022001", 
        "time": "2009-04-13 10:39:00", 
        "title": "Obama 'to lift Cuba restrictions'", 
        "userID": "sw614"
    }, 
    {
        "content": "You can bet some of the old goats (Cuban ex-pats) in Miami aren't going to be happy with this", 
        "intTime": 20090413, 
        "postID": 5, 
        "quote": "", 
        "reply": "You can bet some of the old goats (Cuban ex-pats) in Miami aren't going to be happy with this", 
        "threadID": "672198221_6930006022001", 
        "time": "2009-04-13 10:40:00", 
        "title": "Obama 'to lift Cuba restrictions'", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: You can bet some of the old goats (Cuban ex-pats) in Miami aren't going to be happy with this You are probably correct, but sooner or later it was bound to happen and I think now is a good time to start. I just do not want veryone in Cuba thinking they can \"come on down\".", 
        "intTime": 20090413, 
        "postID": 6, 
        "quote": "Originally posted by PhoenixDark: You can bet some of the old goats (Cuban ex-pats) in Miami aren't going to be happy with this", 
        "reply": " You are probably correct, but sooner or later it was bound to happen and I think now is a good time to start. I just do not want veryone in Cuba thinking they can \"come on down\".", 
        "threadID": "672198221_6930006022001", 
        "time": "2009-04-13 10:55:00", 
        "title": "Obama 'to lift Cuba restrictions'", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by sw614: I just do not want veryone in Cuba thinking they can \"come on down\". I welcome this move, I think it's the right thing to do and applaud Obama's decision but, like you, I agree that it does not lay out the welcome mat.", 
        "intTime": 20090413, 
        "postID": 7, 
        "quote": "Originally posted by sw614: I just do not want veryone in Cuba thinking they can \"come on down\".", 
        "reply": " I welcome this move, I think it's the right thing to do and applaud Obama's decision but, like you, I agree that it does not lay out the welcome mat.", 
        "threadID": "672198221_6930006022001", 
        "time": "2009-04-13 12:29:00", 
        "title": "Obama 'to lift Cuba restrictions'", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by NSNN: quote: US President Barack Obama is to lift some restrictions that will allow Cuban Americans to travel more freely to Cuba, White House sources say. Cuban-Americans will also be allowed to send more money to relatives in Cuba. The move, to be officially announced later on Monday, comes after Mr Obama last month signed a spending bill easing some economic sanctions on Cuba. \"Restrictions on the families will be lifted,\" an unnamed White House official told news agency AFP. The Associated Press quoted an unnamed \"senior administration official\" as saying that President Obama had directed his administration to allow unlimited travel and money transfers by Cuban Americans to family in Cuba. President Obama has indicated he would be open to dialogue with Cuba's leaders. But he has said that, like previous American presidents, he will only consider a full lifting of the embargo once Cuba's communist government makes significant moves such as the holding of democratic elections. Cuba's President Raul Castro has said he is prepared to negotiate with the new US administration, providing there are no preconditions. A step in the right direction...... +http://news.bbc.co.uk/1/hi/world/americas/7997063.stm A step in the left direction. I really dont have a real problem with it, but wait and see if Obama tries a Jimmah and give Gitmo to cuba.", 
        "intTime": 20090413, 
        "postID": 8, 
        "quote": "Originally posted by NSNN: quote: US President Barack Obama is to lift some restrictions that will allow Cuban Americans to travel more freely to Cuba, White House sources say. Cuban-Americans will also be allowed to send more money to relatives in Cuba. The move, to be officially announced later on Monday, comes after Mr Obama last month signed a spending bill easing some economic sanctions on Cuba. \"Restrictions on the families will be lifted,\" an unnamed White House official told news agency AFP. The Associated Press quoted an unnamed \"senior administration official\" as saying that President Obama had directed his administration to allow unlimited travel and money transfers by Cuban Americans to family in Cuba. President Obama has indicated he would be open to dialogue with Cuba's leaders. But he has said that, like previous American presidents, he will only consider a full lifting of the embargo once Cuba's communist government makes significant moves such as the holding of democratic elections. Cuba's President Raul Castro has said he is prepared to negotiate with the new US administration, providing there are no preconditions. A step in the right direction...... +http://news.bbc.co.uk/1/hi/world/americas/7997063.stm", 
        "reply": " A step in the left direction. I really dont have a real problem with it, but wait and see if Obama tries a Jimmah and give Gitmo to cuba.", 
        "threadID": "672198221_6930006022001", 
        "time": "2009-04-13 12:33:00", 
        "title": "Obama 'to lift Cuba restrictions'", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: I really dont have a real problem with it, but wait and see if Obama tries a Jimmah and give Gitmo to cuba. [/b] GITMO was already on the chopping block and was going to go back to Cuba prior to 9/11! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090413, 
        "postID": 9, 
        "quote": "Originally posted by GunnyRet03: I really dont have a real problem with it, but wait and see if Obama tries a Jimmah and give Gitmo to cuba. [/b]", 
        "reply": " GITMO was already on the chopping block and was going to go back to Cuba prior to 9/11! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_6930006022001", 
        "time": "2009-04-13 13:54:00", 
        "title": "Obama 'to lift Cuba restrictions'", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by SignalSgtWilliams: quote: Originally posted by sw614: I just do not want veryone in Cuba thinking they can \"come on down\". I welcome this move, I think it's the right thing to do and applaud Obama's decision but, like you, I agree that it does not lay out the welcome mat. My suspision is that the flood will be in the other direction...rum...cigars...and what happens in Havana stays in Havana.", 
        "intTime": 20090413, 
        "postID": 10, 
        "quote": "Originally posted by SignalSgtWilliams: quote: Originally posted by sw614: I just do not want veryone in Cuba thinking they can \"come on down\". I welcome this move, I think it's the right thing to do and applaud Obama's decision but, like you, I agree that it does not lay out the welcome mat.", 
        "reply": " My suspision is that the flood will be in the other direction...rum...cigars...and what happens in Havana stays in Havana.", 
        "threadID": "672198221_6930006022001", 
        "time": "2009-04-13 14:05:00", 
        "title": "Obama 'to lift Cuba restrictions'", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by Ol_Doc: quote: Originally posted by SignalSgtWilliams: quote: Originally posted by sw614: I just do not want veryone in Cuba thinking they can \"come on down\". I welcome this move, I think it's the right thing to do and applaud Obama's decision but, like you, I agree that it does not lay out the welcome mat. My suspision is that the flood will be in the other direction...rum...cigars...and what happens in Havana stays in Havana. I wish I could get my hands on some of the (well preserved) classic cars they got down there, and bring them back to the States......cha ching!!! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090413, 
        "postID": 11, 
        "quote": "Originally posted by Ol_Doc: quote: Originally posted by SignalSgtWilliams: quote: Originally posted by sw614: I just do not want veryone in Cuba thinking they can \"come on down\". I welcome this move, I think it's the right thing to do and applaud Obama's decision but, like you, I agree that it does not lay out the welcome mat. My suspision is that the flood will be in the other direction...rum...cigars...and what happens in Havana stays in Havana.", 
        "reply": " I wish I could get my hands on some of the (well preserved) classic cars they got down there, and bring them back to the States......cha ching!!! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_6930006022001", 
        "time": "2009-04-13 14:07:00", 
        "title": "Obama 'to lift Cuba restrictions'", 
        "userID": "NSNN"
    }, 
    {
        "content": "I support this decision only because it makes no since to be great trading partners with one commie nation and not the other. Of course the right supports this decision because it will be another country we can out out source jobs too. Thus, preventing \"protectionism\" and adds another piece to the NWO Global Economy and lost Sovereignty as a nation. Yep were steering in the right direction alright, but again I do not blame Obama for this. It has been in the works way to long and it is what the mighty elite rich republicans that dominated the world want and with the power of money they have, are going to get.", 
        "intTime": 20090413, 
        "postID": 12, 
        "quote": "", 
        "reply": "I support this decision only because it makes no since to be great trading partners with one commie nation and not the other. Of course the right supports this decision because it will be another country we can out out source jobs too. Thus, preventing \"protectionism\" and adds another piece to the NWO Global Economy and lost Sovereignty as a nation. Yep were steering in the right direction alright, but again I do not blame Obama for this. It has been in the works way to long and it is what the mighty elite rich republicans that dominated the world want and with the power of money they have, are going to get.", 
        "threadID": "672198221_6930006022001", 
        "time": "2009-04-13 14:15:00", 
        "title": "Obama 'to lift Cuba restrictions'", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by Ol_Doc: quote: Originally posted by SignalSgtWilliams: quote: Originally posted by sw614: I just do not want veryone in Cuba thinking they can \"come on down\". I welcome this move, I think it's the right thing to do and applaud Obama's decision but, like you, I agree that it does not lay out the welcome mat. My suspision is that the flood will be in the other direction...rum...cigars...and what happens in Havana stays in Havana. I'd love to go to Cooba to photograph all the colonial history. Have a Rum and smoke a Cooban sitting in the garden of Ernest Hemmingway's house.", 
        "intTime": 20090413, 
        "postID": 13, 
        "quote": "Originally posted by Ol_Doc: quote: Originally posted by SignalSgtWilliams: quote: Originally posted by sw614: I just do not want veryone in Cuba thinking they can \"come on down\". I welcome this move, I think it's the right thing to do and applaud Obama's decision but, like you, I agree that it does not lay out the welcome mat. My suspision is that the flood will be in the other direction...rum...cigars...and what happens in Havana stays in Havana.", 
        "reply": " I'd love to go to Cooba to photograph all the colonial history. Have a Rum and smoke a Cooban sitting in the garden of Ernest Hemmingway's house.", 
        "threadID": "672198221_6930006022001", 
        "time": "2009-04-13 14:35:00", 
        "title": "Obama 'to lift Cuba restrictions'", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: You can bet some of the old goats (Cuban ex-pats) in Miami aren't going to be happy with this The votes for the Repub party and donations to the Repubs by the Cuban ex-pats is the only reason the embargo and restrictions were not removed years ago. Now all that has to be done is get rid of the US law about Cuban property ownership. As bad as the Communist were the government of and Batista was worse and anyone that had property under that regime probably belonged to families that stole it in the first place.", 
        "intTime": 20090413, 
        "postID": 14, 
        "quote": "Originally posted by PhoenixDark: You can bet some of the old goats (Cuban ex-pats) in Miami aren't going to be happy with this", 
        "reply": " The votes for the Repub party and donations to the Repubs by the Cuban ex-pats is the only reason the embargo and restrictions were not removed years ago. Now all that has to be done is get rid of the US law about Cuban property ownership. As bad as the Communist were the government of and Batista was worse and anyone that had property under that regime probably belonged to families that stole it in the first place.", 
        "threadID": "672198221_6930006022001", 
        "time": "2009-04-13 15:50:00", 
        "title": "Obama 'to lift Cuba restrictions'", 
        "userID": "rayld2"
    }, 
    {
        "content": "This is well past time. Also it should make all of the cruise lines very happy to soon be able to add another port to the crowed Caribbean itinerary.", 
        "intTime": 20090413, 
        "postID": 15, 
        "quote": "", 
        "reply": "This is well past time. Also it should make all of the cruise lines very happy to soon be able to add another port to the crowed Caribbean itinerary.", 
        "threadID": "672198221_6930006022001", 
        "time": "2009-04-13 15:52:00", 
        "title": "Obama 'to lift Cuba restrictions'", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "quote: Originally posted by SignalSgtWilliams: quote: Originally posted by sw614: I just do not want veryone in Cuba thinking they can \"come on down\". I welcome this move, I think it's the right thing to do and applaud Obama's decision but, like you, I agree that it does not lay out the welcome mat. The welcome mat has been out for a long time since the Cubans are the only group that gets automatic political refugee status.", 
        "intTime": 20090413, 
        "postID": 16, 
        "quote": "Originally posted by SignalSgtWilliams: quote: Originally posted by sw614: I just do not want veryone in Cuba thinking they can \"come on down\". I welcome this move, I think it's the right thing to do and applaud Obama's decision but, like you, I agree that it does not lay out the welcome mat.", 
        "reply": " The welcome mat has been out for a long time since the Cubans are the only group that gets automatic political refugee status.", 
        "threadID": "672198221_6930006022001", 
        "time": "2009-04-13 15:53:00", 
        "title": "Obama 'to lift Cuba restrictions'", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by SignalSgtWilliams: quote: Originally posted by sw614: I just do not want veryone in Cuba thinking they can \"come on down\". I welcome this move, I think it's the right thing to do and applaud Obama's decision but, like you, I agree that it does not lay out the welcome mat. The welcome mat has been out for a long time since the Cubans are the only group that gets automatic political refugee status. For those that 'could' make it out. This is not what is being discussed, I'm talking an open door policy.", 
        "intTime": 20090413, 
        "postID": 17, 
        "quote": "Originally posted by rayld2: quote: Originally posted by SignalSgtWilliams: quote: Originally posted by sw614: I just do not want veryone in Cuba thinking they can \"come on down\". I welcome this move, I think it's the right thing to do and applaud Obama's decision but, like you, I agree that it does not lay out the welcome mat. The welcome mat has been out for a long time since the Cubans are the only group that gets automatic political refugee status.", 
        "reply": " For those that 'could' make it out. This is not what is being discussed, I'm talking an open door policy.", 
        "threadID": "672198221_6930006022001", 
        "time": "2009-04-13 16:33:00", 
        "title": "Obama 'to lift Cuba restrictions'", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "The soon to be \"unlimited travel\" involved is for Cuban Americans traveling TO Cuba to visit family members. It used to be once very three years. It does not open up Cuba for travel to an ordinary white guy American like me and it does not in any way shape or form \"authorize\" Cubans to travel to the US, so the same \"feet dry\" rules still apply to them.", 
        "intTime": 20090413, 
        "postID": 18, 
        "quote": "", 
        "reply": "The soon to be \"unlimited travel\" involved is for Cuban Americans traveling TO Cuba to visit family members. It used to be once very three years. It does not open up Cuba for travel to an ordinary white guy American like me and it does not in any way shape or form \"authorize\" Cubans to travel to the US, so the same \"feet dry\" rules still apply to them.", 
        "threadID": "672198221_6930006022001", 
        "time": "2009-04-13 16:43:00", 
        "title": "Obama 'to lift Cuba restrictions'", 
        "userID": "ETCPJ"
    }, 
    {
        "content": "quote: Originally posted by ETCPJ: The soon to be \"unlimited travel\" involved is for Cuban Americans traveling TO Cuba to visit family members. It used to be once very three years. It does not open up Cuba for travel to an ordinary white guy American like me and it does not in any way shape or form \"authorize\" Cubans to travel to the US, so the same \"feet dry\" rules still apply to them. A Bill is being introduced shortly to change that too.", 
        "intTime": 20090413, 
        "postID": 19, 
        "quote": "Originally posted by ETCPJ: The soon to be \"unlimited travel\" involved is for Cuban Americans traveling TO Cuba to visit family members. It used to be once very three years. It does not open up Cuba for travel to an ordinary white guy American like me and it does not in any way shape or form \"authorize\" Cubans to travel to the US, so the same \"feet dry\" rules still apply to them.", 
        "reply": " A Bill is being introduced shortly to change that too.", 
        "threadID": "672198221_6930006022001", 
        "time": "2009-04-13 16:55:00", 
        "title": "Obama 'to lift Cuba restrictions'", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "Hmm, better book a trip to Cuba before all the newly legalised American tourists arrive and strip the place bare.", 
        "intTime": 20090413, 
        "postID": 20, 
        "quote": "", 
        "reply": "Hmm, better book a trip to Cuba before all the newly legalised American tourists arrive and strip the place bare.", 
        "threadID": "672198221_6930006022001", 
        "time": "2009-04-13 16:58:00", 
        "title": "Obama 'to lift Cuba restrictions'", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "quote: US President Barack Obama is to lift some restrictions that will allow Cuban Americans to travel more freely to Cuba, White House sources say. Cuban-Americans will also be allowed to send more money to relatives in Cuba. The move, to be officially announced later on Monday, comes after Mr Obama last month signed a spending bill easing some economic sanctions on Cuba. \"Restrictions on the families will be lifted,\" an unnamed White House official told news agency AFP. The Associated Press quoted an unnamed \"senior administration official\" as saying that President Obama had directed his administration to allow unlimited travel and money transfers by Cuban Americans to family in Cuba. President Obama has indicated he would be open to dialogue with Cuba's leaders. But he has said that, like previous American presidents, he will only consider a full lifting of the embargo once Cuba's communist government makes significant moves such as the holding of democratic elections. Cuba's President Raul Castro has said he is prepared to negotiate with the new US administration, providing there are no preconditions. A step in the right direction...... +http://news.bbc.co.uk/1/hi/world/americas/7997063.stm \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090413, 
        "postID": 21, 
        "quote": "US President Barack Obama is to lift some restrictions that will allow Cuban Americans to travel more freely to Cuba, White House sources say. Cuban-Americans will also be allowed to send more money to relatives in Cuba. The move, to be officially announced later on Monday, comes after Mr Obama last month signed a spending bill easing some economic sanctions on Cuba. \"Restrictions on the families will be lifted,\" an unnamed White House official told news agency AFP. The Associated Press quoted an unnamed \"senior administration official\" as saying that President Obama had directed his administration to allow unlimited travel and money transfers by Cuban Americans to family in Cuba. President Obama has indicated he would be open to dialogue with Cuba's leaders. But he has said that, like previous American presidents, he will only consider a full lifting of the embargo once Cuba's communist government makes significant moves such as the holding of democratic elections. Cuba's President Raul Castro has said he is prepared to negotiate with the new US administration, providing there are no preconditions.", 
        "reply": " A step in the right direction...... +http://news.bbc.co.uk/1/hi/world/americas/7997063.stm \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_6930006022001", 
        "time": "2009-04-13 10:21:00", 
        "title": "Obama 'to lift Cuba restrictions'", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by NSNN: quote: US President Barack Obama is to lift some restrictions that will allow Cuban Americans to travel more freely to Cuba, White House sources say. Cuban-Americans will also be allowed to send more money to relatives in Cuba. The move, to be officially announced later on Monday, comes after Mr Obama last month signed a spending bill easing some economic sanctions on Cuba. \"Restrictions on the families will be lifted,\" an unnamed White House official told news agency AFP. The Associated Press quoted an unnamed \"senior administration official\" as saying that President Obama had directed his administration to allow unlimited travel and money transfers by Cuban Americans to family in Cuba. President Obama has indicated he would be open to dialogue with Cuba's leaders. But he has said that, like previous American presidents, he will only consider a full lifting of the embargo once Cuba's communist government makes significant moves such as the holding of democratic elections. Cuba's President Raul Castro has said he is prepared to negotiate with the new US administration, providing there are no preconditions. A step in the right direction...... +http://news.bbc.co.uk/1/hi/world/americas/7997063.stm It's about time! \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090413, 
        "postID": 22, 
        "quote": "Originally posted by NSNN: quote: US President Barack Obama is to lift some restrictions that will allow Cuban Americans to travel more freely to Cuba, White House sources say. Cuban-Americans will also be allowed to send more money to relatives in Cuba. The move, to be officially announced later on Monday, comes after Mr Obama last month signed a spending bill easing some economic sanctions on Cuba. \"Restrictions on the families will be lifted,\" an unnamed White House official told news agency AFP. The Associated Press quoted an unnamed \"senior administration official\" as saying that President Obama had directed his administration to allow unlimited travel and money transfers by Cuban Americans to family in Cuba. President Obama has indicated he would be open to dialogue with Cuba's leaders. But he has said that, like previous American presidents, he will only consider a full lifting of the embargo once Cuba's communist government makes significant moves such as the holding of democratic elections. Cuba's President Raul Castro has said he is prepared to negotiate with the new US administration, providing there are no preconditions. A step in the right direction...... +http://news.bbc.co.uk/1/hi/world/americas/7997063.stm", 
        "reply": " It's about time! \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_6930006022001", 
        "time": "2009-04-13 10:28:00", 
        "title": "Obama 'to lift Cuba restrictions'", 
        "userID": "jack_flats"
    }, 
    {
        "content": "Great, the Cold War is over. We've been doing buisness with Russia, China, Vietnam, and other countries for a long time now. Cuba is a close neighbor and I look forward to the time when I can take a vacation there.", 
        "intTime": 20090413, 
        "postID": 23, 
        "quote": "", 
        "reply": "Great, the Cold War is over. We've been doing buisness with Russia, China, Vietnam, and other countries for a long time now. Cuba is a close neighbor and I look forward to the time when I can take a vacation there.", 
        "threadID": "672198221_6930006022001", 
        "time": "2009-04-13 10:32:00", 
        "title": "Obama 'to lift Cuba restrictions'", 
        "userID": "foxred03"
    }, 
    {
        "content": "The embargo and restrictions have probably outlived their usefullness. Does anyone know what this will mean for Cubans coming to then US? Are we going to have a repeat of the Mariel Boatlift or some other mad exodus from Cuba? Or is this just to ease conditions between families? Havana as a cruise port. I could do that.", 
        "intTime": 20090413, 
        "postID": 24, 
        "quote": "", 
        "reply": "The embargo and restrictions have probably outlived their usefullness. Does anyone know what this will mean for Cubans coming to then US? Are we going to have a repeat of the Mariel Boatlift or some other mad exodus from Cuba? Or is this just to ease conditions between families? Havana as a cruise port. I could do that.", 
        "threadID": "672198221_6930006022001", 
        "time": "2009-04-13 10:39:00", 
        "title": "Obama 'to lift Cuba restrictions'", 
        "userID": "sw614"
    }, 
    {
        "content": "You can bet some of the old goats (Cuban ex-pats) in Miami aren't going to be happy with this", 
        "intTime": 20090413, 
        "postID": 25, 
        "quote": "", 
        "reply": "You can bet some of the old goats (Cuban ex-pats) in Miami aren't going to be happy with this", 
        "threadID": "672198221_6930006022001", 
        "time": "2009-04-13 10:40:00", 
        "title": "Obama 'to lift Cuba restrictions'", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: You can bet some of the old goats (Cuban ex-pats) in Miami aren't going to be happy with this You are probably correct, but sooner or later it was bound to happen and I think now is a good time to start. I just do not want veryone in Cuba thinking they can \"come on down\".", 
        "intTime": 20090413, 
        "postID": 26, 
        "quote": "Originally posted by PhoenixDark: You can bet some of the old goats (Cuban ex-pats) in Miami aren't going to be happy with this", 
        "reply": " You are probably correct, but sooner or later it was bound to happen and I think now is a good time to start. I just do not want veryone in Cuba thinking they can \"come on down\".", 
        "threadID": "672198221_6930006022001", 
        "time": "2009-04-13 10:55:00", 
        "title": "Obama 'to lift Cuba restrictions'", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by sw614: I just do not want veryone in Cuba thinking they can \"come on down\". I welcome this move, I think it's the right thing to do and applaud Obama's decision but, like you, I agree that it does not lay out the welcome mat.", 
        "intTime": 20090413, 
        "postID": 27, 
        "quote": "Originally posted by sw614: I just do not want veryone in Cuba thinking they can \"come on down\".", 
        "reply": " I welcome this move, I think it's the right thing to do and applaud Obama's decision but, like you, I agree that it does not lay out the welcome mat.", 
        "threadID": "672198221_6930006022001", 
        "time": "2009-04-13 12:29:00", 
        "title": "Obama 'to lift Cuba restrictions'", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by NSNN: quote: US President Barack Obama is to lift some restrictions that will allow Cuban Americans to travel more freely to Cuba, White House sources say. Cuban-Americans will also be allowed to send more money to relatives in Cuba. The move, to be officially announced later on Monday, comes after Mr Obama last month signed a spending bill easing some economic sanctions on Cuba. \"Restrictions on the families will be lifted,\" an unnamed White House official told news agency AFP. The Associated Press quoted an unnamed \"senior administration official\" as saying that President Obama had directed his administration to allow unlimited travel and money transfers by Cuban Americans to family in Cuba. President Obama has indicated he would be open to dialogue with Cuba's leaders. But he has said that, like previous American presidents, he will only consider a full lifting of the embargo once Cuba's communist government makes significant moves such as the holding of democratic elections. Cuba's President Raul Castro has said he is prepared to negotiate with the new US administration, providing there are no preconditions. A step in the right direction...... +http://news.bbc.co.uk/1/hi/world/americas/7997063.stm A step in the left direction. I really dont have a real problem with it, but wait and see if Obama tries a Jimmah and give Gitmo to cuba.", 
        "intTime": 20090413, 
        "postID": 28, 
        "quote": "Originally posted by NSNN: quote: US President Barack Obama is to lift some restrictions that will allow Cuban Americans to travel more freely to Cuba, White House sources say. Cuban-Americans will also be allowed to send more money to relatives in Cuba. The move, to be officially announced later on Monday, comes after Mr Obama last month signed a spending bill easing some economic sanctions on Cuba. \"Restrictions on the families will be lifted,\" an unnamed White House official told news agency AFP. The Associated Press quoted an unnamed \"senior administration official\" as saying that President Obama had directed his administration to allow unlimited travel and money transfers by Cuban Americans to family in Cuba. President Obama has indicated he would be open to dialogue with Cuba's leaders. But he has said that, like previous American presidents, he will only consider a full lifting of the embargo once Cuba's communist government makes significant moves such as the holding of democratic elections. Cuba's President Raul Castro has said he is prepared to negotiate with the new US administration, providing there are no preconditions. A step in the right direction...... +http://news.bbc.co.uk/1/hi/world/americas/7997063.stm", 
        "reply": " A step in the left direction. I really dont have a real problem with it, but wait and see if Obama tries a Jimmah and give Gitmo to cuba.", 
        "threadID": "672198221_6930006022001", 
        "time": "2009-04-13 12:33:00", 
        "title": "Obama 'to lift Cuba restrictions'", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: I really dont have a real problem with it, but wait and see if Obama tries a Jimmah and give Gitmo to cuba. [/b] GITMO was already on the chopping block and was going to go back to Cuba prior to 9/11! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090413, 
        "postID": 29, 
        "quote": "Originally posted by GunnyRet03: I really dont have a real problem with it, but wait and see if Obama tries a Jimmah and give Gitmo to cuba. [/b]", 
        "reply": " GITMO was already on the chopping block and was going to go back to Cuba prior to 9/11! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_6930006022001", 
        "time": "2009-04-13 13:54:00", 
        "title": "Obama 'to lift Cuba restrictions'", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by SignalSgtWilliams: quote: Originally posted by sw614: I just do not want veryone in Cuba thinking they can \"come on down\". I welcome this move, I think it's the right thing to do and applaud Obama's decision but, like you, I agree that it does not lay out the welcome mat. My suspision is that the flood will be in the other direction...rum...cigars...and what happens in Havana stays in Havana.", 
        "intTime": 20090413, 
        "postID": 30, 
        "quote": "Originally posted by SignalSgtWilliams: quote: Originally posted by sw614: I just do not want veryone in Cuba thinking they can \"come on down\". I welcome this move, I think it's the right thing to do and applaud Obama's decision but, like you, I agree that it does not lay out the welcome mat.", 
        "reply": " My suspision is that the flood will be in the other direction...rum...cigars...and what happens in Havana stays in Havana.", 
        "threadID": "672198221_6930006022001", 
        "time": "2009-04-13 14:05:00", 
        "title": "Obama 'to lift Cuba restrictions'", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by Ol_Doc: quote: Originally posted by SignalSgtWilliams: quote: Originally posted by sw614: I just do not want veryone in Cuba thinking they can \"come on down\". I welcome this move, I think it's the right thing to do and applaud Obama's decision but, like you, I agree that it does not lay out the welcome mat. My suspision is that the flood will be in the other direction...rum...cigars...and what happens in Havana stays in Havana. I wish I could get my hands on some of the (well preserved) classic cars they got down there, and bring them back to the States......cha ching!!! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090413, 
        "postID": 31, 
        "quote": "Originally posted by Ol_Doc: quote: Originally posted by SignalSgtWilliams: quote: Originally posted by sw614: I just do not want veryone in Cuba thinking they can \"come on down\". I welcome this move, I think it's the right thing to do and applaud Obama's decision but, like you, I agree that it does not lay out the welcome mat. My suspision is that the flood will be in the other direction...rum...cigars...and what happens in Havana stays in Havana.", 
        "reply": " I wish I could get my hands on some of the (well preserved) classic cars they got down there, and bring them back to the States......cha ching!!! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_6930006022001", 
        "time": "2009-04-13 14:07:00", 
        "title": "Obama 'to lift Cuba restrictions'", 
        "userID": "NSNN"
    }, 
    {
        "content": "I support this decision only because it makes no since to be great trading partners with one commie nation and not the other. Of course the right supports this decision because it will be another country we can out out source jobs too. Thus, preventing \"protectionism\" and adds another piece to the NWO Global Economy and lost Sovereignty as a nation. Yep were steering in the right direction alright, but again I do not blame Obama for this. It has been in the works way to long and it is what the mighty elite rich republicans that dominated the world want and with the power of money they have, are going to get.", 
        "intTime": 20090413, 
        "postID": 32, 
        "quote": "", 
        "reply": "I support this decision only because it makes no since to be great trading partners with one commie nation and not the other. Of course the right supports this decision because it will be another country we can out out source jobs too. Thus, preventing \"protectionism\" and adds another piece to the NWO Global Economy and lost Sovereignty as a nation. Yep were steering in the right direction alright, but again I do not blame Obama for this. It has been in the works way to long and it is what the mighty elite rich republicans that dominated the world want and with the power of money they have, are going to get.", 
        "threadID": "672198221_6930006022001", 
        "time": "2009-04-13 14:15:00", 
        "title": "Obama 'to lift Cuba restrictions'", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by Ol_Doc: quote: Originally posted by SignalSgtWilliams: quote: Originally posted by sw614: I just do not want veryone in Cuba thinking they can \"come on down\". I welcome this move, I think it's the right thing to do and applaud Obama's decision but, like you, I agree that it does not lay out the welcome mat. My suspision is that the flood will be in the other direction...rum...cigars...and what happens in Havana stays in Havana. I'd love to go to Cooba to photograph all the colonial history. Have a Rum and smoke a Cooban sitting in the garden of Ernest Hemmingway's house.", 
        "intTime": 20090413, 
        "postID": 33, 
        "quote": "Originally posted by Ol_Doc: quote: Originally posted by SignalSgtWilliams: quote: Originally posted by sw614: I just do not want veryone in Cuba thinking they can \"come on down\". I welcome this move, I think it's the right thing to do and applaud Obama's decision but, like you, I agree that it does not lay out the welcome mat. My suspision is that the flood will be in the other direction...rum...cigars...and what happens in Havana stays in Havana.", 
        "reply": " I'd love to go to Cooba to photograph all the colonial history. Have a Rum and smoke a Cooban sitting in the garden of Ernest Hemmingway's house.", 
        "threadID": "672198221_6930006022001", 
        "time": "2009-04-13 14:35:00", 
        "title": "Obama 'to lift Cuba restrictions'", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: You can bet some of the old goats (Cuban ex-pats) in Miami aren't going to be happy with this The votes for the Repub party and donations to the Repubs by the Cuban ex-pats is the only reason the embargo and restrictions were not removed years ago. Now all that has to be done is get rid of the US law about Cuban property ownership. As bad as the Communist were the government of and Batista was worse and anyone that had property under that regime probably belonged to families that stole it in the first place.", 
        "intTime": 20090413, 
        "postID": 34, 
        "quote": "Originally posted by PhoenixDark: You can bet some of the old goats (Cuban ex-pats) in Miami aren't going to be happy with this", 
        "reply": " The votes for the Repub party and donations to the Repubs by the Cuban ex-pats is the only reason the embargo and restrictions were not removed years ago. Now all that has to be done is get rid of the US law about Cuban property ownership. As bad as the Communist were the government of and Batista was worse and anyone that had property under that regime probably belonged to families that stole it in the first place.", 
        "threadID": "672198221_6930006022001", 
        "time": "2009-04-13 15:50:00", 
        "title": "Obama 'to lift Cuba restrictions'", 
        "userID": "rayld2"
    }, 
    {
        "content": "This is well past time. Also it should make all of the cruise lines very happy to soon be able to add another port to the crowed Caribbean itinerary.", 
        "intTime": 20090413, 
        "postID": 35, 
        "quote": "", 
        "reply": "This is well past time. Also it should make all of the cruise lines very happy to soon be able to add another port to the crowed Caribbean itinerary.", 
        "threadID": "672198221_6930006022001", 
        "time": "2009-04-13 15:52:00", 
        "title": "Obama 'to lift Cuba restrictions'", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "quote: Originally posted by SignalSgtWilliams: quote: Originally posted by sw614: I just do not want veryone in Cuba thinking they can \"come on down\". I welcome this move, I think it's the right thing to do and applaud Obama's decision but, like you, I agree that it does not lay out the welcome mat. The welcome mat has been out for a long time since the Cubans are the only group that gets automatic political refugee status.", 
        "intTime": 20090413, 
        "postID": 36, 
        "quote": "Originally posted by SignalSgtWilliams: quote: Originally posted by sw614: I just do not want veryone in Cuba thinking they can \"come on down\". I welcome this move, I think it's the right thing to do and applaud Obama's decision but, like you, I agree that it does not lay out the welcome mat.", 
        "reply": " The welcome mat has been out for a long time since the Cubans are the only group that gets automatic political refugee status.", 
        "threadID": "672198221_6930006022001", 
        "time": "2009-04-13 15:53:00", 
        "title": "Obama 'to lift Cuba restrictions'", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by SignalSgtWilliams: quote: Originally posted by sw614: I just do not want veryone in Cuba thinking they can \"come on down\". I welcome this move, I think it's the right thing to do and applaud Obama's decision but, like you, I agree that it does not lay out the welcome mat. The welcome mat has been out for a long time since the Cubans are the only group that gets automatic political refugee status. For those that 'could' make it out. This is not what is being discussed, I'm talking an open door policy.", 
        "intTime": 20090413, 
        "postID": 37, 
        "quote": "Originally posted by rayld2: quote: Originally posted by SignalSgtWilliams: quote: Originally posted by sw614: I just do not want veryone in Cuba thinking they can \"come on down\". I welcome this move, I think it's the right thing to do and applaud Obama's decision but, like you, I agree that it does not lay out the welcome mat. The welcome mat has been out for a long time since the Cubans are the only group that gets automatic political refugee status.", 
        "reply": " For those that 'could' make it out. This is not what is being discussed, I'm talking an open door policy.", 
        "threadID": "672198221_6930006022001", 
        "time": "2009-04-13 16:33:00", 
        "title": "Obama 'to lift Cuba restrictions'", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "The soon to be \"unlimited travel\" involved is for Cuban Americans traveling TO Cuba to visit family members. It used to be once very three years. It does not open up Cuba for travel to an ordinary white guy American like me and it does not in any way shape or form \"authorize\" Cubans to travel to the US, so the same \"feet dry\" rules still apply to them.", 
        "intTime": 20090413, 
        "postID": 38, 
        "quote": "", 
        "reply": "The soon to be \"unlimited travel\" involved is for Cuban Americans traveling TO Cuba to visit family members. It used to be once very three years. It does not open up Cuba for travel to an ordinary white guy American like me and it does not in any way shape or form \"authorize\" Cubans to travel to the US, so the same \"feet dry\" rules still apply to them.", 
        "threadID": "672198221_6930006022001", 
        "time": "2009-04-13 16:43:00", 
        "title": "Obama 'to lift Cuba restrictions'", 
        "userID": "ETCPJ"
    }, 
    {
        "content": "quote: Originally posted by ETCPJ: The soon to be \"unlimited travel\" involved is for Cuban Americans traveling TO Cuba to visit family members. It used to be once very three years. It does not open up Cuba for travel to an ordinary white guy American like me and it does not in any way shape or form \"authorize\" Cubans to travel to the US, so the same \"feet dry\" rules still apply to them. A Bill is being introduced shortly to change that too.", 
        "intTime": 20090413, 
        "postID": 39, 
        "quote": "Originally posted by ETCPJ: The soon to be \"unlimited travel\" involved is for Cuban Americans traveling TO Cuba to visit family members. It used to be once very three years. It does not open up Cuba for travel to an ordinary white guy American like me and it does not in any way shape or form \"authorize\" Cubans to travel to the US, so the same \"feet dry\" rules still apply to them.", 
        "reply": " A Bill is being introduced shortly to change that too.", 
        "threadID": "672198221_6930006022001", 
        "time": "2009-04-13 16:55:00", 
        "title": "Obama 'to lift Cuba restrictions'", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "Hmm, better book a trip to Cuba before all the newly legalised American tourists arrive and strip the place bare.", 
        "intTime": 20090413, 
        "postID": 40, 
        "quote": "", 
        "reply": "Hmm, better book a trip to Cuba before all the newly legalised American tourists arrive and strip the place bare.", 
        "threadID": "672198221_6930006022001", 
        "time": "2009-04-13 16:58:00", 
        "title": "Obama 'to lift Cuba restrictions'", 
        "userID": "Bladensburg"
    }
]