[
    {
        "content": "\"http://www.politico.com/blogs/scorecard/0509/Specters_new_poll_numbers.html\" Republican's in Pennsylvania in bad shape, as they are in most of the country. Specter a sure bet to keep his seat in the Senate. Public not warming to GOP or their attacks. Think they would learn. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson",
        "intTime": 20090504,
        "postID": 1,
        "quote": "",
        "reply": "\"http://www.politico.com/blogs/scorecard/0509/Specters_new_poll_numbers.html\" Republican's in Pennsylvania in bad shape, as they are in most of the country. Specter a sure bet to keep his seat in the Senate. Public not warming to GOP or their attacks. Think they would learn. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson",
        "threadID": "672198221_9440094222001",
        "time": "2009-05-04 16:40:00",
        "title": "Spector Would Beat Toomey Handily in PA - Leads By a Mile!",
        "userID": "jack_flats"
    },
    {
        "content": "LOL, as a Dem he does, but he was losing as a republican. He wouldn't have won the primary and since no one else is running as Dem, geee. go figure. Skewed polls anyone? This message has been edited. Last edited by: L0A1, Wed 06 May 2009 09:12 AM Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin",
        "intTime": 20090504,
        "postID": 2,
        "quote": "",
        "reply": "LOL, as a Dem he does, but he was losing as a republican. He wouldn't have won the primary and since no one else is running as Dem, geee. go figure. Skewed polls anyone? This message has been edited. Last edited by: L0A1, Wed 06 May 2009 09:12 AM Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin",
        "threadID": "672198221_9440094222001",
        "time": "2009-05-04 16:43:00",
        "title": "Spector Would Beat Toomey Handily in PA - Leads By a Mile!",
        "userID": "L0A1"
    },
    {
        "content": "You forgot to talk about the part of the poll where if Tom Ridge runs against Specter it is almost a dead heat. Of course these numbers are before Tom Ridge has even announced that he is running or started campaigning.",
        "intTime": 20090504,
        "postID": 3,
        "quote": "",
        "reply": "You forgot to talk about the part of the poll where if Tom Ridge runs against Specter it is almost a dead heat. Of course these numbers are before Tom Ridge has even announced that he is running or started campaigning.",
        "threadID": "672198221_9440094222001",
        "time": "2009-05-04 18:18:00",
        "title": "Spector Would Beat Toomey Handily in PA - Leads By a Mile!",
        "userID": "stec74"
    },
    {
        "content": "Oh God, is the 2010 election crap starting already?!?!?!?!?!?",
        "intTime": 20090504,
        "postID": 4,
        "quote": "",
        "reply": "Oh God, is the 2010 election crap starting already?!?!?!?!?!?",
        "threadID": "672198221_9440094222001",
        "time": "2009-05-04 18:28:00",
        "title": "Spector Would Beat Toomey Handily in PA - Leads By a Mile!",
        "userID": "adminnco1"
    },
    {
        "content": "quote: Originally posted by L0A1: LOL, as a Dem he does, but he was losing as a republican. He wouldn't have one the primary and since no one else is running as Dem, geee. go figure. Skewed polls anyone? Reality check. Over 200,000 people dropped membership in the Pa Repub party. Isn't this a drop of about 15% in just a few years?",
        "intTime": 20090504,
        "postID": 5,
        "quote": "Originally posted by L0A1: LOL, as a Dem he does, but he was losing as a republican. He wouldn't have one the primary and since no one else is running as Dem, geee. go figure. Skewed polls anyone?",
        "reply": " Reality check. Over 200,000 people dropped membership in the Pa Repub party. Isn't this a drop of about 15% in just a few years?",
        "threadID": "672198221_9440094222001",
        "time": "2009-05-04 21:29:00",
        "title": "Spector Would Beat Toomey Handily in PA - Leads By a Mile!",
        "userID": "rayld2"
    },
    {
        "content": "quote: Originally posted by stec74: You forgot to talk about the part of the poll where if Tom Ridge runs against Specter it is almost a dead heat. Of course these numbers are before Tom Ridge has even announced that he is running or started campaigning. Tome Ridge? A Bush Administration offical? What's he going to do to get elected, do a bunch of phony red alerts like he did during to Bush-Kerry election? \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson",
        "intTime": 20090506,
        "postID": 6,
        "quote": "Originally posted by stec74: You forgot to talk about the part of the poll where if Tom Ridge runs against Specter it is almost a dead heat. Of course these numbers are before Tom Ridge has even announced that he is running or started campaigning.",
        "reply": " Tome Ridge? A Bush Administration offical? What's he going to do to get elected, do a bunch of phony red alerts like he did during to Bush-Kerry election? \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson",
        "threadID": "672198221_9440094222001",
        "time": "2009-05-06 05:50:00",
        "title": "Spector Would Beat Toomey Handily in PA - Leads By a Mile!",
        "userID": "jack_flats"
    },
    {
        "content": "quote: Originally posted by jack_flats: quote: Originally posted by stec74: You forgot to talk about the part of the poll where if Tom Ridge runs against Specter it is almost a dead heat. Of course these numbers are before Tom Ridge has even announced that he is running or started campaigning. Tome Ridge? A Bush Administration offical? What's he going to do to get elected, do a bunch of phony red alerts like he did during to Bush-Kerry election? BEFORE he joined the Bush admin he was a popular Governor. What is funny about him being suggested as the possible Repub candidate by some of the Pa Repub leadership that opposed Mr. Specter is that his positions on most issues are almost exactly the same as Mr. Specter's. The only major differences on the issues is on Civil rights and some national issue Mr. Ridge does not have much of a record on. This message has been edited. Last edited by: rayld2, Wed 06 May 2009 06:28 AM",
        "intTime": 20090506,
        "postID": 7,
        "quote": "Originally posted by jack_flats: quote: Originally posted by stec74: You forgot to talk about the part of the poll where if Tom Ridge runs against Specter it is almost a dead heat. Of course these numbers are before Tom Ridge has even announced that he is running or started campaigning. Tome Ridge? A Bush Administration offical? What's he going to do to get elected, do a bunch of phony red alerts like he did during to Bush-Kerry election?",
        "reply": " BEFORE he joined the Bush admin he was a popular Governor. What is funny about him being suggested as the possible Repub candidate by some of the Pa Repub leadership that opposed Mr. Specter is that his positions on most issues are almost exactly the same as Mr. Specter's. The only major differences on the issues is on Civil rights and some national issue Mr. Ridge does not have much of a record on. This message has been edited. Last edited by: rayld2, Wed 06 May 2009 06:28 AM",
        "threadID": "672198221_9440094222001",
        "time": "2009-05-06 06:09:00",
        "title": "Spector Would Beat Toomey Handily in PA - Leads By a Mile!",
        "userID": "rayld2"
    },
    {
        "content": "Public opinion polls this far out aren't very good tools for making predictions. \"The World's Finest\"",
        "intTime": 20090506,
        "postID": 8,
        "quote": "",
        "reply": "Public opinion polls this far out aren't very good tools for making predictions. \"The World's Finest\"",
        "threadID": "672198221_9440094222001",
        "time": "2009-05-06 06:24:00",
        "title": "Spector Would Beat Toomey Handily in PA - Leads By a Mile!",
        "userID": "Kegler300"
    },
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by jack_flats: quote: Originally posted by stec74: You forgot to talk about the part of the poll where if Tom Ridge runs against Specter it is almost a dead heat. Of course these numbers are before Tom Ridge has even announced that he is running or started campaigning. Tome Ridge? A Bush Administration offical? What's he going to do to get elected, do a bunch of phony red alerts like he did during to Bush-Kerry election? BEFORE he joined the Bush admin he was a popular Governor. What is funny about him being suggested as the possible Repub candidate by some of the Pa Repub leadership that opposed Mr. Specter is that his positions on most issues are almost exactly the same as Mr. Specter's. The only major differences on the issues is on Civil rights and some national issue Mr. Ridge does not have much of a record on. You aren't seeing the big picture. The Republican Party did not force Specter out, the voters did. There was such a backlash from his constituents over his yes votes on the \"stimulus bill\" and \"omnibus\" that he knew he would not be reelected as a Republican. That is why he switced parties, because as a Republican he wouldn't have made it out of the primaries. Before both votes Senator Specter's office received thousands of phone calls, emails, and letters telling him to vote no or his constituents would vote him out. He failed to listen to the people he represented and had to face the consequences. The Democrats can have him.",
        "intTime": 20090506,
        "postID": 9,
        "quote": "Originally posted by rayld2: quote: Originally posted by jack_flats: quote: Originally posted by stec74: You forgot to talk about the part of the poll where if Tom Ridge runs against Specter it is almost a dead heat. Of course these numbers are before Tom Ridge has even announced that he is running or started campaigning. Tome Ridge? A Bush Administration offical? What's he going to do to get elected, do a bunch of phony red alerts like he did during to Bush-Kerry election? BEFORE he joined the Bush admin he was a popular Governor. What is funny about him being suggested as the possible Repub candidate by some of the Pa Repub leadership that opposed Mr. Specter is that his positions on most issues are almost exactly the same as Mr. Specter's. The only major differences on the issues is on Civil rights and some national issue Mr. Ridge does not have much of a record on.",
        "reply": " You aren't seeing the big picture. The Republican Party did not force Specter out, the voters did. There was such a backlash from his constituents over his yes votes on the \"stimulus bill\" and \"omnibus\" that he knew he would not be reelected as a Republican. That is why he switced parties, because as a Republican he wouldn't have made it out of the primaries. Before both votes Senator Specter's office received thousands of phone calls, emails, and letters telling him to vote no or his constituents would vote him out. He failed to listen to the people he represented and had to face the consequences. The Democrats can have him.",
        "threadID": "672198221_9440094222001",
        "time": "2009-05-06 06:55:00",
        "title": "Spector Would Beat Toomey Handily in PA - Leads By a Mile!",
        "userID": "stec74"
    },
    {
        "content": "quote: Originally posted by stec74: quote: Originally posted by rayld2: quote: Originally posted by jack_flats: quote: Originally posted by stec74: You forgot to talk about the part of the poll where if Tom Ridge runs against Specter it is almost a dead heat. Of course these numbers are before Tom Ridge has even announced that he is running or started campaigning. Tome Ridge? A Bush Administration offical? What's he going to do to get elected, do a bunch of phony red alerts like he did during to Bush-Kerry election? BEFORE he joined the Bush admin he was a popular Governor. What is funny about him being suggested as the possible Repub candidate by some of the Pa Repub leadership that opposed Mr. Specter is that his positions on most issues are almost exactly the same as Mr. Specter's. The only major differences on the issues is on Civil rights and some national issue Mr. Ridge does not have much of a record on. You aren't seeing the big picture. The Republican Party did not force Specter out, the voters did. There was such a backlash from his constituents over his yes votes on the \"stimulus bill\" and \"omnibus\" that he knew he would not be reelected as a Republican. That is why he switced parties, because as a Republican he wouldn't have made it out of the primaries. Before both votes Senator Specter's office received thousands of phone calls, emails, and letters telling him to vote no or his constituents would vote him out. He failed to listen to the people he represented and had to face the consequences. The Democrats can have him. I suspect PA Dems won't keep him long. The problem with Spector switching to the Democratic Party is, in his heart he's still a Republican. If it walks like a duck and quacks like a duck...",
        "intTime": 20090506,
        "postID": 10,
        "quote": "Originally posted by stec74: quote: Originally posted by rayld2: quote: Originally posted by jack_flats: quote: Originally posted by stec74: You forgot to talk about the part of the poll where if Tom Ridge runs against Specter it is almost a dead heat. Of course these numbers are before Tom Ridge has even announced that he is running or started campaigning. Tome Ridge? A Bush Administration offical? What's he going to do to get elected, do a bunch of phony red alerts like he did during to Bush-Kerry election? BEFORE he joined the Bush admin he was a popular Governor. What is funny about him being suggested as the possible Repub candidate by some of the Pa Repub leadership that opposed Mr. Specter is that his positions on most issues are almost exactly the same as Mr. Specter's. The only major differences on the issues is on Civil rights and some national issue Mr. Ridge does not have much of a record on. You aren't seeing the big picture. The Republican Party did not force Specter out, the voters did. There was such a backlash from his constituents over his yes votes on the \"stimulus bill\" and \"omnibus\" that he knew he would not be reelected as a Republican. That is why he switced parties, because as a Republican he wouldn't have made it out of the primaries. Before both votes Senator Specter's office received thousands of phone calls, emails, and letters telling him to vote no or his constituents would vote him out. He failed to listen to the people he represented and had to face the consequences. The Democrats can have him.",
        "reply": " I suspect PA Dems won't keep him long. The problem with Spector switching to the Democratic Party is, in his heart he's still a Republican. If it walks like a duck and quacks like a duck...",
        "threadID": "672198221_9440094222001",
        "time": "2009-05-06 06:59:00",
        "title": "Spector Would Beat Toomey Handily in PA - Leads By a Mile!",
        "userID": "Ol_Doc"
    },
    {
        "content": "quote: Originally posted by stec74: quote: Originally posted by rayld2: quote: Originally posted by jack_flats: quote: Originally posted by stec74: You forgot to talk about the part of the poll where if Tom Ridge runs against Specter it is almost a dead heat. Of course these numbers are before Tom Ridge has even announced that he is running or started campaigning. Tome Ridge? A Bush Administration offical? What's he going to do to get elected, do a bunch of phony red alerts like he did during to Bush-Kerry election? BEFORE he joined the Bush admin he was a popular Governor. What is funny about him being suggested as the possible Repub candidate by some of the Pa Repub leadership that opposed Mr. Specter is that his positions on most issues are almost exactly the same as Mr. Specter's. The only major differences on the issues is on Civil rights and some national issue Mr. Ridge does not have much of a record on. You aren't seeing the big picture. The Republican Party did not force Specter out, the voters did. There was such a backlash from his constituents over his yes votes on the \"stimulus bill\" and \"omnibus\" that he knew he would not be reelected as a Republican. That is why he switced parties, because as a Republican he wouldn't have made it out of the primaries. Before both votes Senator Specter's office received thousands of phone calls, emails, and letters telling him to vote no or his constituents would vote him out. He failed to listen to the people he represented and had to face the consequences. The Democrats can have him. Actually it WAS NOT the voters. Most people believe that he would win the GENERAL election even against Toomey who the Repub PARTY leadership was running against him in the primaries they just thought he would lose the Repub primaries with the Pa party leadership opposing him and FUNDING Mr. Toomey. You seem to think that the ONLY constituents a candidate should pay attention to are those from his own party. Remember his voter support has always been Moderate Repubs, Independents and Moderate Demos NOT right wing Repubs and left wing Demos. It is the right wing Repubs who control the local Pa Repub organizations that have been fighting (and not voting for him) Specter for YEARS.",
        "intTime": 20090506,
        "postID": 11,
        "quote": "Originally posted by stec74: quote: Originally posted by rayld2: quote: Originally posted by jack_flats: quote: Originally posted by stec74: You forgot to talk about the part of the poll where if Tom Ridge runs against Specter it is almost a dead heat. Of course these numbers are before Tom Ridge has even announced that he is running or started campaigning. Tome Ridge? A Bush Administration offical? What's he going to do to get elected, do a bunch of phony red alerts like he did during to Bush-Kerry election? BEFORE he joined the Bush admin he was a popular Governor. What is funny about him being suggested as the possible Repub candidate by some of the Pa Repub leadership that opposed Mr. Specter is that his positions on most issues are almost exactly the same as Mr. Specter's. The only major differences on the issues is on Civil rights and some national issue Mr. Ridge does not have much of a record on. You aren't seeing the big picture. The Republican Party did not force Specter out, the voters did. There was such a backlash from his constituents over his yes votes on the \"stimulus bill\" and \"omnibus\" that he knew he would not be reelected as a Republican. That is why he switced parties, because as a Republican he wouldn't have made it out of the primaries. Before both votes Senator Specter's office received thousands of phone calls, emails, and letters telling him to vote no or his constituents would vote him out. He failed to listen to the people he represented and had to face the consequences. The Democrats can have him.",
        "reply": " Actually it WAS NOT the voters. Most people believe that he would win the GENERAL election even against Toomey who the Repub PARTY leadership was running against him in the primaries they just thought he would lose the Repub primaries with the Pa party leadership opposing him and FUNDING Mr. Toomey. You seem to think that the ONLY constituents a candidate should pay attention to are those from his own party. Remember his voter support has always been Moderate Repubs, Independents and Moderate Demos NOT right wing Repubs and left wing Demos. It is the right wing Repubs who control the local Pa Repub organizations that have been fighting (and not voting for him) Specter for YEARS.",
        "threadID": "672198221_9440094222001",
        "time": "2009-05-06 08:35:00",
        "title": "Spector Would Beat Toomey Handily in PA - Leads By a Mile!",
        "userID": "rayld2"
    },
    {
        "content": "quote: Originally posted by Ol_Doc: -snip-I suspect PA Dems won't keep him long. The problem with Spector switching to the Democratic Party is, in his heart he's still a Republican. If it walks like a duck and quacks like a duck... I don't like Specter BUT he has had significant Demo support for years. He has been winning elections with support from Moderate Repubs (a lot of whom have recent left the Pa. Repub party), Independents and Moderate Demos. Personally I think that if Pa. law did not make it almost impossible to run for a statewide office as an Independent Mr. Specter would have preferred running as an Independent like Mr. Lieberman did when he left the Demo party.",
        "intTime": 20090506,
        "postID": 12,
        "quote": "Originally posted by Ol_Doc: -snip-I suspect PA Dems won't keep him long. The problem with Spector switching to the Democratic Party is, in his heart he's still a Republican. If it walks like a duck and quacks like a duck...",
        "reply": " I don't like Specter BUT he has had significant Demo support for years. He has been winning elections with support from Moderate Repubs (a lot of whom have recent left the Pa. Repub party), Independents and Moderate Demos. Personally I think that if Pa. law did not make it almost impossible to run for a statewide office as an Independent Mr. Specter would have preferred running as an Independent like Mr. Lieberman did when he left the Demo party.",
        "threadID": "672198221_9440094222001",
        "time": "2009-05-06 08:45:00",
        "title": "Spector Would Beat Toomey Handily in PA - Leads By a Mile!",
        "userID": "rayld2"
    },
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by Ol_Doc: -snip-I suspect PA Dems won't keep him long. The problem with Spector switching to the Democratic Party is, in his heart he's still a Republican. If it walks like a duck and quacks like a duck... I don't like Specter BUT he has had significant Demo support for years. He has been winning elections with support from Moderate Repubs (a lot of whom have recent left the Pa. Repub party), Independents and Moderate Demos. Personally I think that if Pa. law did not make it almost impossible to run for a statewide office as an Independent Mr. Specter would have preferred running as an Independent like Mr. Lieberman did when he left the Demo party. I don't live in PA so my opinion means very little. IMHO it would at least been more honest of him to have run as an Independent. I also have a problem with the support he has received from the Democratic leadership. He offers nothing to the party beyond taking up a potential democratic seat.",
        "intTime": 20090506,
        "postID": 13,
        "quote": "Originally posted by rayld2: quote: Originally posted by Ol_Doc: -snip-I suspect PA Dems won't keep him long. The problem with Spector switching to the Democratic Party is, in his heart he's still a Republican. If it walks like a duck and quacks like a duck... I don't like Specter BUT he has had significant Demo support for years. He has been winning elections with support from Moderate Repubs (a lot of whom have recent left the Pa. Repub party), Independents and Moderate Demos. Personally I think that if Pa. law did not make it almost impossible to run for a statewide office as an Independent Mr. Specter would have preferred running as an Independent like Mr. Lieberman did when he left the Demo party.",
        "reply": " I don't live in PA so my opinion means very little. IMHO it would at least been more honest of him to have run as an Independent. I also have a problem with the support he has received from the Democratic leadership. He offers nothing to the party beyond taking up a potential democratic seat.",
        "threadID": "672198221_9440094222001",
        "time": "2009-05-06 09:00:00",
        "title": "Spector Would Beat Toomey Handily in PA - Leads By a Mile!",
        "userID": "Ol_Doc"
    },
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by L0A1: LOL, as a Dem he does, but he was losing as a republican. He wouldn't have one the primary and since no one else is running as Dem, geee. go figure. Skewed polls anyone? Reality check. Over 200,000 people dropped membership in the Pa Repub party. Isn't this a drop of about 15% in just a few years? That was just so they could vote for Obama, it's not an open primary state. I bet some of them vote Republican now. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin",
        "intTime": 20090506,
        "postID": 14,
        "quote": "Originally posted by rayld2: quote: Originally posted by L0A1: LOL, as a Dem he does, but he was losing as a republican. He wouldn't have one the primary and since no one else is running as Dem, geee. go figure. Skewed polls anyone? Reality check. Over 200,000 people dropped membership in the Pa Repub party. Isn't this a drop of about 15% in just a few years?",
        "reply": " That was just so they could vote for Obama, it's not an open primary state. I bet some of them vote Republican now. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin",
        "threadID": "672198221_9440094222001",
        "time": "2009-05-06 09:12:00",
        "title": "Spector Would Beat Toomey Handily in PA - Leads By a Mile!",
        "userID": "L0A1"
    },
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by rayld2: quote: Originally posted by L0A1: LOL, as a Dem he does, but he was losing as a republican. He wouldn't have one the primary and since no one else is running as Dem, geee. go figure. Skewed polls anyone? Reality check. Over 200,000 people dropped membership in the Pa Repub party. Isn't this a drop of about 15% in just a few years? That was just so they could vote for Obama, it's not an open primary state. I bet some of them vote Republican now. You do not have to be a member of the same party as the candidate for president in order to vote for him. what you are ignoring is this has been a long term trend. please note this graph was last updated in 2007 and the party has fallen further But just keep drinking the \"if we lean further right we will get the folks in the middle back koolaid -- Savage",
        "intTime": 20090506,
        "postID": 15,
        "quote": "Originally posted by L0A1: quote: Originally posted by rayld2: quote: Originally posted by L0A1: LOL, as a Dem he does, but he was losing as a republican. He wouldn't have one the primary and since no one else is running as Dem, geee. go figure. Skewed polls anyone? Reality check. Over 200,000 people dropped membership in the Pa Repub party. Isn't this a drop of about 15% in just a few years? That was just so they could vote for Obama, it's not an open primary state. I bet some of them vote Republican now.",
        "reply": " You do not have to be a member of the same party as the candidate for president in order to vote for him. what you are ignoring is this has been a long term trend. please note this graph was last updated in 2007 and the party has fallen further But just keep drinking the \"if we lean further right we will get the folks in the middle back koolaid -- Savage",
        "threadID": "672198221_9440094222001",
        "time": "2009-05-06 09:28:00",
        "title": "Spector Would Beat Toomey Handily in PA - Leads By a Mile!",
        "userID": "A_Savage"
    },
    {
        "content": "quote: The Democratic leader in the Senate promised Sen. Arlen Specter he would retain his seniority when he jumped from the Republican to the Democratic Party, Specter said on Wednesday, but faced \"pushback\" from other Democratic senators. Sen. Arlen Specter says Pennsylvania \"has a big interest\" in his seniority. The full Senate voted Tuesday to strip Specter of his seniority, dropping him to the bottom of the pile on every committee he sits on. The Senate action came on a resolution -- passed on a unanimous voice vote -- that set out committee assignments for the entire Senate. The saying \"rank has its privileges\" holds true in the U.S. Senate as in few other places. With seniority comes the ability to influence legislation. Specter has been citing his seniority on the powerful Appropriations Committee, the one that doles out money, as he hits the campaign trail as a Democrat. \"My senior position on appropriations has enabled me to bring a lot of jobs and a lot of federal funding to this state,\" Specter said at a town hall meeting on Monday. He repeatedly made a point of telling an auditorium filled with medical faculty and staff about the hundreds of millions of dollars he delivered to Pennsylvania, thanks to the power he's accumulated in his 29 years in the Senate. +http://www.cnn.com/2009/POLITICS/05/06/specter.seniority/index.html If he can no longer deliver the goods who knows what the voters will do.",
        "intTime": 20090506,
        "postID": 16,
        "quote": "The Democratic leader in the Senate promised Sen. Arlen Specter he would retain his seniority when he jumped from the Republican to the Democratic Party, Specter said on Wednesday, but faced \"pushback\" from other Democratic senators. Sen. Arlen Specter says Pennsylvania \"has a big interest\" in his seniority. The full Senate voted Tuesday to strip Specter of his seniority, dropping him to the bottom of the pile on every committee he sits on. The Senate action came on a resolution -- passed on a unanimous voice vote -- that set out committee assignments for the entire Senate. The saying \"rank has its privileges\" holds true in the U.S. Senate as in few other places. With seniority comes the ability to influence legislation. Specter has been citing his seniority on the powerful Appropriations Committee, the one that doles out money, as he hits the campaign trail as a Democrat. \"My senior position on appropriations has enabled me to bring a lot of jobs and a lot of federal funding to this state,\" Specter said at a town hall meeting on Monday. He repeatedly made a point of telling an auditorium filled with medical faculty and staff about the hundreds of millions of dollars he delivered to Pennsylvania, thanks to the power he's accumulated in his 29 years in the Senate.",
        "reply": " +http://www.cnn.com/2009/POLITICS/05/06/specter.seniority/index.html If he can no longer deliver the goods who knows what the voters will do.",
        "threadID": "672198221_9440094222001",
        "time": "2009-05-06 17:43:00",
        "title": "Spector Would Beat Toomey Handily in PA - Leads By a Mile!",
        "userID": "sgt_posty"
    },
    {
        "content": "quote: Originally posted by Ol_Doc: quote: Originally posted by rayld2: quote: Originally posted by Ol_Doc: -snip-I suspect PA Dems won't keep him long. The problem with Spector switching to the Democratic Party is, in his heart he's still a Republican. If it walks like a duck and quacks like a duck... I don't like Specter BUT he has had significant Demo support for years. He has been winning elections with support from Moderate Repubs (a lot of whom have recent left the Pa. Repub party), Independents and Moderate Demos. Personally I think that if Pa. law did not make it almost impossible to run for a statewide office as an Independent Mr. Specter would have preferred running as an Independent like Mr. Lieberman did when he left the Demo party. I don't live in PA so my opinion means very little. IMHO it would at least been more honest of him to have run as an Independent. I also have a problem with the support he has received from the Democratic leadership. He offers nothing to the party beyond taking up a potential democratic seat. The way the Repubs and Demos have written the election laws in Pa it is almost impossible to win an statewide race as an independent because as an Independent you would NOT be able to get on the ballots (legally t is possible but in practice it is impossible).",
        "intTime": 20090507,
        "postID": 17,
        "quote": "Originally posted by Ol_Doc: quote: Originally posted by rayld2: quote: Originally posted by Ol_Doc: -snip-I suspect PA Dems won't keep him long. The problem with Spector switching to the Democratic Party is, in his heart he's still a Republican. If it walks like a duck and quacks like a duck... I don't like Specter BUT he has had significant Demo support for years. He has been winning elections with support from Moderate Repubs (a lot of whom have recent left the Pa. Repub party), Independents and Moderate Demos. Personally I think that if Pa. law did not make it almost impossible to run for a statewide office as an Independent Mr. Specter would have preferred running as an Independent like Mr. Lieberman did when he left the Demo party. I don't live in PA so my opinion means very little. IMHO it would at least been more honest of him to have run as an Independent. I also have a problem with the support he has received from the Democratic leadership. He offers nothing to the party beyond taking up a potential democratic seat.",
        "reply": " The way the Repubs and Demos have written the election laws in Pa it is almost impossible to win an statewide race as an independent because as an Independent you would NOT be able to get on the ballots (legally t is possible but in practice it is impossible).",
        "threadID": "672198221_9440094222001",
        "time": "2009-05-07 06:06:00",
        "title": "Spector Would Beat Toomey Handily in PA - Leads By a Mile!",
        "userID": "rayld2"
    },
    {
        "content": "quote: Originally posted by sgt_posty: quote: The Democratic leader in the Senate promised Sen. Arlen Specter he would retain his seniority when he jumped from the Republican to the Democratic Party, Specter said on Wednesday, but faced \"pushback\" from other Democratic senators. Sen. Arlen Specter says Pennsylvania \"has a big interest\" in his seniority. The full Senate voted Tuesday to strip Specter of his seniority, dropping him to the bottom of the pile on every committee he sits on. The Senate action came on a resolution -- passed on a unanimous voice vote -- that set out committee assignments for the entire Senate. The saying \"rank has its privileges\" holds true in the U.S. Senate as in few other places. With seniority comes the ability to influence legislation. Specter has been citing his seniority on the powerful Appropriations Committee, the one that doles out money, as he hits the campaign trail as a Democrat. \"My senior position on appropriations has enabled me to bring a lot of jobs and a lot of federal funding to this state,\" Specter said at a town hall meeting on Monday. He repeatedly made a point of telling an auditorium filled with medical faculty and staff about the hundreds of millions of dollars he delivered to Pennsylvania, thanks to the power he's accumulated in his 29 years in the Senate. +http://www.cnn.com/2009/POLITICS/05/06/specter.seniority/index.html If he can no longer deliver the goods who knows what the voters will do. As long as the Repub party puts up someone like Mr. Toomey Mr. Specter will do well, even without seniority, because MOST of the people that voted for him were moderate Repubs, moderate Demos and Indpendents and these will not vote for Mr. Toomey. IF the Pa Repubs select Mr Ridge (a moderate Repub with a record similar to Mr. Specter's) THEN his losing the seniority might hurt him. This message has been edited. Last edited by: rayld2, Thu 07 May 2009 07:38 AM",
        "intTime": 20090507,
        "postID": 18,
        "quote": "Originally posted by sgt_posty: quote: The Democratic leader in the Senate promised Sen. Arlen Specter he would retain his seniority when he jumped from the Republican to the Democratic Party, Specter said on Wednesday, but faced \"pushback\" from other Democratic senators. Sen. Arlen Specter says Pennsylvania \"has a big interest\" in his seniority. The full Senate voted Tuesday to strip Specter of his seniority, dropping him to the bottom of the pile on every committee he sits on. The Senate action came on a resolution -- passed on a unanimous voice vote -- that set out committee assignments for the entire Senate. The saying \"rank has its privileges\" holds true in the U.S. Senate as in few other places. With seniority comes the ability to influence legislation. Specter has been citing his seniority on the powerful Appropriations Committee, the one that doles out money, as he hits the campaign trail as a Democrat. \"My senior position on appropriations has enabled me to bring a lot of jobs and a lot of federal funding to this state,\" Specter said at a town hall meeting on Monday. He repeatedly made a point of telling an auditorium filled with medical faculty and staff about the hundreds of millions of dollars he delivered to Pennsylvania, thanks to the power he's accumulated in his 29 years in the Senate. +http://www.cnn.com/2009/POLITICS/05/06/specter.seniority/index.html If he can no longer deliver the goods who knows what the voters will do.",
        "reply": " As long as the Repub party puts up someone like Mr. Toomey Mr. Specter will do well, even without seniority, because MOST of the people that voted for him were moderate Repubs, moderate Demos and Indpendents and these will not vote for Mr. Toomey. IF the Pa Repubs select Mr Ridge (a moderate Repub with a record similar to Mr. Specter's) THEN his losing the seniority might hurt him. This message has been edited. Last edited by: rayld2, Thu 07 May 2009 07:38 AM",
        "threadID": "672198221_9440094222001",
        "time": "2009-05-07 06:11:00",
        "title": "Spector Would Beat Toomey Handily in PA - Leads By a Mile!",
        "userID": "rayld2"
    },
    {
        "content": "quote: Originally posted by jack_flats: \"http://www.politico.com/blogs/scorecard/0509/Specters_new_poll_numbers.html\" Republican's in Pennsylvania in bad shape, as they are in most of the country. Specter a sure bet to keep his seat in the Senate. Public not warming to GOP or their attacks. Think they would learn. I don't know about the GOP being \"in trouble\" in \"most\" of the country. Down in the southeast, dems get whipped by a 65/35 popular vote margin. Doesn't sound like they're in trouble there. They also lead handily out west until you get to the west coast.",
        "intTime": 20090507,
        "postID": 19,
        "quote": "Originally posted by jack_flats: \"http://www.politico.com/blogs/scorecard/0509/Specters_new_poll_numbers.html\" Republican's in Pennsylvania in bad shape, as they are in most of the country. Specter a sure bet to keep his seat in the Senate. Public not warming to GOP or their attacks. Think they would learn.",
        "reply": " I don't know about the GOP being \"in trouble\" in \"most\" of the country. Down in the southeast, dems get whipped by a 65/35 popular vote margin. Doesn't sound like they're in trouble there. They also lead handily out west until you get to the west coast.",
        "threadID": "672198221_9440094222001",
        "time": "2009-05-07 08:14:00",
        "title": "Spector Would Beat Toomey Handily in PA - Leads By a Mile!",
        "userID": "jwr6"
    },
    {
        "content": "quote: Originally posted by A_Savage: quote: Originally posted by L0A1: quote: Originally posted by rayld2: quote: Originally posted by L0A1: LOL, as a Dem he does, but he was losing as a republican. He wouldn't have one the primary and since no one else is running as Dem, geee. go figure. Skewed polls anyone? Reality check. Over 200,000 people dropped membership in the Pa Repub party. Isn't this a drop of about 15% in just a few years? That was just so they could vote for Obama, it's not an open primary state. I bet some of them vote Republican now. You do not have to be a member of the same party as the candidate for president in order to vote for him. what you are ignoring is this has been a long term trend. please note this graph was last updated in 2007 and the party has fallen further But just keep drinking the \"if we lean further right we will get the folks in the middle back koolaid -- Savage I specified PRIMARIES. Not the general election. Big difference. If you do not understand why, I can't help you there. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin",
        "intTime": 20090507,
        "postID": 20,
        "quote": "Originally posted by A_Savage: quote: Originally posted by L0A1: quote: Originally posted by rayld2: quote: Originally posted by L0A1: LOL, as a Dem he does, but he was losing as a republican. He wouldn't have one the primary and since no one else is running as Dem, geee. go figure. Skewed polls anyone? Reality check. Over 200,000 people dropped membership in the Pa Repub party. Isn't this a drop of about 15% in just a few years? That was just so they could vote for Obama, it's not an open primary state. I bet some of them vote Republican now. You do not have to be a member of the same party as the candidate for president in order to vote for him. what you are ignoring is this has been a long term trend. please note this graph was last updated in 2007 and the party has fallen further But just keep drinking the \"if we lean further right we will get the folks in the middle back koolaid -- Savage",
        "reply": " I specified PRIMARIES. Not the general election. Big difference. If you do not understand why, I can't help you there. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin",
        "threadID": "672198221_9440094222001",
        "time": "2009-05-07 08:17:00",
        "title": "Spector Would Beat Toomey Handily in PA - Leads By a Mile!",
        "userID": "L0A1"
    },
    {
        "content": "\"http://www.politico.com/blogs/scorecard/0509/Specters_new_poll_numbers.html\" Republican's in Pennsylvania in bad shape, as they are in most of the country. Specter a sure bet to keep his seat in the Senate. Public not warming to GOP or their attacks. Think they would learn. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson",
        "intTime": 20090504,
        "postID": 21,
        "quote": "",
        "reply": "\"http://www.politico.com/blogs/scorecard/0509/Specters_new_poll_numbers.html\" Republican's in Pennsylvania in bad shape, as they are in most of the country. Specter a sure bet to keep his seat in the Senate. Public not warming to GOP or their attacks. Think they would learn. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson",
        "threadID": "672198221_9440094222001",
        "time": "2009-05-04 16:40:00",
        "title": "Spector Would Beat Toomey Handily in PA - Leads By a Mile!",
        "userID": "jack_flats"
    },
    {
        "content": "LOL, as a Dem he does, but he was losing as a republican. He wouldn't have won the primary and since no one else is running as Dem, geee. go figure. Skewed polls anyone? This message has been edited. Last edited by: L0A1, Wed 06 May 2009 09:12 AM Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin",
        "intTime": 20090504,
        "postID": 22,
        "quote": "",
        "reply": "LOL, as a Dem he does, but he was losing as a republican. He wouldn't have won the primary and since no one else is running as Dem, geee. go figure. Skewed polls anyone? This message has been edited. Last edited by: L0A1, Wed 06 May 2009 09:12 AM Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin",
        "threadID": "672198221_9440094222001",
        "time": "2009-05-04 16:43:00",
        "title": "Spector Would Beat Toomey Handily in PA - Leads By a Mile!",
        "userID": "L0A1"
    },
    {
        "content": "You forgot to talk about the part of the poll where if Tom Ridge runs against Specter it is almost a dead heat. Of course these numbers are before Tom Ridge has even announced that he is running or started campaigning.",
        "intTime": 20090504,
        "postID": 23,
        "quote": "",
        "reply": "You forgot to talk about the part of the poll where if Tom Ridge runs against Specter it is almost a dead heat. Of course these numbers are before Tom Ridge has even announced that he is running or started campaigning.",
        "threadID": "672198221_9440094222001",
        "time": "2009-05-04 18:18:00",
        "title": "Spector Would Beat Toomey Handily in PA - Leads By a Mile!",
        "userID": "stec74"
    },
    {
        "content": "Oh God, is the 2010 election crap starting already?!?!?!?!?!?",
        "intTime": 20090504,
        "postID": 24,
        "quote": "",
        "reply": "Oh God, is the 2010 election crap starting already?!?!?!?!?!?",
        "threadID": "672198221_9440094222001",
        "time": "2009-05-04 18:28:00",
        "title": "Spector Would Beat Toomey Handily in PA - Leads By a Mile!",
        "userID": "adminnco1"
    },
    {
        "content": "quote: Originally posted by L0A1: LOL, as a Dem he does, but he was losing as a republican. He wouldn't have one the primary and since no one else is running as Dem, geee. go figure. Skewed polls anyone? Reality check. Over 200,000 people dropped membership in the Pa Repub party. Isn't this a drop of about 15% in just a few years?",
        "intTime": 20090504,
        "postID": 25,
        "quote": "Originally posted by L0A1: LOL, as a Dem he does, but he was losing as a republican. He wouldn't have one the primary and since no one else is running as Dem, geee. go figure. Skewed polls anyone?",
        "reply": " Reality check. Over 200,000 people dropped membership in the Pa Repub party. Isn't this a drop of about 15% in just a few years?",
        "threadID": "672198221_9440094222001",
        "time": "2009-05-04 21:29:00",
        "title": "Spector Would Beat Toomey Handily in PA - Leads By a Mile!",
        "userID": "rayld2"
    },
    {
        "content": "quote: Originally posted by stec74: You forgot to talk about the part of the poll where if Tom Ridge runs against Specter it is almost a dead heat. Of course these numbers are before Tom Ridge has even announced that he is running or started campaigning. Tome Ridge? A Bush Administration offical? What's he going to do to get elected, do a bunch of phony red alerts like he did during to Bush-Kerry election? \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson",
        "intTime": 20090506,
        "postID": 26,
        "quote": "Originally posted by stec74: You forgot to talk about the part of the poll where if Tom Ridge runs against Specter it is almost a dead heat. Of course these numbers are before Tom Ridge has even announced that he is running or started campaigning.",
        "reply": " Tome Ridge? A Bush Administration offical? What's he going to do to get elected, do a bunch of phony red alerts like he did during to Bush-Kerry election? \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson",
        "threadID": "672198221_9440094222001",
        "time": "2009-05-06 05:50:00",
        "title": "Spector Would Beat Toomey Handily in PA - Leads By a Mile!",
        "userID": "jack_flats"
    },
    {
        "content": "quote: Originally posted by jack_flats: quote: Originally posted by stec74: You forgot to talk about the part of the poll where if Tom Ridge runs against Specter it is almost a dead heat. Of course these numbers are before Tom Ridge has even announced that he is running or started campaigning. Tome Ridge? A Bush Administration offical? What's he going to do to get elected, do a bunch of phony red alerts like he did during to Bush-Kerry election? BEFORE he joined the Bush admin he was a popular Governor. What is funny about him being suggested as the possible Repub candidate by some of the Pa Repub leadership that opposed Mr. Specter is that his positions on most issues are almost exactly the same as Mr. Specter's. The only major differences on the issues is on Civil rights and some national issue Mr. Ridge does not have much of a record on. This message has been edited. Last edited by: rayld2, Wed 06 May 2009 06:28 AM",
        "intTime": 20090506,
        "postID": 27,
        "quote": "Originally posted by jack_flats: quote: Originally posted by stec74: You forgot to talk about the part of the poll where if Tom Ridge runs against Specter it is almost a dead heat. Of course these numbers are before Tom Ridge has even announced that he is running or started campaigning. Tome Ridge? A Bush Administration offical? What's he going to do to get elected, do a bunch of phony red alerts like he did during to Bush-Kerry election?",
        "reply": " BEFORE he joined the Bush admin he was a popular Governor. What is funny about him being suggested as the possible Repub candidate by some of the Pa Repub leadership that opposed Mr. Specter is that his positions on most issues are almost exactly the same as Mr. Specter's. The only major differences on the issues is on Civil rights and some national issue Mr. Ridge does not have much of a record on. This message has been edited. Last edited by: rayld2, Wed 06 May 2009 06:28 AM",
        "threadID": "672198221_9440094222001",
        "time": "2009-05-06 06:09:00",
        "title": "Spector Would Beat Toomey Handily in PA - Leads By a Mile!",
        "userID": "rayld2"
    },
    {
        "content": "Public opinion polls this far out aren't very good tools for making predictions. \"The World's Finest\"",
        "intTime": 20090506,
        "postID": 28,
        "quote": "",
        "reply": "Public opinion polls this far out aren't very good tools for making predictions. \"The World's Finest\"",
        "threadID": "672198221_9440094222001",
        "time": "2009-05-06 06:24:00",
        "title": "Spector Would Beat Toomey Handily in PA - Leads By a Mile!",
        "userID": "Kegler300"
    },
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by jack_flats: quote: Originally posted by stec74: You forgot to talk about the part of the poll where if Tom Ridge runs against Specter it is almost a dead heat. Of course these numbers are before Tom Ridge has even announced that he is running or started campaigning. Tome Ridge? A Bush Administration offical? What's he going to do to get elected, do a bunch of phony red alerts like he did during to Bush-Kerry election? BEFORE he joined the Bush admin he was a popular Governor. What is funny about him being suggested as the possible Repub candidate by some of the Pa Repub leadership that opposed Mr. Specter is that his positions on most issues are almost exactly the same as Mr. Specter's. The only major differences on the issues is on Civil rights and some national issue Mr. Ridge does not have much of a record on. You aren't seeing the big picture. The Republican Party did not force Specter out, the voters did. There was such a backlash from his constituents over his yes votes on the \"stimulus bill\" and \"omnibus\" that he knew he would not be reelected as a Republican. That is why he switced parties, because as a Republican he wouldn't have made it out of the primaries. Before both votes Senator Specter's office received thousands of phone calls, emails, and letters telling him to vote no or his constituents would vote him out. He failed to listen to the people he represented and had to face the consequences. The Democrats can have him.",
        "intTime": 20090506,
        "postID": 29,
        "quote": "Originally posted by rayld2: quote: Originally posted by jack_flats: quote: Originally posted by stec74: You forgot to talk about the part of the poll where if Tom Ridge runs against Specter it is almost a dead heat. Of course these numbers are before Tom Ridge has even announced that he is running or started campaigning. Tome Ridge? A Bush Administration offical? What's he going to do to get elected, do a bunch of phony red alerts like he did during to Bush-Kerry election? BEFORE he joined the Bush admin he was a popular Governor. What is funny about him being suggested as the possible Repub candidate by some of the Pa Repub leadership that opposed Mr. Specter is that his positions on most issues are almost exactly the same as Mr. Specter's. The only major differences on the issues is on Civil rights and some national issue Mr. Ridge does not have much of a record on.",
        "reply": " You aren't seeing the big picture. The Republican Party did not force Specter out, the voters did. There was such a backlash from his constituents over his yes votes on the \"stimulus bill\" and \"omnibus\" that he knew he would not be reelected as a Republican. That is why he switced parties, because as a Republican he wouldn't have made it out of the primaries. Before both votes Senator Specter's office received thousands of phone calls, emails, and letters telling him to vote no or his constituents would vote him out. He failed to listen to the people he represented and had to face the consequences. The Democrats can have him.",
        "threadID": "672198221_9440094222001",
        "time": "2009-05-06 06:55:00",
        "title": "Spector Would Beat Toomey Handily in PA - Leads By a Mile!",
        "userID": "stec74"
    },
    {
        "content": "quote: Originally posted by stec74: quote: Originally posted by rayld2: quote: Originally posted by jack_flats: quote: Originally posted by stec74: You forgot to talk about the part of the poll where if Tom Ridge runs against Specter it is almost a dead heat. Of course these numbers are before Tom Ridge has even announced that he is running or started campaigning. Tome Ridge? A Bush Administration offical? What's he going to do to get elected, do a bunch of phony red alerts like he did during to Bush-Kerry election? BEFORE he joined the Bush admin he was a popular Governor. What is funny about him being suggested as the possible Repub candidate by some of the Pa Repub leadership that opposed Mr. Specter is that his positions on most issues are almost exactly the same as Mr. Specter's. The only major differences on the issues is on Civil rights and some national issue Mr. Ridge does not have much of a record on. You aren't seeing the big picture. The Republican Party did not force Specter out, the voters did. There was such a backlash from his constituents over his yes votes on the \"stimulus bill\" and \"omnibus\" that he knew he would not be reelected as a Republican. That is why he switced parties, because as a Republican he wouldn't have made it out of the primaries. Before both votes Senator Specter's office received thousands of phone calls, emails, and letters telling him to vote no or his constituents would vote him out. He failed to listen to the people he represented and had to face the consequences. The Democrats can have him. I suspect PA Dems won't keep him long. The problem with Spector switching to the Democratic Party is, in his heart he's still a Republican. If it walks like a duck and quacks like a duck...",
        "intTime": 20090506,
        "postID": 30,
        "quote": "Originally posted by stec74: quote: Originally posted by rayld2: quote: Originally posted by jack_flats: quote: Originally posted by stec74: You forgot to talk about the part of the poll where if Tom Ridge runs against Specter it is almost a dead heat. Of course these numbers are before Tom Ridge has even announced that he is running or started campaigning. Tome Ridge? A Bush Administration offical? What's he going to do to get elected, do a bunch of phony red alerts like he did during to Bush-Kerry election? BEFORE he joined the Bush admin he was a popular Governor. What is funny about him being suggested as the possible Repub candidate by some of the Pa Repub leadership that opposed Mr. Specter is that his positions on most issues are almost exactly the same as Mr. Specter's. The only major differences on the issues is on Civil rights and some national issue Mr. Ridge does not have much of a record on. You aren't seeing the big picture. The Republican Party did not force Specter out, the voters did. There was such a backlash from his constituents over his yes votes on the \"stimulus bill\" and \"omnibus\" that he knew he would not be reelected as a Republican. That is why he switced parties, because as a Republican he wouldn't have made it out of the primaries. Before both votes Senator Specter's office received thousands of phone calls, emails, and letters telling him to vote no or his constituents would vote him out. He failed to listen to the people he represented and had to face the consequences. The Democrats can have him.",
        "reply": " I suspect PA Dems won't keep him long. The problem with Spector switching to the Democratic Party is, in his heart he's still a Republican. If it walks like a duck and quacks like a duck...",
        "threadID": "672198221_9440094222001",
        "time": "2009-05-06 06:59:00",
        "title": "Spector Would Beat Toomey Handily in PA - Leads By a Mile!",
        "userID": "Ol_Doc"
    },
    {
        "content": "quote: Originally posted by stec74: quote: Originally posted by rayld2: quote: Originally posted by jack_flats: quote: Originally posted by stec74: You forgot to talk about the part of the poll where if Tom Ridge runs against Specter it is almost a dead heat. Of course these numbers are before Tom Ridge has even announced that he is running or started campaigning. Tome Ridge? A Bush Administration offical? What's he going to do to get elected, do a bunch of phony red alerts like he did during to Bush-Kerry election? BEFORE he joined the Bush admin he was a popular Governor. What is funny about him being suggested as the possible Repub candidate by some of the Pa Repub leadership that opposed Mr. Specter is that his positions on most issues are almost exactly the same as Mr. Specter's. The only major differences on the issues is on Civil rights and some national issue Mr. Ridge does not have much of a record on. You aren't seeing the big picture. The Republican Party did not force Specter out, the voters did. There was such a backlash from his constituents over his yes votes on the \"stimulus bill\" and \"omnibus\" that he knew he would not be reelected as a Republican. That is why he switced parties, because as a Republican he wouldn't have made it out of the primaries. Before both votes Senator Specter's office received thousands of phone calls, emails, and letters telling him to vote no or his constituents would vote him out. He failed to listen to the people he represented and had to face the consequences. The Democrats can have him. Actually it WAS NOT the voters. Most people believe that he would win the GENERAL election even against Toomey who the Repub PARTY leadership was running against him in the primaries they just thought he would lose the Repub primaries with the Pa party leadership opposing him and FUNDING Mr. Toomey. You seem to think that the ONLY constituents a candidate should pay attention to are those from his own party. Remember his voter support has always been Moderate Repubs, Independents and Moderate Demos NOT right wing Repubs and left wing Demos. It is the right wing Repubs who control the local Pa Repub organizations that have been fighting (and not voting for him) Specter for YEARS.",
        "intTime": 20090506,
        "postID": 31,
        "quote": "Originally posted by stec74: quote: Originally posted by rayld2: quote: Originally posted by jack_flats: quote: Originally posted by stec74: You forgot to talk about the part of the poll where if Tom Ridge runs against Specter it is almost a dead heat. Of course these numbers are before Tom Ridge has even announced that he is running or started campaigning. Tome Ridge? A Bush Administration offical? What's he going to do to get elected, do a bunch of phony red alerts like he did during to Bush-Kerry election? BEFORE he joined the Bush admin he was a popular Governor. What is funny about him being suggested as the possible Repub candidate by some of the Pa Repub leadership that opposed Mr. Specter is that his positions on most issues are almost exactly the same as Mr. Specter's. The only major differences on the issues is on Civil rights and some national issue Mr. Ridge does not have much of a record on. You aren't seeing the big picture. The Republican Party did not force Specter out, the voters did. There was such a backlash from his constituents over his yes votes on the \"stimulus bill\" and \"omnibus\" that he knew he would not be reelected as a Republican. That is why he switced parties, because as a Republican he wouldn't have made it out of the primaries. Before both votes Senator Specter's office received thousands of phone calls, emails, and letters telling him to vote no or his constituents would vote him out. He failed to listen to the people he represented and had to face the consequences. The Democrats can have him.",
        "reply": " Actually it WAS NOT the voters. Most people believe that he would win the GENERAL election even against Toomey who the Repub PARTY leadership was running against him in the primaries they just thought he would lose the Repub primaries with the Pa party leadership opposing him and FUNDING Mr. Toomey. You seem to think that the ONLY constituents a candidate should pay attention to are those from his own party. Remember his voter support has always been Moderate Repubs, Independents and Moderate Demos NOT right wing Repubs and left wing Demos. It is the right wing Repubs who control the local Pa Repub organizations that have been fighting (and not voting for him) Specter for YEARS.",
        "threadID": "672198221_9440094222001",
        "time": "2009-05-06 08:35:00",
        "title": "Spector Would Beat Toomey Handily in PA - Leads By a Mile!",
        "userID": "rayld2"
    },
    {
        "content": "quote: Originally posted by Ol_Doc: -snip-I suspect PA Dems won't keep him long. The problem with Spector switching to the Democratic Party is, in his heart he's still a Republican. If it walks like a duck and quacks like a duck... I don't like Specter BUT he has had significant Demo support for years. He has been winning elections with support from Moderate Repubs (a lot of whom have recent left the Pa. Repub party), Independents and Moderate Demos. Personally I think that if Pa. law did not make it almost impossible to run for a statewide office as an Independent Mr. Specter would have preferred running as an Independent like Mr. Lieberman did when he left the Demo party.",
        "intTime": 20090506,
        "postID": 32,
        "quote": "Originally posted by Ol_Doc: -snip-I suspect PA Dems won't keep him long. The problem with Spector switching to the Democratic Party is, in his heart he's still a Republican. If it walks like a duck and quacks like a duck...",
        "reply": " I don't like Specter BUT he has had significant Demo support for years. He has been winning elections with support from Moderate Repubs (a lot of whom have recent left the Pa. Repub party), Independents and Moderate Demos. Personally I think that if Pa. law did not make it almost impossible to run for a statewide office as an Independent Mr. Specter would have preferred running as an Independent like Mr. Lieberman did when he left the Demo party.",
        "threadID": "672198221_9440094222001",
        "time": "2009-05-06 08:45:00",
        "title": "Spector Would Beat Toomey Handily in PA - Leads By a Mile!",
        "userID": "rayld2"
    },
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by Ol_Doc: -snip-I suspect PA Dems won't keep him long. The problem with Spector switching to the Democratic Party is, in his heart he's still a Republican. If it walks like a duck and quacks like a duck... I don't like Specter BUT he has had significant Demo support for years. He has been winning elections with support from Moderate Repubs (a lot of whom have recent left the Pa. Repub party), Independents and Moderate Demos. Personally I think that if Pa. law did not make it almost impossible to run for a statewide office as an Independent Mr. Specter would have preferred running as an Independent like Mr. Lieberman did when he left the Demo party. I don't live in PA so my opinion means very little. IMHO it would at least been more honest of him to have run as an Independent. I also have a problem with the support he has received from the Democratic leadership. He offers nothing to the party beyond taking up a potential democratic seat.",
        "intTime": 20090506,
        "postID": 33,
        "quote": "Originally posted by rayld2: quote: Originally posted by Ol_Doc: -snip-I suspect PA Dems won't keep him long. The problem with Spector switching to the Democratic Party is, in his heart he's still a Republican. If it walks like a duck and quacks like a duck... I don't like Specter BUT he has had significant Demo support for years. He has been winning elections with support from Moderate Repubs (a lot of whom have recent left the Pa. Repub party), Independents and Moderate Demos. Personally I think that if Pa. law did not make it almost impossible to run for a statewide office as an Independent Mr. Specter would have preferred running as an Independent like Mr. Lieberman did when he left the Demo party.",
        "reply": " I don't live in PA so my opinion means very little. IMHO it would at least been more honest of him to have run as an Independent. I also have a problem with the support he has received from the Democratic leadership. He offers nothing to the party beyond taking up a potential democratic seat.",
        "threadID": "672198221_9440094222001",
        "time": "2009-05-06 09:00:00",
        "title": "Spector Would Beat Toomey Handily in PA - Leads By a Mile!",
        "userID": "Ol_Doc"
    },
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by L0A1: LOL, as a Dem he does, but he was losing as a republican. He wouldn't have one the primary and since no one else is running as Dem, geee. go figure. Skewed polls anyone? Reality check. Over 200,000 people dropped membership in the Pa Repub party. Isn't this a drop of about 15% in just a few years? That was just so they could vote for Obama, it's not an open primary state. I bet some of them vote Republican now. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin",
        "intTime": 20090506,
        "postID": 34,
        "quote": "Originally posted by rayld2: quote: Originally posted by L0A1: LOL, as a Dem he does, but he was losing as a republican. He wouldn't have one the primary and since no one else is running as Dem, geee. go figure. Skewed polls anyone? Reality check. Over 200,000 people dropped membership in the Pa Repub party. Isn't this a drop of about 15% in just a few years?",
        "reply": " That was just so they could vote for Obama, it's not an open primary state. I bet some of them vote Republican now. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin",
        "threadID": "672198221_9440094222001",
        "time": "2009-05-06 09:12:00",
        "title": "Spector Would Beat Toomey Handily in PA - Leads By a Mile!",
        "userID": "L0A1"
    },
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by rayld2: quote: Originally posted by L0A1: LOL, as a Dem he does, but he was losing as a republican. He wouldn't have one the primary and since no one else is running as Dem, geee. go figure. Skewed polls anyone? Reality check. Over 200,000 people dropped membership in the Pa Repub party. Isn't this a drop of about 15% in just a few years? That was just so they could vote for Obama, it's not an open primary state. I bet some of them vote Republican now. You do not have to be a member of the same party as the candidate for president in order to vote for him. what you are ignoring is this has been a long term trend. please note this graph was last updated in 2007 and the party has fallen further But just keep drinking the \"if we lean further right we will get the folks in the middle back koolaid -- Savage",
        "intTime": 20090506,
        "postID": 35,
        "quote": "Originally posted by L0A1: quote: Originally posted by rayld2: quote: Originally posted by L0A1: LOL, as a Dem he does, but he was losing as a republican. He wouldn't have one the primary and since no one else is running as Dem, geee. go figure. Skewed polls anyone? Reality check. Over 200,000 people dropped membership in the Pa Repub party. Isn't this a drop of about 15% in just a few years? That was just so they could vote for Obama, it's not an open primary state. I bet some of them vote Republican now.",
        "reply": " You do not have to be a member of the same party as the candidate for president in order to vote for him. what you are ignoring is this has been a long term trend. please note this graph was last updated in 2007 and the party has fallen further But just keep drinking the \"if we lean further right we will get the folks in the middle back koolaid -- Savage",
        "threadID": "672198221_9440094222001",
        "time": "2009-05-06 09:28:00",
        "title": "Spector Would Beat Toomey Handily in PA - Leads By a Mile!",
        "userID": "A_Savage"
    },
    {
        "content": "quote: The Democratic leader in the Senate promised Sen. Arlen Specter he would retain his seniority when he jumped from the Republican to the Democratic Party, Specter said on Wednesday, but faced \"pushback\" from other Democratic senators. Sen. Arlen Specter says Pennsylvania \"has a big interest\" in his seniority. The full Senate voted Tuesday to strip Specter of his seniority, dropping him to the bottom of the pile on every committee he sits on. The Senate action came on a resolution -- passed on a unanimous voice vote -- that set out committee assignments for the entire Senate. The saying \"rank has its privileges\" holds true in the U.S. Senate as in few other places. With seniority comes the ability to influence legislation. Specter has been citing his seniority on the powerful Appropriations Committee, the one that doles out money, as he hits the campaign trail as a Democrat. \"My senior position on appropriations has enabled me to bring a lot of jobs and a lot of federal funding to this state,\" Specter said at a town hall meeting on Monday. He repeatedly made a point of telling an auditorium filled with medical faculty and staff about the hundreds of millions of dollars he delivered to Pennsylvania, thanks to the power he's accumulated in his 29 years in the Senate. +http://www.cnn.com/2009/POLITICS/05/06/specter.seniority/index.html If he can no longer deliver the goods who knows what the voters will do.",
        "intTime": 20090506,
        "postID": 36,
        "quote": "The Democratic leader in the Senate promised Sen. Arlen Specter he would retain his seniority when he jumped from the Republican to the Democratic Party, Specter said on Wednesday, but faced \"pushback\" from other Democratic senators. Sen. Arlen Specter says Pennsylvania \"has a big interest\" in his seniority. The full Senate voted Tuesday to strip Specter of his seniority, dropping him to the bottom of the pile on every committee he sits on. The Senate action came on a resolution -- passed on a unanimous voice vote -- that set out committee assignments for the entire Senate. The saying \"rank has its privileges\" holds true in the U.S. Senate as in few other places. With seniority comes the ability to influence legislation. Specter has been citing his seniority on the powerful Appropriations Committee, the one that doles out money, as he hits the campaign trail as a Democrat. \"My senior position on appropriations has enabled me to bring a lot of jobs and a lot of federal funding to this state,\" Specter said at a town hall meeting on Monday. He repeatedly made a point of telling an auditorium filled with medical faculty and staff about the hundreds of millions of dollars he delivered to Pennsylvania, thanks to the power he's accumulated in his 29 years in the Senate.",
        "reply": " +http://www.cnn.com/2009/POLITICS/05/06/specter.seniority/index.html If he can no longer deliver the goods who knows what the voters will do.",
        "threadID": "672198221_9440094222001",
        "time": "2009-05-06 17:43:00",
        "title": "Spector Would Beat Toomey Handily in PA - Leads By a Mile!",
        "userID": "sgt_posty"
    },
    {
        "content": "quote: Originally posted by Ol_Doc: quote: Originally posted by rayld2: quote: Originally posted by Ol_Doc: -snip-I suspect PA Dems won't keep him long. The problem with Spector switching to the Democratic Party is, in his heart he's still a Republican. If it walks like a duck and quacks like a duck... I don't like Specter BUT he has had significant Demo support for years. He has been winning elections with support from Moderate Repubs (a lot of whom have recent left the Pa. Repub party), Independents and Moderate Demos. Personally I think that if Pa. law did not make it almost impossible to run for a statewide office as an Independent Mr. Specter would have preferred running as an Independent like Mr. Lieberman did when he left the Demo party. I don't live in PA so my opinion means very little. IMHO it would at least been more honest of him to have run as an Independent. I also have a problem with the support he has received from the Democratic leadership. He offers nothing to the party beyond taking up a potential democratic seat. The way the Repubs and Demos have written the election laws in Pa it is almost impossible to win an statewide race as an independent because as an Independent you would NOT be able to get on the ballots (legally t is possible but in practice it is impossible).",
        "intTime": 20090507,
        "postID": 37,
        "quote": "Originally posted by Ol_Doc: quote: Originally posted by rayld2: quote: Originally posted by Ol_Doc: -snip-I suspect PA Dems won't keep him long. The problem with Spector switching to the Democratic Party is, in his heart he's still a Republican. If it walks like a duck and quacks like a duck... I don't like Specter BUT he has had significant Demo support for years. He has been winning elections with support from Moderate Repubs (a lot of whom have recent left the Pa. Repub party), Independents and Moderate Demos. Personally I think that if Pa. law did not make it almost impossible to run for a statewide office as an Independent Mr. Specter would have preferred running as an Independent like Mr. Lieberman did when he left the Demo party. I don't live in PA so my opinion means very little. IMHO it would at least been more honest of him to have run as an Independent. I also have a problem with the support he has received from the Democratic leadership. He offers nothing to the party beyond taking up a potential democratic seat.",
        "reply": " The way the Repubs and Demos have written the election laws in Pa it is almost impossible to win an statewide race as an independent because as an Independent you would NOT be able to get on the ballots (legally t is possible but in practice it is impossible).",
        "threadID": "672198221_9440094222001",
        "time": "2009-05-07 06:06:00",
        "title": "Spector Would Beat Toomey Handily in PA - Leads By a Mile!",
        "userID": "rayld2"
    },
    {
        "content": "quote: Originally posted by sgt_posty: quote: The Democratic leader in the Senate promised Sen. Arlen Specter he would retain his seniority when he jumped from the Republican to the Democratic Party, Specter said on Wednesday, but faced \"pushback\" from other Democratic senators. Sen. Arlen Specter says Pennsylvania \"has a big interest\" in his seniority. The full Senate voted Tuesday to strip Specter of his seniority, dropping him to the bottom of the pile on every committee he sits on. The Senate action came on a resolution -- passed on a unanimous voice vote -- that set out committee assignments for the entire Senate. The saying \"rank has its privileges\" holds true in the U.S. Senate as in few other places. With seniority comes the ability to influence legislation. Specter has been citing his seniority on the powerful Appropriations Committee, the one that doles out money, as he hits the campaign trail as a Democrat. \"My senior position on appropriations has enabled me to bring a lot of jobs and a lot of federal funding to this state,\" Specter said at a town hall meeting on Monday. He repeatedly made a point of telling an auditorium filled with medical faculty and staff about the hundreds of millions of dollars he delivered to Pennsylvania, thanks to the power he's accumulated in his 29 years in the Senate. +http://www.cnn.com/2009/POLITICS/05/06/specter.seniority/index.html If he can no longer deliver the goods who knows what the voters will do. As long as the Repub party puts up someone like Mr. Toomey Mr. Specter will do well, even without seniority, because MOST of the people that voted for him were moderate Repubs, moderate Demos and Indpendents and these will not vote for Mr. Toomey. IF the Pa Repubs select Mr Ridge (a moderate Repub with a record similar to Mr. Specter's) THEN his losing the seniority might hurt him. This message has been edited. Last edited by: rayld2, Thu 07 May 2009 07:38 AM",
        "intTime": 20090507,
        "postID": 38,
        "quote": "Originally posted by sgt_posty: quote: The Democratic leader in the Senate promised Sen. Arlen Specter he would retain his seniority when he jumped from the Republican to the Democratic Party, Specter said on Wednesday, but faced \"pushback\" from other Democratic senators. Sen. Arlen Specter says Pennsylvania \"has a big interest\" in his seniority. The full Senate voted Tuesday to strip Specter of his seniority, dropping him to the bottom of the pile on every committee he sits on. The Senate action came on a resolution -- passed on a unanimous voice vote -- that set out committee assignments for the entire Senate. The saying \"rank has its privileges\" holds true in the U.S. Senate as in few other places. With seniority comes the ability to influence legislation. Specter has been citing his seniority on the powerful Appropriations Committee, the one that doles out money, as he hits the campaign trail as a Democrat. \"My senior position on appropriations has enabled me to bring a lot of jobs and a lot of federal funding to this state,\" Specter said at a town hall meeting on Monday. He repeatedly made a point of telling an auditorium filled with medical faculty and staff about the hundreds of millions of dollars he delivered to Pennsylvania, thanks to the power he's accumulated in his 29 years in the Senate. +http://www.cnn.com/2009/POLITICS/05/06/specter.seniority/index.html If he can no longer deliver the goods who knows what the voters will do.",
        "reply": " As long as the Repub party puts up someone like Mr. Toomey Mr. Specter will do well, even without seniority, because MOST of the people that voted for him were moderate Repubs, moderate Demos and Indpendents and these will not vote for Mr. Toomey. IF the Pa Repubs select Mr Ridge (a moderate Repub with a record similar to Mr. Specter's) THEN his losing the seniority might hurt him. This message has been edited. Last edited by: rayld2, Thu 07 May 2009 07:38 AM",
        "threadID": "672198221_9440094222001",
        "time": "2009-05-07 06:11:00",
        "title": "Spector Would Beat Toomey Handily in PA - Leads By a Mile!",
        "userID": "rayld2"
    },
    {
        "content": "quote: Originally posted by jack_flats: \"http://www.politico.com/blogs/scorecard/0509/Specters_new_poll_numbers.html\" Republican's in Pennsylvania in bad shape, as they are in most of the country. Specter a sure bet to keep his seat in the Senate. Public not warming to GOP or their attacks. Think they would learn. I don't know about the GOP being \"in trouble\" in \"most\" of the country. Down in the southeast, dems get whipped by a 65/35 popular vote margin. Doesn't sound like they're in trouble there. They also lead handily out west until you get to the west coast.",
        "intTime": 20090507,
        "postID": 39,
        "quote": "Originally posted by jack_flats: \"http://www.politico.com/blogs/scorecard/0509/Specters_new_poll_numbers.html\" Republican's in Pennsylvania in bad shape, as they are in most of the country. Specter a sure bet to keep his seat in the Senate. Public not warming to GOP or their attacks. Think they would learn.",
        "reply": " I don't know about the GOP being \"in trouble\" in \"most\" of the country. Down in the southeast, dems get whipped by a 65/35 popular vote margin. Doesn't sound like they're in trouble there. They also lead handily out west until you get to the west coast.",
        "threadID": "672198221_9440094222001",
        "time": "2009-05-07 08:14:00",
        "title": "Spector Would Beat Toomey Handily in PA - Leads By a Mile!",
        "userID": "jwr6"
    },
    {
        "content": "quote: Originally posted by A_Savage: quote: Originally posted by L0A1: quote: Originally posted by rayld2: quote: Originally posted by L0A1: LOL, as a Dem he does, but he was losing as a republican. He wouldn't have one the primary and since no one else is running as Dem, geee. go figure. Skewed polls anyone? Reality check. Over 200,000 people dropped membership in the Pa Repub party. Isn't this a drop of about 15% in just a few years? That was just so they could vote for Obama, it's not an open primary state. I bet some of them vote Republican now. You do not have to be a member of the same party as the candidate for president in order to vote for him. what you are ignoring is this has been a long term trend. please note this graph was last updated in 2007 and the party has fallen further But just keep drinking the \"if we lean further right we will get the folks in the middle back koolaid -- Savage I specified PRIMARIES. Not the general election. Big difference. If you do not understand why, I can't help you there. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin",
        "intTime": 20090507,
        "postID": 40,
        "quote": "Originally posted by A_Savage: quote: Originally posted by L0A1: quote: Originally posted by rayld2: quote: Originally posted by L0A1: LOL, as a Dem he does, but he was losing as a republican. He wouldn't have one the primary and since no one else is running as Dem, geee. go figure. Skewed polls anyone? Reality check. Over 200,000 people dropped membership in the Pa Repub party. Isn't this a drop of about 15% in just a few years? That was just so they could vote for Obama, it's not an open primary state. I bet some of them vote Republican now. You do not have to be a member of the same party as the candidate for president in order to vote for him. what you are ignoring is this has been a long term trend. please note this graph was last updated in 2007 and the party has fallen further But just keep drinking the \"if we lean further right we will get the folks in the middle back koolaid -- Savage",
        "reply": " I specified PRIMARIES. Not the general election. Big difference. If you do not understand why, I can't help you there. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin",
        "threadID": "672198221_9440094222001",
        "time": "2009-05-07 08:17:00",
        "title": "Spector Would Beat Toomey Handily in PA - Leads By a Mile!",
        "userID": "L0A1"
    }
]