[
    {
        "content": "President Bush created the theory of the Unitary Executive. That a President is not just an “executive,’ exercising the executive branch of government, but that the President, under his position as Commander in Chief, can determine what is and what is not Constitutional. While he did not invent the signing statement, under his administration more of them were used then by all previous Presidents combined. Essentially a “signing statement is on it’s face UnConstitutional. It is a veto of a Bill lawfully passed by Congress, but without the ability of Congress to override it. There is absolutely no provision in the Constitution for such defacto vetoes. Other aspects of power that Mr. Bush seized is the claim that the President can stop a CIvil suit against the government if it endangers National Security. Sounds reasonable on its face, but who determines if a suit endangers National Security? According to Mr. Bush, the President need merely say so, and without any proof whatsoever, the suit is stopped. These and many other aspects of the theory of the Unitary Executive became precedents. Well, Mr Obama has embraced almost all of this theory, although he doesn’t use the words - Who is he to declare that a bill is “unconstitutional?” Who is he to declare that a President need not even bother to prove a suit endangers our security? Are the Courts so loaded with Al Qaeda members that a Federal Judge is unfit to make that decision? quote: Democrats often criticized the Bush White House for its use of the presidential signing statement, a means by which the president can reject provisions of a bill he deems unconstitutional without vetoing the entire legislation. Now the approach is back. President Barack Obama, after signing into law a $410 billion budget bill on Wednesday, declared five provisions in the bill to be unconstitutional and non-binding, including one that would effectively restrict U.S. troop deployments under U.N. command and another aimed at preventing punishment of whistleblowers. The move came two days after Mr. Obama ordered a review of his predecessor's signing statements and said he would rein in the use of such declarations. \"We're having a repeat of what Democrats bitterly complained about under President Bush,\" said Sen. Arlen Specter (R, Pa.), who drafted legislation to nullify Mr. Bush's signing statements. He added that if Mr. Obama \"wants to pick a fight, Congress has plenty of authority to retaliate.\" “http://online.wsj.com/article/SB123688875576610955.html?mod=googlenews_wsj” To his credit, Arlen Specter attacked these ideas when the President was Bush, and continues to attack these ideas when the President is Obama. I should also add that one of Senator McCains campaign promises was to NEVER use a signing statement. It takes a very strong leader indeed to voluntarily give up a power, which is why these abuses SHOULD have been stopped when they first started - We have indeed created a Presidency which claims to be above the law. Only time will tell if the Democrats reveal themselves as supporters of the Constitution or willing grave diggers to our principles. Dave", 
        "intTime": 20090312, 
        "postID": 1, 
        "quote": "Democrats often criticized the Bush White House for its use of the presidential signing statement, a means by which the president can reject provisions of a bill he deems unconstitutional without vetoing the entire legislation. Now the approach is back. President Barack Obama, after signing into law a $410 billion budget bill on Wednesday, declared five provisions in the bill to be unconstitutional and non-binding, including one that would effectively restrict U.S. troop deployments under U.N. command and another aimed at preventing punishment of whistleblowers. The move came two days after Mr. Obama ordered a review of his predecessor's signing statements and said he would rein in the use of such declarations. \"We're having a repeat of what Democrats bitterly complained about under President Bush,\" said Sen. Arlen Specter (R, Pa.), who drafted legislation to nullify Mr. Bush's signing statements. He added that if Mr. Obama \"wants to pick a fight, Congress has plenty of authority to retaliate.\" “http://online.wsj.com/article/SB123688875576610955.html?mod=googlenews_wsj”", 
        "reply": "President Bush created the theory of the Unitary Executive. That a President is not just an “executive,’ exercising the executive branch of government, but that the President, under his position as Commander in Chief, can determine what is and what is not Constitutional. While he did not invent the signing statement, under his administration more of them were used then by all previous Presidents combined. Essentially a “signing statement is on it’s face UnConstitutional. It is a veto of a Bill lawfully passed by Congress, but without the ability of Congress to override it. There is absolutely no provision in the Constitution for such defacto vetoes. Other aspects of power that Mr. Bush seized is the claim that the President can stop a CIvil suit against the government if it endangers National Security. Sounds reasonable on its face, but who determines if a suit endangers National Security? According to Mr. Bush, the President need merely say so, and without any proof whatsoever, the suit is stopped. These and many other aspects of the theory of the Unitary Executive became precedents. Well, Mr Obama has embraced almost all of this theory, although he doesn’t use the words - Who is he to declare that a bill is “unconstitutional?” Who is he to declare that a President need not even bother to prove a suit endangers our security? Are the Courts so loaded with Al Qaeda members that a Federal Judge is unfit to make that decision?  To his credit, Arlen Specter attacked these ideas when the President was Bush, and continues to attack these ideas when the President is Obama. I should also add that one of Senator McCains campaign promises was to NEVER use a signing statement. It takes a very strong leader indeed to voluntarily give up a power, which is why these abuses SHOULD have been stopped when they first started - We have indeed created a Presidency which claims to be above the law. Only time will tell if the Democrats reveal themselves as supporters of the Constitution or willing grave diggers to our principles. Dave", 
        "threadID": "672198221_1940076712001", 
        "time": "2009-03-12 14:13:00", 
        "title": "The “Unitary Executive” is alive and well under Obama.", 
        "userID": "Grachus"
    }, 
    {
        "content": "then people wonder why some of us don't believe anything these politicians say. Change you can believe in my azz. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090312, 
        "postID": 2, 
        "quote": "", 
        "reply": "then people wonder why some of us don't believe anything these politicians say. Change you can believe in my azz. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_1940076712001", 
        "time": "2009-03-12 14:22:00", 
        "title": "The “Unitary Executive” is alive and well under Obama.", 
        "userID": "L0A1"
    }, 
    {
        "content": "Me thinks the only President I heard give up true power was George Washington. All others that followed were/are politicians", 
        "intTime": 20090312, 
        "postID": 3, 
        "quote": "", 
        "reply": "Me thinks the only President I heard give up true power was George Washington. All others that followed were/are politicians", 
        "threadID": "672198221_1940076712001", 
        "time": "2009-03-12 14:34:00", 
        "title": "The “Unitary Executive” is alive and well under Obama.", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by ACR26: Me thinks the only President I heard give up true power was George Washington. All others that followed were/are politicians It is possible to once and for all resolve this question in favor of the Constitution. I urge everyone to write their representative and Senator and tell them how important it is to roll back an all powerful executive. Republicans refused to do this while Mr. Bush was President, and they now can watch the use of these powers in the hands of a Democrat. I would guestimate that almost a majority of Democrats would support legislation ending signing statements, ending Executive Orders that infringe on the rights of the other two branches. If they are joined by at least some Republicans it may be possible to roll all this back. It's time for Conservatives, Republicans, Democrats and Liberals, who remember their oaths to protect the Constitution, to join hands in protecting it. Dave", 
        "intTime": 20090312, 
        "postID": 4, 
        "quote": "Originally posted by ACR26: Me thinks the only President I heard give up true power was George Washington. All others that followed were/are politicians", 
        "reply": " It is possible to once and for all resolve this question in favor of the Constitution. I urge everyone to write their representative and Senator and tell them how important it is to roll back an all powerful executive. Republicans refused to do this while Mr. Bush was President, and they now can watch the use of these powers in the hands of a Democrat. I would guestimate that almost a majority of Democrats would support legislation ending signing statements, ending Executive Orders that infringe on the rights of the other two branches. If they are joined by at least some Republicans it may be possible to roll all this back. It's time for Conservatives, Republicans, Democrats and Liberals, who remember their oaths to protect the Constitution, to join hands in protecting it. Dave", 
        "threadID": "672198221_1940076712001", 
        "time": "2009-03-12 15:40:00", 
        "title": "The “Unitary Executive” is alive and well under Obama.", 
        "userID": "Grachus"
    }
]