[
    {
        "content": "Now that the Obama administration has decided to scale back Stop-Loss, and has listened to veterans and scrapped the insurance plan, why don't some of you Obama haters come forward and say a kind word for the man?", 
        "intTime": 20090318, 
        "postID": 1, 
        "quote": "", 
        "reply": "Now that the Obama administration has decided to scale back Stop-Loss, and has listened to veterans and scrapped the insurance plan, why don't some of you Obama haters come forward and say a kind word for the man?", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 18:51:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "If you don't have anything nice to say about someone, then just let it be.", 
        "intTime": 20090318, 
        "postID": 2, 
        "quote": "", 
        "reply": "If you don't have anything nice to say about someone, then just let it be.", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 18:56:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "Navy_Grunt"
    }, 
    {
        "content": "quote: Originally posted by SteveDeHaven: Now that the Obama administration has decided to scale back Stop-Loss, and has listened to veterans and scrapped the insurance plan, why don't some of you Obama haters come forward and say a kind word for the man? I suspect what he listened to (on insurance), assuming he has changed his position, were Democratic senators such as Patty Murray who said if he sent such a proposal to them, it would be DOA. As to scaling back stop loss, DoD has been wanting to do that all along. The drawdown in Iraq coupled with a tanked economy (increased retention and enlistment) makes it possible.", 
        "intTime": 20090318, 
        "postID": 3, 
        "quote": "Originally posted by SteveDeHaven: Now that the Obama administration has decided to scale back Stop-Loss, and has listened to veterans and scrapped the insurance plan, why don't some of you Obama haters come forward and say a kind word for the man?", 
        "reply": " I suspect what he listened to (on insurance), assuming he has changed his position, were Democratic senators such as Patty Murray who said if he sent such a proposal to them, it would be DOA. As to scaling back stop loss, DoD has been wanting to do that all along. The drawdown in Iraq coupled with a tanked economy (increased retention and enlistment) makes it possible.", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:00:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Originally posted by Navy_Grunt: If you don't have anything nice to say about someone, then just let it be. Judging by that picture, it looks like you need to take your own advice.", 
        "intTime": 20090318, 
        "postID": 4, 
        "quote": "Originally posted by Navy_Grunt: If you don't have anything nice to say about someone, then just let it be.", 
        "reply": " Judging by that picture, it looks like you need to take your own advice.", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:00:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "quote: Originally posted by I_M_Qwerty: quote: Originally posted by SteveDeHaven: Now that the Obama administration has decided to scale back Stop-Loss, and has listened to veterans and scrapped the insurance plan, why don't some of you Obama haters come forward and say a kind word for the man? I suspect what he listened to (on insurance), assuming he has changed his position, were Democratic senators such as Patty Murray who said if he sent such a proposal to them, it would be DOA. No, according to the news article I read, he listend to Shinseki, head of the VA and himself a veteran.", 
        "intTime": 20090318, 
        "postID": 5, 
        "quote": "Originally posted by I_M_Qwerty: quote: Originally posted by SteveDeHaven: Now that the Obama administration has decided to scale back Stop-Loss, and has listened to veterans and scrapped the insurance plan, why don't some of you Obama haters come forward and say a kind word for the man? I suspect what he listened to (on insurance), assuming he has changed his position, were Democratic senators such as Patty Murray who said if he sent such a proposal to them, it would be DOA.", 
        "reply": " No, according to the news article I read, he listend to Shinseki, head of the VA and himself a veteran.", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:02:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "quote: Originally posted by SteveDeHaven: Now that the Obama administration has decided to scale back Stop-Loss, and has listened to veterans and scrapped the insurance plan, why don't some of you Obama haters come forward and say a kind word for the man? Problem is the Obama administration considered the insurance scam against vets as a viable option- reason enough not to trust him. I wonder what idiocy Barry will come up with tomorrow.", 
        "intTime": 20090318, 
        "postID": 6, 
        "quote": "Originally posted by SteveDeHaven: Now that the Obama administration has decided to scale back Stop-Loss, and has listened to veterans and scrapped the insurance plan, why don't some of you Obama haters come forward and say a kind word for the man?", 
        "reply": " Problem is the Obama administration considered the insurance scam against vets as a viable option- reason enough not to trust him. I wonder what idiocy Barry will come up with tomorrow.", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:02:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "MaddogK"
    }, 
    {
        "content": "quote: Originally posted by SteveDeHaven: quote: Originally posted by I_M_Qwerty: quote: Originally posted by SteveDeHaven: Now that the Obama administration has decided to scale back Stop-Loss, and has listened to veterans and scrapped the insurance plan, why don't some of you Obama haters come forward and say a kind word for the man? I suspect what he listened to (on insurance), assuming he has changed his position, were Democratic senators such as Patty Murray who said if he sent such a proposal to them, it would be DOA. No, according to the news article I read, he listend to Shinseki, head of the VA and himself a veteran. I can believe that ... Eric Shinseki is a good man and I wondered how he could be party to such a dumb proposal. Do you have a link to the article? If so, please post it in quotes (cold link). He apparently wasn't influenced by the American Legion and the other veterans' organizations he met with the other day.", 
        "intTime": 20090318, 
        "postID": 7, 
        "quote": "Originally posted by SteveDeHaven: quote: Originally posted by I_M_Qwerty: quote: Originally posted by SteveDeHaven: Now that the Obama administration has decided to scale back Stop-Loss, and has listened to veterans and scrapped the insurance plan, why don't some of you Obama haters come forward and say a kind word for the man? I suspect what he listened to (on insurance), assuming he has changed his position, were Democratic senators such as Patty Murray who said if he sent such a proposal to them, it would be DOA. No, according to the news article I read, he listend to Shinseki, head of the VA and himself a veteran.", 
        "reply": " I can believe that ... Eric Shinseki is a good man and I wondered how he could be party to such a dumb proposal. Do you have a link to the article? If so, please post it in quotes (cold link). He apparently wasn't influenced by the American Legion and the other veterans' organizations he met with the other day.", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:06:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Originally posted by SteveDeHaven: Now that the Obama administration has decided to scale back Stop-Loss, and has listened to veterans and scrapped the insurance plan, why don't some of you Obama haters come forward and say a kind word for the man? There is no reason to phrase a topic like this other that spread negativity. Instead of attacking others, simply point out the accomplishments of the President. I don't know what options there are to stop-loss other than bringing back the draft. And the insurance issue was definitly a misstep by the President. Still, I'm glad he changed course on that. Still, this is one money saving idea that never should have seen the light of day.", 
        "intTime": 20090318, 
        "postID": 8, 
        "quote": "Originally posted by SteveDeHaven: Now that the Obama administration has decided to scale back Stop-Loss, and has listened to veterans and scrapped the insurance plan, why don't some of you Obama haters come forward and say a kind word for the man?", 
        "reply": " There is no reason to phrase a topic like this other that spread negativity. Instead of attacking others, simply point out the accomplishments of the President. I don't know what options there are to stop-loss other than bringing back the draft. And the insurance issue was definitly a misstep by the President. Still, I'm glad he changed course on that. Still, this is one money saving idea that never should have seen the light of day.", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:17:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "Oh believe me I am being nice.", 
        "intTime": 20090318, 
        "postID": 9, 
        "quote": "", 
        "reply": "Oh believe me I am being nice.", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:19:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "Navy_Grunt"
    }, 
    {
        "content": "quote: Originally posted by I_M_Qwerty: I can believe that ... Eric Shinseki is a good man and I wondered how he could be party to such a dumb proposal. Do you have a link to the article? If so, please post it in quotes (cold link). He apparently wasn't influenced by the American Legion and the other veterans' organizations he met with the other day. I may have reported incorrectly. The article says Obama, Shinseki, and other administration officials met with 11 veterans groups. Still, it's the President listening to veterans. Here's the link, properly cooled off: foxnews(DOT)com/politics/first100days/2009/03/17/vets-group-blasts-obama-plan-private-insurance-pay-service-related-health-care/", 
        "intTime": 20090318, 
        "postID": 10, 
        "quote": "Originally posted by I_M_Qwerty: I can believe that ... Eric Shinseki is a good man and I wondered how he could be party to such a dumb proposal. Do you have a link to the article? If so, please post it in quotes (cold link). He apparently wasn't influenced by the American Legion and the other veterans' organizations he met with the other day.", 
        "reply": " I may have reported incorrectly. The article says Obama, Shinseki, and other administration officials met with 11 veterans groups. Still, it's the President listening to veterans. Here's the link, properly cooled off: foxnews(DOT)com/politics/first100days/2009/03/17/vets-group-blasts-obama-plan-private-insurance-pay-service-related-health-care/", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:24:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "quote: Originally posted by scooter_mech: There is no reason to phrase a topic like this other that spread negativity. Do you similarly chastise those who post ranting screeds against the President?", 
        "intTime": 20090318, 
        "postID": 11, 
        "quote": "Originally posted by scooter_mech: There is no reason to phrase a topic like this other that spread negativity.", 
        "reply": " Do you similarly chastise those who post ranting screeds against the President?", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:28:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "Right on, Navy Grunt! The Zombies were awesome with great tunes like \"She's Not There\", \"Time of the Season\", and \"Tell Her No.\" Rock on, Dude!", 
        "intTime": 20090318, 
        "postID": 12, 
        "quote": "", 
        "reply": "Right on, Navy Grunt! The Zombies were awesome with great tunes like \"She's Not There\", \"Time of the Season\", and \"Tell Her No.\" Rock on, Dude!", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:29:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "quote: Originally posted by MaddogK: Problem is the Obama administration considered the insurance scam against vets as a viable option- reason enough not to trust him. I wonder what idiocy Barry will come up with tomorrow. BINGO!!!!!!!!!!!!!! then, today and tomarrow. He showed his true colors with just the idiotic thought and it backfired. It might have even showed him that he is not in charge, the american people are. He tried Chitown politics and he loss.", 
        "intTime": 20090318, 
        "postID": 13, 
        "quote": "Originally posted by MaddogK: Problem is the Obama administration considered the insurance scam against vets as a viable option- reason enough not to trust him. I wonder what idiocy Barry will come up with tomorrow.", 
        "reply": " BINGO!!!!!!!!!!!!!! then, today and tomarrow. He showed his true colors with just the idiotic thought and it backfired. It might have even showed him that he is not in charge, the american people are. He tried Chitown politics and he loss.", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:30:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by SteveDeHaven: quote: Originally posted by scooter_mech: There is no reason to phrase a topic like this other that spread negativity. Do you similarly chastise those who post ranting screeds against the President? Yes, as a matter of fact I have. Particularly when he was first elected and the \"natering nabobs of negativity\"* were blasting away. * A Spiro T Agnew line...", 
        "intTime": 20090318, 
        "postID": 14, 
        "quote": "Originally posted by SteveDeHaven: quote: Originally posted by scooter_mech: There is no reason to phrase a topic like this other that spread negativity. Do you similarly chastise those who post ranting screeds against the President?", 
        "reply": " Yes, as a matter of fact I have. Particularly when he was first elected and the \"natering nabobs of negativity\"* were blasting away. * A Spiro T Agnew line...", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:34:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "quote: Originally posted by SteveDeHaven: quote: Originally posted by I_M_Qwerty: I can believe that ... Eric Shinseki is a good man and I wondered how he could be party to such a dumb proposal. Do you have a link to the article? If so, please post it in quotes (cold link). He apparently wasn't influenced by the American Legion and the other veterans' organizations he met with the other day. I may have reported incorrectly. The article says Obama, Shinseki, and other administration officials met with 11 veterans groups. Still, it's the President listening to veterans. Here's the link, properly cooled off: foxnews(DOT)com/politics/first100days/2009/03/17/vets-group-blasts-obama-plan-private-insurance-pay-service-related-health-care/ You may find this thread interesting: http://forums.military.com/eve/forums/a/tpc/f/672198221/m/5880040812001 It specifically addresses that meeting ... and the American Legion's response to it. So ... he has not backed off his proposal. That leaves stop loss ... and my comment on it stands.", 
        "intTime": 20090318, 
        "postID": 15, 
        "quote": "Originally posted by SteveDeHaven: quote: Originally posted by I_M_Qwerty: I can believe that ... Eric Shinseki is a good man and I wondered how he could be party to such a dumb proposal. Do you have a link to the article? If so, please post it in quotes (cold link). He apparently wasn't influenced by the American Legion and the other veterans' organizations he met with the other day. I may have reported incorrectly. The article says Obama, Shinseki, and other administration officials met with 11 veterans groups. Still, it's the President listening to veterans. Here's the link, properly cooled off: foxnews(DOT)com/politics/first100days/2009/03/17/vets-group-blasts-obama-plan-private-insurance-pay-service-related-health-care/", 
        "reply": " You may find this thread interesting: http://forums.military.com/eve/forums/a/tpc/f/672198221/m/5880040812001 It specifically addresses that meeting ... and the American Legion's response to it. So ... he has not backed off his proposal. That leaves stop loss ... and my comment on it stands.", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:39:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Originally posted by scooter_mech: quote: Originally posted by SteveDeHaven: Now that the Obama administration has decided to scale back Stop-Loss, and has listened to veterans and scrapped the insurance plan, why don't some of you Obama haters come forward and say a kind word for the man? There is no reason to phrase a topic like this other that spread negativity. . Maybe he likes \"rattling cages and upsetting applecarts\", after all, that's what's in his bio.", 
        "intTime": 20090318, 
        "postID": 16, 
        "quote": "Originally posted by scooter_mech: quote: Originally posted by SteveDeHaven: Now that the Obama administration has decided to scale back Stop-Loss, and has listened to veterans and scrapped the insurance plan, why don't some of you Obama haters come forward and say a kind word for the man? There is no reason to phrase a topic like this other that spread negativity. .", 
        "reply": " Maybe he likes \"rattling cages and upsetting applecarts\", after all, that's what's in his bio.", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:40:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "Well, I'm sorry for you that you won't be able to live in the Constitution-trampling Bush-Cheney police state, but you'll cope somehow. I heard all the same crap against President Clinton from all the right-wing-nuts. And you know what? The country survived. Fortunately, we also survived President Cheney Bush II. I know we're not going to come to a consensus today. All I can say is, wait 30-40 years, and see which Presidents still look good in hindsight. By the way, I don't consider myself a Democrat, and haven't since I voted for Reagan. But this anti-Obama sentiment that I keep seeing, both in print and in person, really bothers me. When I see it in person, I usually get a good dose of racism with it. Makes me wonder about what I see in print.", 
        "intTime": 20090318, 
        "postID": 17, 
        "quote": "", 
        "reply": "Well, I'm sorry for you that you won't be able to live in the Constitution-trampling Bush-Cheney police state, but you'll cope somehow. I heard all the same crap against President Clinton from all the right-wing-nuts. And you know what? The country survived. Fortunately, we also survived President Cheney Bush II. I know we're not going to come to a consensus today. All I can say is, wait 30-40 years, and see which Presidents still look good in hindsight. By the way, I don't consider myself a Democrat, and haven't since I voted for Reagan. But this anti-Obama sentiment that I keep seeing, both in print and in person, really bothers me. When I see it in person, I usually get a good dose of racism with it. Makes me wonder about what I see in print.", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:45:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "quote: Originally posted by I_M_Qwerty: You may find this thread interesting: http://forums.military.com/eve/forums/a/tpc/f/672198221/m/5880040812001 It specifically addresses that meeting ... and the American Legion's response to it. So ... he has not backed off his proposal. That leaves stop loss ... and my comment on it stands. I'm not sure what this proves. That item was posted 2 days ago, and Obama just today decided to abandon the plan. Was there something I missed?", 
        "intTime": 20090318, 
        "postID": 18, 
        "quote": "Originally posted by I_M_Qwerty: You may find this thread interesting: http://forums.military.com/eve/forums/a/tpc/f/672198221/m/5880040812001 It specifically addresses that meeting ... and the American Legion's response to it. So ... he has not backed off his proposal. That leaves stop loss ... and my comment on it stands.", 
        "reply": " I'm not sure what this proves. That item was posted 2 days ago, and Obama just today decided to abandon the plan. Was there something I missed?", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:57:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "quote: Where are the Obama haters now? Here... C.R.", 
        "intTime": 20090318, 
        "postID": 19, 
        "quote": "Where are the Obama haters now?", 
        "reply": " Here... C.R.", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 20:11:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "CYCLIC_RUNAWAY"
    }, 
    {
        "content": "Present", 
        "intTime": 20090318, 
        "postID": 20, 
        "quote": "", 
        "reply": "Present", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 20:16:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "BAGodbehere"
    }, 
    {
        "content": "Now that the Obama administration has decided to scale back Stop-Loss, and has listened to veterans and scrapped the insurance plan, why don't some of you Obama haters come forward and say a kind word for the man?", 
        "intTime": 20090318, 
        "postID": 21, 
        "quote": "", 
        "reply": "Now that the Obama administration has decided to scale back Stop-Loss, and has listened to veterans and scrapped the insurance plan, why don't some of you Obama haters come forward and say a kind word for the man?", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 18:51:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "If you don't have anything nice to say about someone, then just let it be.", 
        "intTime": 20090318, 
        "postID": 22, 
        "quote": "", 
        "reply": "If you don't have anything nice to say about someone, then just let it be.", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 18:56:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "Navy_Grunt"
    }, 
    {
        "content": "quote: Originally posted by SteveDeHaven: Now that the Obama administration has decided to scale back Stop-Loss, and has listened to veterans and scrapped the insurance plan, why don't some of you Obama haters come forward and say a kind word for the man? I suspect what he listened to (on insurance), assuming he has changed his position, were Democratic senators such as Patty Murray who said if he sent such a proposal to them, it would be DOA. As to scaling back stop loss, DoD has been wanting to do that all along. The drawdown in Iraq coupled with a tanked economy (increased retention and enlistment) makes it possible.", 
        "intTime": 20090318, 
        "postID": 23, 
        "quote": "Originally posted by SteveDeHaven: Now that the Obama administration has decided to scale back Stop-Loss, and has listened to veterans and scrapped the insurance plan, why don't some of you Obama haters come forward and say a kind word for the man?", 
        "reply": " I suspect what he listened to (on insurance), assuming he has changed his position, were Democratic senators such as Patty Murray who said if he sent such a proposal to them, it would be DOA. As to scaling back stop loss, DoD has been wanting to do that all along. The drawdown in Iraq coupled with a tanked economy (increased retention and enlistment) makes it possible.", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:00:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Originally posted by Navy_Grunt: If you don't have anything nice to say about someone, then just let it be. Judging by that picture, it looks like you need to take your own advice.", 
        "intTime": 20090318, 
        "postID": 24, 
        "quote": "Originally posted by Navy_Grunt: If you don't have anything nice to say about someone, then just let it be.", 
        "reply": " Judging by that picture, it looks like you need to take your own advice.", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:00:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "quote: Originally posted by I_M_Qwerty: quote: Originally posted by SteveDeHaven: Now that the Obama administration has decided to scale back Stop-Loss, and has listened to veterans and scrapped the insurance plan, why don't some of you Obama haters come forward and say a kind word for the man? I suspect what he listened to (on insurance), assuming he has changed his position, were Democratic senators such as Patty Murray who said if he sent such a proposal to them, it would be DOA. No, according to the news article I read, he listend to Shinseki, head of the VA and himself a veteran.", 
        "intTime": 20090318, 
        "postID": 25, 
        "quote": "Originally posted by I_M_Qwerty: quote: Originally posted by SteveDeHaven: Now that the Obama administration has decided to scale back Stop-Loss, and has listened to veterans and scrapped the insurance plan, why don't some of you Obama haters come forward and say a kind word for the man? I suspect what he listened to (on insurance), assuming he has changed his position, were Democratic senators such as Patty Murray who said if he sent such a proposal to them, it would be DOA.", 
        "reply": " No, according to the news article I read, he listend to Shinseki, head of the VA and himself a veteran.", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:02:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "quote: Originally posted by SteveDeHaven: Now that the Obama administration has decided to scale back Stop-Loss, and has listened to veterans and scrapped the insurance plan, why don't some of you Obama haters come forward and say a kind word for the man? Problem is the Obama administration considered the insurance scam against vets as a viable option- reason enough not to trust him. I wonder what idiocy Barry will come up with tomorrow.", 
        "intTime": 20090318, 
        "postID": 26, 
        "quote": "Originally posted by SteveDeHaven: Now that the Obama administration has decided to scale back Stop-Loss, and has listened to veterans and scrapped the insurance plan, why don't some of you Obama haters come forward and say a kind word for the man?", 
        "reply": " Problem is the Obama administration considered the insurance scam against vets as a viable option- reason enough not to trust him. I wonder what idiocy Barry will come up with tomorrow.", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:02:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "MaddogK"
    }, 
    {
        "content": "quote: Originally posted by SteveDeHaven: quote: Originally posted by I_M_Qwerty: quote: Originally posted by SteveDeHaven: Now that the Obama administration has decided to scale back Stop-Loss, and has listened to veterans and scrapped the insurance plan, why don't some of you Obama haters come forward and say a kind word for the man? I suspect what he listened to (on insurance), assuming he has changed his position, were Democratic senators such as Patty Murray who said if he sent such a proposal to them, it would be DOA. No, according to the news article I read, he listend to Shinseki, head of the VA and himself a veteran. I can believe that ... Eric Shinseki is a good man and I wondered how he could be party to such a dumb proposal. Do you have a link to the article? If so, please post it in quotes (cold link). He apparently wasn't influenced by the American Legion and the other veterans' organizations he met with the other day.", 
        "intTime": 20090318, 
        "postID": 27, 
        "quote": "Originally posted by SteveDeHaven: quote: Originally posted by I_M_Qwerty: quote: Originally posted by SteveDeHaven: Now that the Obama administration has decided to scale back Stop-Loss, and has listened to veterans and scrapped the insurance plan, why don't some of you Obama haters come forward and say a kind word for the man? I suspect what he listened to (on insurance), assuming he has changed his position, were Democratic senators such as Patty Murray who said if he sent such a proposal to them, it would be DOA. No, according to the news article I read, he listend to Shinseki, head of the VA and himself a veteran.", 
        "reply": " I can believe that ... Eric Shinseki is a good man and I wondered how he could be party to such a dumb proposal. Do you have a link to the article? If so, please post it in quotes (cold link). He apparently wasn't influenced by the American Legion and the other veterans' organizations he met with the other day.", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:06:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Originally posted by SteveDeHaven: Now that the Obama administration has decided to scale back Stop-Loss, and has listened to veterans and scrapped the insurance plan, why don't some of you Obama haters come forward and say a kind word for the man? There is no reason to phrase a topic like this other that spread negativity. Instead of attacking others, simply point out the accomplishments of the President. I don't know what options there are to stop-loss other than bringing back the draft. And the insurance issue was definitly a misstep by the President. Still, I'm glad he changed course on that. Still, this is one money saving idea that never should have seen the light of day.", 
        "intTime": 20090318, 
        "postID": 28, 
        "quote": "Originally posted by SteveDeHaven: Now that the Obama administration has decided to scale back Stop-Loss, and has listened to veterans and scrapped the insurance plan, why don't some of you Obama haters come forward and say a kind word for the man?", 
        "reply": " There is no reason to phrase a topic like this other that spread negativity. Instead of attacking others, simply point out the accomplishments of the President. I don't know what options there are to stop-loss other than bringing back the draft. And the insurance issue was definitly a misstep by the President. Still, I'm glad he changed course on that. Still, this is one money saving idea that never should have seen the light of day.", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:17:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "Oh believe me I am being nice.", 
        "intTime": 20090318, 
        "postID": 29, 
        "quote": "", 
        "reply": "Oh believe me I am being nice.", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:19:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "Navy_Grunt"
    }, 
    {
        "content": "quote: Originally posted by I_M_Qwerty: I can believe that ... Eric Shinseki is a good man and I wondered how he could be party to such a dumb proposal. Do you have a link to the article? If so, please post it in quotes (cold link). He apparently wasn't influenced by the American Legion and the other veterans' organizations he met with the other day. I may have reported incorrectly. The article says Obama, Shinseki, and other administration officials met with 11 veterans groups. Still, it's the President listening to veterans. Here's the link, properly cooled off: foxnews(DOT)com/politics/first100days/2009/03/17/vets-group-blasts-obama-plan-private-insurance-pay-service-related-health-care/", 
        "intTime": 20090318, 
        "postID": 30, 
        "quote": "Originally posted by I_M_Qwerty: I can believe that ... Eric Shinseki is a good man and I wondered how he could be party to such a dumb proposal. Do you have a link to the article? If so, please post it in quotes (cold link). He apparently wasn't influenced by the American Legion and the other veterans' organizations he met with the other day.", 
        "reply": " I may have reported incorrectly. The article says Obama, Shinseki, and other administration officials met with 11 veterans groups. Still, it's the President listening to veterans. Here's the link, properly cooled off: foxnews(DOT)com/politics/first100days/2009/03/17/vets-group-blasts-obama-plan-private-insurance-pay-service-related-health-care/", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:24:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "quote: Originally posted by scooter_mech: There is no reason to phrase a topic like this other that spread negativity. Do you similarly chastise those who post ranting screeds against the President?", 
        "intTime": 20090318, 
        "postID": 31, 
        "quote": "Originally posted by scooter_mech: There is no reason to phrase a topic like this other that spread negativity.", 
        "reply": " Do you similarly chastise those who post ranting screeds against the President?", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:28:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "Right on, Navy Grunt! The Zombies were awesome with great tunes like \"She's Not There\", \"Time of the Season\", and \"Tell Her No.\" Rock on, Dude!", 
        "intTime": 20090318, 
        "postID": 32, 
        "quote": "", 
        "reply": "Right on, Navy Grunt! The Zombies were awesome with great tunes like \"She's Not There\", \"Time of the Season\", and \"Tell Her No.\" Rock on, Dude!", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:29:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "quote: Originally posted by MaddogK: Problem is the Obama administration considered the insurance scam against vets as a viable option- reason enough not to trust him. I wonder what idiocy Barry will come up with tomorrow. BINGO!!!!!!!!!!!!!! then, today and tomarrow. He showed his true colors with just the idiotic thought and it backfired. It might have even showed him that he is not in charge, the american people are. He tried Chitown politics and he loss.", 
        "intTime": 20090318, 
        "postID": 33, 
        "quote": "Originally posted by MaddogK: Problem is the Obama administration considered the insurance scam against vets as a viable option- reason enough not to trust him. I wonder what idiocy Barry will come up with tomorrow.", 
        "reply": " BINGO!!!!!!!!!!!!!! then, today and tomarrow. He showed his true colors with just the idiotic thought and it backfired. It might have even showed him that he is not in charge, the american people are. He tried Chitown politics and he loss.", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:30:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by SteveDeHaven: quote: Originally posted by scooter_mech: There is no reason to phrase a topic like this other that spread negativity. Do you similarly chastise those who post ranting screeds against the President? Yes, as a matter of fact I have. Particularly when he was first elected and the \"natering nabobs of negativity\"* were blasting away. * A Spiro T Agnew line...", 
        "intTime": 20090318, 
        "postID": 34, 
        "quote": "Originally posted by SteveDeHaven: quote: Originally posted by scooter_mech: There is no reason to phrase a topic like this other that spread negativity. Do you similarly chastise those who post ranting screeds against the President?", 
        "reply": " Yes, as a matter of fact I have. Particularly when he was first elected and the \"natering nabobs of negativity\"* were blasting away. * A Spiro T Agnew line...", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:34:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "quote: Originally posted by SteveDeHaven: quote: Originally posted by I_M_Qwerty: I can believe that ... Eric Shinseki is a good man and I wondered how he could be party to such a dumb proposal. Do you have a link to the article? If so, please post it in quotes (cold link). He apparently wasn't influenced by the American Legion and the other veterans' organizations he met with the other day. I may have reported incorrectly. The article says Obama, Shinseki, and other administration officials met with 11 veterans groups. Still, it's the President listening to veterans. Here's the link, properly cooled off: foxnews(DOT)com/politics/first100days/2009/03/17/vets-group-blasts-obama-plan-private-insurance-pay-service-related-health-care/ You may find this thread interesting: http://forums.military.com/eve/forums/a/tpc/f/672198221/m/5880040812001 It specifically addresses that meeting ... and the American Legion's response to it. So ... he has not backed off his proposal. That leaves stop loss ... and my comment on it stands.", 
        "intTime": 20090318, 
        "postID": 35, 
        "quote": "Originally posted by SteveDeHaven: quote: Originally posted by I_M_Qwerty: I can believe that ... Eric Shinseki is a good man and I wondered how he could be party to such a dumb proposal. Do you have a link to the article? If so, please post it in quotes (cold link). He apparently wasn't influenced by the American Legion and the other veterans' organizations he met with the other day. I may have reported incorrectly. The article says Obama, Shinseki, and other administration officials met with 11 veterans groups. Still, it's the President listening to veterans. Here's the link, properly cooled off: foxnews(DOT)com/politics/first100days/2009/03/17/vets-group-blasts-obama-plan-private-insurance-pay-service-related-health-care/", 
        "reply": " You may find this thread interesting: http://forums.military.com/eve/forums/a/tpc/f/672198221/m/5880040812001 It specifically addresses that meeting ... and the American Legion's response to it. So ... he has not backed off his proposal. That leaves stop loss ... and my comment on it stands.", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:39:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Originally posted by scooter_mech: quote: Originally posted by SteveDeHaven: Now that the Obama administration has decided to scale back Stop-Loss, and has listened to veterans and scrapped the insurance plan, why don't some of you Obama haters come forward and say a kind word for the man? There is no reason to phrase a topic like this other that spread negativity. . Maybe he likes \"rattling cages and upsetting applecarts\", after all, that's what's in his bio.", 
        "intTime": 20090318, 
        "postID": 36, 
        "quote": "Originally posted by scooter_mech: quote: Originally posted by SteveDeHaven: Now that the Obama administration has decided to scale back Stop-Loss, and has listened to veterans and scrapped the insurance plan, why don't some of you Obama haters come forward and say a kind word for the man? There is no reason to phrase a topic like this other that spread negativity. .", 
        "reply": " Maybe he likes \"rattling cages and upsetting applecarts\", after all, that's what's in his bio.", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:40:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "Well, I'm sorry for you that you won't be able to live in the Constitution-trampling Bush-Cheney police state, but you'll cope somehow. I heard all the same crap against President Clinton from all the right-wing-nuts. And you know what? The country survived. Fortunately, we also survived President Cheney Bush II. I know we're not going to come to a consensus today. All I can say is, wait 30-40 years, and see which Presidents still look good in hindsight. By the way, I don't consider myself a Democrat, and haven't since I voted for Reagan. But this anti-Obama sentiment that I keep seeing, both in print and in person, really bothers me. When I see it in person, I usually get a good dose of racism with it. Makes me wonder about what I see in print.", 
        "intTime": 20090318, 
        "postID": 37, 
        "quote": "", 
        "reply": "Well, I'm sorry for you that you won't be able to live in the Constitution-trampling Bush-Cheney police state, but you'll cope somehow. I heard all the same crap against President Clinton from all the right-wing-nuts. And you know what? The country survived. Fortunately, we also survived President Cheney Bush II. I know we're not going to come to a consensus today. All I can say is, wait 30-40 years, and see which Presidents still look good in hindsight. By the way, I don't consider myself a Democrat, and haven't since I voted for Reagan. But this anti-Obama sentiment that I keep seeing, both in print and in person, really bothers me. When I see it in person, I usually get a good dose of racism with it. Makes me wonder about what I see in print.", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:45:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "quote: Originally posted by I_M_Qwerty: You may find this thread interesting: http://forums.military.com/eve/forums/a/tpc/f/672198221/m/5880040812001 It specifically addresses that meeting ... and the American Legion's response to it. So ... he has not backed off his proposal. That leaves stop loss ... and my comment on it stands. I'm not sure what this proves. That item was posted 2 days ago, and Obama just today decided to abandon the plan. Was there something I missed?", 
        "intTime": 20090318, 
        "postID": 38, 
        "quote": "Originally posted by I_M_Qwerty: You may find this thread interesting: http://forums.military.com/eve/forums/a/tpc/f/672198221/m/5880040812001 It specifically addresses that meeting ... and the American Legion's response to it. So ... he has not backed off his proposal. That leaves stop loss ... and my comment on it stands.", 
        "reply": " I'm not sure what this proves. That item was posted 2 days ago, and Obama just today decided to abandon the plan. Was there something I missed?", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:57:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "quote: Where are the Obama haters now? Here... C.R.", 
        "intTime": 20090318, 
        "postID": 39, 
        "quote": "Where are the Obama haters now?", 
        "reply": " Here... C.R.", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 20:11:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "CYCLIC_RUNAWAY"
    }, 
    {
        "content": "Present", 
        "intTime": 20090318, 
        "postID": 40, 
        "quote": "", 
        "reply": "Present", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 20:16:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "BAGodbehere"
    }, 
    {
        "content": "Now that the Obama administration has decided to scale back Stop-Loss, and has listened to veterans and scrapped the insurance plan, why don't some of you Obama haters come forward and say a kind word for the man?", 
        "intTime": 20090318, 
        "postID": 41, 
        "quote": "", 
        "reply": "Now that the Obama administration has decided to scale back Stop-Loss, and has listened to veterans and scrapped the insurance plan, why don't some of you Obama haters come forward and say a kind word for the man?", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 18:51:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "If you don't have anything nice to say about someone, then just let it be.", 
        "intTime": 20090318, 
        "postID": 42, 
        "quote": "", 
        "reply": "If you don't have anything nice to say about someone, then just let it be.", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 18:56:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "Navy_Grunt"
    }, 
    {
        "content": "quote: Originally posted by SteveDeHaven: Now that the Obama administration has decided to scale back Stop-Loss, and has listened to veterans and scrapped the insurance plan, why don't some of you Obama haters come forward and say a kind word for the man? I suspect what he listened to (on insurance), assuming he has changed his position, were Democratic senators such as Patty Murray who said if he sent such a proposal to them, it would be DOA. As to scaling back stop loss, DoD has been wanting to do that all along. The drawdown in Iraq coupled with a tanked economy (increased retention and enlistment) makes it possible.", 
        "intTime": 20090318, 
        "postID": 43, 
        "quote": "Originally posted by SteveDeHaven: Now that the Obama administration has decided to scale back Stop-Loss, and has listened to veterans and scrapped the insurance plan, why don't some of you Obama haters come forward and say a kind word for the man?", 
        "reply": " I suspect what he listened to (on insurance), assuming he has changed his position, were Democratic senators such as Patty Murray who said if he sent such a proposal to them, it would be DOA. As to scaling back stop loss, DoD has been wanting to do that all along. The drawdown in Iraq coupled with a tanked economy (increased retention and enlistment) makes it possible.", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:00:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Originally posted by Navy_Grunt: If you don't have anything nice to say about someone, then just let it be. Judging by that picture, it looks like you need to take your own advice.", 
        "intTime": 20090318, 
        "postID": 44, 
        "quote": "Originally posted by Navy_Grunt: If you don't have anything nice to say about someone, then just let it be.", 
        "reply": " Judging by that picture, it looks like you need to take your own advice.", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:00:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "quote: Originally posted by I_M_Qwerty: quote: Originally posted by SteveDeHaven: Now that the Obama administration has decided to scale back Stop-Loss, and has listened to veterans and scrapped the insurance plan, why don't some of you Obama haters come forward and say a kind word for the man? I suspect what he listened to (on insurance), assuming he has changed his position, were Democratic senators such as Patty Murray who said if he sent such a proposal to them, it would be DOA. No, according to the news article I read, he listend to Shinseki, head of the VA and himself a veteran.", 
        "intTime": 20090318, 
        "postID": 45, 
        "quote": "Originally posted by I_M_Qwerty: quote: Originally posted by SteveDeHaven: Now that the Obama administration has decided to scale back Stop-Loss, and has listened to veterans and scrapped the insurance plan, why don't some of you Obama haters come forward and say a kind word for the man? I suspect what he listened to (on insurance), assuming he has changed his position, were Democratic senators such as Patty Murray who said if he sent such a proposal to them, it would be DOA.", 
        "reply": " No, according to the news article I read, he listend to Shinseki, head of the VA and himself a veteran.", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:02:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "quote: Originally posted by SteveDeHaven: Now that the Obama administration has decided to scale back Stop-Loss, and has listened to veterans and scrapped the insurance plan, why don't some of you Obama haters come forward and say a kind word for the man? Problem is the Obama administration considered the insurance scam against vets as a viable option- reason enough not to trust him. I wonder what idiocy Barry will come up with tomorrow.", 
        "intTime": 20090318, 
        "postID": 46, 
        "quote": "Originally posted by SteveDeHaven: Now that the Obama administration has decided to scale back Stop-Loss, and has listened to veterans and scrapped the insurance plan, why don't some of you Obama haters come forward and say a kind word for the man?", 
        "reply": " Problem is the Obama administration considered the insurance scam against vets as a viable option- reason enough not to trust him. I wonder what idiocy Barry will come up with tomorrow.", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:02:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "MaddogK"
    }, 
    {
        "content": "quote: Originally posted by SteveDeHaven: quote: Originally posted by I_M_Qwerty: quote: Originally posted by SteveDeHaven: Now that the Obama administration has decided to scale back Stop-Loss, and has listened to veterans and scrapped the insurance plan, why don't some of you Obama haters come forward and say a kind word for the man? I suspect what he listened to (on insurance), assuming he has changed his position, were Democratic senators such as Patty Murray who said if he sent such a proposal to them, it would be DOA. No, according to the news article I read, he listend to Shinseki, head of the VA and himself a veteran. I can believe that ... Eric Shinseki is a good man and I wondered how he could be party to such a dumb proposal. Do you have a link to the article? If so, please post it in quotes (cold link). He apparently wasn't influenced by the American Legion and the other veterans' organizations he met with the other day.", 
        "intTime": 20090318, 
        "postID": 47, 
        "quote": "Originally posted by SteveDeHaven: quote: Originally posted by I_M_Qwerty: quote: Originally posted by SteveDeHaven: Now that the Obama administration has decided to scale back Stop-Loss, and has listened to veterans and scrapped the insurance plan, why don't some of you Obama haters come forward and say a kind word for the man? I suspect what he listened to (on insurance), assuming he has changed his position, were Democratic senators such as Patty Murray who said if he sent such a proposal to them, it would be DOA. No, according to the news article I read, he listend to Shinseki, head of the VA and himself a veteran.", 
        "reply": " I can believe that ... Eric Shinseki is a good man and I wondered how he could be party to such a dumb proposal. Do you have a link to the article? If so, please post it in quotes (cold link). He apparently wasn't influenced by the American Legion and the other veterans' organizations he met with the other day.", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:06:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Originally posted by SteveDeHaven: Now that the Obama administration has decided to scale back Stop-Loss, and has listened to veterans and scrapped the insurance plan, why don't some of you Obama haters come forward and say a kind word for the man? There is no reason to phrase a topic like this other that spread negativity. Instead of attacking others, simply point out the accomplishments of the President. I don't know what options there are to stop-loss other than bringing back the draft. And the insurance issue was definitly a misstep by the President. Still, I'm glad he changed course on that. Still, this is one money saving idea that never should have seen the light of day.", 
        "intTime": 20090318, 
        "postID": 48, 
        "quote": "Originally posted by SteveDeHaven: Now that the Obama administration has decided to scale back Stop-Loss, and has listened to veterans and scrapped the insurance plan, why don't some of you Obama haters come forward and say a kind word for the man?", 
        "reply": " There is no reason to phrase a topic like this other that spread negativity. Instead of attacking others, simply point out the accomplishments of the President. I don't know what options there are to stop-loss other than bringing back the draft. And the insurance issue was definitly a misstep by the President. Still, I'm glad he changed course on that. Still, this is one money saving idea that never should have seen the light of day.", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:17:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "Oh believe me I am being nice.", 
        "intTime": 20090318, 
        "postID": 49, 
        "quote": "", 
        "reply": "Oh believe me I am being nice.", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:19:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "Navy_Grunt"
    }, 
    {
        "content": "quote: Originally posted by I_M_Qwerty: I can believe that ... Eric Shinseki is a good man and I wondered how he could be party to such a dumb proposal. Do you have a link to the article? If so, please post it in quotes (cold link). He apparently wasn't influenced by the American Legion and the other veterans' organizations he met with the other day. I may have reported incorrectly. The article says Obama, Shinseki, and other administration officials met with 11 veterans groups. Still, it's the President listening to veterans. Here's the link, properly cooled off: foxnews(DOT)com/politics/first100days/2009/03/17/vets-group-blasts-obama-plan-private-insurance-pay-service-related-health-care/", 
        "intTime": 20090318, 
        "postID": 50, 
        "quote": "Originally posted by I_M_Qwerty: I can believe that ... Eric Shinseki is a good man and I wondered how he could be party to such a dumb proposal. Do you have a link to the article? If so, please post it in quotes (cold link). He apparently wasn't influenced by the American Legion and the other veterans' organizations he met with the other day.", 
        "reply": " I may have reported incorrectly. The article says Obama, Shinseki, and other administration officials met with 11 veterans groups. Still, it's the President listening to veterans. Here's the link, properly cooled off: foxnews(DOT)com/politics/first100days/2009/03/17/vets-group-blasts-obama-plan-private-insurance-pay-service-related-health-care/", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:24:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "quote: Originally posted by scooter_mech: There is no reason to phrase a topic like this other that spread negativity. Do you similarly chastise those who post ranting screeds against the President?", 
        "intTime": 20090318, 
        "postID": 51, 
        "quote": "Originally posted by scooter_mech: There is no reason to phrase a topic like this other that spread negativity.", 
        "reply": " Do you similarly chastise those who post ranting screeds against the President?", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:28:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "Right on, Navy Grunt! The Zombies were awesome with great tunes like \"She's Not There\", \"Time of the Season\", and \"Tell Her No.\" Rock on, Dude!", 
        "intTime": 20090318, 
        "postID": 52, 
        "quote": "", 
        "reply": "Right on, Navy Grunt! The Zombies were awesome with great tunes like \"She's Not There\", \"Time of the Season\", and \"Tell Her No.\" Rock on, Dude!", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:29:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "quote: Originally posted by MaddogK: Problem is the Obama administration considered the insurance scam against vets as a viable option- reason enough not to trust him. I wonder what idiocy Barry will come up with tomorrow. BINGO!!!!!!!!!!!!!! then, today and tomarrow. He showed his true colors with just the idiotic thought and it backfired. It might have even showed him that he is not in charge, the american people are. He tried Chitown politics and he loss.", 
        "intTime": 20090318, 
        "postID": 53, 
        "quote": "Originally posted by MaddogK: Problem is the Obama administration considered the insurance scam against vets as a viable option- reason enough not to trust him. I wonder what idiocy Barry will come up with tomorrow.", 
        "reply": " BINGO!!!!!!!!!!!!!! then, today and tomarrow. He showed his true colors with just the idiotic thought and it backfired. It might have even showed him that he is not in charge, the american people are. He tried Chitown politics and he loss.", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:30:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by SteveDeHaven: quote: Originally posted by scooter_mech: There is no reason to phrase a topic like this other that spread negativity. Do you similarly chastise those who post ranting screeds against the President? Yes, as a matter of fact I have. Particularly when he was first elected and the \"natering nabobs of negativity\"* were blasting away. * A Spiro T Agnew line...", 
        "intTime": 20090318, 
        "postID": 54, 
        "quote": "Originally posted by SteveDeHaven: quote: Originally posted by scooter_mech: There is no reason to phrase a topic like this other that spread negativity. Do you similarly chastise those who post ranting screeds against the President?", 
        "reply": " Yes, as a matter of fact I have. Particularly when he was first elected and the \"natering nabobs of negativity\"* were blasting away. * A Spiro T Agnew line...", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:34:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "quote: Originally posted by SteveDeHaven: quote: Originally posted by I_M_Qwerty: I can believe that ... Eric Shinseki is a good man and I wondered how he could be party to such a dumb proposal. Do you have a link to the article? If so, please post it in quotes (cold link). He apparently wasn't influenced by the American Legion and the other veterans' organizations he met with the other day. I may have reported incorrectly. The article says Obama, Shinseki, and other administration officials met with 11 veterans groups. Still, it's the President listening to veterans. Here's the link, properly cooled off: foxnews(DOT)com/politics/first100days/2009/03/17/vets-group-blasts-obama-plan-private-insurance-pay-service-related-health-care/ You may find this thread interesting: http://forums.military.com/eve/forums/a/tpc/f/672198221/m/5880040812001 It specifically addresses that meeting ... and the American Legion's response to it. So ... he has not backed off his proposal. That leaves stop loss ... and my comment on it stands.", 
        "intTime": 20090318, 
        "postID": 55, 
        "quote": "Originally posted by SteveDeHaven: quote: Originally posted by I_M_Qwerty: I can believe that ... Eric Shinseki is a good man and I wondered how he could be party to such a dumb proposal. Do you have a link to the article? If so, please post it in quotes (cold link). He apparently wasn't influenced by the American Legion and the other veterans' organizations he met with the other day. I may have reported incorrectly. The article says Obama, Shinseki, and other administration officials met with 11 veterans groups. Still, it's the President listening to veterans. Here's the link, properly cooled off: foxnews(DOT)com/politics/first100days/2009/03/17/vets-group-blasts-obama-plan-private-insurance-pay-service-related-health-care/", 
        "reply": " You may find this thread interesting: http://forums.military.com/eve/forums/a/tpc/f/672198221/m/5880040812001 It specifically addresses that meeting ... and the American Legion's response to it. So ... he has not backed off his proposal. That leaves stop loss ... and my comment on it stands.", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:39:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Originally posted by scooter_mech: quote: Originally posted by SteveDeHaven: Now that the Obama administration has decided to scale back Stop-Loss, and has listened to veterans and scrapped the insurance plan, why don't some of you Obama haters come forward and say a kind word for the man? There is no reason to phrase a topic like this other that spread negativity. . Maybe he likes \"rattling cages and upsetting applecarts\", after all, that's what's in his bio.", 
        "intTime": 20090318, 
        "postID": 56, 
        "quote": "Originally posted by scooter_mech: quote: Originally posted by SteveDeHaven: Now that the Obama administration has decided to scale back Stop-Loss, and has listened to veterans and scrapped the insurance plan, why don't some of you Obama haters come forward and say a kind word for the man? There is no reason to phrase a topic like this other that spread negativity. .", 
        "reply": " Maybe he likes \"rattling cages and upsetting applecarts\", after all, that's what's in his bio.", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:40:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "Well, I'm sorry for you that you won't be able to live in the Constitution-trampling Bush-Cheney police state, but you'll cope somehow. I heard all the same crap against President Clinton from all the right-wing-nuts. And you know what? The country survived. Fortunately, we also survived President Cheney Bush II. I know we're not going to come to a consensus today. All I can say is, wait 30-40 years, and see which Presidents still look good in hindsight. By the way, I don't consider myself a Democrat, and haven't since I voted for Reagan. But this anti-Obama sentiment that I keep seeing, both in print and in person, really bothers me. When I see it in person, I usually get a good dose of racism with it. Makes me wonder about what I see in print.", 
        "intTime": 20090318, 
        "postID": 57, 
        "quote": "", 
        "reply": "Well, I'm sorry for you that you won't be able to live in the Constitution-trampling Bush-Cheney police state, but you'll cope somehow. I heard all the same crap against President Clinton from all the right-wing-nuts. And you know what? The country survived. Fortunately, we also survived President Cheney Bush II. I know we're not going to come to a consensus today. All I can say is, wait 30-40 years, and see which Presidents still look good in hindsight. By the way, I don't consider myself a Democrat, and haven't since I voted for Reagan. But this anti-Obama sentiment that I keep seeing, both in print and in person, really bothers me. When I see it in person, I usually get a good dose of racism with it. Makes me wonder about what I see in print.", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:45:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "quote: Originally posted by I_M_Qwerty: You may find this thread interesting: http://forums.military.com/eve/forums/a/tpc/f/672198221/m/5880040812001 It specifically addresses that meeting ... and the American Legion's response to it. So ... he has not backed off his proposal. That leaves stop loss ... and my comment on it stands. I'm not sure what this proves. That item was posted 2 days ago, and Obama just today decided to abandon the plan. Was there something I missed?", 
        "intTime": 20090318, 
        "postID": 58, 
        "quote": "Originally posted by I_M_Qwerty: You may find this thread interesting: http://forums.military.com/eve/forums/a/tpc/f/672198221/m/5880040812001 It specifically addresses that meeting ... and the American Legion's response to it. So ... he has not backed off his proposal. That leaves stop loss ... and my comment on it stands.", 
        "reply": " I'm not sure what this proves. That item was posted 2 days ago, and Obama just today decided to abandon the plan. Was there something I missed?", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:57:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "quote: Where are the Obama haters now? Here... C.R.", 
        "intTime": 20090318, 
        "postID": 59, 
        "quote": "Where are the Obama haters now?", 
        "reply": " Here... C.R.", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 20:11:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "CYCLIC_RUNAWAY"
    }, 
    {
        "content": "Present", 
        "intTime": 20090318, 
        "postID": 60, 
        "quote": "", 
        "reply": "Present", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 20:16:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "BAGodbehere"
    }, 
    {
        "content": "Now that the Obama administration has decided to scale back Stop-Loss, and has listened to veterans and scrapped the insurance plan, why don't some of you Obama haters come forward and say a kind word for the man?", 
        "intTime": 20090318, 
        "postID": 61, 
        "quote": "", 
        "reply": "Now that the Obama administration has decided to scale back Stop-Loss, and has listened to veterans and scrapped the insurance plan, why don't some of you Obama haters come forward and say a kind word for the man?", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 18:51:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "If you don't have anything nice to say about someone, then just let it be.", 
        "intTime": 20090318, 
        "postID": 62, 
        "quote": "", 
        "reply": "If you don't have anything nice to say about someone, then just let it be.", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 18:56:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "Navy_Grunt"
    }, 
    {
        "content": "quote: Originally posted by SteveDeHaven: Now that the Obama administration has decided to scale back Stop-Loss, and has listened to veterans and scrapped the insurance plan, why don't some of you Obama haters come forward and say a kind word for the man? I suspect what he listened to (on insurance), assuming he has changed his position, were Democratic senators such as Patty Murray who said if he sent such a proposal to them, it would be DOA. As to scaling back stop loss, DoD has been wanting to do that all along. The drawdown in Iraq coupled with a tanked economy (increased retention and enlistment) makes it possible.", 
        "intTime": 20090318, 
        "postID": 63, 
        "quote": "Originally posted by SteveDeHaven: Now that the Obama administration has decided to scale back Stop-Loss, and has listened to veterans and scrapped the insurance plan, why don't some of you Obama haters come forward and say a kind word for the man?", 
        "reply": " I suspect what he listened to (on insurance), assuming he has changed his position, were Democratic senators such as Patty Murray who said if he sent such a proposal to them, it would be DOA. As to scaling back stop loss, DoD has been wanting to do that all along. The drawdown in Iraq coupled with a tanked economy (increased retention and enlistment) makes it possible.", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:00:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Originally posted by Navy_Grunt: If you don't have anything nice to say about someone, then just let it be. Judging by that picture, it looks like you need to take your own advice.", 
        "intTime": 20090318, 
        "postID": 64, 
        "quote": "Originally posted by Navy_Grunt: If you don't have anything nice to say about someone, then just let it be.", 
        "reply": " Judging by that picture, it looks like you need to take your own advice.", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:00:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "quote: Originally posted by I_M_Qwerty: quote: Originally posted by SteveDeHaven: Now that the Obama administration has decided to scale back Stop-Loss, and has listened to veterans and scrapped the insurance plan, why don't some of you Obama haters come forward and say a kind word for the man? I suspect what he listened to (on insurance), assuming he has changed his position, were Democratic senators such as Patty Murray who said if he sent such a proposal to them, it would be DOA. No, according to the news article I read, he listend to Shinseki, head of the VA and himself a veteran.", 
        "intTime": 20090318, 
        "postID": 65, 
        "quote": "Originally posted by I_M_Qwerty: quote: Originally posted by SteveDeHaven: Now that the Obama administration has decided to scale back Stop-Loss, and has listened to veterans and scrapped the insurance plan, why don't some of you Obama haters come forward and say a kind word for the man? I suspect what he listened to (on insurance), assuming he has changed his position, were Democratic senators such as Patty Murray who said if he sent such a proposal to them, it would be DOA.", 
        "reply": " No, according to the news article I read, he listend to Shinseki, head of the VA and himself a veteran.", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:02:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "quote: Originally posted by SteveDeHaven: Now that the Obama administration has decided to scale back Stop-Loss, and has listened to veterans and scrapped the insurance plan, why don't some of you Obama haters come forward and say a kind word for the man? Problem is the Obama administration considered the insurance scam against vets as a viable option- reason enough not to trust him. I wonder what idiocy Barry will come up with tomorrow.", 
        "intTime": 20090318, 
        "postID": 66, 
        "quote": "Originally posted by SteveDeHaven: Now that the Obama administration has decided to scale back Stop-Loss, and has listened to veterans and scrapped the insurance plan, why don't some of you Obama haters come forward and say a kind word for the man?", 
        "reply": " Problem is the Obama administration considered the insurance scam against vets as a viable option- reason enough not to trust him. I wonder what idiocy Barry will come up with tomorrow.", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:02:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "MaddogK"
    }, 
    {
        "content": "quote: Originally posted by SteveDeHaven: quote: Originally posted by I_M_Qwerty: quote: Originally posted by SteveDeHaven: Now that the Obama administration has decided to scale back Stop-Loss, and has listened to veterans and scrapped the insurance plan, why don't some of you Obama haters come forward and say a kind word for the man? I suspect what he listened to (on insurance), assuming he has changed his position, were Democratic senators such as Patty Murray who said if he sent such a proposal to them, it would be DOA. No, according to the news article I read, he listend to Shinseki, head of the VA and himself a veteran. I can believe that ... Eric Shinseki is a good man and I wondered how he could be party to such a dumb proposal. Do you have a link to the article? If so, please post it in quotes (cold link). He apparently wasn't influenced by the American Legion and the other veterans' organizations he met with the other day.", 
        "intTime": 20090318, 
        "postID": 67, 
        "quote": "Originally posted by SteveDeHaven: quote: Originally posted by I_M_Qwerty: quote: Originally posted by SteveDeHaven: Now that the Obama administration has decided to scale back Stop-Loss, and has listened to veterans and scrapped the insurance plan, why don't some of you Obama haters come forward and say a kind word for the man? I suspect what he listened to (on insurance), assuming he has changed his position, were Democratic senators such as Patty Murray who said if he sent such a proposal to them, it would be DOA. No, according to the news article I read, he listend to Shinseki, head of the VA and himself a veteran.", 
        "reply": " I can believe that ... Eric Shinseki is a good man and I wondered how he could be party to such a dumb proposal. Do you have a link to the article? If so, please post it in quotes (cold link). He apparently wasn't influenced by the American Legion and the other veterans' organizations he met with the other day.", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:06:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Originally posted by SteveDeHaven: Now that the Obama administration has decided to scale back Stop-Loss, and has listened to veterans and scrapped the insurance plan, why don't some of you Obama haters come forward and say a kind word for the man? There is no reason to phrase a topic like this other that spread negativity. Instead of attacking others, simply point out the accomplishments of the President. I don't know what options there are to stop-loss other than bringing back the draft. And the insurance issue was definitly a misstep by the President. Still, I'm glad he changed course on that. Still, this is one money saving idea that never should have seen the light of day.", 
        "intTime": 20090318, 
        "postID": 68, 
        "quote": "Originally posted by SteveDeHaven: Now that the Obama administration has decided to scale back Stop-Loss, and has listened to veterans and scrapped the insurance plan, why don't some of you Obama haters come forward and say a kind word for the man?", 
        "reply": " There is no reason to phrase a topic like this other that spread negativity. Instead of attacking others, simply point out the accomplishments of the President. I don't know what options there are to stop-loss other than bringing back the draft. And the insurance issue was definitly a misstep by the President. Still, I'm glad he changed course on that. Still, this is one money saving idea that never should have seen the light of day.", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:17:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "Oh believe me I am being nice.", 
        "intTime": 20090318, 
        "postID": 69, 
        "quote": "", 
        "reply": "Oh believe me I am being nice.", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:19:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "Navy_Grunt"
    }, 
    {
        "content": "quote: Originally posted by I_M_Qwerty: I can believe that ... Eric Shinseki is a good man and I wondered how he could be party to such a dumb proposal. Do you have a link to the article? If so, please post it in quotes (cold link). He apparently wasn't influenced by the American Legion and the other veterans' organizations he met with the other day. I may have reported incorrectly. The article says Obama, Shinseki, and other administration officials met with 11 veterans groups. Still, it's the President listening to veterans. Here's the link, properly cooled off: foxnews(DOT)com/politics/first100days/2009/03/17/vets-group-blasts-obama-plan-private-insurance-pay-service-related-health-care/", 
        "intTime": 20090318, 
        "postID": 70, 
        "quote": "Originally posted by I_M_Qwerty: I can believe that ... Eric Shinseki is a good man and I wondered how he could be party to such a dumb proposal. Do you have a link to the article? If so, please post it in quotes (cold link). He apparently wasn't influenced by the American Legion and the other veterans' organizations he met with the other day.", 
        "reply": " I may have reported incorrectly. The article says Obama, Shinseki, and other administration officials met with 11 veterans groups. Still, it's the President listening to veterans. Here's the link, properly cooled off: foxnews(DOT)com/politics/first100days/2009/03/17/vets-group-blasts-obama-plan-private-insurance-pay-service-related-health-care/", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:24:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "quote: Originally posted by scooter_mech: There is no reason to phrase a topic like this other that spread negativity. Do you similarly chastise those who post ranting screeds against the President?", 
        "intTime": 20090318, 
        "postID": 71, 
        "quote": "Originally posted by scooter_mech: There is no reason to phrase a topic like this other that spread negativity.", 
        "reply": " Do you similarly chastise those who post ranting screeds against the President?", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:28:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "Right on, Navy Grunt! The Zombies were awesome with great tunes like \"She's Not There\", \"Time of the Season\", and \"Tell Her No.\" Rock on, Dude!", 
        "intTime": 20090318, 
        "postID": 72, 
        "quote": "", 
        "reply": "Right on, Navy Grunt! The Zombies were awesome with great tunes like \"She's Not There\", \"Time of the Season\", and \"Tell Her No.\" Rock on, Dude!", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:29:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "quote: Originally posted by MaddogK: Problem is the Obama administration considered the insurance scam against vets as a viable option- reason enough not to trust him. I wonder what idiocy Barry will come up with tomorrow. BINGO!!!!!!!!!!!!!! then, today and tomarrow. He showed his true colors with just the idiotic thought and it backfired. It might have even showed him that he is not in charge, the american people are. He tried Chitown politics and he loss.", 
        "intTime": 20090318, 
        "postID": 73, 
        "quote": "Originally posted by MaddogK: Problem is the Obama administration considered the insurance scam against vets as a viable option- reason enough not to trust him. I wonder what idiocy Barry will come up with tomorrow.", 
        "reply": " BINGO!!!!!!!!!!!!!! then, today and tomarrow. He showed his true colors with just the idiotic thought and it backfired. It might have even showed him that he is not in charge, the american people are. He tried Chitown politics and he loss.", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:30:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by SteveDeHaven: quote: Originally posted by scooter_mech: There is no reason to phrase a topic like this other that spread negativity. Do you similarly chastise those who post ranting screeds against the President? Yes, as a matter of fact I have. Particularly when he was first elected and the \"natering nabobs of negativity\"* were blasting away. * A Spiro T Agnew line...", 
        "intTime": 20090318, 
        "postID": 74, 
        "quote": "Originally posted by SteveDeHaven: quote: Originally posted by scooter_mech: There is no reason to phrase a topic like this other that spread negativity. Do you similarly chastise those who post ranting screeds against the President?", 
        "reply": " Yes, as a matter of fact I have. Particularly when he was first elected and the \"natering nabobs of negativity\"* were blasting away. * A Spiro T Agnew line...", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:34:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "quote: Originally posted by SteveDeHaven: quote: Originally posted by I_M_Qwerty: I can believe that ... Eric Shinseki is a good man and I wondered how he could be party to such a dumb proposal. Do you have a link to the article? If so, please post it in quotes (cold link). He apparently wasn't influenced by the American Legion and the other veterans' organizations he met with the other day. I may have reported incorrectly. The article says Obama, Shinseki, and other administration officials met with 11 veterans groups. Still, it's the President listening to veterans. Here's the link, properly cooled off: foxnews(DOT)com/politics/first100days/2009/03/17/vets-group-blasts-obama-plan-private-insurance-pay-service-related-health-care/ You may find this thread interesting: http://forums.military.com/eve/forums/a/tpc/f/672198221/m/5880040812001 It specifically addresses that meeting ... and the American Legion's response to it. So ... he has not backed off his proposal. That leaves stop loss ... and my comment on it stands.", 
        "intTime": 20090318, 
        "postID": 75, 
        "quote": "Originally posted by SteveDeHaven: quote: Originally posted by I_M_Qwerty: I can believe that ... Eric Shinseki is a good man and I wondered how he could be party to such a dumb proposal. Do you have a link to the article? If so, please post it in quotes (cold link). He apparently wasn't influenced by the American Legion and the other veterans' organizations he met with the other day. I may have reported incorrectly. The article says Obama, Shinseki, and other administration officials met with 11 veterans groups. Still, it's the President listening to veterans. Here's the link, properly cooled off: foxnews(DOT)com/politics/first100days/2009/03/17/vets-group-blasts-obama-plan-private-insurance-pay-service-related-health-care/", 
        "reply": " You may find this thread interesting: http://forums.military.com/eve/forums/a/tpc/f/672198221/m/5880040812001 It specifically addresses that meeting ... and the American Legion's response to it. So ... he has not backed off his proposal. That leaves stop loss ... and my comment on it stands.", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:39:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Originally posted by scooter_mech: quote: Originally posted by SteveDeHaven: Now that the Obama administration has decided to scale back Stop-Loss, and has listened to veterans and scrapped the insurance plan, why don't some of you Obama haters come forward and say a kind word for the man? There is no reason to phrase a topic like this other that spread negativity. . Maybe he likes \"rattling cages and upsetting applecarts\", after all, that's what's in his bio.", 
        "intTime": 20090318, 
        "postID": 76, 
        "quote": "Originally posted by scooter_mech: quote: Originally posted by SteveDeHaven: Now that the Obama administration has decided to scale back Stop-Loss, and has listened to veterans and scrapped the insurance plan, why don't some of you Obama haters come forward and say a kind word for the man? There is no reason to phrase a topic like this other that spread negativity. .", 
        "reply": " Maybe he likes \"rattling cages and upsetting applecarts\", after all, that's what's in his bio.", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:40:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "Well, I'm sorry for you that you won't be able to live in the Constitution-trampling Bush-Cheney police state, but you'll cope somehow. I heard all the same crap against President Clinton from all the right-wing-nuts. And you know what? The country survived. Fortunately, we also survived President Cheney Bush II. I know we're not going to come to a consensus today. All I can say is, wait 30-40 years, and see which Presidents still look good in hindsight. By the way, I don't consider myself a Democrat, and haven't since I voted for Reagan. But this anti-Obama sentiment that I keep seeing, both in print and in person, really bothers me. When I see it in person, I usually get a good dose of racism with it. Makes me wonder about what I see in print.", 
        "intTime": 20090318, 
        "postID": 77, 
        "quote": "", 
        "reply": "Well, I'm sorry for you that you won't be able to live in the Constitution-trampling Bush-Cheney police state, but you'll cope somehow. I heard all the same crap against President Clinton from all the right-wing-nuts. And you know what? The country survived. Fortunately, we also survived President Cheney Bush II. I know we're not going to come to a consensus today. All I can say is, wait 30-40 years, and see which Presidents still look good in hindsight. By the way, I don't consider myself a Democrat, and haven't since I voted for Reagan. But this anti-Obama sentiment that I keep seeing, both in print and in person, really bothers me. When I see it in person, I usually get a good dose of racism with it. Makes me wonder about what I see in print.", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:45:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "quote: Originally posted by I_M_Qwerty: You may find this thread interesting: http://forums.military.com/eve/forums/a/tpc/f/672198221/m/5880040812001 It specifically addresses that meeting ... and the American Legion's response to it. So ... he has not backed off his proposal. That leaves stop loss ... and my comment on it stands. I'm not sure what this proves. That item was posted 2 days ago, and Obama just today decided to abandon the plan. Was there something I missed?", 
        "intTime": 20090318, 
        "postID": 78, 
        "quote": "Originally posted by I_M_Qwerty: You may find this thread interesting: http://forums.military.com/eve/forums/a/tpc/f/672198221/m/5880040812001 It specifically addresses that meeting ... and the American Legion's response to it. So ... he has not backed off his proposal. That leaves stop loss ... and my comment on it stands.", 
        "reply": " I'm not sure what this proves. That item was posted 2 days ago, and Obama just today decided to abandon the plan. Was there something I missed?", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:57:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "quote: Where are the Obama haters now? Here... C.R.", 
        "intTime": 20090318, 
        "postID": 79, 
        "quote": "Where are the Obama haters now?", 
        "reply": " Here... C.R.", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 20:11:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "CYCLIC_RUNAWAY"
    }, 
    {
        "content": "Present", 
        "intTime": 20090318, 
        "postID": 80, 
        "quote": "", 
        "reply": "Present", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 20:16:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "BAGodbehere"
    }, 
    {
        "content": "Now that the Obama administration has decided to scale back Stop-Loss, and has listened to veterans and scrapped the insurance plan, why don't some of you Obama haters come forward and say a kind word for the man?", 
        "intTime": 20090318, 
        "postID": 81, 
        "quote": "", 
        "reply": "Now that the Obama administration has decided to scale back Stop-Loss, and has listened to veterans and scrapped the insurance plan, why don't some of you Obama haters come forward and say a kind word for the man?", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 18:51:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "If you don't have anything nice to say about someone, then just let it be.", 
        "intTime": 20090318, 
        "postID": 82, 
        "quote": "", 
        "reply": "If you don't have anything nice to say about someone, then just let it be.", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 18:56:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "Navy_Grunt"
    }, 
    {
        "content": "quote: Originally posted by SteveDeHaven: Now that the Obama administration has decided to scale back Stop-Loss, and has listened to veterans and scrapped the insurance plan, why don't some of you Obama haters come forward and say a kind word for the man? I suspect what he listened to (on insurance), assuming he has changed his position, were Democratic senators such as Patty Murray who said if he sent such a proposal to them, it would be DOA. As to scaling back stop loss, DoD has been wanting to do that all along. The drawdown in Iraq coupled with a tanked economy (increased retention and enlistment) makes it possible.", 
        "intTime": 20090318, 
        "postID": 83, 
        "quote": "Originally posted by SteveDeHaven: Now that the Obama administration has decided to scale back Stop-Loss, and has listened to veterans and scrapped the insurance plan, why don't some of you Obama haters come forward and say a kind word for the man?", 
        "reply": " I suspect what he listened to (on insurance), assuming he has changed his position, were Democratic senators such as Patty Murray who said if he sent such a proposal to them, it would be DOA. As to scaling back stop loss, DoD has been wanting to do that all along. The drawdown in Iraq coupled with a tanked economy (increased retention and enlistment) makes it possible.", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:00:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Originally posted by Navy_Grunt: If you don't have anything nice to say about someone, then just let it be. Judging by that picture, it looks like you need to take your own advice.", 
        "intTime": 20090318, 
        "postID": 84, 
        "quote": "Originally posted by Navy_Grunt: If you don't have anything nice to say about someone, then just let it be.", 
        "reply": " Judging by that picture, it looks like you need to take your own advice.", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:00:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "quote: Originally posted by I_M_Qwerty: quote: Originally posted by SteveDeHaven: Now that the Obama administration has decided to scale back Stop-Loss, and has listened to veterans and scrapped the insurance plan, why don't some of you Obama haters come forward and say a kind word for the man? I suspect what he listened to (on insurance), assuming he has changed his position, were Democratic senators such as Patty Murray who said if he sent such a proposal to them, it would be DOA. No, according to the news article I read, he listend to Shinseki, head of the VA and himself a veteran.", 
        "intTime": 20090318, 
        "postID": 85, 
        "quote": "Originally posted by I_M_Qwerty: quote: Originally posted by SteveDeHaven: Now that the Obama administration has decided to scale back Stop-Loss, and has listened to veterans and scrapped the insurance plan, why don't some of you Obama haters come forward and say a kind word for the man? I suspect what he listened to (on insurance), assuming he has changed his position, were Democratic senators such as Patty Murray who said if he sent such a proposal to them, it would be DOA.", 
        "reply": " No, according to the news article I read, he listend to Shinseki, head of the VA and himself a veteran.", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:02:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "quote: Originally posted by SteveDeHaven: Now that the Obama administration has decided to scale back Stop-Loss, and has listened to veterans and scrapped the insurance plan, why don't some of you Obama haters come forward and say a kind word for the man? Problem is the Obama administration considered the insurance scam against vets as a viable option- reason enough not to trust him. I wonder what idiocy Barry will come up with tomorrow.", 
        "intTime": 20090318, 
        "postID": 86, 
        "quote": "Originally posted by SteveDeHaven: Now that the Obama administration has decided to scale back Stop-Loss, and has listened to veterans and scrapped the insurance plan, why don't some of you Obama haters come forward and say a kind word for the man?", 
        "reply": " Problem is the Obama administration considered the insurance scam against vets as a viable option- reason enough not to trust him. I wonder what idiocy Barry will come up with tomorrow.", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:02:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "MaddogK"
    }, 
    {
        "content": "quote: Originally posted by SteveDeHaven: quote: Originally posted by I_M_Qwerty: quote: Originally posted by SteveDeHaven: Now that the Obama administration has decided to scale back Stop-Loss, and has listened to veterans and scrapped the insurance plan, why don't some of you Obama haters come forward and say a kind word for the man? I suspect what he listened to (on insurance), assuming he has changed his position, were Democratic senators such as Patty Murray who said if he sent such a proposal to them, it would be DOA. No, according to the news article I read, he listend to Shinseki, head of the VA and himself a veteran. I can believe that ... Eric Shinseki is a good man and I wondered how he could be party to such a dumb proposal. Do you have a link to the article? If so, please post it in quotes (cold link). He apparently wasn't influenced by the American Legion and the other veterans' organizations he met with the other day.", 
        "intTime": 20090318, 
        "postID": 87, 
        "quote": "Originally posted by SteveDeHaven: quote: Originally posted by I_M_Qwerty: quote: Originally posted by SteveDeHaven: Now that the Obama administration has decided to scale back Stop-Loss, and has listened to veterans and scrapped the insurance plan, why don't some of you Obama haters come forward and say a kind word for the man? I suspect what he listened to (on insurance), assuming he has changed his position, were Democratic senators such as Patty Murray who said if he sent such a proposal to them, it would be DOA. No, according to the news article I read, he listend to Shinseki, head of the VA and himself a veteran.", 
        "reply": " I can believe that ... Eric Shinseki is a good man and I wondered how he could be party to such a dumb proposal. Do you have a link to the article? If so, please post it in quotes (cold link). He apparently wasn't influenced by the American Legion and the other veterans' organizations he met with the other day.", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:06:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Originally posted by SteveDeHaven: Now that the Obama administration has decided to scale back Stop-Loss, and has listened to veterans and scrapped the insurance plan, why don't some of you Obama haters come forward and say a kind word for the man? There is no reason to phrase a topic like this other that spread negativity. Instead of attacking others, simply point out the accomplishments of the President. I don't know what options there are to stop-loss other than bringing back the draft. And the insurance issue was definitly a misstep by the President. Still, I'm glad he changed course on that. Still, this is one money saving idea that never should have seen the light of day.", 
        "intTime": 20090318, 
        "postID": 88, 
        "quote": "Originally posted by SteveDeHaven: Now that the Obama administration has decided to scale back Stop-Loss, and has listened to veterans and scrapped the insurance plan, why don't some of you Obama haters come forward and say a kind word for the man?", 
        "reply": " There is no reason to phrase a topic like this other that spread negativity. Instead of attacking others, simply point out the accomplishments of the President. I don't know what options there are to stop-loss other than bringing back the draft. And the insurance issue was definitly a misstep by the President. Still, I'm glad he changed course on that. Still, this is one money saving idea that never should have seen the light of day.", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:17:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "Oh believe me I am being nice.", 
        "intTime": 20090318, 
        "postID": 89, 
        "quote": "", 
        "reply": "Oh believe me I am being nice.", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:19:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "Navy_Grunt"
    }, 
    {
        "content": "quote: Originally posted by I_M_Qwerty: I can believe that ... Eric Shinseki is a good man and I wondered how he could be party to such a dumb proposal. Do you have a link to the article? If so, please post it in quotes (cold link). He apparently wasn't influenced by the American Legion and the other veterans' organizations he met with the other day. I may have reported incorrectly. The article says Obama, Shinseki, and other administration officials met with 11 veterans groups. Still, it's the President listening to veterans. Here's the link, properly cooled off: foxnews(DOT)com/politics/first100days/2009/03/17/vets-group-blasts-obama-plan-private-insurance-pay-service-related-health-care/", 
        "intTime": 20090318, 
        "postID": 90, 
        "quote": "Originally posted by I_M_Qwerty: I can believe that ... Eric Shinseki is a good man and I wondered how he could be party to such a dumb proposal. Do you have a link to the article? If so, please post it in quotes (cold link). He apparently wasn't influenced by the American Legion and the other veterans' organizations he met with the other day.", 
        "reply": " I may have reported incorrectly. The article says Obama, Shinseki, and other administration officials met with 11 veterans groups. Still, it's the President listening to veterans. Here's the link, properly cooled off: foxnews(DOT)com/politics/first100days/2009/03/17/vets-group-blasts-obama-plan-private-insurance-pay-service-related-health-care/", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:24:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "quote: Originally posted by scooter_mech: There is no reason to phrase a topic like this other that spread negativity. Do you similarly chastise those who post ranting screeds against the President?", 
        "intTime": 20090318, 
        "postID": 91, 
        "quote": "Originally posted by scooter_mech: There is no reason to phrase a topic like this other that spread negativity.", 
        "reply": " Do you similarly chastise those who post ranting screeds against the President?", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:28:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "Right on, Navy Grunt! The Zombies were awesome with great tunes like \"She's Not There\", \"Time of the Season\", and \"Tell Her No.\" Rock on, Dude!", 
        "intTime": 20090318, 
        "postID": 92, 
        "quote": "", 
        "reply": "Right on, Navy Grunt! The Zombies were awesome with great tunes like \"She's Not There\", \"Time of the Season\", and \"Tell Her No.\" Rock on, Dude!", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:29:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "quote: Originally posted by MaddogK: Problem is the Obama administration considered the insurance scam against vets as a viable option- reason enough not to trust him. I wonder what idiocy Barry will come up with tomorrow. BINGO!!!!!!!!!!!!!! then, today and tomarrow. He showed his true colors with just the idiotic thought and it backfired. It might have even showed him that he is not in charge, the american people are. He tried Chitown politics and he loss.", 
        "intTime": 20090318, 
        "postID": 93, 
        "quote": "Originally posted by MaddogK: Problem is the Obama administration considered the insurance scam against vets as a viable option- reason enough not to trust him. I wonder what idiocy Barry will come up with tomorrow.", 
        "reply": " BINGO!!!!!!!!!!!!!! then, today and tomarrow. He showed his true colors with just the idiotic thought and it backfired. It might have even showed him that he is not in charge, the american people are. He tried Chitown politics and he loss.", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:30:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by SteveDeHaven: quote: Originally posted by scooter_mech: There is no reason to phrase a topic like this other that spread negativity. Do you similarly chastise those who post ranting screeds against the President? Yes, as a matter of fact I have. Particularly when he was first elected and the \"natering nabobs of negativity\"* were blasting away. * A Spiro T Agnew line...", 
        "intTime": 20090318, 
        "postID": 94, 
        "quote": "Originally posted by SteveDeHaven: quote: Originally posted by scooter_mech: There is no reason to phrase a topic like this other that spread negativity. Do you similarly chastise those who post ranting screeds against the President?", 
        "reply": " Yes, as a matter of fact I have. Particularly when he was first elected and the \"natering nabobs of negativity\"* were blasting away. * A Spiro T Agnew line...", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:34:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "quote: Originally posted by SteveDeHaven: quote: Originally posted by I_M_Qwerty: I can believe that ... Eric Shinseki is a good man and I wondered how he could be party to such a dumb proposal. Do you have a link to the article? If so, please post it in quotes (cold link). He apparently wasn't influenced by the American Legion and the other veterans' organizations he met with the other day. I may have reported incorrectly. The article says Obama, Shinseki, and other administration officials met with 11 veterans groups. Still, it's the President listening to veterans. Here's the link, properly cooled off: foxnews(DOT)com/politics/first100days/2009/03/17/vets-group-blasts-obama-plan-private-insurance-pay-service-related-health-care/ You may find this thread interesting: http://forums.military.com/eve/forums/a/tpc/f/672198221/m/5880040812001 It specifically addresses that meeting ... and the American Legion's response to it. So ... he has not backed off his proposal. That leaves stop loss ... and my comment on it stands.", 
        "intTime": 20090318, 
        "postID": 95, 
        "quote": "Originally posted by SteveDeHaven: quote: Originally posted by I_M_Qwerty: I can believe that ... Eric Shinseki is a good man and I wondered how he could be party to such a dumb proposal. Do you have a link to the article? If so, please post it in quotes (cold link). He apparently wasn't influenced by the American Legion and the other veterans' organizations he met with the other day. I may have reported incorrectly. The article says Obama, Shinseki, and other administration officials met with 11 veterans groups. Still, it's the President listening to veterans. Here's the link, properly cooled off: foxnews(DOT)com/politics/first100days/2009/03/17/vets-group-blasts-obama-plan-private-insurance-pay-service-related-health-care/", 
        "reply": " You may find this thread interesting: http://forums.military.com/eve/forums/a/tpc/f/672198221/m/5880040812001 It specifically addresses that meeting ... and the American Legion's response to it. So ... he has not backed off his proposal. That leaves stop loss ... and my comment on it stands.", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:39:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Originally posted by scooter_mech: quote: Originally posted by SteveDeHaven: Now that the Obama administration has decided to scale back Stop-Loss, and has listened to veterans and scrapped the insurance plan, why don't some of you Obama haters come forward and say a kind word for the man? There is no reason to phrase a topic like this other that spread negativity. . Maybe he likes \"rattling cages and upsetting applecarts\", after all, that's what's in his bio.", 
        "intTime": 20090318, 
        "postID": 96, 
        "quote": "Originally posted by scooter_mech: quote: Originally posted by SteveDeHaven: Now that the Obama administration has decided to scale back Stop-Loss, and has listened to veterans and scrapped the insurance plan, why don't some of you Obama haters come forward and say a kind word for the man? There is no reason to phrase a topic like this other that spread negativity. .", 
        "reply": " Maybe he likes \"rattling cages and upsetting applecarts\", after all, that's what's in his bio.", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:40:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "Well, I'm sorry for you that you won't be able to live in the Constitution-trampling Bush-Cheney police state, but you'll cope somehow. I heard all the same crap against President Clinton from all the right-wing-nuts. And you know what? The country survived. Fortunately, we also survived President Cheney Bush II. I know we're not going to come to a consensus today. All I can say is, wait 30-40 years, and see which Presidents still look good in hindsight. By the way, I don't consider myself a Democrat, and haven't since I voted for Reagan. But this anti-Obama sentiment that I keep seeing, both in print and in person, really bothers me. When I see it in person, I usually get a good dose of racism with it. Makes me wonder about what I see in print.", 
        "intTime": 20090318, 
        "postID": 97, 
        "quote": "", 
        "reply": "Well, I'm sorry for you that you won't be able to live in the Constitution-trampling Bush-Cheney police state, but you'll cope somehow. I heard all the same crap against President Clinton from all the right-wing-nuts. And you know what? The country survived. Fortunately, we also survived President Cheney Bush II. I know we're not going to come to a consensus today. All I can say is, wait 30-40 years, and see which Presidents still look good in hindsight. By the way, I don't consider myself a Democrat, and haven't since I voted for Reagan. But this anti-Obama sentiment that I keep seeing, both in print and in person, really bothers me. When I see it in person, I usually get a good dose of racism with it. Makes me wonder about what I see in print.", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:45:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "quote: Originally posted by I_M_Qwerty: You may find this thread interesting: http://forums.military.com/eve/forums/a/tpc/f/672198221/m/5880040812001 It specifically addresses that meeting ... and the American Legion's response to it. So ... he has not backed off his proposal. That leaves stop loss ... and my comment on it stands. I'm not sure what this proves. That item was posted 2 days ago, and Obama just today decided to abandon the plan. Was there something I missed?", 
        "intTime": 20090318, 
        "postID": 98, 
        "quote": "Originally posted by I_M_Qwerty: You may find this thread interesting: http://forums.military.com/eve/forums/a/tpc/f/672198221/m/5880040812001 It specifically addresses that meeting ... and the American Legion's response to it. So ... he has not backed off his proposal. That leaves stop loss ... and my comment on it stands.", 
        "reply": " I'm not sure what this proves. That item was posted 2 days ago, and Obama just today decided to abandon the plan. Was there something I missed?", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:57:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "quote: Where are the Obama haters now? Here... C.R.", 
        "intTime": 20090318, 
        "postID": 99, 
        "quote": "Where are the Obama haters now?", 
        "reply": " Here... C.R.", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 20:11:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "CYCLIC_RUNAWAY"
    }, 
    {
        "content": "Present", 
        "intTime": 20090318, 
        "postID": 100, 
        "quote": "", 
        "reply": "Present", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 20:16:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "BAGodbehere"
    }, 
    {
        "content": "Now that the Obama administration has decided to scale back Stop-Loss, and has listened to veterans and scrapped the insurance plan, why don't some of you Obama haters come forward and say a kind word for the man?", 
        "intTime": 20090318, 
        "postID": 101, 
        "quote": "", 
        "reply": "Now that the Obama administration has decided to scale back Stop-Loss, and has listened to veterans and scrapped the insurance plan, why don't some of you Obama haters come forward and say a kind word for the man?", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 18:51:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "If you don't have anything nice to say about someone, then just let it be.", 
        "intTime": 20090318, 
        "postID": 102, 
        "quote": "", 
        "reply": "If you don't have anything nice to say about someone, then just let it be.", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 18:56:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "Navy_Grunt"
    }, 
    {
        "content": "quote: Originally posted by SteveDeHaven: Now that the Obama administration has decided to scale back Stop-Loss, and has listened to veterans and scrapped the insurance plan, why don't some of you Obama haters come forward and say a kind word for the man? I suspect what he listened to (on insurance), assuming he has changed his position, were Democratic senators such as Patty Murray who said if he sent such a proposal to them, it would be DOA. As to scaling back stop loss, DoD has been wanting to do that all along. The drawdown in Iraq coupled with a tanked economy (increased retention and enlistment) makes it possible.", 
        "intTime": 20090318, 
        "postID": 103, 
        "quote": "Originally posted by SteveDeHaven: Now that the Obama administration has decided to scale back Stop-Loss, and has listened to veterans and scrapped the insurance plan, why don't some of you Obama haters come forward and say a kind word for the man?", 
        "reply": " I suspect what he listened to (on insurance), assuming he has changed his position, were Democratic senators such as Patty Murray who said if he sent such a proposal to them, it would be DOA. As to scaling back stop loss, DoD has been wanting to do that all along. The drawdown in Iraq coupled with a tanked economy (increased retention and enlistment) makes it possible.", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:00:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Originally posted by Navy_Grunt: If you don't have anything nice to say about someone, then just let it be. Judging by that picture, it looks like you need to take your own advice.", 
        "intTime": 20090318, 
        "postID": 104, 
        "quote": "Originally posted by Navy_Grunt: If you don't have anything nice to say about someone, then just let it be.", 
        "reply": " Judging by that picture, it looks like you need to take your own advice.", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:00:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "quote: Originally posted by I_M_Qwerty: quote: Originally posted by SteveDeHaven: Now that the Obama administration has decided to scale back Stop-Loss, and has listened to veterans and scrapped the insurance plan, why don't some of you Obama haters come forward and say a kind word for the man? I suspect what he listened to (on insurance), assuming he has changed his position, were Democratic senators such as Patty Murray who said if he sent such a proposal to them, it would be DOA. No, according to the news article I read, he listend to Shinseki, head of the VA and himself a veteran.", 
        "intTime": 20090318, 
        "postID": 105, 
        "quote": "Originally posted by I_M_Qwerty: quote: Originally posted by SteveDeHaven: Now that the Obama administration has decided to scale back Stop-Loss, and has listened to veterans and scrapped the insurance plan, why don't some of you Obama haters come forward and say a kind word for the man? I suspect what he listened to (on insurance), assuming he has changed his position, were Democratic senators such as Patty Murray who said if he sent such a proposal to them, it would be DOA.", 
        "reply": " No, according to the news article I read, he listend to Shinseki, head of the VA and himself a veteran.", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:02:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "quote: Originally posted by SteveDeHaven: Now that the Obama administration has decided to scale back Stop-Loss, and has listened to veterans and scrapped the insurance plan, why don't some of you Obama haters come forward and say a kind word for the man? Problem is the Obama administration considered the insurance scam against vets as a viable option- reason enough not to trust him. I wonder what idiocy Barry will come up with tomorrow.", 
        "intTime": 20090318, 
        "postID": 106, 
        "quote": "Originally posted by SteveDeHaven: Now that the Obama administration has decided to scale back Stop-Loss, and has listened to veterans and scrapped the insurance plan, why don't some of you Obama haters come forward and say a kind word for the man?", 
        "reply": " Problem is the Obama administration considered the insurance scam against vets as a viable option- reason enough not to trust him. I wonder what idiocy Barry will come up with tomorrow.", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:02:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "MaddogK"
    }, 
    {
        "content": "quote: Originally posted by SteveDeHaven: quote: Originally posted by I_M_Qwerty: quote: Originally posted by SteveDeHaven: Now that the Obama administration has decided to scale back Stop-Loss, and has listened to veterans and scrapped the insurance plan, why don't some of you Obama haters come forward and say a kind word for the man? I suspect what he listened to (on insurance), assuming he has changed his position, were Democratic senators such as Patty Murray who said if he sent such a proposal to them, it would be DOA. No, according to the news article I read, he listend to Shinseki, head of the VA and himself a veteran. I can believe that ... Eric Shinseki is a good man and I wondered how he could be party to such a dumb proposal. Do you have a link to the article? If so, please post it in quotes (cold link). He apparently wasn't influenced by the American Legion and the other veterans' organizations he met with the other day.", 
        "intTime": 20090318, 
        "postID": 107, 
        "quote": "Originally posted by SteveDeHaven: quote: Originally posted by I_M_Qwerty: quote: Originally posted by SteveDeHaven: Now that the Obama administration has decided to scale back Stop-Loss, and has listened to veterans and scrapped the insurance plan, why don't some of you Obama haters come forward and say a kind word for the man? I suspect what he listened to (on insurance), assuming he has changed his position, were Democratic senators such as Patty Murray who said if he sent such a proposal to them, it would be DOA. No, according to the news article I read, he listend to Shinseki, head of the VA and himself a veteran.", 
        "reply": " I can believe that ... Eric Shinseki is a good man and I wondered how he could be party to such a dumb proposal. Do you have a link to the article? If so, please post it in quotes (cold link). He apparently wasn't influenced by the American Legion and the other veterans' organizations he met with the other day.", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:06:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Originally posted by SteveDeHaven: Now that the Obama administration has decided to scale back Stop-Loss, and has listened to veterans and scrapped the insurance plan, why don't some of you Obama haters come forward and say a kind word for the man? There is no reason to phrase a topic like this other that spread negativity. Instead of attacking others, simply point out the accomplishments of the President. I don't know what options there are to stop-loss other than bringing back the draft. And the insurance issue was definitly a misstep by the President. Still, I'm glad he changed course on that. Still, this is one money saving idea that never should have seen the light of day.", 
        "intTime": 20090318, 
        "postID": 108, 
        "quote": "Originally posted by SteveDeHaven: Now that the Obama administration has decided to scale back Stop-Loss, and has listened to veterans and scrapped the insurance plan, why don't some of you Obama haters come forward and say a kind word for the man?", 
        "reply": " There is no reason to phrase a topic like this other that spread negativity. Instead of attacking others, simply point out the accomplishments of the President. I don't know what options there are to stop-loss other than bringing back the draft. And the insurance issue was definitly a misstep by the President. Still, I'm glad he changed course on that. Still, this is one money saving idea that never should have seen the light of day.", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:17:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "Oh believe me I am being nice.", 
        "intTime": 20090318, 
        "postID": 109, 
        "quote": "", 
        "reply": "Oh believe me I am being nice.", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:19:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "Navy_Grunt"
    }, 
    {
        "content": "quote: Originally posted by I_M_Qwerty: I can believe that ... Eric Shinseki is a good man and I wondered how he could be party to such a dumb proposal. Do you have a link to the article? If so, please post it in quotes (cold link). He apparently wasn't influenced by the American Legion and the other veterans' organizations he met with the other day. I may have reported incorrectly. The article says Obama, Shinseki, and other administration officials met with 11 veterans groups. Still, it's the President listening to veterans. Here's the link, properly cooled off: foxnews(DOT)com/politics/first100days/2009/03/17/vets-group-blasts-obama-plan-private-insurance-pay-service-related-health-care/", 
        "intTime": 20090318, 
        "postID": 110, 
        "quote": "Originally posted by I_M_Qwerty: I can believe that ... Eric Shinseki is a good man and I wondered how he could be party to such a dumb proposal. Do you have a link to the article? If so, please post it in quotes (cold link). He apparently wasn't influenced by the American Legion and the other veterans' organizations he met with the other day.", 
        "reply": " I may have reported incorrectly. The article says Obama, Shinseki, and other administration officials met with 11 veterans groups. Still, it's the President listening to veterans. Here's the link, properly cooled off: foxnews(DOT)com/politics/first100days/2009/03/17/vets-group-blasts-obama-plan-private-insurance-pay-service-related-health-care/", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:24:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "quote: Originally posted by scooter_mech: There is no reason to phrase a topic like this other that spread negativity. Do you similarly chastise those who post ranting screeds against the President?", 
        "intTime": 20090318, 
        "postID": 111, 
        "quote": "Originally posted by scooter_mech: There is no reason to phrase a topic like this other that spread negativity.", 
        "reply": " Do you similarly chastise those who post ranting screeds against the President?", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:28:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "Right on, Navy Grunt! The Zombies were awesome with great tunes like \"She's Not There\", \"Time of the Season\", and \"Tell Her No.\" Rock on, Dude!", 
        "intTime": 20090318, 
        "postID": 112, 
        "quote": "", 
        "reply": "Right on, Navy Grunt! The Zombies were awesome with great tunes like \"She's Not There\", \"Time of the Season\", and \"Tell Her No.\" Rock on, Dude!", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:29:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "quote: Originally posted by MaddogK: Problem is the Obama administration considered the insurance scam against vets as a viable option- reason enough not to trust him. I wonder what idiocy Barry will come up with tomorrow. BINGO!!!!!!!!!!!!!! then, today and tomarrow. He showed his true colors with just the idiotic thought and it backfired. It might have even showed him that he is not in charge, the american people are. He tried Chitown politics and he loss.", 
        "intTime": 20090318, 
        "postID": 113, 
        "quote": "Originally posted by MaddogK: Problem is the Obama administration considered the insurance scam against vets as a viable option- reason enough not to trust him. I wonder what idiocy Barry will come up with tomorrow.", 
        "reply": " BINGO!!!!!!!!!!!!!! then, today and tomarrow. He showed his true colors with just the idiotic thought and it backfired. It might have even showed him that he is not in charge, the american people are. He tried Chitown politics and he loss.", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:30:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by SteveDeHaven: quote: Originally posted by scooter_mech: There is no reason to phrase a topic like this other that spread negativity. Do you similarly chastise those who post ranting screeds against the President? Yes, as a matter of fact I have. Particularly when he was first elected and the \"natering nabobs of negativity\"* were blasting away. * A Spiro T Agnew line...", 
        "intTime": 20090318, 
        "postID": 114, 
        "quote": "Originally posted by SteveDeHaven: quote: Originally posted by scooter_mech: There is no reason to phrase a topic like this other that spread negativity. Do you similarly chastise those who post ranting screeds against the President?", 
        "reply": " Yes, as a matter of fact I have. Particularly when he was first elected and the \"natering nabobs of negativity\"* were blasting away. * A Spiro T Agnew line...", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:34:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "quote: Originally posted by SteveDeHaven: quote: Originally posted by I_M_Qwerty: I can believe that ... Eric Shinseki is a good man and I wondered how he could be party to such a dumb proposal. Do you have a link to the article? If so, please post it in quotes (cold link). He apparently wasn't influenced by the American Legion and the other veterans' organizations he met with the other day. I may have reported incorrectly. The article says Obama, Shinseki, and other administration officials met with 11 veterans groups. Still, it's the President listening to veterans. Here's the link, properly cooled off: foxnews(DOT)com/politics/first100days/2009/03/17/vets-group-blasts-obama-plan-private-insurance-pay-service-related-health-care/ You may find this thread interesting: http://forums.military.com/eve/forums/a/tpc/f/672198221/m/5880040812001 It specifically addresses that meeting ... and the American Legion's response to it. So ... he has not backed off his proposal. That leaves stop loss ... and my comment on it stands.", 
        "intTime": 20090318, 
        "postID": 115, 
        "quote": "Originally posted by SteveDeHaven: quote: Originally posted by I_M_Qwerty: I can believe that ... Eric Shinseki is a good man and I wondered how he could be party to such a dumb proposal. Do you have a link to the article? If so, please post it in quotes (cold link). He apparently wasn't influenced by the American Legion and the other veterans' organizations he met with the other day. I may have reported incorrectly. The article says Obama, Shinseki, and other administration officials met with 11 veterans groups. Still, it's the President listening to veterans. Here's the link, properly cooled off: foxnews(DOT)com/politics/first100days/2009/03/17/vets-group-blasts-obama-plan-private-insurance-pay-service-related-health-care/", 
        "reply": " You may find this thread interesting: http://forums.military.com/eve/forums/a/tpc/f/672198221/m/5880040812001 It specifically addresses that meeting ... and the American Legion's response to it. So ... he has not backed off his proposal. That leaves stop loss ... and my comment on it stands.", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:39:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Originally posted by scooter_mech: quote: Originally posted by SteveDeHaven: Now that the Obama administration has decided to scale back Stop-Loss, and has listened to veterans and scrapped the insurance plan, why don't some of you Obama haters come forward and say a kind word for the man? There is no reason to phrase a topic like this other that spread negativity. . Maybe he likes \"rattling cages and upsetting applecarts\", after all, that's what's in his bio.", 
        "intTime": 20090318, 
        "postID": 116, 
        "quote": "Originally posted by scooter_mech: quote: Originally posted by SteveDeHaven: Now that the Obama administration has decided to scale back Stop-Loss, and has listened to veterans and scrapped the insurance plan, why don't some of you Obama haters come forward and say a kind word for the man? There is no reason to phrase a topic like this other that spread negativity. .", 
        "reply": " Maybe he likes \"rattling cages and upsetting applecarts\", after all, that's what's in his bio.", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:40:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "Well, I'm sorry for you that you won't be able to live in the Constitution-trampling Bush-Cheney police state, but you'll cope somehow. I heard all the same crap against President Clinton from all the right-wing-nuts. And you know what? The country survived. Fortunately, we also survived President Cheney Bush II. I know we're not going to come to a consensus today. All I can say is, wait 30-40 years, and see which Presidents still look good in hindsight. By the way, I don't consider myself a Democrat, and haven't since I voted for Reagan. But this anti-Obama sentiment that I keep seeing, both in print and in person, really bothers me. When I see it in person, I usually get a good dose of racism with it. Makes me wonder about what I see in print.", 
        "intTime": 20090318, 
        "postID": 117, 
        "quote": "", 
        "reply": "Well, I'm sorry for you that you won't be able to live in the Constitution-trampling Bush-Cheney police state, but you'll cope somehow. I heard all the same crap against President Clinton from all the right-wing-nuts. And you know what? The country survived. Fortunately, we also survived President Cheney Bush II. I know we're not going to come to a consensus today. All I can say is, wait 30-40 years, and see which Presidents still look good in hindsight. By the way, I don't consider myself a Democrat, and haven't since I voted for Reagan. But this anti-Obama sentiment that I keep seeing, both in print and in person, really bothers me. When I see it in person, I usually get a good dose of racism with it. Makes me wonder about what I see in print.", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:45:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "quote: Originally posted by I_M_Qwerty: You may find this thread interesting: http://forums.military.com/eve/forums/a/tpc/f/672198221/m/5880040812001 It specifically addresses that meeting ... and the American Legion's response to it. So ... he has not backed off his proposal. That leaves stop loss ... and my comment on it stands. I'm not sure what this proves. That item was posted 2 days ago, and Obama just today decided to abandon the plan. Was there something I missed?", 
        "intTime": 20090318, 
        "postID": 118, 
        "quote": "Originally posted by I_M_Qwerty: You may find this thread interesting: http://forums.military.com/eve/forums/a/tpc/f/672198221/m/5880040812001 It specifically addresses that meeting ... and the American Legion's response to it. So ... he has not backed off his proposal. That leaves stop loss ... and my comment on it stands.", 
        "reply": " I'm not sure what this proves. That item was posted 2 days ago, and Obama just today decided to abandon the plan. Was there something I missed?", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 19:57:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "quote: Where are the Obama haters now? Here... C.R.", 
        "intTime": 20090318, 
        "postID": 119, 
        "quote": "Where are the Obama haters now?", 
        "reply": " Here... C.R.", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 20:11:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "CYCLIC_RUNAWAY"
    }, 
    {
        "content": "Present", 
        "intTime": 20090318, 
        "postID": 120, 
        "quote": "", 
        "reply": "Present", 
        "threadID": "672198221_6830062812001", 
        "time": "2009-03-18 20:16:00", 
        "title": "Where are the Obama haters now?", 
        "userID": "BAGodbehere"
    }
]