[
    {
        "content": "\"http://www.nytimes.com/pages/national/ This has to be stopped. To many here in denial this is happening because NRA says' it isn't so, and they actually believe the NRA. This is a FACT folks, and it needs to be stopped, and quickly. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090415, 
        "postID": 1, 
        "quote": "", 
        "reply": "\"http://www.nytimes.com/pages/national/ This has to be stopped. To many here in denial this is happening because NRA says' it isn't so, and they actually believe the NRA. This is a FACT folks, and it needs to be stopped, and quickly. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_8390087022001", 
        "time": "2009-04-15 08:00:00", 
        "title": "Guns Flowing to Mexican Cartels from US Souhwest", 
        "userID": "jack_flats"
    }, 
    {
        "content": "wow and here i though the full autos were coming from mexico...", 
        "intTime": 20090415, 
        "postID": 2, 
        "quote": "", 
        "reply": "wow and here i though the full autos were coming from mexico...", 
        "threadID": "672198221_8390087022001", 
        "time": "2009-04-15 08:01:00", 
        "title": "Guns Flowing to Mexican Cartels from US Souhwest", 
        "userID": "outlaws93"
    }, 
    {
        "content": "Well now ... if the administration puts as much effort into stopping illegals crossing the border as they do mouthing off about guns doing the same, they'll stop both ... Wishful thinking, I know. It is much more self-serving to use the guns allegedly flowing into Mexico as political cover to constrain gun ownership. BTW ... I don't know an NRA statistic from a hole in the ground ... but I do pay attention to the statistics from the ATF ... and while \"we\" are part of the problem, we aren't the bulk of the problem ... not by a country mile.", 
        "intTime": 20090415, 
        "postID": 3, 
        "quote": "", 
        "reply": "Well now ... if the administration puts as much effort into stopping illegals crossing the border as they do mouthing off about guns doing the same, they'll stop both ... Wishful thinking, I know. It is much more self-serving to use the guns allegedly flowing into Mexico as political cover to constrain gun ownership. BTW ... I don't know an NRA statistic from a hole in the ground ... but I do pay attention to the statistics from the ATF ... and while \"we\" are part of the problem, we aren't the bulk of the problem ... not by a country mile.", 
        "threadID": "672198221_8390087022001", 
        "time": "2009-04-15 08:13:00", 
        "title": "Guns Flowing to Mexican Cartels from US Souhwest", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Originally posted by I_M_Qwerty: Well now ... if the administration puts as much effort into stopping illegals crossing the border as they do mouthing off about guns doing the same, they'll stop both ... Wishful thinking, I know. It is much more self-serving to use the guns allegedly flowing into Mexico as political cover to constrain gun ownership.", 
        "intTime": 20090415, 
        "postID": 4, 
        "quote": "Originally posted by I_M_Qwerty: Well now ... if the administration puts as much effort into stopping illegals crossing the border as they do mouthing off about guns doing the same, they'll stop both ... Wishful thinking, I know. It is much more self-serving to use the guns allegedly flowing into Mexico as political cover to constrain gun ownership.", 
        "reply": "", 
        "threadID": "672198221_8390087022001", 
        "time": "2009-04-15 08:15:00", 
        "title": "Guns Flowing to Mexican Cartels from US Souhwest", 
        "userID": "NickBrand"
    }, 
    {
        "content": "From the article ... quote: Mexican officials have repeatedly asked the United States to clamp down on the flow of weapons and are likely to bring it up again with President Obama when he visits Mexico on Thursday. ... and for how long has the United States been (lamely) asking Mexico to clamp down on the flow of illegals to the United States? ... and not only been given the brush off but had the Mexican government aid and abet illegals? Wouldn't want Mexico to put a dent in its cash flow from illegals in the U.S. now would we?", 
        "intTime": 20090415, 
        "postID": 5, 
        "quote": "Mexican officials have repeatedly asked the United States to clamp down on the flow of weapons and are likely to bring it up again with President Obama when he visits Mexico on Thursday.", 
        "reply": "From the article ...  ... and for how long has the United States been (lamely) asking Mexico to clamp down on the flow of illegals to the United States? ... and not only been given the brush off but had the Mexican government aid and abet illegals? Wouldn't want Mexico to put a dent in its cash flow from illegals in the U.S. now would we?", 
        "threadID": "672198221_8390087022001", 
        "time": "2009-04-15 08:24:00", 
        "title": "Guns Flowing to Mexican Cartels from US Souhwest", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "This has more to do with Mexico not searching people before they go back over the border. We do our part when they come in, but it is legal to own a weapon in the U.S. so if they Mexicans are going to search them when they come back over, it really isn't going to make a difference. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090415, 
        "postID": 6, 
        "quote": "", 
        "reply": "This has more to do with Mexico not searching people before they go back over the border. We do our part when they come in, but it is legal to own a weapon in the U.S. so if they Mexicans are going to search them when they come back over, it really isn't going to make a difference. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_8390087022001", 
        "time": "2009-04-15 08:37:00", 
        "title": "Guns Flowing to Mexican Cartels from US Souhwest", 
        "userID": "Anbar7"
    }, 
    {
        "content": "Many, many years ago when I was entering Texas, the customs people were suspicious of me and literally took my entire car apart. It's not the job of customs to stop people leaving the country, although apparently they are now doing this. But like US customs taking my car apart, I have to ask why Mexican authorities don't seem to be able to expend the effort to guard THEIR border (not mine) from illegal guns? I read this article and it's not as if there are caravans of guns, loaded on camals with security guards making the trips.... Dave", 
        "intTime": 20090415, 
        "postID": 7, 
        "quote": "", 
        "reply": "Many, many years ago when I was entering Texas, the customs people were suspicious of me and literally took my entire car apart. It's not the job of customs to stop people leaving the country, although apparently they are now doing this. But like US customs taking my car apart, I have to ask why Mexican authorities don't seem to be able to expend the effort to guard THEIR border (not mine) from illegal guns? I read this article and it's not as if there are caravans of guns, loaded on camals with security guards making the trips.... Dave", 
        "threadID": "672198221_8390087022001", 
        "time": "2009-04-15 08:42:00", 
        "title": "Guns Flowing to Mexican Cartels from US Souhwest", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: \"http://www.nytimes.com/pages/national/ This has to be stopped. To many here in denial this is happening because NRA says' it isn't so, and they actually believe the NRA. This is a FACT folks, and it needs to be stopped, and quickly. Yea ok Jack. FACT eh? Like when the Obama Admin said 90% of the weapons the found on Mexican criminals came from the US when it was later found to be a Lie, that less then 18% were from the US? Keep ranting. I believe this as much as man made global warming. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090415, 
        "postID": 8, 
        "quote": "Originally posted by jack_flats: \"http://www.nytimes.com/pages/national/ This has to be stopped. To many here in denial this is happening because NRA says' it isn't so, and they actually believe the NRA. This is a FACT folks, and it needs to be stopped, and quickly.", 
        "reply": " Yea ok Jack. FACT eh? Like when the Obama Admin said 90% of the weapons the found on Mexican criminals came from the US when it was later found to be a Lie, that less then 18% were from the US? Keep ranting. I believe this as much as man made global warming. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_8390087022001", 
        "time": "2009-04-15 08:49:00", 
        "title": "Guns Flowing to Mexican Cartels from US Souhwest", 
        "userID": "L0A1"
    }, 
    {
        "content": "The original item was already disproved. . . repeatedly. It is a lie; another leftist, control freak red herring to sucker fools. Even if it were true, which it obviously is not, there shall be NO INFRINGEMENT OF THE RIGHT TO KEEP AND BEAR ARMS in these United States because some other nation cannot control its own society, due to the graft and indifference of many of its authorities.", 
        "intTime": 20090415, 
        "postID": 9, 
        "quote": "", 
        "reply": "The original item was already disproved. . . repeatedly. It is a lie; another leftist, control freak red herring to sucker fools. Even if it were true, which it obviously is not, there shall be NO INFRINGEMENT OF THE RIGHT TO KEEP AND BEAR ARMS in these United States because some other nation cannot control its own society, due to the graft and indifference of many of its authorities.", 
        "threadID": "672198221_8390087022001", 
        "time": "2009-04-15 11:29:00", 
        "title": "Guns Flowing to Mexican Cartels from US Souhwest", 
        "userID": "RRR52"
    }, 
    {
        "content": "quote: Originally posted by Grachus: Many, many years ago when I was entering Texas, the customs people were suspicious of me and literally took my entire car apart. It's not the job of customs to stop people leaving the country, although apparently they are now doing this. But like US customs taking my car apart, I have to ask why Mexican authorities don't seem to be able to expend the effort to guard THEIR border (not mine) from illegal guns? I read this article and it's not as if there are caravans of guns, loaded on camals with security guards making the trips.... Dave Exactlly, the Governemnt of Mexico needs to take care of THEIR border by doing the necessary checks not us securing their border for them. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090415, 
        "postID": 10, 
        "quote": "Originally posted by Grachus: Many, many years ago when I was entering Texas, the customs people were suspicious of me and literally took my entire car apart. It's not the job of customs to stop people leaving the country, although apparently they are now doing this. But like US customs taking my car apart, I have to ask why Mexican authorities don't seem to be able to expend the effort to guard THEIR border (not mine) from illegal guns? I read this article and it's not as if there are caravans of guns, loaded on camals with security guards making the trips.... Dave", 
        "reply": " Exactlly, the Governemnt of Mexico needs to take care of THEIR border by doing the necessary checks not us securing their border for them. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_8390087022001", 
        "time": "2009-04-15 11:38:00", 
        "title": "Guns Flowing to Mexican Cartels from US Souhwest", 
        "userID": "Anbar7"
    }, 
    {
        "content": "More smoke and mirrors.... folks this fits the pattern of the dhs report. Of the world America's fugd up tour. America is to blame for illegals coming here, for violence in Mehiko. For them not checking vehicles when entering THEIR country. So the only rememdy is let illegals get amnesty. take weapons away from Law abiding citizens. and let all nations azz bone us. Come on people we had a psuedo genocide here once and slavery, and we dropped a nuke on Japan. We dont rate. Oh, yeh we are arrogant.", 
        "intTime": 20090415, 
        "postID": 11, 
        "quote": "", 
        "reply": "More smoke and mirrors.... folks this fits the pattern of the dhs report. Of the world America's fugd up tour. America is to blame for illegals coming here, for violence in Mehiko. For them not checking vehicles when entering THEIR country. So the only rememdy is let illegals get amnesty. take weapons away from Law abiding citizens. and let all nations azz bone us. Come on people we had a psuedo genocide here once and slavery, and we dropped a nuke on Japan. We dont rate. Oh, yeh we are arrogant.", 
        "threadID": "672198221_8390087022001", 
        "time": "2009-04-15 11:44:00", 
        "title": "Guns Flowing to Mexican Cartels from US Souhwest", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by RRR52: The original item was already disproved. . . repeatedly. It is a lie; another leftist, control freak red herring to sucker fools. Even if it were true, which it obviously is not, there shall be NO INFRINGEMENT OF THE RIGHT TO KEEP AND BEAR ARMS in these United States because some other nation cannot control its own society, due to the graft and indifference of many of its authorities. While I personally doubt this story, and even if I didn't it's irrelevant, the Second Amendment does not authorise Americans to sell guns to criminals. Anyone who does so is in violation of law, not the Second Amendment. Anyone we catch, should rightfully be tossed in the can. The real question is not OUR rights, but rather why the Mexican government chooses NOT to enfore their own laws. There's nothing on our part that prevents them from searching cars or trucks entering THEIR country. Why blame us, when they can't seem to spare the energy? Dave", 
        "intTime": 20090415, 
        "postID": 12, 
        "quote": "Originally posted by RRR52: The original item was already disproved. . . repeatedly. It is a lie; another leftist, control freak red herring to sucker fools. Even if it were true, which it obviously is not, there shall be NO INFRINGEMENT OF THE RIGHT TO KEEP AND BEAR ARMS in these United States because some other nation cannot control its own society, due to the graft and indifference of many of its authorities.", 
        "reply": " While I personally doubt this story, and even if I didn't it's irrelevant, the Second Amendment does not authorise Americans to sell guns to criminals. Anyone who does so is in violation of law, not the Second Amendment. Anyone we catch, should rightfully be tossed in the can. The real question is not OUR rights, but rather why the Mexican government chooses NOT to enfore their own laws. There's nothing on our part that prevents them from searching cars or trucks entering THEIR country. Why blame us, when they can't seem to spare the energy? Dave", 
        "threadID": "672198221_8390087022001", 
        "time": "2009-04-15 11:46:00", 
        "title": "Guns Flowing to Mexican Cartels from US Souhwest", 
        "userID": "Grachus"
    }, 
    {
        "content": "Americans are the ones doing the drugs, so we are responsible for the violence. We are bringing this on ourselves. I don't know why we keep blaming Mexico. If they weren't supplying the drugs, someone else would be.", 
        "intTime": 20090415, 
        "postID": 13, 
        "quote": "", 
        "reply": "Americans are the ones doing the drugs, so we are responsible for the violence. We are bringing this on ourselves. I don't know why we keep blaming Mexico. If they weren't supplying the drugs, someone else would be.", 
        "threadID": "672198221_8390087022001", 
        "time": "2009-04-15 12:05:00", 
        "title": "Guns Flowing to Mexican Cartels from US Souhwest", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by jack_flats: \"http://www.nytimes.com/pages/national/ This has to be stopped. To many here in denial this is happening because NRA says' it isn't so, and they actually believe the NRA. This is a FACT folks, and it needs to be stopped, and quickly. Yea ok Jack. FACT eh? Like when the Obama Admin said 90% of the weapons the found on Mexican criminals came from the US when it was later found to be a Lie, that less then 18% were from the US? Keep ranting. I believe this as much as man made global warming. 90%, if not more, are coming right from the good o'l USofA and into Mexican hands. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090415, 
        "postID": 14, 
        "quote": "Originally posted by L0A1: quote: Originally posted by jack_flats: \"http://www.nytimes.com/pages/national/ This has to be stopped. To many here in denial this is happening because NRA says' it isn't so, and they actually believe the NRA. This is a FACT folks, and it needs to be stopped, and quickly. Yea ok Jack. FACT eh? Like when the Obama Admin said 90% of the weapons the found on Mexican criminals came from the US when it was later found to be a Lie, that less then 18% were from the US? Keep ranting. I believe this as much as man made global warming.", 
        "reply": " 90%, if not more, are coming right from the good o'l USofA and into Mexican hands. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_8390087022001", 
        "time": "2009-04-15 12:11:00", 
        "title": "Guns Flowing to Mexican Cartels from US Souhwest", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: Exactlly, the Governemnt of Mexico needs to take care of THEIR border by doing the necessary checks not us securing their border for them. Why? Mexicans aren't doing the drugs. We create the demand, and therefore we create the violence.", 
        "intTime": 20090415, 
        "postID": 15, 
        "quote": "Originally posted by Anbar7: Exactlly, the Governemnt of Mexico needs to take care of THEIR border by doing the necessary checks not us securing their border for them.", 
        "reply": " Why? Mexicans aren't doing the drugs. We create the demand, and therefore we create the violence.", 
        "threadID": "672198221_8390087022001", 
        "time": "2009-04-15 12:14:00", 
        "title": "Guns Flowing to Mexican Cartels from US Souhwest", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by Anbar7: Exactlly, the Governemnt of Mexico needs to take care of THEIR border by doing the necessary checks not us securing their border for them. Why? Mexicans aren't doing the drugs. We create the demand, and therefore we create the violence. Look, I understand that you think America needs to police everybody. That isn't the case though. Mexico wants us to do this and that. Why don't they secure their own borders more tightly. By them doing searches of people coming in to Mexico and they can reduce the amount of weapons (18% that has come from America) and also prevent the drugs that come over. Yet, we need to do more to prevent the drugs from coming over as well. But that won't happen. Drugs are not going to be prevented there just isn't any possible way. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090415, 
        "postID": 16, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by Anbar7: Exactlly, the Governemnt of Mexico needs to take care of THEIR border by doing the necessary checks not us securing their border for them. Why? Mexicans aren't doing the drugs. We create the demand, and therefore we create the violence.", 
        "reply": " Look, I understand that you think America needs to police everybody. That isn't the case though. Mexico wants us to do this and that. Why don't they secure their own borders more tightly. By them doing searches of people coming in to Mexico and they can reduce the amount of weapons (18% that has come from America) and also prevent the drugs that come over. Yet, we need to do more to prevent the drugs from coming over as well. But that won't happen. Drugs are not going to be prevented there just isn't any possible way. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_8390087022001", 
        "time": "2009-04-15 12:16:00", 
        "title": "Guns Flowing to Mexican Cartels from US Souhwest", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: quote: Originally posted by L0A1: quote: Originally posted by jack_flats: \"http://www.nytimes.com/pages/national/ This has to be stopped. To many here in denial this is happening because NRA says' it isn't so, and they actually believe the NRA. This is a FACT folks, and it needs to be stopped, and quickly. Yea ok Jack. FACT eh? Like when the Obama Admin said 90% of the weapons the found on Mexican criminals came from the US when it was later found to be a Lie, that less then 18% were from the US? Keep ranting. I believe this as much as man made global warming. 90%, if not more, are coming right from the good o'l USofA and into Mexican hands. That fact has been debunked Jack. It is time to move on. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090415, 
        "postID": 17, 
        "quote": "Originally posted by jack_flats: quote: Originally posted by L0A1: quote: Originally posted by jack_flats: \"http://www.nytimes.com/pages/national/ This has to be stopped. To many here in denial this is happening because NRA says' it isn't so, and they actually believe the NRA. This is a FACT folks, and it needs to be stopped, and quickly. Yea ok Jack. FACT eh? Like when the Obama Admin said 90% of the weapons the found on Mexican criminals came from the US when it was later found to be a Lie, that less then 18% were from the US? Keep ranting. I believe this as much as man made global warming. 90%, if not more, are coming right from the good o'l USofA and into Mexican hands.", 
        "reply": " That fact has been debunked Jack. It is time to move on. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_8390087022001", 
        "time": "2009-04-15 12:17:00", 
        "title": "Guns Flowing to Mexican Cartels from US Souhwest", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: quote: Originally posted by L0A1: quote: Originally posted by jack_flats: \"http://www.nytimes.com/pages/national/ This has to be stopped. To many here in denial this is happening because NRA says' it isn't so, and they actually believe the NRA. This is a FACT folks, and it needs to be stopped, and quickly. Yea ok Jack. FACT eh? Like when the Obama Admin said 90% of the weapons the found on Mexican criminals came from the US when it was later found to be a Lie, that less then 18% were from the US? Keep ranting. I believe this as much as man made global warming. 90%, if not more, are coming right from the good o'l USofA and into Mexican hands. In 2007-2008, according to ATF Special Agent William Newell, Mexico submitted 11,000 guns to the ATF for tracing. Close to 6,000 were successfully traced -- and of those, 90 percent -- 5,114 to be exact, according to testimony in Congress by William Hoover -- were found to have come from the U.S. But in those same two years, according to the Mexican government, 29,000 guns were recovered at crime scenes. In other words, 68 percent of the guns that were recovered were never submitted for tracing. And when you weed out the roughly 6,000 guns that could not be traced from the remaining 32 percent, it means 83 percent of the guns found at crime scenes in Mexico could not be traced to the U.S. So, if not from the U.S., where do they come from? There are a variety of sources: -- The Black Market. Mexico is a virtual arms bazaar, with fragmentation grenades from South Korea, AK-47s from China, and shoulder-fired rocket launchers from Spain, Israel and former Soviet bloc manufacturers. -- Russian crime organizations. Interpol says Russian Mafia groups such as Poldolskaya and Moscow-based Solntsevskaya are actively trafficking drugs and arms in Mexico. - South America. During the late 1990s, the Revolutionary Armed Forces of Colombia (FARC) established a clandestine arms smuggling and drug trafficking partnership with the Tijuana cartel, according to the Federal Research Division report from the Library of Congress. -- Asia. According to a 2006 Amnesty International Report, China has provided arms to countries in Asia, Africa and Latin America. Chinese assault weapons and Korean explosives have been recovered in Mexico. -- The Mexican Army. More than 150,000 soldiers deserted in the last six years, according to Mexican Congressman Robert Badillo. Many took their weapons with them, including the standard issue M-16 assault rifle made in Belgium. -- Guatemala. U.S. intelligence agencies say traffickers move immigrants, stolen cars, guns and drugs, including most of America's cocaine, along the porous Mexican-Guatemalan border. On March 27, La Hora, a Guatemalan newspaper, reported that police seized 500 grenades and a load of AK-47s on the border. Police say the cache was transported by a Mexican drug cartel operating out of Ixcan, a border town. \"http://www.foxnews.com/politics/elections/2009/04/02/myth-percent-guns-mexico-fraction-number-claimed/\" Kind of like when the Dems do polls and claim that the USA is behind them. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090415, 
        "postID": 18, 
        "quote": "Originally posted by jack_flats: quote: Originally posted by L0A1: quote: Originally posted by jack_flats: \"http://www.nytimes.com/pages/national/ This has to be stopped. To many here in denial this is happening because NRA says' it isn't so, and they actually believe the NRA. This is a FACT folks, and it needs to be stopped, and quickly. Yea ok Jack. FACT eh? Like when the Obama Admin said 90% of the weapons the found on Mexican criminals came from the US when it was later found to be a Lie, that less then 18% were from the US? Keep ranting. I believe this as much as man made global warming. 90%, if not more, are coming right from the good o'l USofA and into Mexican hands.", 
        "reply": " In 2007-2008, according to ATF Special Agent William Newell, Mexico submitted 11,000 guns to the ATF for tracing. Close to 6,000 were successfully traced -- and of those, 90 percent -- 5,114 to be exact, according to testimony in Congress by William Hoover -- were found to have come from the U.S. But in those same two years, according to the Mexican government, 29,000 guns were recovered at crime scenes. In other words, 68 percent of the guns that were recovered were never submitted for tracing. And when you weed out the roughly 6,000 guns that could not be traced from the remaining 32 percent, it means 83 percent of the guns found at crime scenes in Mexico could not be traced to the U.S. So, if not from the U.S., where do they come from? There are a variety of sources: -- The Black Market. Mexico is a virtual arms bazaar, with fragmentation grenades from South Korea, AK-47s from China, and shoulder-fired rocket launchers from Spain, Israel and former Soviet bloc manufacturers. -- Russian crime organizations. Interpol says Russian Mafia groups such as Poldolskaya and Moscow-based Solntsevskaya are actively trafficking drugs and arms in Mexico. - South America. During the late 1990s, the Revolutionary Armed Forces of Colombia (FARC) established a clandestine arms smuggling and drug trafficking partnership with the Tijuana cartel, according to the Federal Research Division report from the Library of Congress. -- Asia. According to a 2006 Amnesty International Report, China has provided arms to countries in Asia, Africa and Latin America. Chinese assault weapons and Korean explosives have been recovered in Mexico. -- The Mexican Army. More than 150,000 soldiers deserted in the last six years, according to Mexican Congressman Robert Badillo. Many took their weapons with them, including the standard issue M-16 assault rifle made in Belgium. -- Guatemala. U.S. intelligence agencies say traffickers move immigrants, stolen cars, guns and drugs, including most of America's cocaine, along the porous Mexican-Guatemalan border. On March 27, La Hora, a Guatemalan newspaper, reported that police seized 500 grenades and a load of AK-47s on the border. Police say the cache was transported by a Mexican drug cartel operating out of Ixcan, a border town. \"http://www.foxnews.com/politics/elections/2009/04/02/myth-percent-guns-mexico-fraction-number-claimed/\" Kind of like when the Dems do polls and claim that the USA is behind them. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_8390087022001", 
        "time": "2009-04-15 12:23:00", 
        "title": "Guns Flowing to Mexican Cartels from US Souhwest", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: Look, I understand that you think America needs to police everybody. That isn't the case though. Mexico wants us to do this and that. Why don't they secure their own borders more tightly. By them doing searches of people coming in to Mexico and they can reduce the amount of weapons (18% that has come from America) and also prevent the drugs that come over. Yet, we need to do more to prevent the drugs from coming over as well. But that won't happen. Drugs are not going to be prevented there just isn't any possible way. This war is because of our actions, and only our actions. If the drug users (us) stopped using the drugs, the violence would end.", 
        "intTime": 20090415, 
        "postID": 19, 
        "quote": "Originally posted by Anbar7: Look, I understand that you think America needs to police everybody. That isn't the case though. Mexico wants us to do this and that. Why don't they secure their own borders more tightly. By them doing searches of people coming in to Mexico and they can reduce the amount of weapons (18% that has come from America) and also prevent the drugs that come over. Yet, we need to do more to prevent the drugs from coming over as well. But that won't happen. Drugs are not going to be prevented there just isn't any possible way.", 
        "reply": " This war is because of our actions, and only our actions. If the drug users (us) stopped using the drugs, the violence would end.", 
        "threadID": "672198221_8390087022001", 
        "time": "2009-04-15 12:23:00", 
        "title": "Guns Flowing to Mexican Cartels from US Souhwest", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by Anbar7: Look, I understand that you think America needs to police everybody. That isn't the case though. Mexico wants us to do this and that. Why don't they secure their own borders more tightly. By them doing searches of people coming in to Mexico and they can reduce the amount of weapons (18% that has come from America) and also prevent the drugs that come over. Yet, we need to do more to prevent the drugs from coming over as well. But that won't happen. Drugs are not going to be prevented there just isn't any possible way. This war is because of our actions, and only our actions. If the drug users (us) stopped using the drugs, the violence would end. And as I said before there is not way to stop people from doing drugs...sorry. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090415, 
        "postID": 20, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by Anbar7: Look, I understand that you think America needs to police everybody. That isn't the case though. Mexico wants us to do this and that. Why don't they secure their own borders more tightly. By them doing searches of people coming in to Mexico and they can reduce the amount of weapons (18% that has come from America) and also prevent the drugs that come over. Yet, we need to do more to prevent the drugs from coming over as well. But that won't happen. Drugs are not going to be prevented there just isn't any possible way. This war is because of our actions, and only our actions. If the drug users (us) stopped using the drugs, the violence would end.", 
        "reply": " And as I said before there is not way to stop people from doing drugs...sorry. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_8390087022001", 
        "time": "2009-04-15 12:28:00", 
        "title": "Guns Flowing to Mexican Cartels from US Souhwest", 
        "userID": "Anbar7"
    }, 
    {
        "content": "\"http://www.nytimes.com/pages/national/ This has to be stopped. To many here in denial this is happening because NRA says' it isn't so, and they actually believe the NRA. This is a FACT folks, and it needs to be stopped, and quickly. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090415, 
        "postID": 21, 
        "quote": "", 
        "reply": "\"http://www.nytimes.com/pages/national/ This has to be stopped. To many here in denial this is happening because NRA says' it isn't so, and they actually believe the NRA. This is a FACT folks, and it needs to be stopped, and quickly. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_8390087022001", 
        "time": "2009-04-15 08:00:00", 
        "title": "Guns Flowing to Mexican Cartels from US Souhwest", 
        "userID": "jack_flats"
    }, 
    {
        "content": "wow and here i though the full autos were coming from mexico...", 
        "intTime": 20090415, 
        "postID": 22, 
        "quote": "", 
        "reply": "wow and here i though the full autos were coming from mexico...", 
        "threadID": "672198221_8390087022001", 
        "time": "2009-04-15 08:01:00", 
        "title": "Guns Flowing to Mexican Cartels from US Souhwest", 
        "userID": "outlaws93"
    }, 
    {
        "content": "Well now ... if the administration puts as much effort into stopping illegals crossing the border as they do mouthing off about guns doing the same, they'll stop both ... Wishful thinking, I know. It is much more self-serving to use the guns allegedly flowing into Mexico as political cover to constrain gun ownership. BTW ... I don't know an NRA statistic from a hole in the ground ... but I do pay attention to the statistics from the ATF ... and while \"we\" are part of the problem, we aren't the bulk of the problem ... not by a country mile.", 
        "intTime": 20090415, 
        "postID": 23, 
        "quote": "", 
        "reply": "Well now ... if the administration puts as much effort into stopping illegals crossing the border as they do mouthing off about guns doing the same, they'll stop both ... Wishful thinking, I know. It is much more self-serving to use the guns allegedly flowing into Mexico as political cover to constrain gun ownership. BTW ... I don't know an NRA statistic from a hole in the ground ... but I do pay attention to the statistics from the ATF ... and while \"we\" are part of the problem, we aren't the bulk of the problem ... not by a country mile.", 
        "threadID": "672198221_8390087022001", 
        "time": "2009-04-15 08:13:00", 
        "title": "Guns Flowing to Mexican Cartels from US Souhwest", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Originally posted by I_M_Qwerty: Well now ... if the administration puts as much effort into stopping illegals crossing the border as they do mouthing off about guns doing the same, they'll stop both ... Wishful thinking, I know. It is much more self-serving to use the guns allegedly flowing into Mexico as political cover to constrain gun ownership.", 
        "intTime": 20090415, 
        "postID": 24, 
        "quote": "Originally posted by I_M_Qwerty: Well now ... if the administration puts as much effort into stopping illegals crossing the border as they do mouthing off about guns doing the same, they'll stop both ... Wishful thinking, I know. It is much more self-serving to use the guns allegedly flowing into Mexico as political cover to constrain gun ownership.", 
        "reply": "", 
        "threadID": "672198221_8390087022001", 
        "time": "2009-04-15 08:15:00", 
        "title": "Guns Flowing to Mexican Cartels from US Souhwest", 
        "userID": "NickBrand"
    }, 
    {
        "content": "From the article ... quote: Mexican officials have repeatedly asked the United States to clamp down on the flow of weapons and are likely to bring it up again with President Obama when he visits Mexico on Thursday. ... and for how long has the United States been (lamely) asking Mexico to clamp down on the flow of illegals to the United States? ... and not only been given the brush off but had the Mexican government aid and abet illegals? Wouldn't want Mexico to put a dent in its cash flow from illegals in the U.S. now would we?", 
        "intTime": 20090415, 
        "postID": 25, 
        "quote": "Mexican officials have repeatedly asked the United States to clamp down on the flow of weapons and are likely to bring it up again with President Obama when he visits Mexico on Thursday.", 
        "reply": "From the article ...  ... and for how long has the United States been (lamely) asking Mexico to clamp down on the flow of illegals to the United States? ... and not only been given the brush off but had the Mexican government aid and abet illegals? Wouldn't want Mexico to put a dent in its cash flow from illegals in the U.S. now would we?", 
        "threadID": "672198221_8390087022001", 
        "time": "2009-04-15 08:24:00", 
        "title": "Guns Flowing to Mexican Cartels from US Souhwest", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "This has more to do with Mexico not searching people before they go back over the border. We do our part when they come in, but it is legal to own a weapon in the U.S. so if they Mexicans are going to search them when they come back over, it really isn't going to make a difference. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090415, 
        "postID": 26, 
        "quote": "", 
        "reply": "This has more to do with Mexico not searching people before they go back over the border. We do our part when they come in, but it is legal to own a weapon in the U.S. so if they Mexicans are going to search them when they come back over, it really isn't going to make a difference. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_8390087022001", 
        "time": "2009-04-15 08:37:00", 
        "title": "Guns Flowing to Mexican Cartels from US Souhwest", 
        "userID": "Anbar7"
    }, 
    {
        "content": "Many, many years ago when I was entering Texas, the customs people were suspicious of me and literally took my entire car apart. It's not the job of customs to stop people leaving the country, although apparently they are now doing this. But like US customs taking my car apart, I have to ask why Mexican authorities don't seem to be able to expend the effort to guard THEIR border (not mine) from illegal guns? I read this article and it's not as if there are caravans of guns, loaded on camals with security guards making the trips.... Dave", 
        "intTime": 20090415, 
        "postID": 27, 
        "quote": "", 
        "reply": "Many, many years ago when I was entering Texas, the customs people were suspicious of me and literally took my entire car apart. It's not the job of customs to stop people leaving the country, although apparently they are now doing this. But like US customs taking my car apart, I have to ask why Mexican authorities don't seem to be able to expend the effort to guard THEIR border (not mine) from illegal guns? I read this article and it's not as if there are caravans of guns, loaded on camals with security guards making the trips.... Dave", 
        "threadID": "672198221_8390087022001", 
        "time": "2009-04-15 08:42:00", 
        "title": "Guns Flowing to Mexican Cartels from US Souhwest", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: \"http://www.nytimes.com/pages/national/ This has to be stopped. To many here in denial this is happening because NRA says' it isn't so, and they actually believe the NRA. This is a FACT folks, and it needs to be stopped, and quickly. Yea ok Jack. FACT eh? Like when the Obama Admin said 90% of the weapons the found on Mexican criminals came from the US when it was later found to be a Lie, that less then 18% were from the US? Keep ranting. I believe this as much as man made global warming. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090415, 
        "postID": 28, 
        "quote": "Originally posted by jack_flats: \"http://www.nytimes.com/pages/national/ This has to be stopped. To many here in denial this is happening because NRA says' it isn't so, and they actually believe the NRA. This is a FACT folks, and it needs to be stopped, and quickly.", 
        "reply": " Yea ok Jack. FACT eh? Like when the Obama Admin said 90% of the weapons the found on Mexican criminals came from the US when it was later found to be a Lie, that less then 18% were from the US? Keep ranting. I believe this as much as man made global warming. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_8390087022001", 
        "time": "2009-04-15 08:49:00", 
        "title": "Guns Flowing to Mexican Cartels from US Souhwest", 
        "userID": "L0A1"
    }, 
    {
        "content": "The original item was already disproved. . . repeatedly. It is a lie; another leftist, control freak red herring to sucker fools. Even if it were true, which it obviously is not, there shall be NO INFRINGEMENT OF THE RIGHT TO KEEP AND BEAR ARMS in these United States because some other nation cannot control its own society, due to the graft and indifference of many of its authorities.", 
        "intTime": 20090415, 
        "postID": 29, 
        "quote": "", 
        "reply": "The original item was already disproved. . . repeatedly. It is a lie; another leftist, control freak red herring to sucker fools. Even if it were true, which it obviously is not, there shall be NO INFRINGEMENT OF THE RIGHT TO KEEP AND BEAR ARMS in these United States because some other nation cannot control its own society, due to the graft and indifference of many of its authorities.", 
        "threadID": "672198221_8390087022001", 
        "time": "2009-04-15 11:29:00", 
        "title": "Guns Flowing to Mexican Cartels from US Souhwest", 
        "userID": "RRR52"
    }, 
    {
        "content": "quote: Originally posted by Grachus: Many, many years ago when I was entering Texas, the customs people were suspicious of me and literally took my entire car apart. It's not the job of customs to stop people leaving the country, although apparently they are now doing this. But like US customs taking my car apart, I have to ask why Mexican authorities don't seem to be able to expend the effort to guard THEIR border (not mine) from illegal guns? I read this article and it's not as if there are caravans of guns, loaded on camals with security guards making the trips.... Dave Exactlly, the Governemnt of Mexico needs to take care of THEIR border by doing the necessary checks not us securing their border for them. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090415, 
        "postID": 30, 
        "quote": "Originally posted by Grachus: Many, many years ago when I was entering Texas, the customs people were suspicious of me and literally took my entire car apart. It's not the job of customs to stop people leaving the country, although apparently they are now doing this. But like US customs taking my car apart, I have to ask why Mexican authorities don't seem to be able to expend the effort to guard THEIR border (not mine) from illegal guns? I read this article and it's not as if there are caravans of guns, loaded on camals with security guards making the trips.... Dave", 
        "reply": " Exactlly, the Governemnt of Mexico needs to take care of THEIR border by doing the necessary checks not us securing their border for them. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_8390087022001", 
        "time": "2009-04-15 11:38:00", 
        "title": "Guns Flowing to Mexican Cartels from US Souhwest", 
        "userID": "Anbar7"
    }, 
    {
        "content": "More smoke and mirrors.... folks this fits the pattern of the dhs report. Of the world America's fugd up tour. America is to blame for illegals coming here, for violence in Mehiko. For them not checking vehicles when entering THEIR country. So the only rememdy is let illegals get amnesty. take weapons away from Law abiding citizens. and let all nations azz bone us. Come on people we had a psuedo genocide here once and slavery, and we dropped a nuke on Japan. We dont rate. Oh, yeh we are arrogant.", 
        "intTime": 20090415, 
        "postID": 31, 
        "quote": "", 
        "reply": "More smoke and mirrors.... folks this fits the pattern of the dhs report. Of the world America's fugd up tour. America is to blame for illegals coming here, for violence in Mehiko. For them not checking vehicles when entering THEIR country. So the only rememdy is let illegals get amnesty. take weapons away from Law abiding citizens. and let all nations azz bone us. Come on people we had a psuedo genocide here once and slavery, and we dropped a nuke on Japan. We dont rate. Oh, yeh we are arrogant.", 
        "threadID": "672198221_8390087022001", 
        "time": "2009-04-15 11:44:00", 
        "title": "Guns Flowing to Mexican Cartels from US Souhwest", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by RRR52: The original item was already disproved. . . repeatedly. It is a lie; another leftist, control freak red herring to sucker fools. Even if it were true, which it obviously is not, there shall be NO INFRINGEMENT OF THE RIGHT TO KEEP AND BEAR ARMS in these United States because some other nation cannot control its own society, due to the graft and indifference of many of its authorities. While I personally doubt this story, and even if I didn't it's irrelevant, the Second Amendment does not authorise Americans to sell guns to criminals. Anyone who does so is in violation of law, not the Second Amendment. Anyone we catch, should rightfully be tossed in the can. The real question is not OUR rights, but rather why the Mexican government chooses NOT to enfore their own laws. There's nothing on our part that prevents them from searching cars or trucks entering THEIR country. Why blame us, when they can't seem to spare the energy? Dave", 
        "intTime": 20090415, 
        "postID": 32, 
        "quote": "Originally posted by RRR52: The original item was already disproved. . . repeatedly. It is a lie; another leftist, control freak red herring to sucker fools. Even if it were true, which it obviously is not, there shall be NO INFRINGEMENT OF THE RIGHT TO KEEP AND BEAR ARMS in these United States because some other nation cannot control its own society, due to the graft and indifference of many of its authorities.", 
        "reply": " While I personally doubt this story, and even if I didn't it's irrelevant, the Second Amendment does not authorise Americans to sell guns to criminals. Anyone who does so is in violation of law, not the Second Amendment. Anyone we catch, should rightfully be tossed in the can. The real question is not OUR rights, but rather why the Mexican government chooses NOT to enfore their own laws. There's nothing on our part that prevents them from searching cars or trucks entering THEIR country. Why blame us, when they can't seem to spare the energy? Dave", 
        "threadID": "672198221_8390087022001", 
        "time": "2009-04-15 11:46:00", 
        "title": "Guns Flowing to Mexican Cartels from US Souhwest", 
        "userID": "Grachus"
    }, 
    {
        "content": "Americans are the ones doing the drugs, so we are responsible for the violence. We are bringing this on ourselves. I don't know why we keep blaming Mexico. If they weren't supplying the drugs, someone else would be.", 
        "intTime": 20090415, 
        "postID": 33, 
        "quote": "", 
        "reply": "Americans are the ones doing the drugs, so we are responsible for the violence. We are bringing this on ourselves. I don't know why we keep blaming Mexico. If they weren't supplying the drugs, someone else would be.", 
        "threadID": "672198221_8390087022001", 
        "time": "2009-04-15 12:05:00", 
        "title": "Guns Flowing to Mexican Cartels from US Souhwest", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by jack_flats: \"http://www.nytimes.com/pages/national/ This has to be stopped. To many here in denial this is happening because NRA says' it isn't so, and they actually believe the NRA. This is a FACT folks, and it needs to be stopped, and quickly. Yea ok Jack. FACT eh? Like when the Obama Admin said 90% of the weapons the found on Mexican criminals came from the US when it was later found to be a Lie, that less then 18% were from the US? Keep ranting. I believe this as much as man made global warming. 90%, if not more, are coming right from the good o'l USofA and into Mexican hands. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090415, 
        "postID": 34, 
        "quote": "Originally posted by L0A1: quote: Originally posted by jack_flats: \"http://www.nytimes.com/pages/national/ This has to be stopped. To many here in denial this is happening because NRA says' it isn't so, and they actually believe the NRA. This is a FACT folks, and it needs to be stopped, and quickly. Yea ok Jack. FACT eh? Like when the Obama Admin said 90% of the weapons the found on Mexican criminals came from the US when it was later found to be a Lie, that less then 18% were from the US? Keep ranting. I believe this as much as man made global warming.", 
        "reply": " 90%, if not more, are coming right from the good o'l USofA and into Mexican hands. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_8390087022001", 
        "time": "2009-04-15 12:11:00", 
        "title": "Guns Flowing to Mexican Cartels from US Souhwest", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: Exactlly, the Governemnt of Mexico needs to take care of THEIR border by doing the necessary checks not us securing their border for them. Why? Mexicans aren't doing the drugs. We create the demand, and therefore we create the violence.", 
        "intTime": 20090415, 
        "postID": 35, 
        "quote": "Originally posted by Anbar7: Exactlly, the Governemnt of Mexico needs to take care of THEIR border by doing the necessary checks not us securing their border for them.", 
        "reply": " Why? Mexicans aren't doing the drugs. We create the demand, and therefore we create the violence.", 
        "threadID": "672198221_8390087022001", 
        "time": "2009-04-15 12:14:00", 
        "title": "Guns Flowing to Mexican Cartels from US Souhwest", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by Anbar7: Exactlly, the Governemnt of Mexico needs to take care of THEIR border by doing the necessary checks not us securing their border for them. Why? Mexicans aren't doing the drugs. We create the demand, and therefore we create the violence. Look, I understand that you think America needs to police everybody. That isn't the case though. Mexico wants us to do this and that. Why don't they secure their own borders more tightly. By them doing searches of people coming in to Mexico and they can reduce the amount of weapons (18% that has come from America) and also prevent the drugs that come over. Yet, we need to do more to prevent the drugs from coming over as well. But that won't happen. Drugs are not going to be prevented there just isn't any possible way. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090415, 
        "postID": 36, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by Anbar7: Exactlly, the Governemnt of Mexico needs to take care of THEIR border by doing the necessary checks not us securing their border for them. Why? Mexicans aren't doing the drugs. We create the demand, and therefore we create the violence.", 
        "reply": " Look, I understand that you think America needs to police everybody. That isn't the case though. Mexico wants us to do this and that. Why don't they secure their own borders more tightly. By them doing searches of people coming in to Mexico and they can reduce the amount of weapons (18% that has come from America) and also prevent the drugs that come over. Yet, we need to do more to prevent the drugs from coming over as well. But that won't happen. Drugs are not going to be prevented there just isn't any possible way. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_8390087022001", 
        "time": "2009-04-15 12:16:00", 
        "title": "Guns Flowing to Mexican Cartels from US Souhwest", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: quote: Originally posted by L0A1: quote: Originally posted by jack_flats: \"http://www.nytimes.com/pages/national/ This has to be stopped. To many here in denial this is happening because NRA says' it isn't so, and they actually believe the NRA. This is a FACT folks, and it needs to be stopped, and quickly. Yea ok Jack. FACT eh? Like when the Obama Admin said 90% of the weapons the found on Mexican criminals came from the US when it was later found to be a Lie, that less then 18% were from the US? Keep ranting. I believe this as much as man made global warming. 90%, if not more, are coming right from the good o'l USofA and into Mexican hands. That fact has been debunked Jack. It is time to move on. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090415, 
        "postID": 37, 
        "quote": "Originally posted by jack_flats: quote: Originally posted by L0A1: quote: Originally posted by jack_flats: \"http://www.nytimes.com/pages/national/ This has to be stopped. To many here in denial this is happening because NRA says' it isn't so, and they actually believe the NRA. This is a FACT folks, and it needs to be stopped, and quickly. Yea ok Jack. FACT eh? Like when the Obama Admin said 90% of the weapons the found on Mexican criminals came from the US when it was later found to be a Lie, that less then 18% were from the US? Keep ranting. I believe this as much as man made global warming. 90%, if not more, are coming right from the good o'l USofA and into Mexican hands.", 
        "reply": " That fact has been debunked Jack. It is time to move on. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_8390087022001", 
        "time": "2009-04-15 12:17:00", 
        "title": "Guns Flowing to Mexican Cartels from US Souhwest", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: quote: Originally posted by L0A1: quote: Originally posted by jack_flats: \"http://www.nytimes.com/pages/national/ This has to be stopped. To many here in denial this is happening because NRA says' it isn't so, and they actually believe the NRA. This is a FACT folks, and it needs to be stopped, and quickly. Yea ok Jack. FACT eh? Like when the Obama Admin said 90% of the weapons the found on Mexican criminals came from the US when it was later found to be a Lie, that less then 18% were from the US? Keep ranting. I believe this as much as man made global warming. 90%, if not more, are coming right from the good o'l USofA and into Mexican hands. In 2007-2008, according to ATF Special Agent William Newell, Mexico submitted 11,000 guns to the ATF for tracing. Close to 6,000 were successfully traced -- and of those, 90 percent -- 5,114 to be exact, according to testimony in Congress by William Hoover -- were found to have come from the U.S. But in those same two years, according to the Mexican government, 29,000 guns were recovered at crime scenes. In other words, 68 percent of the guns that were recovered were never submitted for tracing. And when you weed out the roughly 6,000 guns that could not be traced from the remaining 32 percent, it means 83 percent of the guns found at crime scenes in Mexico could not be traced to the U.S. So, if not from the U.S., where do they come from? There are a variety of sources: -- The Black Market. Mexico is a virtual arms bazaar, with fragmentation grenades from South Korea, AK-47s from China, and shoulder-fired rocket launchers from Spain, Israel and former Soviet bloc manufacturers. -- Russian crime organizations. Interpol says Russian Mafia groups such as Poldolskaya and Moscow-based Solntsevskaya are actively trafficking drugs and arms in Mexico. - South America. During the late 1990s, the Revolutionary Armed Forces of Colombia (FARC) established a clandestine arms smuggling and drug trafficking partnership with the Tijuana cartel, according to the Federal Research Division report from the Library of Congress. -- Asia. According to a 2006 Amnesty International Report, China has provided arms to countries in Asia, Africa and Latin America. Chinese assault weapons and Korean explosives have been recovered in Mexico. -- The Mexican Army. More than 150,000 soldiers deserted in the last six years, according to Mexican Congressman Robert Badillo. Many took their weapons with them, including the standard issue M-16 assault rifle made in Belgium. -- Guatemala. U.S. intelligence agencies say traffickers move immigrants, stolen cars, guns and drugs, including most of America's cocaine, along the porous Mexican-Guatemalan border. On March 27, La Hora, a Guatemalan newspaper, reported that police seized 500 grenades and a load of AK-47s on the border. Police say the cache was transported by a Mexican drug cartel operating out of Ixcan, a border town. \"http://www.foxnews.com/politics/elections/2009/04/02/myth-percent-guns-mexico-fraction-number-claimed/\" Kind of like when the Dems do polls and claim that the USA is behind them. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090415, 
        "postID": 38, 
        "quote": "Originally posted by jack_flats: quote: Originally posted by L0A1: quote: Originally posted by jack_flats: \"http://www.nytimes.com/pages/national/ This has to be stopped. To many here in denial this is happening because NRA says' it isn't so, and they actually believe the NRA. This is a FACT folks, and it needs to be stopped, and quickly. Yea ok Jack. FACT eh? Like when the Obama Admin said 90% of the weapons the found on Mexican criminals came from the US when it was later found to be a Lie, that less then 18% were from the US? Keep ranting. I believe this as much as man made global warming. 90%, if not more, are coming right from the good o'l USofA and into Mexican hands.", 
        "reply": " In 2007-2008, according to ATF Special Agent William Newell, Mexico submitted 11,000 guns to the ATF for tracing. Close to 6,000 were successfully traced -- and of those, 90 percent -- 5,114 to be exact, according to testimony in Congress by William Hoover -- were found to have come from the U.S. But in those same two years, according to the Mexican government, 29,000 guns were recovered at crime scenes. In other words, 68 percent of the guns that were recovered were never submitted for tracing. And when you weed out the roughly 6,000 guns that could not be traced from the remaining 32 percent, it means 83 percent of the guns found at crime scenes in Mexico could not be traced to the U.S. So, if not from the U.S., where do they come from? There are a variety of sources: -- The Black Market. Mexico is a virtual arms bazaar, with fragmentation grenades from South Korea, AK-47s from China, and shoulder-fired rocket launchers from Spain, Israel and former Soviet bloc manufacturers. -- Russian crime organizations. Interpol says Russian Mafia groups such as Poldolskaya and Moscow-based Solntsevskaya are actively trafficking drugs and arms in Mexico. - South America. During the late 1990s, the Revolutionary Armed Forces of Colombia (FARC) established a clandestine arms smuggling and drug trafficking partnership with the Tijuana cartel, according to the Federal Research Division report from the Library of Congress. -- Asia. According to a 2006 Amnesty International Report, China has provided arms to countries in Asia, Africa and Latin America. Chinese assault weapons and Korean explosives have been recovered in Mexico. -- The Mexican Army. More than 150,000 soldiers deserted in the last six years, according to Mexican Congressman Robert Badillo. Many took their weapons with them, including the standard issue M-16 assault rifle made in Belgium. -- Guatemala. U.S. intelligence agencies say traffickers move immigrants, stolen cars, guns and drugs, including most of America's cocaine, along the porous Mexican-Guatemalan border. On March 27, La Hora, a Guatemalan newspaper, reported that police seized 500 grenades and a load of AK-47s on the border. Police say the cache was transported by a Mexican drug cartel operating out of Ixcan, a border town. \"http://www.foxnews.com/politics/elections/2009/04/02/myth-percent-guns-mexico-fraction-number-claimed/\" Kind of like when the Dems do polls and claim that the USA is behind them. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_8390087022001", 
        "time": "2009-04-15 12:23:00", 
        "title": "Guns Flowing to Mexican Cartels from US Souhwest", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: Look, I understand that you think America needs to police everybody. That isn't the case though. Mexico wants us to do this and that. Why don't they secure their own borders more tightly. By them doing searches of people coming in to Mexico and they can reduce the amount of weapons (18% that has come from America) and also prevent the drugs that come over. Yet, we need to do more to prevent the drugs from coming over as well. But that won't happen. Drugs are not going to be prevented there just isn't any possible way. This war is because of our actions, and only our actions. If the drug users (us) stopped using the drugs, the violence would end.", 
        "intTime": 20090415, 
        "postID": 39, 
        "quote": "Originally posted by Anbar7: Look, I understand that you think America needs to police everybody. That isn't the case though. Mexico wants us to do this and that. Why don't they secure their own borders more tightly. By them doing searches of people coming in to Mexico and they can reduce the amount of weapons (18% that has come from America) and also prevent the drugs that come over. Yet, we need to do more to prevent the drugs from coming over as well. But that won't happen. Drugs are not going to be prevented there just isn't any possible way.", 
        "reply": " This war is because of our actions, and only our actions. If the drug users (us) stopped using the drugs, the violence would end.", 
        "threadID": "672198221_8390087022001", 
        "time": "2009-04-15 12:23:00", 
        "title": "Guns Flowing to Mexican Cartels from US Souhwest", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by Anbar7: Look, I understand that you think America needs to police everybody. That isn't the case though. Mexico wants us to do this and that. Why don't they secure their own borders more tightly. By them doing searches of people coming in to Mexico and they can reduce the amount of weapons (18% that has come from America) and also prevent the drugs that come over. Yet, we need to do more to prevent the drugs from coming over as well. But that won't happen. Drugs are not going to be prevented there just isn't any possible way. This war is because of our actions, and only our actions. If the drug users (us) stopped using the drugs, the violence would end. And as I said before there is not way to stop people from doing drugs...sorry. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090415, 
        "postID": 40, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by Anbar7: Look, I understand that you think America needs to police everybody. That isn't the case though. Mexico wants us to do this and that. Why don't they secure their own borders more tightly. By them doing searches of people coming in to Mexico and they can reduce the amount of weapons (18% that has come from America) and also prevent the drugs that come over. Yet, we need to do more to prevent the drugs from coming over as well. But that won't happen. Drugs are not going to be prevented there just isn't any possible way. This war is because of our actions, and only our actions. If the drug users (us) stopped using the drugs, the violence would end.", 
        "reply": " And as I said before there is not way to stop people from doing drugs...sorry. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_8390087022001", 
        "time": "2009-04-15 12:28:00", 
        "title": "Guns Flowing to Mexican Cartels from US Souhwest", 
        "userID": "Anbar7"
    }
]