[
    {
        "content": "quote: RAMALLAH, West Bank, March 4 (Reuters) - U.S. Secretary of State Hillary Clinton criticised Israel on Wednesday over plans to demolish Palestinian homes in Arab East Jerusalem and said Washington would engage Israeli leaders on Jewish settlements. Calling the planned destruction of more than 80 dwellings \"unhelpful\", Clinton said after talks with Palestinian leaders: \"It is an issue that we intend to raise with the government of Israel and the government at the municipal level in Jerusalem.\" Israel says the homes slated for demolition were built without permits. Palestinians say authorisation from Israel's Jerusalem municipality is nearly impossible to obtain. They accuse Israel of trying to drive them out of East Jerusalem, territory captured in a 1967 war, to make room for Jewish families. Israel considers all of Jerusalem its \"united and eternal\" capital, a claim that has not won international recognition. The Palestinian Authority wants East Jerusalem to be the capital of a Palestinian state. At a news conference with Palestinian President Mahmoud Abbas in the occupied West Bank, Clinton stopped short of repeating U.S. calls for an immediate cessation of Israeli settlement expansion but promised to follow up on the issue. \"We will be looking for a way to put it on the table along with all the other issues that need to be discussed and resolved,\" she said. \"I think at this time, we should wait until we have a new Israeli government. That will be soon and then we will look at whatever tools are available,\" Clinton said repeating her support for creation of a Palestinian state alongside Israel. Instead of bringing up the “permit” issue, they could have claimed they were fired upon from those residences....bulldoze away! +http://uk.reuters.com/article/featuredCrisis/idUKJER0298222", 
        "intTime": 20090304, 
        "postID": 1, 
        "quote": "RAMALLAH, West Bank, March 4 (Reuters) - U.S. Secretary of State Hillary Clinton criticised Israel on Wednesday over plans to demolish Palestinian homes in Arab East Jerusalem and said Washington would engage Israeli leaders on Jewish settlements. Calling the planned destruction of more than 80 dwellings \"unhelpful\", Clinton said after talks with Palestinian leaders: \"It is an issue that we intend to raise with the government of Israel and the government at the municipal level in Jerusalem.\" Israel says the homes slated for demolition were built without permits. Palestinians say authorisation from Israel's Jerusalem municipality is nearly impossible to obtain. They accuse Israel of trying to drive them out of East Jerusalem, territory captured in a 1967 war, to make room for Jewish families. Israel considers all of Jerusalem its \"united and eternal\" capital, a claim that has not won international recognition. The Palestinian Authority wants East Jerusalem to be the capital of a Palestinian state. At a news conference with Palestinian President Mahmoud Abbas in the occupied West Bank, Clinton stopped short of repeating U.S. calls for an immediate cessation of Israeli settlement expansion but promised to follow up on the issue. \"We will be looking for a way to put it on the table along with all the other issues that need to be discussed and resolved,\" she said. \"I think at this time, we should wait until we have a new Israeli government. That will be soon and then we will look at whatever tools are available,\" Clinton said repeating her support for creation of a Palestinian state alongside Israel.", 
        "reply": " Instead of bringing up the “permit” issue, they could have claimed they were fired upon from those residences....bulldoze away! +http://uk.reuters.com/article/featuredCrisis/idUKJER0298222", 
        "threadID": "672198221_5870078612001", 
        "time": "2009-03-04 07:56:00", 
        "title": "Clinton criticises Israel over E. Jerusalem demolition", 
        "userID": "Knele"
    }, 
    {
        "content": "Every residential community needs a park, a public space where residents can come together in peace and harmony. It's just too bad those Palestinians chose to live where the park is going to go. About 'engagement' on the proposed new settlements - 73 000 new homes planned. Good to see that the building boom goes on in Israel unaffected by the rest of the world. Are the welfare payments included in the bail-out budget?", 
        "intTime": 20090304, 
        "postID": 2, 
        "quote": "", 
        "reply": "Every residential community needs a park, a public space where residents can come together in peace and harmony. It's just too bad those Palestinians chose to live where the park is going to go. About 'engagement' on the proposed new settlements - 73 000 new homes planned. Good to see that the building boom goes on in Israel unaffected by the rest of the world. Are the welfare payments included in the bail-out budget?", 
        "threadID": "672198221_5870078612001", 
        "time": "2009-03-04 08:34:00", 
        "title": "Clinton criticises Israel over E. Jerusalem demolition", 
        "userID": "popsiq"
    }
]