[
    {
        "content": "\"http://www.govexec.com/features/0509-01/0509-01s1.htm\" Interesting article. I look forward to seeing what the new Director of OPM has in store.", 
        "intTime": 20090506, 
        "postID": 1, 
        "quote": "", 
        "reply": "\"http://www.govexec.com/features/0509-01/0509-01s1.htm\" Interesting article. I look forward to seeing what the new Director of OPM has in store.", 
        "threadID": "672198221_7980026222001", 
        "time": "2009-05-06 09:09:00", 
        "title": "FDIC leads the way on domestic partner benefits", 
        "userID": "Flygirl62"
    }, 
    {
        "content": "Therein lies a problem not many are addressing. To extend the same benefits to gay couples you would have to extend those same benefits to people in committed relationships as said in the article. quote: It was a largely tame event, without much in the way of partisan bickering or attempts to score points on either side of the culture war. The lone Republican attendee, Maine Sen. Susan M. Collins, was there to support the bill, and she even suggested broadening it to include heterosexual couples who are not married but live together in committed relationships. I am all for equal benefits for gay couples as long as it doesn't discriminate against straight couples that are not married. Where will all this money come from??? It also doesn't address the far right opposition on age requirements for consent. Or EXCLUDE the freaks out their into werid lifestyles. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090506, 
        "postID": 2, 
        "quote": "It was a largely tame event, without much in the way of partisan bickering or attempts to score points on either side of the culture war. The lone Republican attendee, Maine Sen. Susan M. Collins, was there to support the bill, and she even suggested broadening it to include heterosexual couples who are not married but live together in committed relationships.", 
        "reply": "Therein lies a problem not many are addressing. To extend the same benefits to gay couples you would have to extend those same benefits to people in committed relationships as said in the article.  I am all for equal benefits for gay couples as long as it doesn't discriminate against straight couples that are not married. Where will all this money come from??? It also doesn't address the far right opposition on age requirements for consent. Or EXCLUDE the freaks out their into werid lifestyles. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_7980026222001", 
        "time": "2009-05-06 09:37:00", 
        "title": "FDIC leads the way on domestic partner benefits", 
        "userID": "L0A1"
    }, 
    {
        "content": "Here is a good place that you can post whatever you like and update your profile whenever you like!! http://u*smilnet.com/smf/index.php?action=forum Just take the asterisk out when you paste this in your address bar.", 
        "intTime": 20090506, 
        "postID": 3, 
        "quote": "", 
        "reply": "Here is a good place that you can post whatever you like and update your profile whenever you like!! http://u*smilnet.com/smf/index.php?action=forum Just take the asterisk out when you paste this in your address bar.", 
        "threadID": "672198221_7980026222001", 
        "time": "2009-05-06 09:46:00", 
        "title": "FDIC leads the way on domestic partner benefits", 
        "userID": "ArtyOps"
    }, 
    {
        "content": "quote: Originally posted by L0A1: Therein lies a problem not many are addressing. To extend the same benefits to gay couples you would have to extend those same benefits to people in committed relationships as said in the article. quote: It was a largely tame event, without much in the way of partisan bickering or attempts to score points on either side of the culture war. The lone Republican attendee, Maine Sen. Susan M. Collins, was there to support the bill, and she even suggested broadening it to include heterosexual couples who are not married but live together in committed relationships. I am all for equal benefits for gay couples as long as it doesn't discriminate against straight couples that are not married. Where will all this money come from??? It also doesn't address the far right opposition on age requirements for consent. Or EXCLUDE the freaks out their into werid lifestyles. I agree with you on offering benefits to str8 couples in a committed relationship. Fair is fair. Where will all the money come from? That is really at the heart of the Feds' reservations. All those new relationships they will have to recognize and subsidize as they have been doing for years for str8 married couples. The rest of your post is an old tired argument. Obviously there should be the same age and consent requirements as apply to str8s. Throwing that in there is more of a diversionary tactic. That's okay. At least we agree that benefits should be available to both gays and unmarried str8 couples...as long as everyone can agree on what constitutes a committed relationship.", 
        "intTime": 20090506, 
        "postID": 4, 
        "quote": "Originally posted by L0A1: Therein lies a problem not many are addressing. To extend the same benefits to gay couples you would have to extend those same benefits to people in committed relationships as said in the article. quote: It was a largely tame event, without much in the way of partisan bickering or attempts to score points on either side of the culture war. The lone Republican attendee, Maine Sen. Susan M. Collins, was there to support the bill, and she even suggested broadening it to include heterosexual couples who are not married but live together in committed relationships. I am all for equal benefits for gay couples as long as it doesn't discriminate against straight couples that are not married. Where will all this money come from??? It also doesn't address the far right opposition on age requirements for consent. Or EXCLUDE the freaks out their into werid lifestyles.", 
        "reply": " I agree with you on offering benefits to str8 couples in a committed relationship. Fair is fair. Where will all the money come from? That is really at the heart of the Feds' reservations. All those new relationships they will have to recognize and subsidize as they have been doing for years for str8 married couples. The rest of your post is an old tired argument. Obviously there should be the same age and consent requirements as apply to str8s. Throwing that in there is more of a diversionary tactic. That's okay. At least we agree that benefits should be available to both gays and unmarried str8 couples...as long as everyone can agree on what constitutes a committed relationship.", 
        "threadID": "672198221_7980026222001", 
        "time": "2009-05-06 09:54:00", 
        "title": "FDIC leads the way on domestic partner benefits", 
        "userID": "Flygirl62"
    }, 
    {
        "content": "quote: Originally posted by Flygirl62: quote: Originally posted by L0A1: Therein lies a problem not many are addressing. To extend the same benefits to gay couples you would have to extend those same benefits to people in committed relationships as said in the article. quote: It was a largely tame event, without much in the way of partisan bickering or attempts to score points on either side of the culture war. The lone Republican attendee, Maine Sen. Susan M. Collins, was there to support the bill, and she even suggested broadening it to include heterosexual couples who are not married but live together in committed relationships. I am all for equal benefits for gay couples as long as it doesn't discriminate against straight couples that are not married. Where will all this money come from??? It also doesn't address the far right opposition on age requirements for consent. Or EXCLUDE the freaks out their into werid lifestyles. I agree with you on offering benefits to str8 couples in a committed relationship. Fair is fair. Where will all the money come from? That is really at the heart of the Feds' reservations. All those new relationships they will have to recognize and subsidize as they have been doing for years for str8 married couples. The rest of your post is an old tired argument. Obviously there should be the same age and consent requirements as apply to str8s. Throwing that in there is more of a diversionary tactic. That's okay. At least we agree that benefits should be available to both gays and unmarried str8 couples...as long as everyone can agree on what constitutes a committed relationship. I brought up the secondary arguements you call tired because to most people that oppose gay marraige, it's not tired, it's a serious issue that has not been addressed nor a solution put up. Each state has a different age of consent, there is no federal age of consent except for Drinking. There has to be language in the bill that adresses it. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090506, 
        "postID": 5, 
        "quote": "Originally posted by Flygirl62: quote: Originally posted by L0A1: Therein lies a problem not many are addressing. To extend the same benefits to gay couples you would have to extend those same benefits to people in committed relationships as said in the article. quote: It was a largely tame event, without much in the way of partisan bickering or attempts to score points on either side of the culture war. The lone Republican attendee, Maine Sen. Susan M. Collins, was there to support the bill, and she even suggested broadening it to include heterosexual couples who are not married but live together in committed relationships. I am all for equal benefits for gay couples as long as it doesn't discriminate against straight couples that are not married. Where will all this money come from??? It also doesn't address the far right opposition on age requirements for consent. Or EXCLUDE the freaks out their into werid lifestyles. I agree with you on offering benefits to str8 couples in a committed relationship. Fair is fair. Where will all the money come from? That is really at the heart of the Feds' reservations. All those new relationships they will have to recognize and subsidize as they have been doing for years for str8 married couples. The rest of your post is an old tired argument. Obviously there should be the same age and consent requirements as apply to str8s. Throwing that in there is more of a diversionary tactic. That's okay. At least we agree that benefits should be available to both gays and unmarried str8 couples...as long as everyone can agree on what constitutes a committed relationship.", 
        "reply": " I brought up the secondary arguements you call tired because to most people that oppose gay marraige, it's not tired, it's a serious issue that has not been addressed nor a solution put up. Each state has a different age of consent, there is no federal age of consent except for Drinking. There has to be language in the bill that adresses it. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_7980026222001", 
        "time": "2009-05-06 10:32:00", 
        "title": "FDIC leads the way on domestic partner benefits", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: I brought up the secondary arguements you call tired because to most people that oppose gay marraige, it's not tired, it's a serious issue that has not been addressed nor a solution put up. Each state has a different age of consent, there is no federal age of consent except for Drinking. There has to be language in the bill that adresses it. Fine. Include an age of consent. What do you suggest that age be? Because in some states its 16. Some its 18. Heck, I think there might be a few states that allow 14 year olds to marry. So lets give it a number. What about 18? You can't vote until 18. It seems ludicrous that you can make a life altering decision like marriage before you can vote. Now all you have to do is convince all those people who believe in states' rights that a Federal age limit is necessary and in no way infringes on states' rights. Good luck with that one.", 
        "intTime": 20090506, 
        "postID": 6, 
        "quote": "Originally posted by L0A1: I brought up the secondary arguements you call tired because to most people that oppose gay marraige, it's not tired, it's a serious issue that has not been addressed nor a solution put up. Each state has a different age of consent, there is no federal age of consent except for Drinking. There has to be language in the bill that adresses it.", 
        "reply": " Fine. Include an age of consent. What do you suggest that age be? Because in some states its 16. Some its 18. Heck, I think there might be a few states that allow 14 year olds to marry. So lets give it a number. What about 18? You can't vote until 18. It seems ludicrous that you can make a life altering decision like marriage before you can vote. Now all you have to do is convince all those people who believe in states' rights that a Federal age limit is necessary and in no way infringes on states' rights. Good luck with that one.", 
        "threadID": "672198221_7980026222001", 
        "time": "2009-05-06 12:00:00", 
        "title": "FDIC leads the way on domestic partner benefits", 
        "userID": "Flygirl62"
    }, 
    {
        "content": "quote: Originally posted by Flygirl62: Where will all the money come from? That is really at the heart of the Feds' reservations. All those new relationships they will have to recognize and subsidize as they have been doing for years for str8 married couples. From the taxes paid by homosexual couples in committed relationships, by hetrosexual couples who are in committed relationships but aren't married, by unmarried hetrosexuals and homosexuals who are not in a committed realationship, and by married hetrosexual couples? Probably from them. You know, the same people who have been paying for the benefits that have been given for years by the federal, state and local governments to married hetrosexual couples only. I am a presently unmarried hetrosexual - and a substantial chunk of my taxes go to provide benefits to married hetrosexual couples, particularly those who have children of school age.", 
        "intTime": 20090506, 
        "postID": 7, 
        "quote": "Originally posted by Flygirl62: Where will all the money come from? That is really at the heart of the Feds' reservations. All those new relationships they will have to recognize and subsidize as they have been doing for years for str8 married couples.", 
        "reply": " From the taxes paid by homosexual couples in committed relationships, by hetrosexual couples who are in committed relationships but aren't married, by unmarried hetrosexuals and homosexuals who are not in a committed realationship, and by married hetrosexual couples? Probably from them. You know, the same people who have been paying for the benefits that have been given for years by the federal, state and local governments to married hetrosexual couples only. I am a presently unmarried hetrosexual - and a substantial chunk of my taxes go to provide benefits to married hetrosexual couples, particularly those who have children of school age.", 
        "threadID": "672198221_7980026222001", 
        "time": "2009-05-06 13:33:00", 
        "title": "FDIC leads the way on domestic partner benefits", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: Originally posted by Flygirl62: quote: Originally posted by L0A1: I brought up the secondary arguements you call tired because to most people that oppose gay marraige, it's not tired, it's a serious issue that has not been addressed nor a solution put up. Each state has a different age of consent, there is no federal age of consent except for Drinking. There has to be language in the bill that adresses it. Fine. Include an age of consent. What do you suggest that age be? Because in some states its 16. Some its 18. Heck, I think there might be a few states that allow 14 year olds to marry. So lets give it a number. What about 18? You can't vote until 18. It seems ludicrous that you can make a life altering decision like marriage before you can vote. Now all you have to do is convince all those people who believe in states' rights that a Federal age limit is necessary and in no way infringes on states' rights. Good luck with that one. LOL, I agree with you there. I believe in States rights, however the Federal Gov raised the drinking age by saying those states that don't will not receive certain funding. If they want it that bad, they can use that same tactic. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090506, 
        "postID": 8, 
        "quote": "Originally posted by Flygirl62: quote: Originally posted by L0A1: I brought up the secondary arguements you call tired because to most people that oppose gay marraige, it's not tired, it's a serious issue that has not been addressed nor a solution put up. Each state has a different age of consent, there is no federal age of consent except for Drinking. There has to be language in the bill that adresses it. Fine. Include an age of consent. What do you suggest that age be? Because in some states its 16. Some its 18. Heck, I think there might be a few states that allow 14 year olds to marry. So lets give it a number. What about 18? You can't vote until 18. It seems ludicrous that you can make a life altering decision like marriage before you can vote. Now all you have to do is convince all those people who believe in states' rights that a Federal age limit is necessary and in no way infringes on states' rights. Good luck with that one.", 
        "reply": " LOL, I agree with you there. I believe in States rights, however the Federal Gov raised the drinking age by saying those states that don't will not receive certain funding. If they want it that bad, they can use that same tactic. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_7980026222001", 
        "time": "2009-05-06 13:37:00", 
        "title": "FDIC leads the way on domestic partner benefits", 
        "userID": "L0A1"
    }
]