[
    {
        "content": "\"http://www.worldnetdaily.com/index.php?fa=PAGE.view&pageId=94186\"", 
        "intTime": 20090407, 
        "postID": 1, 
        "quote": "", 
        "reply": "\"http://www.worldnetdaily.com/index.php?fa=PAGE.view&pageId=94186\"", 
        "threadID": "672198221_3110001022001", 
        "time": "2009-04-07 14:13:00", 
        "title": "Vermont legalizes same-sex marriage", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "Bravo for Vermont! Frisco", 
        "intTime": 20090407, 
        "postID": 2, 
        "quote": "", 
        "reply": "Bravo for Vermont! Frisco", 
        "threadID": "672198221_3110001022001", 
        "time": "2009-04-07 14:14:00", 
        "title": "Vermont legalizes same-sex marriage", 
        "userID": "FriscoLady01"
    }, 
    {
        "content": "The only ones that get hurt in a same sex marriage is the children if there are any involved. All children need the balance of a female mother and a male father. I will never change my mind on that because that is the nature of it all and that is indeed how it is suppose to work and what brings out a well balanced child to become a woman or a man. That's not to say a child raised otherwise is not either, but then again I think single parent children as well as same sex children are lacking a certain balance and I do think contributes to some things in this nation that are missing.", 
        "intTime": 20090407, 
        "postID": 3, 
        "quote": "", 
        "reply": "The only ones that get hurt in a same sex marriage is the children if there are any involved. All children need the balance of a female mother and a male father. I will never change my mind on that because that is the nature of it all and that is indeed how it is suppose to work and what brings out a well balanced child to become a woman or a man. That's not to say a child raised otherwise is not either, but then again I think single parent children as well as same sex children are lacking a certain balance and I do think contributes to some things in this nation that are missing.", 
        "threadID": "672198221_3110001022001", 
        "time": "2009-04-07 15:22:00", 
        "title": "Vermont legalizes same-sex marriage", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "You are entitled to your opinion, however I have seen more children of standard male/female marriages destroyed by the parents than any of the same sex or single parent families I have known. I raised two of my children alone for years and the sexual pervert ex of mine did more to destroy them than I ever did. I have nothing against men my current husband has been wonderful to our children. He has helped greatly in saving my two middle children, but I started the process and got it well along before he came into our lives. I know plenty of everyday married couples that have wonderful children. However, if I were to put money on it I would bet on the child of a same sex couple being far better adjusted to the adversity of life than most. Frisco", 
        "intTime": 20090407, 
        "postID": 4, 
        "quote": "", 
        "reply": "You are entitled to your opinion, however I have seen more children of standard male/female marriages destroyed by the parents than any of the same sex or single parent families I have known. I raised two of my children alone for years and the sexual pervert ex of mine did more to destroy them than I ever did. I have nothing against men my current husband has been wonderful to our children. He has helped greatly in saving my two middle children, but I started the process and got it well along before he came into our lives. I know plenty of everyday married couples that have wonderful children. However, if I were to put money on it I would bet on the child of a same sex couple being far better adjusted to the adversity of life than most. Frisco", 
        "threadID": "672198221_3110001022001", 
        "time": "2009-04-07 15:34:00", 
        "title": "Vermont legalizes same-sex marriage", 
        "userID": "FriscoLady01"
    }, 
    {
        "content": "quote: Originally posted by FriscoLady01: You are entitled to your opinion, however I have seen more children of standard male/female marriages destroyed by the parents than any of the same sex or single parent families I have known. I raised two of my children alone for years and the sexual pervert ex of mine did more to destroy them than I ever did. I have nothing against men my current husband has been wonderful to our children. He has helped greatly in saving my two middle children, but I started the process and got it well along before he came into our lives. I know plenty of everyday married couples that have wonderful children. However, if I were to put money on it I would bet on the child of a same sex couple being far better adjusted to the adversity of life than most. Frisco I understand your point, I honestly do and I have seen it as well. Mine is not to say nor do I believe that any particular child raised by any other than F or M are bad or even flawed in any way, quite the contrary as you stated, but I have also seen a kid messed up because of the lack of one or the other, in which they would have been ok if they had had both. A feminine mother teachers love, affection, spoils, is soft, a masculine father is discipline, manhood, survival, hardness, teachers one to earn their keep and to conquer and survive, to deal and bargain, just the male figure in itself can make it one way or the other. Just the voice in some cases. Do I believe there should be such laws? No. But overall I do feel it is better. One day we may not be so spoiled and actually have to be real hunters and gatherers once again and to actually have to survive. Don't laugh, because it very well and probably will happen one day. Maybe not in our lifetime. You can not win against nature. That I do know. But man is very good at manipulating nature. Nature is even better at correcting itself. I am sure one day man will regret that in some fashion or form if that behavior becomes dominant. Then again, nature may adjust things to allow for that behavior. Not in a religious since, my argument has nothing to do with religion. hard to explain but I am sure some here know what I am mean. No threat though as long as it is not dominant, I do not think.", 
        "intTime": 20090407, 
        "postID": 5, 
        "quote": "Originally posted by FriscoLady01: You are entitled to your opinion, however I have seen more children of standard male/female marriages destroyed by the parents than any of the same sex or single parent families I have known. I raised two of my children alone for years and the sexual pervert ex of mine did more to destroy them than I ever did. I have nothing against men my current husband has been wonderful to our children. He has helped greatly in saving my two middle children, but I started the process and got it well along before he came into our lives. I know plenty of everyday married couples that have wonderful children. However, if I were to put money on it I would bet on the child of a same sex couple being far better adjusted to the adversity of life than most. Frisco", 
        "reply": " I understand your point, I honestly do and I have seen it as well. Mine is not to say nor do I believe that any particular child raised by any other than F or M are bad or even flawed in any way, quite the contrary as you stated, but I have also seen a kid messed up because of the lack of one or the other, in which they would have been ok if they had had both. A feminine mother teachers love, affection, spoils, is soft, a masculine father is discipline, manhood, survival, hardness, teachers one to earn their keep and to conquer and survive, to deal and bargain, just the male figure in itself can make it one way or the other. Just the voice in some cases. Do I believe there should be such laws? No. But overall I do feel it is better. One day we may not be so spoiled and actually have to be real hunters and gatherers once again and to actually have to survive. Don't laugh, because it very well and probably will happen one day. Maybe not in our lifetime. You can not win against nature. That I do know. But man is very good at manipulating nature. Nature is even better at correcting itself. I am sure one day man will regret that in some fashion or form if that behavior becomes dominant. Then again, nature may adjust things to allow for that behavior. Not in a religious since, my argument has nothing to do with religion. hard to explain but I am sure some here know what I am mean. No threat though as long as it is not dominant, I do not think.", 
        "threadID": "672198221_3110001022001", 
        "time": "2009-04-07 15:55:00", 
        "title": "Vermont legalizes same-sex marriage", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "I don't have an issue with gay people but I always spoke up for my right to keep my definition of marriage for them them to get their own. I always thought as long as they have the same legal rights then why should they want to take away my rights? I once asked a gay female if they had all the legal rights would they still want the definition changed and she said yes, some would but she did not care about that part. Now I find myself thinking.... it seems to be so much more important for they gay community and do I really care about a definition??? As for the gay community and children. I can't buy that way of thinking. I have seen messed up people on both sides gay and straight. As long as the children are cared for and loved I don't care if it is by a mom and dad, a dad and a dad or a mom and a mom.", 
        "intTime": 20090407, 
        "postID": 6, 
        "quote": "", 
        "reply": "I don't have an issue with gay people but I always spoke up for my right to keep my definition of marriage for them them to get their own. I always thought as long as they have the same legal rights then why should they want to take away my rights? I once asked a gay female if they had all the legal rights would they still want the definition changed and she said yes, some would but she did not care about that part. Now I find myself thinking.... it seems to be so much more important for they gay community and do I really care about a definition??? As for the gay community and children. I can't buy that way of thinking. I have seen messed up people on both sides gay and straight. As long as the children are cared for and loved I don't care if it is by a mom and dad, a dad and a dad or a mom and a mom.", 
        "threadID": "672198221_3110001022001", 
        "time": "2009-04-07 18:25:00", 
        "title": "Vermont legalizes same-sex marriage", 
        "userID": "usa_girl"
    }, 
    {
        "content": "Dear would you get me my slippers? Get em your self a$$hole!", 
        "intTime": 20090407, 
        "postID": 7, 
        "quote": "", 
        "reply": "Dear would you get me my slippers? Get em your self a$$hole!", 
        "threadID": "672198221_3110001022001", 
        "time": "2009-04-07 19:00:00", 
        "title": "Vermont legalizes same-sex marriage", 
        "userID": "EAG154"
    }, 
    {
        "content": "more proof that the moral decay of America is still in full swing. Traditional family values? WTF is that? those got done away with the first time some pervert put on a thong with leather chaps and strutted down the streets in San Fransisco. Since then, America's days of being a great country were numbered. America has become a cesspool of depravity and its enemies need not attack it as it is destroying itself from within and all that will be left is for these enemies to pick up whats left without firing a shot.", 
        "intTime": 20090407, 
        "postID": 8, 
        "quote": "", 
        "reply": "more proof that the moral decay of America is still in full swing. Traditional family values? WTF is that? those got done away with the first time some pervert put on a thong with leather chaps and strutted down the streets in San Fransisco. Since then, America's days of being a great country were numbered. America has become a cesspool of depravity and its enemies need not attack it as it is destroying itself from within and all that will be left is for these enemies to pick up whats left without firing a shot.", 
        "threadID": "672198221_3110001022001", 
        "time": "2009-04-07 20:44:00", 
        "title": "Vermont legalizes same-sex marriage", 
        "userID": "FlankerFlyer"
    }, 
    {
        "content": "This country of ours was made so people could come and not be judge. All men are created equal with that being said. Family values are taught more then one way. a gay couple can still teach family values. This is what our country is all about protecting people from being judge by others. Gays have been fighting beside straights since the start of our country.", 
        "intTime": 20090408, 
        "postID": 9, 
        "quote": "", 
        "reply": "This country of ours was made so people could come and not be judge. All men are created equal with that being said. Family values are taught more then one way. a gay couple can still teach family values. This is what our country is all about protecting people from being judge by others. Gays have been fighting beside straights since the start of our country.", 
        "threadID": "672198221_3110001022001", 
        "time": "2009-04-08 04:28:00", 
        "title": "Vermont legalizes same-sex marriage", 
        "userID": "world_king377"
    }, 
    {
        "content": "quote: a gay couple can still teach family values. This is what our country is all about protecting people from being judge by others. your joking, right? In case you werent paying attention in biology, it take a man and a woman to create a child and natural law also dictates that this is the optimal way to raise a child. I have NEVER seen two men create a baby. I have never sen two women create a baby. WHy? its NOT natural. If two people want to live in an un-natural way then great, that is their right to do so in America but dont think for one second that this lifestyle should in anyway be promoted as natural or normal because it is not. It is because of allowing rampant sexual deviancy, not promoting family values and allowing other immoral behavior to continue unchecked that is a really huge part of why America is in the shape its in. Marriage and the family isnt protected anymore and is not even held in reverance anymore, especially by liberals who think that just because it feels good and results in an orgasm then it must be good for everyone. What is next? marry a goat? allow children to marry or have sex with adults because enough people decide that its just as \"normal\" as anything else? Homosexuality was at one time considered immoral and deviant now it is called normal by some. Pedophilia is growing also right under your noses. At what point do these people stand up and declare themselves discriminated against? At what point in the future do they start parading down the streets declaring their behavior as normal and should be acceptable to all because it is their right and freedom as a human to do so?", 
        "intTime": 20090408, 
        "postID": 10, 
        "quote": "a gay couple can still teach family values. This is what our country is all about protecting people from being judge by others.", 
        "reply": " your joking, right? In case you werent paying attention in biology, it take a man and a woman to create a child and natural law also dictates that this is the optimal way to raise a child. I have NEVER seen two men create a baby. I have never sen two women create a baby. WHy? its NOT natural. If two people want to live in an un-natural way then great, that is their right to do so in America but dont think for one second that this lifestyle should in anyway be promoted as natural or normal because it is not. It is because of allowing rampant sexual deviancy, not promoting family values and allowing other immoral behavior to continue unchecked that is a really huge part of why America is in the shape its in. Marriage and the family isnt protected anymore and is not even held in reverance anymore, especially by liberals who think that just because it feels good and results in an orgasm then it must be good for everyone. What is next? marry a goat? allow children to marry or have sex with adults because enough people decide that its just as \"normal\" as anything else? Homosexuality was at one time considered immoral and deviant now it is called normal by some. Pedophilia is growing also right under your noses. At what point do these people stand up and declare themselves discriminated against? At what point in the future do they start parading down the streets declaring their behavior as normal and should be acceptable to all because it is their right and freedom as a human to do so?", 
        "threadID": "672198221_3110001022001", 
        "time": "2009-04-08 17:57:00", 
        "title": "Vermont legalizes same-sex marriage", 
        "userID": "FlankerFlyer"
    }, 
    {
        "content": "Look Gay and gay relationships are thousands of years old, probably ever since man has walked upright, nothing new and no big deal. Don't know why gay thrive on recognition. I do not thrive on myself being hetrosexual When the children are brought in to it another story, yes against nature That I agree with and always will and I find to be the biggest con. But on the other hand Well said to most of your post FlankerFlyer.", 
        "intTime": 20090408, 
        "postID": 11, 
        "quote": "", 
        "reply": "Look Gay and gay relationships are thousands of years old, probably ever since man has walked upright, nothing new and no big deal. Don't know why gay thrive on recognition. I do not thrive on myself being hetrosexual When the children are brought in to it another story, yes against nature That I agree with and always will and I find to be the biggest con. But on the other hand Well said to most of your post FlankerFlyer.", 
        "threadID": "672198221_3110001022001", 
        "time": "2009-04-08 18:47:00", 
        "title": "Vermont legalizes same-sex marriage", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by FlankerFlyer: more proof that the moral decay of America is still in full swing. Traditional family values? WTF is that? those got done away with the first time some pervert put on a thong with leather chaps and strutted down the streets in San Fransisco. Since then, America's days of being a great country were numbered. America has become a cesspool of depravity and its enemies need not attack it as it is destroying itself from within and all that will be left is for these enemies to pick up whats left without firing a shot. boo ****ing hoo people said the exact same thing when the Supreme Court allowed interracial marriages guess what? the US didn't collapse", 
        "intTime": 20090408, 
        "postID": 12, 
        "quote": "Originally posted by FlankerFlyer: more proof that the moral decay of America is still in full swing. Traditional family values? WTF is that? those got done away with the first time some pervert put on a thong with leather chaps and strutted down the streets in San Fransisco. Since then, America's days of being a great country were numbered. America has become a cesspool of depravity and its enemies need not attack it as it is destroying itself from within and all that will be left is for these enemies to pick up whats left without firing a shot.", 
        "reply": " boo ****ing hoo people said the exact same thing when the Supreme Court allowed interracial marriages guess what? the US didn't collapse", 
        "threadID": "672198221_3110001022001", 
        "time": "2009-04-08 20:08:00", 
        "title": "Vermont legalizes same-sex marriage", 
        "userID": "liberal90"
    }, 
    {
        "content": "quote: Originally posted by FlankerFlyer: quote: a gay couple can still teach family values. This is what our country is all about protecting people from being judge by others. your joking, right? In case you werent paying attention in biology, it take a man and a woman to create a child and natural law also dictates that this is the optimal way to raise a child. I have NEVER seen two men create a baby. I have never sen two women create a baby. WHy? its NOT natural. If two people want to live in an un-natural way then great, that is their right to do so in America but dont think for one second that this lifestyle should in anyway be promoted as natural or normal because it is not. It is because of allowing rampant sexual deviancy, not promoting family values and allowing other immoral behavior to continue unchecked that is a really huge part of why America is in the shape its in. Marriage and the family isnt protected anymore and is not even held in reverance anymore, especially by liberals who think that just because it feels good and results in an orgasm then it must be good for everyone. What is next? marry a goat? allow children to marry or have sex with adults because enough people decide that its just as \"normal\" as anything else? Homosexuality was at one time considered immoral and deviant now it is called normal by some. Pedophilia is growing also right under your noses. At what point do these people stand up and declare themselves discriminated against? At what point in the future do they start parading down the streets declaring their behavior as normal and should be acceptable to all because it is their right and freedom as a human to do so? This is America If they want to get marry and have kids who are we to tell them they cant. For one thing I seen some pretty **** up family's of man and female. so don't tell me that family values can be taught only between a man and a women. head to a sperm clinic you'll see gay couples there. head to a adoption agency you'll see them there to. will this make them bad parents because there gay. I think not.", 
        "intTime": 20090408, 
        "postID": 13, 
        "quote": "Originally posted by FlankerFlyer: quote: a gay couple can still teach family values. This is what our country is all about protecting people from being judge by others. your joking, right? In case you werent paying attention in biology, it take a man and a woman to create a child and natural law also dictates that this is the optimal way to raise a child. I have NEVER seen two men create a baby. I have never sen two women create a baby. WHy? its NOT natural. If two people want to live in an un-natural way then great, that is their right to do so in America but dont think for one second that this lifestyle should in anyway be promoted as natural or normal because it is not. It is because of allowing rampant sexual deviancy, not promoting family values and allowing other immoral behavior to continue unchecked that is a really huge part of why America is in the shape its in. Marriage and the family isnt protected anymore and is not even held in reverance anymore, especially by liberals who think that just because it feels good and results in an orgasm then it must be good for everyone. What is next? marry a goat? allow children to marry or have sex with adults because enough people decide that its just as \"normal\" as anything else? Homosexuality was at one time considered immoral and deviant now it is called normal by some. Pedophilia is growing also right under your noses. At what point do these people stand up and declare themselves discriminated against? At what point in the future do they start parading down the streets declaring their behavior as normal and should be acceptable to all because it is their right and freedom as a human to do so?", 
        "reply": " This is America If they want to get marry and have kids who are we to tell them they cant. For one thing I seen some pretty **** up family's of man and female. so don't tell me that family values can be taught only between a man and a women. head to a sperm clinic you'll see gay couples there. head to a adoption agency you'll see them there to. will this make them bad parents because there gay. I think not.", 
        "threadID": "672198221_3110001022001", 
        "time": "2009-04-08 22:18:00", 
        "title": "Vermont legalizes same-sex marriage", 
        "userID": "world_king377"
    }, 
    {
        "content": "It is amazing that in the same breath people can talk about “family values” while saying our families have no value. It is also amazing that people can say, again in the same breath, that they are okay with “civil unions”, but don’t want gays to be able to “marry”. In other words, you don’t mind us being in the same house, but we have to use the back door to get in. I’m sure you have all heard the term “separate but equal” before. My son, despite having two mothers, has managed to learn to throw a baseball, shoot a gun and a bow and arrow, ride a motorcycle AND pee standing up. My daughter, despite having two lesbians as mothers, plays with dolls, tea sets, dresses and has crushes on the Jonas Brothers. Kids need good parents. The sexual orientation of those parents is irrelevant, but their families certainly deserve the same rights and protections YOUR families enjoy.", 
        "intTime": 20090409, 
        "postID": 14, 
        "quote": "", 
        "reply": "It is amazing that in the same breath people can talk about “family values” while saying our families have no value. It is also amazing that people can say, again in the same breath, that they are okay with “civil unions”, but don’t want gays to be able to “marry”. In other words, you don’t mind us being in the same house, but we have to use the back door to get in. I’m sure you have all heard the term “separate but equal” before. My son, despite having two mothers, has managed to learn to throw a baseball, shoot a gun and a bow and arrow, ride a motorcycle AND pee standing up. My daughter, despite having two lesbians as mothers, plays with dolls, tea sets, dresses and has crushes on the Jonas Brothers. Kids need good parents. The sexual orientation of those parents is irrelevant, but their families certainly deserve the same rights and protections YOUR families enjoy.", 
        "threadID": "672198221_3110001022001", 
        "time": "2009-04-09 05:10:00", 
        "title": "Vermont legalizes same-sex marriage", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: The only ones that get hurt in a same sex marriage is the children if there are any involved. All children need the balance of a female mother and a male father. I will never change my mind on that because that is the nature of it all and that is indeed how it is suppose to work and what brings out a well balanced child to become a woman or a man. That's not to say a child raised otherwise is not either, but then again I think single parent children as well as same sex children are lacking a certain balance and I do think contributes to some things in this nation that are missing. ALL other things being equal I agree that in our society a 2 parent heterosexual family would be best (marginally). BUT in the real world all other things are almost NEVER equal.", 
        "intTime": 20090409, 
        "postID": 15, 
        "quote": "Originally posted by crackerjacks61: The only ones that get hurt in a same sex marriage is the children if there are any involved. All children need the balance of a female mother and a male father. I will never change my mind on that because that is the nature of it all and that is indeed how it is suppose to work and what brings out a well balanced child to become a woman or a man. That's not to say a child raised otherwise is not either, but then again I think single parent children as well as same sex children are lacking a certain balance and I do think contributes to some things in this nation that are missing.", 
        "reply": " ALL other things being equal I agree that in our society a 2 parent heterosexual family would be best (marginally). BUT in the real world all other things are almost NEVER equal.", 
        "threadID": "672198221_3110001022001", 
        "time": "2009-04-09 05:39:00", 
        "title": "Vermont legalizes same-sex marriage", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by usa_girl: I don't have an issue with gay people but I always spoke up for my right to keep my definition of marriage for them them to get their own. I always thought as long as they have the same legal rights then why should they want to take away my rights? I once asked a gay female if they had all the legal rights would they still want the definition changed and she said yes, some would but she did not care about that part. Now I find myself thinking.... it seems to be so much more important for they gay community and do I really care about a definition??? As for the gay community and children. I can't buy that way of thinking. I have seen messed up people on both sides gay and straight. As long as the children are cared for and loved I don't care if it is by a mom and dad, a dad and a dad or a mom and a mom. What is your definition of marriage that homosexual are trying to change? FACTS * ALL legal marriages in the US, including religious, have a Civil (non-religious) contract element which is why they are registered. * The Civil marriage contract is NOT concerned with religion although some of the laws about Civil marriage have been influenced by religon. * There are sigificant legal benefits, protections and responsiblity provided by Civil marriage contracts * Homosexuals already HAVE access to religious marriages, including Christian. * Heterosexuals can get non-religious Civil marriage contracts but Homosexuals can not So in reality ALL that people claiming to be trying to protect religious marriage are doing is denying Civil marriage contracts to homosexuals since it does NOT have any effect on religious groups that do not already allow homosexuals to marry.", 
        "intTime": 20090409, 
        "postID": 16, 
        "quote": "Originally posted by usa_girl: I don't have an issue with gay people but I always spoke up for my right to keep my definition of marriage for them them to get their own. I always thought as long as they have the same legal rights then why should they want to take away my rights? I once asked a gay female if they had all the legal rights would they still want the definition changed and she said yes, some would but she did not care about that part. Now I find myself thinking.... it seems to be so much more important for they gay community and do I really care about a definition??? As for the gay community and children. I can't buy that way of thinking. I have seen messed up people on both sides gay and straight. As long as the children are cared for and loved I don't care if it is by a mom and dad, a dad and a dad or a mom and a mom.", 
        "reply": " What is your definition of marriage that homosexual are trying to change? FACTS * ALL legal marriages in the US, including religious, have a Civil (non-religious) contract element which is why they are registered. * The Civil marriage contract is NOT concerned with religion although some of the laws about Civil marriage have been influenced by religon. * There are sigificant legal benefits, protections and responsiblity provided by Civil marriage contracts * Homosexuals already HAVE access to religious marriages, including Christian. * Heterosexuals can get non-religious Civil marriage contracts but Homosexuals can not So in reality ALL that people claiming to be trying to protect religious marriage are doing is denying Civil marriage contracts to homosexuals since it does NOT have any effect on religious groups that do not already allow homosexuals to marry.", 
        "threadID": "672198221_3110001022001", 
        "time": "2009-04-09 05:50:00", 
        "title": "Vermont legalizes same-sex marriage", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by liberal90: quote: Originally posted by FlankerFlyer: more proof that the moral decay of America is still in full swing. Traditional family values? WTF is that? those got done away with the first time some pervert put on a thong with leather chaps and strutted down the streets in San Fransisco. Since then, America's days of being a great country were numbered. America has become a cesspool of depravity and its enemies need not attack it as it is destroying itself from within and all that will be left is for these enemies to pick up whats left without firing a shot. boo ****ing hoo people said the exact same thing when the Supreme Court allowed interracial marriages guess what? the US didn't collapse They also said the same thing about allowing Women to vote.", 
        "intTime": 20090409, 
        "postID": 17, 
        "quote": "Originally posted by liberal90: quote: Originally posted by FlankerFlyer: more proof that the moral decay of America is still in full swing. Traditional family values? WTF is that? those got done away with the first time some pervert put on a thong with leather chaps and strutted down the streets in San Fransisco. Since then, America's days of being a great country were numbered. America has become a cesspool of depravity and its enemies need not attack it as it is destroying itself from within and all that will be left is for these enemies to pick up whats left without firing a shot. boo ****ing hoo people said the exact same thing when the Supreme Court allowed interracial marriages guess what? the US didn't collapse", 
        "reply": " They also said the same thing about allowing Women to vote.", 
        "threadID": "672198221_3110001022001", 
        "time": "2009-04-09 05:52:00", 
        "title": "Vermont legalizes same-sex marriage", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: The only ones that get hurt in a same sex marriage is the children if there are any involved. All children need the balance of a female mother and a male father. I will never change my mind on that because that is the nature of it all and that is indeed how it is suppose to work and what brings out a well balanced child to become a woman or a man. That's not to say a child raised otherwise is not either, but then again I think single parent children as well as same sex children are lacking a certain balance and I do think contributes to some things in this nation that are missing. Why? Considering far our country has gone to pussify men in general, I don't think there's any reason to demand a male and female parental figure. In lesbian relationships, one of them is always the \"man\", and she is invariably more masculine than at least half the males in any city. In male/male relationships, one or both of them is invariably feminine enough, and odds are the kid isn't going to get a \"man's man\" for a father figure, anyways.", 
        "intTime": 20090409, 
        "postID": 18, 
        "quote": "Originally posted by crackerjacks61: The only ones that get hurt in a same sex marriage is the children if there are any involved. All children need the balance of a female mother and a male father. I will never change my mind on that because that is the nature of it all and that is indeed how it is suppose to work and what brings out a well balanced child to become a woman or a man. That's not to say a child raised otherwise is not either, but then again I think single parent children as well as same sex children are lacking a certain balance and I do think contributes to some things in this nation that are missing.", 
        "reply": " Why? Considering far our country has gone to pussify men in general, I don't think there's any reason to demand a male and female parental figure. In lesbian relationships, one of them is always the \"man\", and she is invariably more masculine than at least half the males in any city. In male/male relationships, one or both of them is invariably feminine enough, and odds are the kid isn't going to get a \"man's man\" for a father figure, anyways.", 
        "threadID": "672198221_3110001022001", 
        "time": "2009-04-09 09:37:00", 
        "title": "Vermont legalizes same-sex marriage", 
        "userID": "jwr6"
    }, 
    {
        "content": "Hey rayld2... That was a lot of HAVE, can not HAVE, religious, not religious legal chit chat but I get what you are trying to say. I think that is where all the mess seems to stem from which is the legal definition of what marriage is, not in the legal aspects of insurance, adoption etc. Sure there are some radical religous people who are never going to even acknowledge any rights for the gay community. But most people that vote against gay marriage in their state do so more because they are wanting to protect their belief of what the definition of marraige means to them, not so much that they want to keep the gay community down or not let them have access to legal contractual matters. I get the gay desire for wanting legal rights. You have to get that not everyone is gay and they want the same freedom to protect and believe their way of thinking. I personally am not gay but I get others are and at this point in my life, I feel the definition is way more important to the gay community than it is to me. I think the contractual matter wont be enough and as soon as that is made a non issue, the radical gay community will then feel slighted by the wording and definition and will go after that. So, I have to then ask myself, if it means that much to another community, does my personal lifestyle choice mean enough for me to fight for? I think I can live my belief without having all this hate and division and that is a better way to handle it. I want all people to be treated equal and have all the same rights", 
        "intTime": 20090409, 
        "postID": 19, 
        "quote": "", 
        "reply": "Hey rayld2... That was a lot of HAVE, can not HAVE, religious, not religious legal chit chat but I get what you are trying to say. I think that is where all the mess seems to stem from which is the legal definition of what marriage is, not in the legal aspects of insurance, adoption etc. Sure there are some radical religous people who are never going to even acknowledge any rights for the gay community. But most people that vote against gay marriage in their state do so more because they are wanting to protect their belief of what the definition of marraige means to them, not so much that they want to keep the gay community down or not let them have access to legal contractual matters. I get the gay desire for wanting legal rights. You have to get that not everyone is gay and they want the same freedom to protect and believe their way of thinking. I personally am not gay but I get others are and at this point in my life, I feel the definition is way more important to the gay community than it is to me. I think the contractual matter wont be enough and as soon as that is made a non issue, the radical gay community will then feel slighted by the wording and definition and will go after that. So, I have to then ask myself, if it means that much to another community, does my personal lifestyle choice mean enough for me to fight for? I think I can live my belief without having all this hate and division and that is a better way to handle it. I want all people to be treated equal and have all the same rights", 
        "threadID": "672198221_3110001022001", 
        "time": "2009-04-09 10:41:00", 
        "title": "Vermont legalizes same-sex marriage", 
        "userID": "usa_girl"
    }
]