[
    {
        "content": "Her idea of a baby is no longer a \"joyful and happy\" time but a responsible thing that she \"has\" to do. \"http://www.google.com/hostednews/ap/article/ALeqM5hCJJnoKa-w1If6gMyZri_7KaI_MQD98A4IRG0\" \"Girls need to imagine and picture their life with a screaming newborn baby and then think before they have sex,\" Palin told People magazine in a lengthy interview. \"If girls realized the consequences of sex, nobody would be having sex. Trust me. Nobody.\" more like...no body would have a baby..trust me no body. Sounds like maybe she needs to give this baby up for adoption to someone that will love it and be happy for it's birth.", 
        "intTime": 20090520, 
        "postID": 1, 
        "quote": "", 
        "reply": "Her idea of a baby is no longer a \"joyful and happy\" time but a responsible thing that she \"has\" to do. \"http://www.google.com/hostednews/ap/article/ALeqM5hCJJnoKa-w1If6gMyZri_7KaI_MQD98A4IRG0\" \"Girls need to imagine and picture their life with a screaming newborn baby and then think before they have sex,\" Palin told People magazine in a lengthy interview. \"If girls realized the consequences of sex, nobody would be having sex. Trust me. Nobody.\" more like...no body would have a baby..trust me no body. Sounds like maybe she needs to give this baby up for adoption to someone that will love it and be happy for it's birth.", 
        "threadID": "672198221_4520018322001", 
        "time": "2009-05-20 18:42:00", 
        "title": "Bristol Palin Seems to Regret Having A baby", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "so, does that mean her mother was right? heheh", 
        "intTime": 20090520, 
        "postID": 2, 
        "quote": "", 
        "reply": "so, does that mean her mother was right? heheh", 
        "threadID": "672198221_4520018322001", 
        "time": "2009-05-20 19:00:00", 
        "title": "Bristol Palin Seems to Regret Having A baby", 
        "userID": "usa_girl"
    }, 
    {
        "content": "quote: Originally posted by usa_girl: so, does that mean her mother was right? heheh Sounds like it if that's what she said.", 
        "intTime": 20090520, 
        "postID": 3, 
        "quote": "Originally posted by usa_girl: so, does that mean her mother was right? heheh", 
        "reply": " Sounds like it if that's what she said.", 
        "threadID": "672198221_4520018322001", 
        "time": "2009-05-20 19:11:00", 
        "title": "Bristol Palin Seems to Regret Having A baby", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "Doesn't make her any different than most teenage mothers. At least she didn't take the cowardly way out.", 
        "intTime": 20090520, 
        "postID": 4, 
        "quote": "", 
        "reply": "Doesn't make her any different than most teenage mothers. At least she didn't take the cowardly way out.", 
        "threadID": "672198221_4520018322001", 
        "time": "2009-05-20 19:15:00", 
        "title": "Bristol Palin Seems to Regret Having A baby", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Originally posted by stec74: Doesn't make her any different than most teenage mothers. At least she didn't take the cowardly way out. How is putting a baby up for adoption a cowardly way out?", 
        "intTime": 20090520, 
        "postID": 5, 
        "quote": "Originally posted by stec74: Doesn't make her any different than most teenage mothers. At least she didn't take the cowardly way out.", 
        "reply": " How is putting a baby up for adoption a cowardly way out?", 
        "threadID": "672198221_4520018322001", 
        "time": "2009-05-20 19:20:00", 
        "title": "Bristol Palin Seems to Regret Having A baby", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: Her idea of a baby is no longer a \"joyful and happy\" time but a responsible thing that she \"has\" to do. \"http://www.google.com/hostednews/ap/article/ALeqM5hCJJnoKa-w1If6gMyZri_7KaI_MQD98A4IRG0\" \"Girls need to imagine and picture their life with a screaming newborn baby and then think before they have sex,\" Palin told People magazine in a lengthy interview. \"If girls realized the consequences of sex, nobody would be having sex. Trust me. Nobody.\" more like...no body would have a baby..trust me no body. Sounds like maybe she needs to give this baby up for adoption to someone that will love it and be happy for it's birth. And this is important how? The poor girl is not a politician. Her mother is yesterday's news to everyone outside of Alaska. This is nothing but muckraking of the lowest sort.", 
        "intTime": 20090520, 
        "postID": 6, 
        "quote": "Originally posted by crackerjacks61: Her idea of a baby is no longer a \"joyful and happy\" time but a responsible thing that she \"has\" to do. \"http://www.google.com/hostednews/ap/article/ALeqM5hCJJnoKa-w1If6gMyZri_7KaI_MQD98A4IRG0\" \"Girls need to imagine and picture their life with a screaming newborn baby and then think before they have sex,\" Palin told People magazine in a lengthy interview. \"If girls realized the consequences of sex, nobody would be having sex. Trust me. Nobody.\" more like...no body would have a baby..trust me no body. Sounds like maybe she needs to give this baby up for adoption to someone that will love it and be happy for it's birth.", 
        "reply": " And this is important how? The poor girl is not a politician. Her mother is yesterday's news to everyone outside of Alaska. This is nothing but muckraking of the lowest sort.", 
        "threadID": "672198221_4520018322001", 
        "time": "2009-05-20 19:21:00", 
        "title": "Bristol Palin Seems to Regret Having A baby", 
        "userID": "thorin001"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: quote: Originally posted by stec74: Doesn't make her any different than most teenage mothers. At least she didn't take the cowardly way out. How is putting a baby up for adoption a cowardly way out? He was refering to abortion.", 
        "intTime": 20090520, 
        "postID": 7, 
        "quote": "Originally posted by crackerjacks61: quote: Originally posted by stec74: Doesn't make her any different than most teenage mothers. At least she didn't take the cowardly way out. How is putting a baby up for adoption a cowardly way out?", 
        "reply": " He was refering to abortion.", 
        "threadID": "672198221_4520018322001", 
        "time": "2009-05-20 19:22:00", 
        "title": "Bristol Palin Seems to Regret Having A baby", 
        "userID": "thorin001"
    }, 
    {
        "content": "Hey thorin, I agree she is just a girl, but when she went on all the tv shows she became as they say fair game. On one hand, I guess it is nice she wants to try and tell young girls that it was not the right thing to do and how hard it is blah blah blah But that has been said for years and when her mother said it to her, she sure did not listen and unfortunately, many young people wont. Anyway, I think she did not help her mother, she should just be humble, hush up and stay off the tv as should her ex.", 
        "intTime": 20090520, 
        "postID": 8, 
        "quote": "", 
        "reply": "Hey thorin, I agree she is just a girl, but when she went on all the tv shows she became as they say fair game. On one hand, I guess it is nice she wants to try and tell young girls that it was not the right thing to do and how hard it is blah blah blah But that has been said for years and when her mother said it to her, she sure did not listen and unfortunately, many young people wont. Anyway, I think she did not help her mother, she should just be humble, hush up and stay off the tv as should her ex.", 
        "threadID": "672198221_4520018322001", 
        "time": "2009-05-20 19:26:00", 
        "title": "Bristol Palin Seems to Regret Having A baby", 
        "userID": "usa_girl"
    }, 
    {
        "content": "quote: Originally posted by usa_girl: Hey thorin, I agree she is just a girl, but when she went on all the tv shows she became as they say fair game. On one hand, I guess it is nice she wants to try and tell young girls that it was not the right thing to do and how hard it is blah blah blah But that has been said for years and when her mother said it to her, she sure did not listen and unfortunately, many young people wont. Anyway, I think she did not help her mother, she should just be humble, hush up and stay off the tv as should her ex. Sarah doesn't need her help. Bristol is a teenager who thought she fell in love and let the nasty happen with a little POS. She was a naive, innocent girl before she made the god awful mistake you people condemn her for. What a sinner! Cast the girl into hell and get it over with. You all should be ashamed of yourselves. Only a bunch of pathetic excuses for adults with nothing better to do, would talk crap about a young girl. Nice job. Leave her alone for god sakes. She is doing the right thing by trying to be a mother to her child. Of course it is hard for her to care for a newborn and deal with the left's vicious hatred at the same time. Thank God she has her family. Why don't you all get off your high horses and talk about something worthwhile.", 
        "intTime": 20090520, 
        "postID": 9, 
        "quote": "Originally posted by usa_girl: Hey thorin, I agree she is just a girl, but when she went on all the tv shows she became as they say fair game. On one hand, I guess it is nice she wants to try and tell young girls that it was not the right thing to do and how hard it is blah blah blah But that has been said for years and when her mother said it to her, she sure did not listen and unfortunately, many young people wont. Anyway, I think she did not help her mother, she should just be humble, hush up and stay off the tv as should her ex.", 
        "reply": " Sarah doesn't need her help. Bristol is a teenager who thought she fell in love and let the nasty happen with a little POS. She was a naive, innocent girl before she made the god awful mistake you people condemn her for. What a sinner! Cast the girl into hell and get it over with. You all should be ashamed of yourselves. Only a bunch of pathetic excuses for adults with nothing better to do, would talk crap about a young girl. Nice job. Leave her alone for god sakes. She is doing the right thing by trying to be a mother to her child. Of course it is hard for her to care for a newborn and deal with the left's vicious hatred at the same time. Thank God she has her family. Why don't you all get off your high horses and talk about something worthwhile.", 
        "threadID": "672198221_4520018322001", 
        "time": "2009-05-20 21:09:00", 
        "title": "Bristol Palin Seems to Regret Having A baby", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "Hi AngelHeart Sorry if the post offended you. I am not condemning her. I get she was young and made a mistake. I certainly don't want her to go to the devil. I know she loves her little baby even though times will be tough. I am sure the ex is not a cute as he was to her back then, yes? Having said that, when she herself continues to be in the media and tell her story then she becomes a topic of conversation. The topic itself bring passion from both sides as I can tell from your post. Anyway, it was not meant from me to be vicious, only to discuss the topic. That is how you might be able to find a middle ground to the subject, if both sides keep talking.", 
        "intTime": 20090520, 
        "postID": 10, 
        "quote": "", 
        "reply": "Hi AngelHeart Sorry if the post offended you. I am not condemning her. I get she was young and made a mistake. I certainly don't want her to go to the devil. I know she loves her little baby even though times will be tough. I am sure the ex is not a cute as he was to her back then, yes? Having said that, when she herself continues to be in the media and tell her story then she becomes a topic of conversation. The topic itself bring passion from both sides as I can tell from your post. Anyway, it was not meant from me to be vicious, only to discuss the topic. That is how you might be able to find a middle ground to the subject, if both sides keep talking.", 
        "threadID": "672198221_4520018322001", 
        "time": "2009-05-20 22:17:00", 
        "title": "Bristol Palin Seems to Regret Having A baby", 
        "userID": "usa_girl"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: quote: Originally posted by crackerjacks61: Her idea of a baby is no longer a \"joyful and happy\" time but a responsible thing that she \"has\" to do. \"http://www.google.com/hostednews/ap/article/ALeqM5hCJJnoKa-w1If6gMyZri_7KaI_MQD98A4IRG0\" \"Girls need to imagine and picture their life with a screaming newborn baby and then think before they have sex,\" Palin told People magazine in a lengthy interview. \"If girls realized the consequences of sex, nobody would be having sex. Trust me. Nobody.\" more like...no body would have a baby..trust me no body. Sounds like maybe she needs to give this baby up for adoption to someone that will love it and be happy for it's birth. She loves her son, but it's hard even when you are planning for it. Babies change lives. She's new at this. Cut her some slack. EXACTLY... the poor kid has realized the depth of her responsibility... that is a hard pill to swallow. she'll grow into it in time... with a little help, here and there, she'll do what women have been doing since the beginning of time... she'll be a mother and raise a child in a safe, nurturing home.", 
        "intTime": 20090521, 
        "postID": 11, 
        "quote": "Originally posted by klassylady25: quote: Originally posted by crackerjacks61: Her idea of a baby is no longer a \"joyful and happy\" time but a responsible thing that she \"has\" to do. \"http://www.google.com/hostednews/ap/article/ALeqM5hCJJnoKa-w1If6gMyZri_7KaI_MQD98A4IRG0\" \"Girls need to imagine and picture their life with a screaming newborn baby and then think before they have sex,\" Palin told People magazine in a lengthy interview. \"If girls realized the consequences of sex, nobody would be having sex. Trust me. Nobody.\" more like...no body would have a baby..trust me no body. Sounds like maybe she needs to give this baby up for adoption to someone that will love it and be happy for it's birth. She loves her son, but it's hard even when you are planning for it. Babies change lives. She's new at this. Cut her some slack.", 
        "reply": " EXACTLY... the poor kid has realized the depth of her responsibility... that is a hard pill to swallow. she'll grow into it in time... with a little help, here and there, she'll do what women have been doing since the beginning of time... she'll be a mother and raise a child in a safe, nurturing home.", 
        "threadID": "672198221_4520018322001", 
        "time": "2009-05-21 04:20:00", 
        "title": "Bristol Palin Seems to Regret Having A baby", 
        "userID": "Elesso"
    }, 
    {
        "content": "quote: Originally posted by thorin001: quote: Originally posted by crackerjacks61: Her idea of a baby is no longer a \"joyful and happy\" time but a responsible thing that she \"has\" to do. \"http://www.google.com/hostednews/ap/article/ALeqM5hCJJnoKa-w1If6gMyZri_7KaI_MQD98A4IRG0\" \"Girls need to imagine and picture their life with a screaming newborn baby and then think before they have sex,\" Palin told People magazine in a lengthy interview. \"If girls realized the consequences of sex, nobody would be having sex. Trust me. Nobody.\" more like...no body would have a baby..trust me no body. Sounds like maybe she needs to give this baby up for adoption to someone that will love it and be happy for it's birth. And this is important how? The poor girl is not a politician. Her mother is yesterday's news to everyone outside of Alaska. This is nothing but muckraking of the lowest sort. She's not a politician but since she is in time magazine that makes her somewhat of a Celebrity doesn't it? If she does not want to be in the lime light she shouldn't place herself there.", 
        "intTime": 20090521, 
        "postID": 12, 
        "quote": "Originally posted by thorin001: quote: Originally posted by crackerjacks61: Her idea of a baby is no longer a \"joyful and happy\" time but a responsible thing that she \"has\" to do. \"http://www.google.com/hostednews/ap/article/ALeqM5hCJJnoKa-w1If6gMyZri_7KaI_MQD98A4IRG0\" \"Girls need to imagine and picture their life with a screaming newborn baby and then think before they have sex,\" Palin told People magazine in a lengthy interview. \"If girls realized the consequences of sex, nobody would be having sex. Trust me. Nobody.\" more like...no body would have a baby..trust me no body. Sounds like maybe she needs to give this baby up for adoption to someone that will love it and be happy for it's birth. And this is important how? The poor girl is not a politician. Her mother is yesterday's news to everyone outside of Alaska. This is nothing but muckraking of the lowest sort.", 
        "reply": " She's not a politician but since she is in time magazine that makes her somewhat of a Celebrity doesn't it? If she does not want to be in the lime light she shouldn't place herself there.", 
        "threadID": "672198221_4520018322001", 
        "time": "2009-05-21 04:27:00", 
        "title": "Bristol Palin Seems to Regret Having A baby", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by usa_girl: Hey thorin, I agree she is just a girl, but when she went on all the tv shows she became as they say fair game. On one hand, I guess it is nice she wants to try and tell young girls that it was not the right thing to do and how hard it is blah blah blah But that has been said for years and when her mother said it to her, she sure did not listen and unfortunately, many young people wont. Anyway, I think she did not help her mother, she should just be humble, hush up and stay off the tv as should her ex. My feelings exactly.", 
        "intTime": 20090521, 
        "postID": 13, 
        "quote": "Originally posted by usa_girl: Hey thorin, I agree she is just a girl, but when she went on all the tv shows she became as they say fair game. On one hand, I guess it is nice she wants to try and tell young girls that it was not the right thing to do and how hard it is blah blah blah But that has been said for years and when her mother said it to her, she sure did not listen and unfortunately, many young people wont. Anyway, I think she did not help her mother, she should just be humble, hush up and stay off the tv as should her ex.", 
        "reply": " My feelings exactly.", 
        "threadID": "672198221_4520018322001", 
        "time": "2009-05-21 04:28:00", 
        "title": "Bristol Palin Seems to Regret Having A baby", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by Elesso: quote: Originally posted by Elesso: quote: Originally posted by AngelHeart: quote: Originally posted by usa_girl: Hey thorin, I agree she is just a girl, but when she went on all the tv shows she became as they say fair game. On one hand, I guess it is nice she wants to try and tell young girls that it was not the right thing to do and how hard it is blah blah blah But that has been said for years and when her mother said it to her, she sure did not listen and unfortunately, many young people wont. Anyway, I think she did not help her mother, she should just be humble, hush up and stay off the tv as should her ex. Sarah doesn't need her help. Bristol is a teenager who thought she fell in love and let the nasty happen with a little POS. She was a naive, innocent girl before she made the god awful mistake you people condemn her for. What a sinner! Cast the girl into hell and get it over with. You all should be ashamed of yourselves. Only a bunch of pathetic excuses for adults with nothing better to do, would talk crap about a young girl. Nice job. Leave her alone for god sakes. She is doing the right thing by trying to be a mother to her child. Of course it is hard for her to care for a newborn and deal with the left's vicious hatred at the same time. Thank God she has her family. Why don't you all get off your high horses and talk about something worthwhile. well... how is it that he is a \"POS\"? and what is \"nasty\" about sex? he, like she, were thrust into the public eye and paraded across the media like some sort of annomaly. he is no diffrent than any TEENAGED boy. was he supposed to marry her? be a daddy? i think he has a great responsability, since the child is his too, but a lifetime of anger, and harsh feelings between those two would have made the raising of the baby secondary to their spite for each other. after that whole press thing, they are BOTH shy and shell shocked. it is no surprise to me that he ran, and ran as fast as his legs could carry him. and better he ran now, that whan the child was old enough to remember. i think you judge the boy harshly.(because that is what he is proving to be) Maybe he'll man up and take responsability, or Maybe he'll remain hidden. time will tell. tis is not a \"leftist\" thing. it is a \"stupid\" thing thatis being discussed This message has been edited. Last edited by: Elesso, Thu 21 May 2009 05:03 AM", 
        "intTime": 20090521, 
        "postID": 14, 
        "quote": "Originally posted by Elesso: quote: Originally posted by Elesso: quote: Originally posted by AngelHeart: quote: Originally posted by usa_girl: Hey thorin, I agree she is just a girl, but when she went on all the tv shows she became as they say fair game. On one hand, I guess it is nice she wants to try and tell young girls that it was not the right thing to do and how hard it is blah blah blah But that has been said for years and when her mother said it to her, she sure did not listen and unfortunately, many young people wont. Anyway, I think she did not help her mother, she should just be humble, hush up and stay off the tv as should her ex. Sarah doesn't need her help. Bristol is a teenager who thought she fell in love and let the nasty happen with a little POS. She was a naive, innocent girl before she made the god awful mistake you people condemn her for. What a sinner! Cast the girl into hell and get it over with. You all should be ashamed of yourselves. Only a bunch of pathetic excuses for adults with nothing better to do, would talk crap about a young girl. Nice job. Leave her alone for god sakes. She is doing the right thing by trying to be a mother to her child. Of course it is hard for her to care for a newborn and deal with the left's vicious hatred at the same time. Thank God she has her family. Why don't you all get off your high horses and talk about something worthwhile. well... how is it that he is a \"POS\"? and what is \"nasty\" about sex? he, like she, were thrust into the public eye and paraded across the media like some sort of annomaly. he is no diffrent than any TEENAGED boy. was he supposed to marry her? be a daddy? i think he has a great responsability, since the child is his too, but a lifetime of anger, and harsh feelings between those two would have made the raising of the baby secondary to their spite for each other. after that whole press thing, they are BOTH shy and shell shocked. it is no surprise to me that he ran, and ran as fast as his legs could carry him. and better he ran now, that whan the child was old enough to remember. i think you judge the boy harshly.(because that is what he is proving to be) Maybe he'll man up and take responsability, or Maybe he'll remain hidden. time will tell. tis is not a \"leftist\" thing. it is a \"stupid\" thing thatis being discussed", 
        "reply": " This message has been edited. Last edited by: Elesso, Thu 21 May 2009 05:03 AM", 
        "threadID": "672198221_4520018322001", 
        "time": "2009-05-21 04:31:00", 
        "title": "Bristol Palin Seems to Regret Having A baby", 
        "userID": "Elesso"
    }, 
    {
        "content": "I'm curious, how many of you self righteous, pompous ***holes have had cameras on you 24/7 for extended periods of time? How many of you have been thrown into the spotlight because of the success of a parent? Did Sara really scare you guys that much? Is this the warm-ups for the 2012 mudslinging contest?", 
        "intTime": 20090521, 
        "postID": 15, 
        "quote": "", 
        "reply": "I'm curious, how many of you self righteous, pompous ***holes have had cameras on you 24/7 for extended periods of time? How many of you have been thrown into the spotlight because of the success of a parent? Did Sara really scare you guys that much? Is this the warm-ups for the 2012 mudslinging contest?", 
        "threadID": "672198221_4520018322001", 
        "time": "2009-05-21 04:44:00", 
        "title": "Bristol Palin Seems to Regret Having A baby", 
        "userID": "18830518"
    }, 
    {
        "content": "quote: Originally posted by AngelHeart: Sarah doesn't need her help. Bristol is a teenager who thought she fell in love and let the nasty happen with a little POS. She was a naive, innocent girl before she made the god awful mistake...... LOL What planet are you living on? You play, you pay; and play she did! Bristol Palin: Abstinence Is 'Not Realistic' +http://gawker.com/5154805/bristol-palin-abstinence-is-not-realistic-despite-what-mom-says \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090521, 
        "postID": 16, 
        "quote": "Originally posted by AngelHeart: Sarah doesn't need her help. Bristol is a teenager who thought she fell in love and let the nasty happen with a little POS. She was a naive, innocent girl before she made the god awful mistake......", 
        "reply": " LOL What planet are you living on? You play, you pay; and play she did! Bristol Palin: Abstinence Is 'Not Realistic' +http://gawker.com/5154805/bristol-palin-abstinence-is-not-realistic-despite-what-mom-says \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_4520018322001", 
        "time": "2009-05-21 04:48:00", 
        "title": "Bristol Palin Seems to Regret Having A baby", 
        "userID": "NSNN"
    }, 
    {
        "content": "Why are you pin heads still talking about a kid that made a mistake and is trying to make up for it?", 
        "intTime": 20090521, 
        "postID": 17, 
        "quote": "", 
        "reply": "Why are you pin heads still talking about a kid that made a mistake and is trying to make up for it?", 
        "threadID": "672198221_4520018322001", 
        "time": "2009-05-21 05:07:00", 
        "title": "Bristol Palin Seems to Regret Having A baby", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Duster6: Why are you pin heads still talking about a kid that made a mistake and is trying to make up for it? Probably because these dorks who are critizing her have never done the \"nasty\" before or had to pay for it and are just jealous.", 
        "intTime": 20090521, 
        "postID": 18, 
        "quote": "Originally posted by Duster6: Why are you pin heads still talking about a kid that made a mistake and is trying to make up for it?", 
        "reply": " Probably because these dorks who are critizing her have never done the \"nasty\" before or had to pay for it and are just jealous.", 
        "threadID": "672198221_4520018322001", 
        "time": "2009-05-21 05:25:00", 
        "title": "Bristol Palin Seems to Regret Having A baby", 
        "userID": "NickBrand"
    }, 
    {
        "content": "quote: Originally posted by Duster6: Why are you pin heads still talking about a kid that made a mistake and is trying to make up for it? Getting boozed up (at 17) almost daily and screwing some (random) yahoo is a mistake? No wonder our youth today is so jacked up, with all the free passes we give them...... I don’t feel an iota of pity for her.... \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090521, 
        "postID": 19, 
        "quote": "Originally posted by Duster6: Why are you pin heads still talking about a kid that made a mistake and is trying to make up for it?", 
        "reply": " Getting boozed up (at 17) almost daily and screwing some (random) yahoo is a mistake? No wonder our youth today is so jacked up, with all the free passes we give them...... I don’t feel an iota of pity for her.... \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_4520018322001", 
        "time": "2009-05-21 05:33:00", 
        "title": "Bristol Palin Seems to Regret Having A baby", 
        "userID": "NSNN"
    }, 
    {
        "content": "Her idea of a baby is no longer a \"joyful and happy\" time but a responsible thing that she \"has\" to do. \"http://www.google.com/hostednews/ap/article/ALeqM5hCJJnoKa-w1If6gMyZri_7KaI_MQD98A4IRG0\" \"Girls need to imagine and picture their life with a screaming newborn baby and then think before they have sex,\" Palin told People magazine in a lengthy interview. \"If girls realized the consequences of sex, nobody would be having sex. Trust me. Nobody.\" more like...no body would have a baby..trust me no body. Sounds like maybe she needs to give this baby up for adoption to someone that will love it and be happy for it's birth.", 
        "intTime": 20090520, 
        "postID": 20, 
        "quote": "", 
        "reply": "Her idea of a baby is no longer a \"joyful and happy\" time but a responsible thing that she \"has\" to do. \"http://www.google.com/hostednews/ap/article/ALeqM5hCJJnoKa-w1If6gMyZri_7KaI_MQD98A4IRG0\" \"Girls need to imagine and picture their life with a screaming newborn baby and then think before they have sex,\" Palin told People magazine in a lengthy interview. \"If girls realized the consequences of sex, nobody would be having sex. Trust me. Nobody.\" more like...no body would have a baby..trust me no body. Sounds like maybe she needs to give this baby up for adoption to someone that will love it and be happy for it's birth.", 
        "threadID": "672198221_4520018322001", 
        "time": "2009-05-20 18:42:00", 
        "title": "Bristol Palin Seems to Regret Having A baby", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "so, does that mean her mother was right? heheh", 
        "intTime": 20090520, 
        "postID": 21, 
        "quote": "", 
        "reply": "so, does that mean her mother was right? heheh", 
        "threadID": "672198221_4520018322001", 
        "time": "2009-05-20 19:00:00", 
        "title": "Bristol Palin Seems to Regret Having A baby", 
        "userID": "usa_girl"
    }, 
    {
        "content": "quote: Originally posted by usa_girl: so, does that mean her mother was right? heheh Sounds like it if that's what she said.", 
        "intTime": 20090520, 
        "postID": 22, 
        "quote": "Originally posted by usa_girl: so, does that mean her mother was right? heheh", 
        "reply": " Sounds like it if that's what she said.", 
        "threadID": "672198221_4520018322001", 
        "time": "2009-05-20 19:11:00", 
        "title": "Bristol Palin Seems to Regret Having A baby", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "Doesn't make her any different than most teenage mothers. At least she didn't take the cowardly way out.", 
        "intTime": 20090520, 
        "postID": 23, 
        "quote": "", 
        "reply": "Doesn't make her any different than most teenage mothers. At least she didn't take the cowardly way out.", 
        "threadID": "672198221_4520018322001", 
        "time": "2009-05-20 19:15:00", 
        "title": "Bristol Palin Seems to Regret Having A baby", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Originally posted by stec74: Doesn't make her any different than most teenage mothers. At least she didn't take the cowardly way out. How is putting a baby up for adoption a cowardly way out?", 
        "intTime": 20090520, 
        "postID": 24, 
        "quote": "Originally posted by stec74: Doesn't make her any different than most teenage mothers. At least she didn't take the cowardly way out.", 
        "reply": " How is putting a baby up for adoption a cowardly way out?", 
        "threadID": "672198221_4520018322001", 
        "time": "2009-05-20 19:20:00", 
        "title": "Bristol Palin Seems to Regret Having A baby", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: Her idea of a baby is no longer a \"joyful and happy\" time but a responsible thing that she \"has\" to do. \"http://www.google.com/hostednews/ap/article/ALeqM5hCJJnoKa-w1If6gMyZri_7KaI_MQD98A4IRG0\" \"Girls need to imagine and picture their life with a screaming newborn baby and then think before they have sex,\" Palin told People magazine in a lengthy interview. \"If girls realized the consequences of sex, nobody would be having sex. Trust me. Nobody.\" more like...no body would have a baby..trust me no body. Sounds like maybe she needs to give this baby up for adoption to someone that will love it and be happy for it's birth. And this is important how? The poor girl is not a politician. Her mother is yesterday's news to everyone outside of Alaska. This is nothing but muckraking of the lowest sort.", 
        "intTime": 20090520, 
        "postID": 25, 
        "quote": "Originally posted by crackerjacks61: Her idea of a baby is no longer a \"joyful and happy\" time but a responsible thing that she \"has\" to do. \"http://www.google.com/hostednews/ap/article/ALeqM5hCJJnoKa-w1If6gMyZri_7KaI_MQD98A4IRG0\" \"Girls need to imagine and picture their life with a screaming newborn baby and then think before they have sex,\" Palin told People magazine in a lengthy interview. \"If girls realized the consequences of sex, nobody would be having sex. Trust me. Nobody.\" more like...no body would have a baby..trust me no body. Sounds like maybe she needs to give this baby up for adoption to someone that will love it and be happy for it's birth.", 
        "reply": " And this is important how? The poor girl is not a politician. Her mother is yesterday's news to everyone outside of Alaska. This is nothing but muckraking of the lowest sort.", 
        "threadID": "672198221_4520018322001", 
        "time": "2009-05-20 19:21:00", 
        "title": "Bristol Palin Seems to Regret Having A baby", 
        "userID": "thorin001"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: quote: Originally posted by stec74: Doesn't make her any different than most teenage mothers. At least she didn't take the cowardly way out. How is putting a baby up for adoption a cowardly way out? He was refering to abortion.", 
        "intTime": 20090520, 
        "postID": 26, 
        "quote": "Originally posted by crackerjacks61: quote: Originally posted by stec74: Doesn't make her any different than most teenage mothers. At least she didn't take the cowardly way out. How is putting a baby up for adoption a cowardly way out?", 
        "reply": " He was refering to abortion.", 
        "threadID": "672198221_4520018322001", 
        "time": "2009-05-20 19:22:00", 
        "title": "Bristol Palin Seems to Regret Having A baby", 
        "userID": "thorin001"
    }, 
    {
        "content": "Hey thorin, I agree she is just a girl, but when she went on all the tv shows she became as they say fair game. On one hand, I guess it is nice she wants to try and tell young girls that it was not the right thing to do and how hard it is blah blah blah But that has been said for years and when her mother said it to her, she sure did not listen and unfortunately, many young people wont. Anyway, I think she did not help her mother, she should just be humble, hush up and stay off the tv as should her ex.", 
        "intTime": 20090520, 
        "postID": 27, 
        "quote": "", 
        "reply": "Hey thorin, I agree she is just a girl, but when she went on all the tv shows she became as they say fair game. On one hand, I guess it is nice she wants to try and tell young girls that it was not the right thing to do and how hard it is blah blah blah But that has been said for years and when her mother said it to her, she sure did not listen and unfortunately, many young people wont. Anyway, I think she did not help her mother, she should just be humble, hush up and stay off the tv as should her ex.", 
        "threadID": "672198221_4520018322001", 
        "time": "2009-05-20 19:26:00", 
        "title": "Bristol Palin Seems to Regret Having A baby", 
        "userID": "usa_girl"
    }, 
    {
        "content": "quote: Originally posted by usa_girl: Hey thorin, I agree she is just a girl, but when she went on all the tv shows she became as they say fair game. On one hand, I guess it is nice she wants to try and tell young girls that it was not the right thing to do and how hard it is blah blah blah But that has been said for years and when her mother said it to her, she sure did not listen and unfortunately, many young people wont. Anyway, I think she did not help her mother, she should just be humble, hush up and stay off the tv as should her ex. Sarah doesn't need her help. Bristol is a teenager who thought she fell in love and let the nasty happen with a little POS. She was a naive, innocent girl before she made the god awful mistake you people condemn her for. What a sinner! Cast the girl into hell and get it over with. You all should be ashamed of yourselves. Only a bunch of pathetic excuses for adults with nothing better to do, would talk crap about a young girl. Nice job. Leave her alone for god sakes. She is doing the right thing by trying to be a mother to her child. Of course it is hard for her to care for a newborn and deal with the left's vicious hatred at the same time. Thank God she has her family. Why don't you all get off your high horses and talk about something worthwhile.", 
        "intTime": 20090520, 
        "postID": 28, 
        "quote": "Originally posted by usa_girl: Hey thorin, I agree she is just a girl, but when she went on all the tv shows she became as they say fair game. On one hand, I guess it is nice she wants to try and tell young girls that it was not the right thing to do and how hard it is blah blah blah But that has been said for years and when her mother said it to her, she sure did not listen and unfortunately, many young people wont. Anyway, I think she did not help her mother, she should just be humble, hush up and stay off the tv as should her ex.", 
        "reply": " Sarah doesn't need her help. Bristol is a teenager who thought she fell in love and let the nasty happen with a little POS. She was a naive, innocent girl before she made the god awful mistake you people condemn her for. What a sinner! Cast the girl into hell and get it over with. You all should be ashamed of yourselves. Only a bunch of pathetic excuses for adults with nothing better to do, would talk crap about a young girl. Nice job. Leave her alone for god sakes. She is doing the right thing by trying to be a mother to her child. Of course it is hard for her to care for a newborn and deal with the left's vicious hatred at the same time. Thank God she has her family. Why don't you all get off your high horses and talk about something worthwhile.", 
        "threadID": "672198221_4520018322001", 
        "time": "2009-05-20 21:09:00", 
        "title": "Bristol Palin Seems to Regret Having A baby", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "Hi AngelHeart Sorry if the post offended you. I am not condemning her. I get she was young and made a mistake. I certainly don't want her to go to the devil. I know she loves her little baby even though times will be tough. I am sure the ex is not a cute as he was to her back then, yes? Having said that, when she herself continues to be in the media and tell her story then she becomes a topic of conversation. The topic itself bring passion from both sides as I can tell from your post. Anyway, it was not meant from me to be vicious, only to discuss the topic. That is how you might be able to find a middle ground to the subject, if both sides keep talking.", 
        "intTime": 20090520, 
        "postID": 29, 
        "quote": "", 
        "reply": "Hi AngelHeart Sorry if the post offended you. I am not condemning her. I get she was young and made a mistake. I certainly don't want her to go to the devil. I know she loves her little baby even though times will be tough. I am sure the ex is not a cute as he was to her back then, yes? Having said that, when she herself continues to be in the media and tell her story then she becomes a topic of conversation. The topic itself bring passion from both sides as I can tell from your post. Anyway, it was not meant from me to be vicious, only to discuss the topic. That is how you might be able to find a middle ground to the subject, if both sides keep talking.", 
        "threadID": "672198221_4520018322001", 
        "time": "2009-05-20 22:17:00", 
        "title": "Bristol Palin Seems to Regret Having A baby", 
        "userID": "usa_girl"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: quote: Originally posted by crackerjacks61: Her idea of a baby is no longer a \"joyful and happy\" time but a responsible thing that she \"has\" to do. \"http://www.google.com/hostednews/ap/article/ALeqM5hCJJnoKa-w1If6gMyZri_7KaI_MQD98A4IRG0\" \"Girls need to imagine and picture their life with a screaming newborn baby and then think before they have sex,\" Palin told People magazine in a lengthy interview. \"If girls realized the consequences of sex, nobody would be having sex. Trust me. Nobody.\" more like...no body would have a baby..trust me no body. Sounds like maybe she needs to give this baby up for adoption to someone that will love it and be happy for it's birth. She loves her son, but it's hard even when you are planning for it. Babies change lives. She's new at this. Cut her some slack. EXACTLY... the poor kid has realized the depth of her responsibility... that is a hard pill to swallow. she'll grow into it in time... with a little help, here and there, she'll do what women have been doing since the beginning of time... she'll be a mother and raise a child in a safe, nurturing home.", 
        "intTime": 20090521, 
        "postID": 30, 
        "quote": "Originally posted by klassylady25: quote: Originally posted by crackerjacks61: Her idea of a baby is no longer a \"joyful and happy\" time but a responsible thing that she \"has\" to do. \"http://www.google.com/hostednews/ap/article/ALeqM5hCJJnoKa-w1If6gMyZri_7KaI_MQD98A4IRG0\" \"Girls need to imagine and picture their life with a screaming newborn baby and then think before they have sex,\" Palin told People magazine in a lengthy interview. \"If girls realized the consequences of sex, nobody would be having sex. Trust me. Nobody.\" more like...no body would have a baby..trust me no body. Sounds like maybe she needs to give this baby up for adoption to someone that will love it and be happy for it's birth. She loves her son, but it's hard even when you are planning for it. Babies change lives. She's new at this. Cut her some slack.", 
        "reply": " EXACTLY... the poor kid has realized the depth of her responsibility... that is a hard pill to swallow. she'll grow into it in time... with a little help, here and there, she'll do what women have been doing since the beginning of time... she'll be a mother and raise a child in a safe, nurturing home.", 
        "threadID": "672198221_4520018322001", 
        "time": "2009-05-21 04:20:00", 
        "title": "Bristol Palin Seems to Regret Having A baby", 
        "userID": "Elesso"
    }, 
    {
        "content": "quote: Originally posted by thorin001: quote: Originally posted by crackerjacks61: Her idea of a baby is no longer a \"joyful and happy\" time but a responsible thing that she \"has\" to do. \"http://www.google.com/hostednews/ap/article/ALeqM5hCJJnoKa-w1If6gMyZri_7KaI_MQD98A4IRG0\" \"Girls need to imagine and picture their life with a screaming newborn baby and then think before they have sex,\" Palin told People magazine in a lengthy interview. \"If girls realized the consequences of sex, nobody would be having sex. Trust me. Nobody.\" more like...no body would have a baby..trust me no body. Sounds like maybe she needs to give this baby up for adoption to someone that will love it and be happy for it's birth. And this is important how? The poor girl is not a politician. Her mother is yesterday's news to everyone outside of Alaska. This is nothing but muckraking of the lowest sort. She's not a politician but since she is in time magazine that makes her somewhat of a Celebrity doesn't it? If she does not want to be in the lime light she shouldn't place herself there.", 
        "intTime": 20090521, 
        "postID": 31, 
        "quote": "Originally posted by thorin001: quote: Originally posted by crackerjacks61: Her idea of a baby is no longer a \"joyful and happy\" time but a responsible thing that she \"has\" to do. \"http://www.google.com/hostednews/ap/article/ALeqM5hCJJnoKa-w1If6gMyZri_7KaI_MQD98A4IRG0\" \"Girls need to imagine and picture their life with a screaming newborn baby and then think before they have sex,\" Palin told People magazine in a lengthy interview. \"If girls realized the consequences of sex, nobody would be having sex. Trust me. Nobody.\" more like...no body would have a baby..trust me no body. Sounds like maybe she needs to give this baby up for adoption to someone that will love it and be happy for it's birth. And this is important how? The poor girl is not a politician. Her mother is yesterday's news to everyone outside of Alaska. This is nothing but muckraking of the lowest sort.", 
        "reply": " She's not a politician but since she is in time magazine that makes her somewhat of a Celebrity doesn't it? If she does not want to be in the lime light she shouldn't place herself there.", 
        "threadID": "672198221_4520018322001", 
        "time": "2009-05-21 04:27:00", 
        "title": "Bristol Palin Seems to Regret Having A baby", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by usa_girl: Hey thorin, I agree she is just a girl, but when she went on all the tv shows she became as they say fair game. On one hand, I guess it is nice she wants to try and tell young girls that it was not the right thing to do and how hard it is blah blah blah But that has been said for years and when her mother said it to her, she sure did not listen and unfortunately, many young people wont. Anyway, I think she did not help her mother, she should just be humble, hush up and stay off the tv as should her ex. My feelings exactly.", 
        "intTime": 20090521, 
        "postID": 32, 
        "quote": "Originally posted by usa_girl: Hey thorin, I agree she is just a girl, but when she went on all the tv shows she became as they say fair game. On one hand, I guess it is nice she wants to try and tell young girls that it was not the right thing to do and how hard it is blah blah blah But that has been said for years and when her mother said it to her, she sure did not listen and unfortunately, many young people wont. Anyway, I think she did not help her mother, she should just be humble, hush up and stay off the tv as should her ex.", 
        "reply": " My feelings exactly.", 
        "threadID": "672198221_4520018322001", 
        "time": "2009-05-21 04:28:00", 
        "title": "Bristol Palin Seems to Regret Having A baby", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by Elesso: quote: Originally posted by Elesso: quote: Originally posted by AngelHeart: quote: Originally posted by usa_girl: Hey thorin, I agree she is just a girl, but when she went on all the tv shows she became as they say fair game. On one hand, I guess it is nice she wants to try and tell young girls that it was not the right thing to do and how hard it is blah blah blah But that has been said for years and when her mother said it to her, she sure did not listen and unfortunately, many young people wont. Anyway, I think she did not help her mother, she should just be humble, hush up and stay off the tv as should her ex. Sarah doesn't need her help. Bristol is a teenager who thought she fell in love and let the nasty happen with a little POS. She was a naive, innocent girl before she made the god awful mistake you people condemn her for. What a sinner! Cast the girl into hell and get it over with. You all should be ashamed of yourselves. Only a bunch of pathetic excuses for adults with nothing better to do, would talk crap about a young girl. Nice job. Leave her alone for god sakes. She is doing the right thing by trying to be a mother to her child. Of course it is hard for her to care for a newborn and deal with the left's vicious hatred at the same time. Thank God she has her family. Why don't you all get off your high horses and talk about something worthwhile. well... how is it that he is a \"POS\"? and what is \"nasty\" about sex? he, like she, were thrust into the public eye and paraded across the media like some sort of annomaly. he is no diffrent than any TEENAGED boy. was he supposed to marry her? be a daddy? i think he has a great responsability, since the child is his too, but a lifetime of anger, and harsh feelings between those two would have made the raising of the baby secondary to their spite for each other. after that whole press thing, they are BOTH shy and shell shocked. it is no surprise to me that he ran, and ran as fast as his legs could carry him. and better he ran now, that whan the child was old enough to remember. i think you judge the boy harshly.(because that is what he is proving to be) Maybe he'll man up and take responsability, or Maybe he'll remain hidden. time will tell. tis is not a \"leftist\" thing. it is a \"stupid\" thing thatis being discussed This message has been edited. Last edited by: Elesso, Thu 21 May 2009 05:03 AM", 
        "intTime": 20090521, 
        "postID": 33, 
        "quote": "Originally posted by Elesso: quote: Originally posted by Elesso: quote: Originally posted by AngelHeart: quote: Originally posted by usa_girl: Hey thorin, I agree she is just a girl, but when she went on all the tv shows she became as they say fair game. On one hand, I guess it is nice she wants to try and tell young girls that it was not the right thing to do and how hard it is blah blah blah But that has been said for years and when her mother said it to her, she sure did not listen and unfortunately, many young people wont. Anyway, I think she did not help her mother, she should just be humble, hush up and stay off the tv as should her ex. Sarah doesn't need her help. Bristol is a teenager who thought she fell in love and let the nasty happen with a little POS. She was a naive, innocent girl before she made the god awful mistake you people condemn her for. What a sinner! Cast the girl into hell and get it over with. You all should be ashamed of yourselves. Only a bunch of pathetic excuses for adults with nothing better to do, would talk crap about a young girl. Nice job. Leave her alone for god sakes. She is doing the right thing by trying to be a mother to her child. Of course it is hard for her to care for a newborn and deal with the left's vicious hatred at the same time. Thank God she has her family. Why don't you all get off your high horses and talk about something worthwhile. well... how is it that he is a \"POS\"? and what is \"nasty\" about sex? he, like she, were thrust into the public eye and paraded across the media like some sort of annomaly. he is no diffrent than any TEENAGED boy. was he supposed to marry her? be a daddy? i think he has a great responsability, since the child is his too, but a lifetime of anger, and harsh feelings between those two would have made the raising of the baby secondary to their spite for each other. after that whole press thing, they are BOTH shy and shell shocked. it is no surprise to me that he ran, and ran as fast as his legs could carry him. and better he ran now, that whan the child was old enough to remember. i think you judge the boy harshly.(because that is what he is proving to be) Maybe he'll man up and take responsability, or Maybe he'll remain hidden. time will tell. tis is not a \"leftist\" thing. it is a \"stupid\" thing thatis being discussed", 
        "reply": " This message has been edited. Last edited by: Elesso, Thu 21 May 2009 05:03 AM", 
        "threadID": "672198221_4520018322001", 
        "time": "2009-05-21 04:31:00", 
        "title": "Bristol Palin Seems to Regret Having A baby", 
        "userID": "Elesso"
    }, 
    {
        "content": "I'm curious, how many of you self righteous, pompous ***holes have had cameras on you 24/7 for extended periods of time? How many of you have been thrown into the spotlight because of the success of a parent? Did Sara really scare you guys that much? Is this the warm-ups for the 2012 mudslinging contest?", 
        "intTime": 20090521, 
        "postID": 34, 
        "quote": "", 
        "reply": "I'm curious, how many of you self righteous, pompous ***holes have had cameras on you 24/7 for extended periods of time? How many of you have been thrown into the spotlight because of the success of a parent? Did Sara really scare you guys that much? Is this the warm-ups for the 2012 mudslinging contest?", 
        "threadID": "672198221_4520018322001", 
        "time": "2009-05-21 04:44:00", 
        "title": "Bristol Palin Seems to Regret Having A baby", 
        "userID": "18830518"
    }, 
    {
        "content": "quote: Originally posted by AngelHeart: Sarah doesn't need her help. Bristol is a teenager who thought she fell in love and let the nasty happen with a little POS. She was a naive, innocent girl before she made the god awful mistake...... LOL What planet are you living on? You play, you pay; and play she did! Bristol Palin: Abstinence Is 'Not Realistic' +http://gawker.com/5154805/bristol-palin-abstinence-is-not-realistic-despite-what-mom-says \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090521, 
        "postID": 35, 
        "quote": "Originally posted by AngelHeart: Sarah doesn't need her help. Bristol is a teenager who thought she fell in love and let the nasty happen with a little POS. She was a naive, innocent girl before she made the god awful mistake......", 
        "reply": " LOL What planet are you living on? You play, you pay; and play she did! Bristol Palin: Abstinence Is 'Not Realistic' +http://gawker.com/5154805/bristol-palin-abstinence-is-not-realistic-despite-what-mom-says \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_4520018322001", 
        "time": "2009-05-21 04:48:00", 
        "title": "Bristol Palin Seems to Regret Having A baby", 
        "userID": "NSNN"
    }, 
    {
        "content": "Why are you pin heads still talking about a kid that made a mistake and is trying to make up for it?", 
        "intTime": 20090521, 
        "postID": 36, 
        "quote": "", 
        "reply": "Why are you pin heads still talking about a kid that made a mistake and is trying to make up for it?", 
        "threadID": "672198221_4520018322001", 
        "time": "2009-05-21 05:07:00", 
        "title": "Bristol Palin Seems to Regret Having A baby", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Duster6: Why are you pin heads still talking about a kid that made a mistake and is trying to make up for it? Probably because these dorks who are critizing her have never done the \"nasty\" before or had to pay for it and are just jealous.", 
        "intTime": 20090521, 
        "postID": 37, 
        "quote": "Originally posted by Duster6: Why are you pin heads still talking about a kid that made a mistake and is trying to make up for it?", 
        "reply": " Probably because these dorks who are critizing her have never done the \"nasty\" before or had to pay for it and are just jealous.", 
        "threadID": "672198221_4520018322001", 
        "time": "2009-05-21 05:25:00", 
        "title": "Bristol Palin Seems to Regret Having A baby", 
        "userID": "NickBrand"
    }, 
    {
        "content": "quote: Originally posted by Duster6: Why are you pin heads still talking about a kid that made a mistake and is trying to make up for it? Getting boozed up (at 17) almost daily and screwing some (random) yahoo is a mistake? No wonder our youth today is so jacked up, with all the free passes we give them...... I don’t feel an iota of pity for her.... \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090521, 
        "postID": 38, 
        "quote": "Originally posted by Duster6: Why are you pin heads still talking about a kid that made a mistake and is trying to make up for it?", 
        "reply": " Getting boozed up (at 17) almost daily and screwing some (random) yahoo is a mistake? No wonder our youth today is so jacked up, with all the free passes we give them...... I don’t feel an iota of pity for her.... \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_4520018322001", 
        "time": "2009-05-21 05:33:00", 
        "title": "Bristol Palin Seems to Regret Having A baby", 
        "userID": "NSNN"
    }, 
    {
        "content": "Her idea of a baby is no longer a \"joyful and happy\" time but a responsible thing that she \"has\" to do. \"http://www.google.com/hostednews/ap/article/ALeqM5hCJJnoKa-w1If6gMyZri_7KaI_MQD98A4IRG0\" \"Girls need to imagine and picture their life with a screaming newborn baby and then think before they have sex,\" Palin told People magazine in a lengthy interview. \"If girls realized the consequences of sex, nobody would be having sex. Trust me. Nobody.\" more like...no body would have a baby..trust me no body. Sounds like maybe she needs to give this baby up for adoption to someone that will love it and be happy for it's birth.", 
        "intTime": 20090520, 
        "postID": 39, 
        "quote": "", 
        "reply": "Her idea of a baby is no longer a \"joyful and happy\" time but a responsible thing that she \"has\" to do. \"http://www.google.com/hostednews/ap/article/ALeqM5hCJJnoKa-w1If6gMyZri_7KaI_MQD98A4IRG0\" \"Girls need to imagine and picture their life with a screaming newborn baby and then think before they have sex,\" Palin told People magazine in a lengthy interview. \"If girls realized the consequences of sex, nobody would be having sex. Trust me. Nobody.\" more like...no body would have a baby..trust me no body. Sounds like maybe she needs to give this baby up for adoption to someone that will love it and be happy for it's birth.", 
        "threadID": "672198221_4520018322001", 
        "time": "2009-05-20 18:42:00", 
        "title": "Bristol Palin Seems to Regret Having A baby", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "so, does that mean her mother was right? heheh", 
        "intTime": 20090520, 
        "postID": 40, 
        "quote": "", 
        "reply": "so, does that mean her mother was right? heheh", 
        "threadID": "672198221_4520018322001", 
        "time": "2009-05-20 19:00:00", 
        "title": "Bristol Palin Seems to Regret Having A baby", 
        "userID": "usa_girl"
    }, 
    {
        "content": "quote: Originally posted by usa_girl: so, does that mean her mother was right? heheh Sounds like it if that's what she said.", 
        "intTime": 20090520, 
        "postID": 41, 
        "quote": "Originally posted by usa_girl: so, does that mean her mother was right? heheh", 
        "reply": " Sounds like it if that's what she said.", 
        "threadID": "672198221_4520018322001", 
        "time": "2009-05-20 19:11:00", 
        "title": "Bristol Palin Seems to Regret Having A baby", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "Doesn't make her any different than most teenage mothers. At least she didn't take the cowardly way out.", 
        "intTime": 20090520, 
        "postID": 42, 
        "quote": "", 
        "reply": "Doesn't make her any different than most teenage mothers. At least she didn't take the cowardly way out.", 
        "threadID": "672198221_4520018322001", 
        "time": "2009-05-20 19:15:00", 
        "title": "Bristol Palin Seems to Regret Having A baby", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Originally posted by stec74: Doesn't make her any different than most teenage mothers. At least she didn't take the cowardly way out. How is putting a baby up for adoption a cowardly way out?", 
        "intTime": 20090520, 
        "postID": 43, 
        "quote": "Originally posted by stec74: Doesn't make her any different than most teenage mothers. At least she didn't take the cowardly way out.", 
        "reply": " How is putting a baby up for adoption a cowardly way out?", 
        "threadID": "672198221_4520018322001", 
        "time": "2009-05-20 19:20:00", 
        "title": "Bristol Palin Seems to Regret Having A baby", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: Her idea of a baby is no longer a \"joyful and happy\" time but a responsible thing that she \"has\" to do. \"http://www.google.com/hostednews/ap/article/ALeqM5hCJJnoKa-w1If6gMyZri_7KaI_MQD98A4IRG0\" \"Girls need to imagine and picture their life with a screaming newborn baby and then think before they have sex,\" Palin told People magazine in a lengthy interview. \"If girls realized the consequences of sex, nobody would be having sex. Trust me. Nobody.\" more like...no body would have a baby..trust me no body. Sounds like maybe she needs to give this baby up for adoption to someone that will love it and be happy for it's birth. And this is important how? The poor girl is not a politician. Her mother is yesterday's news to everyone outside of Alaska. This is nothing but muckraking of the lowest sort.", 
        "intTime": 20090520, 
        "postID": 44, 
        "quote": "Originally posted by crackerjacks61: Her idea of a baby is no longer a \"joyful and happy\" time but a responsible thing that she \"has\" to do. \"http://www.google.com/hostednews/ap/article/ALeqM5hCJJnoKa-w1If6gMyZri_7KaI_MQD98A4IRG0\" \"Girls need to imagine and picture their life with a screaming newborn baby and then think before they have sex,\" Palin told People magazine in a lengthy interview. \"If girls realized the consequences of sex, nobody would be having sex. Trust me. Nobody.\" more like...no body would have a baby..trust me no body. Sounds like maybe she needs to give this baby up for adoption to someone that will love it and be happy for it's birth.", 
        "reply": " And this is important how? The poor girl is not a politician. Her mother is yesterday's news to everyone outside of Alaska. This is nothing but muckraking of the lowest sort.", 
        "threadID": "672198221_4520018322001", 
        "time": "2009-05-20 19:21:00", 
        "title": "Bristol Palin Seems to Regret Having A baby", 
        "userID": "thorin001"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: quote: Originally posted by stec74: Doesn't make her any different than most teenage mothers. At least she didn't take the cowardly way out. How is putting a baby up for adoption a cowardly way out? He was refering to abortion.", 
        "intTime": 20090520, 
        "postID": 45, 
        "quote": "Originally posted by crackerjacks61: quote: Originally posted by stec74: Doesn't make her any different than most teenage mothers. At least she didn't take the cowardly way out. How is putting a baby up for adoption a cowardly way out?", 
        "reply": " He was refering to abortion.", 
        "threadID": "672198221_4520018322001", 
        "time": "2009-05-20 19:22:00", 
        "title": "Bristol Palin Seems to Regret Having A baby", 
        "userID": "thorin001"
    }, 
    {
        "content": "Hey thorin, I agree she is just a girl, but when she went on all the tv shows she became as they say fair game. On one hand, I guess it is nice she wants to try and tell young girls that it was not the right thing to do and how hard it is blah blah blah But that has been said for years and when her mother said it to her, she sure did not listen and unfortunately, many young people wont. Anyway, I think she did not help her mother, she should just be humble, hush up and stay off the tv as should her ex.", 
        "intTime": 20090520, 
        "postID": 46, 
        "quote": "", 
        "reply": "Hey thorin, I agree she is just a girl, but when she went on all the tv shows she became as they say fair game. On one hand, I guess it is nice she wants to try and tell young girls that it was not the right thing to do and how hard it is blah blah blah But that has been said for years and when her mother said it to her, she sure did not listen and unfortunately, many young people wont. Anyway, I think she did not help her mother, she should just be humble, hush up and stay off the tv as should her ex.", 
        "threadID": "672198221_4520018322001", 
        "time": "2009-05-20 19:26:00", 
        "title": "Bristol Palin Seems to Regret Having A baby", 
        "userID": "usa_girl"
    }, 
    {
        "content": "quote: Originally posted by usa_girl: Hey thorin, I agree she is just a girl, but when she went on all the tv shows she became as they say fair game. On one hand, I guess it is nice she wants to try and tell young girls that it was not the right thing to do and how hard it is blah blah blah But that has been said for years and when her mother said it to her, she sure did not listen and unfortunately, many young people wont. Anyway, I think she did not help her mother, she should just be humble, hush up and stay off the tv as should her ex. Sarah doesn't need her help. Bristol is a teenager who thought she fell in love and let the nasty happen with a little POS. She was a naive, innocent girl before she made the god awful mistake you people condemn her for. What a sinner! Cast the girl into hell and get it over with. You all should be ashamed of yourselves. Only a bunch of pathetic excuses for adults with nothing better to do, would talk crap about a young girl. Nice job. Leave her alone for god sakes. She is doing the right thing by trying to be a mother to her child. Of course it is hard for her to care for a newborn and deal with the left's vicious hatred at the same time. Thank God she has her family. Why don't you all get off your high horses and talk about something worthwhile.", 
        "intTime": 20090520, 
        "postID": 47, 
        "quote": "Originally posted by usa_girl: Hey thorin, I agree she is just a girl, but when she went on all the tv shows she became as they say fair game. On one hand, I guess it is nice she wants to try and tell young girls that it was not the right thing to do and how hard it is blah blah blah But that has been said for years and when her mother said it to her, she sure did not listen and unfortunately, many young people wont. Anyway, I think she did not help her mother, she should just be humble, hush up and stay off the tv as should her ex.", 
        "reply": " Sarah doesn't need her help. Bristol is a teenager who thought she fell in love and let the nasty happen with a little POS. She was a naive, innocent girl before she made the god awful mistake you people condemn her for. What a sinner! Cast the girl into hell and get it over with. You all should be ashamed of yourselves. Only a bunch of pathetic excuses for adults with nothing better to do, would talk crap about a young girl. Nice job. Leave her alone for god sakes. She is doing the right thing by trying to be a mother to her child. Of course it is hard for her to care for a newborn and deal with the left's vicious hatred at the same time. Thank God she has her family. Why don't you all get off your high horses and talk about something worthwhile.", 
        "threadID": "672198221_4520018322001", 
        "time": "2009-05-20 21:09:00", 
        "title": "Bristol Palin Seems to Regret Having A baby", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "Hi AngelHeart Sorry if the post offended you. I am not condemning her. I get she was young and made a mistake. I certainly don't want her to go to the devil. I know she loves her little baby even though times will be tough. I am sure the ex is not a cute as he was to her back then, yes? Having said that, when she herself continues to be in the media and tell her story then she becomes a topic of conversation. The topic itself bring passion from both sides as I can tell from your post. Anyway, it was not meant from me to be vicious, only to discuss the topic. That is how you might be able to find a middle ground to the subject, if both sides keep talking.", 
        "intTime": 20090520, 
        "postID": 48, 
        "quote": "", 
        "reply": "Hi AngelHeart Sorry if the post offended you. I am not condemning her. I get she was young and made a mistake. I certainly don't want her to go to the devil. I know she loves her little baby even though times will be tough. I am sure the ex is not a cute as he was to her back then, yes? Having said that, when she herself continues to be in the media and tell her story then she becomes a topic of conversation. The topic itself bring passion from both sides as I can tell from your post. Anyway, it was not meant from me to be vicious, only to discuss the topic. That is how you might be able to find a middle ground to the subject, if both sides keep talking.", 
        "threadID": "672198221_4520018322001", 
        "time": "2009-05-20 22:17:00", 
        "title": "Bristol Palin Seems to Regret Having A baby", 
        "userID": "usa_girl"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: quote: Originally posted by crackerjacks61: Her idea of a baby is no longer a \"joyful and happy\" time but a responsible thing that she \"has\" to do. \"http://www.google.com/hostednews/ap/article/ALeqM5hCJJnoKa-w1If6gMyZri_7KaI_MQD98A4IRG0\" \"Girls need to imagine and picture their life with a screaming newborn baby and then think before they have sex,\" Palin told People magazine in a lengthy interview. \"If girls realized the consequences of sex, nobody would be having sex. Trust me. Nobody.\" more like...no body would have a baby..trust me no body. Sounds like maybe she needs to give this baby up for adoption to someone that will love it and be happy for it's birth. She loves her son, but it's hard even when you are planning for it. Babies change lives. She's new at this. Cut her some slack. EXACTLY... the poor kid has realized the depth of her responsibility... that is a hard pill to swallow. she'll grow into it in time... with a little help, here and there, she'll do what women have been doing since the beginning of time... she'll be a mother and raise a child in a safe, nurturing home.", 
        "intTime": 20090521, 
        "postID": 49, 
        "quote": "Originally posted by klassylady25: quote: Originally posted by crackerjacks61: Her idea of a baby is no longer a \"joyful and happy\" time but a responsible thing that she \"has\" to do. \"http://www.google.com/hostednews/ap/article/ALeqM5hCJJnoKa-w1If6gMyZri_7KaI_MQD98A4IRG0\" \"Girls need to imagine and picture their life with a screaming newborn baby and then think before they have sex,\" Palin told People magazine in a lengthy interview. \"If girls realized the consequences of sex, nobody would be having sex. Trust me. Nobody.\" more like...no body would have a baby..trust me no body. Sounds like maybe she needs to give this baby up for adoption to someone that will love it and be happy for it's birth. She loves her son, but it's hard even when you are planning for it. Babies change lives. She's new at this. Cut her some slack.", 
        "reply": " EXACTLY... the poor kid has realized the depth of her responsibility... that is a hard pill to swallow. she'll grow into it in time... with a little help, here and there, she'll do what women have been doing since the beginning of time... she'll be a mother and raise a child in a safe, nurturing home.", 
        "threadID": "672198221_4520018322001", 
        "time": "2009-05-21 04:20:00", 
        "title": "Bristol Palin Seems to Regret Having A baby", 
        "userID": "Elesso"
    }, 
    {
        "content": "quote: Originally posted by thorin001: quote: Originally posted by crackerjacks61: Her idea of a baby is no longer a \"joyful and happy\" time but a responsible thing that she \"has\" to do. \"http://www.google.com/hostednews/ap/article/ALeqM5hCJJnoKa-w1If6gMyZri_7KaI_MQD98A4IRG0\" \"Girls need to imagine and picture their life with a screaming newborn baby and then think before they have sex,\" Palin told People magazine in a lengthy interview. \"If girls realized the consequences of sex, nobody would be having sex. Trust me. Nobody.\" more like...no body would have a baby..trust me no body. Sounds like maybe she needs to give this baby up for adoption to someone that will love it and be happy for it's birth. And this is important how? The poor girl is not a politician. Her mother is yesterday's news to everyone outside of Alaska. This is nothing but muckraking of the lowest sort. She's not a politician but since she is in time magazine that makes her somewhat of a Celebrity doesn't it? If she does not want to be in the lime light she shouldn't place herself there.", 
        "intTime": 20090521, 
        "postID": 50, 
        "quote": "Originally posted by thorin001: quote: Originally posted by crackerjacks61: Her idea of a baby is no longer a \"joyful and happy\" time but a responsible thing that she \"has\" to do. \"http://www.google.com/hostednews/ap/article/ALeqM5hCJJnoKa-w1If6gMyZri_7KaI_MQD98A4IRG0\" \"Girls need to imagine and picture their life with a screaming newborn baby and then think before they have sex,\" Palin told People magazine in a lengthy interview. \"If girls realized the consequences of sex, nobody would be having sex. Trust me. Nobody.\" more like...no body would have a baby..trust me no body. Sounds like maybe she needs to give this baby up for adoption to someone that will love it and be happy for it's birth. And this is important how? The poor girl is not a politician. Her mother is yesterday's news to everyone outside of Alaska. This is nothing but muckraking of the lowest sort.", 
        "reply": " She's not a politician but since she is in time magazine that makes her somewhat of a Celebrity doesn't it? If she does not want to be in the lime light she shouldn't place herself there.", 
        "threadID": "672198221_4520018322001", 
        "time": "2009-05-21 04:27:00", 
        "title": "Bristol Palin Seems to Regret Having A baby", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by usa_girl: Hey thorin, I agree she is just a girl, but when she went on all the tv shows she became as they say fair game. On one hand, I guess it is nice she wants to try and tell young girls that it was not the right thing to do and how hard it is blah blah blah But that has been said for years and when her mother said it to her, she sure did not listen and unfortunately, many young people wont. Anyway, I think she did not help her mother, she should just be humble, hush up and stay off the tv as should her ex. My feelings exactly.", 
        "intTime": 20090521, 
        "postID": 51, 
        "quote": "Originally posted by usa_girl: Hey thorin, I agree she is just a girl, but when she went on all the tv shows she became as they say fair game. On one hand, I guess it is nice she wants to try and tell young girls that it was not the right thing to do and how hard it is blah blah blah But that has been said for years and when her mother said it to her, she sure did not listen and unfortunately, many young people wont. Anyway, I think she did not help her mother, she should just be humble, hush up and stay off the tv as should her ex.", 
        "reply": " My feelings exactly.", 
        "threadID": "672198221_4520018322001", 
        "time": "2009-05-21 04:28:00", 
        "title": "Bristol Palin Seems to Regret Having A baby", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by Elesso: quote: Originally posted by Elesso: quote: Originally posted by AngelHeart: quote: Originally posted by usa_girl: Hey thorin, I agree she is just a girl, but when she went on all the tv shows she became as they say fair game. On one hand, I guess it is nice she wants to try and tell young girls that it was not the right thing to do and how hard it is blah blah blah But that has been said for years and when her mother said it to her, she sure did not listen and unfortunately, many young people wont. Anyway, I think she did not help her mother, she should just be humble, hush up and stay off the tv as should her ex. Sarah doesn't need her help. Bristol is a teenager who thought she fell in love and let the nasty happen with a little POS. She was a naive, innocent girl before she made the god awful mistake you people condemn her for. What a sinner! Cast the girl into hell and get it over with. You all should be ashamed of yourselves. Only a bunch of pathetic excuses for adults with nothing better to do, would talk crap about a young girl. Nice job. Leave her alone for god sakes. She is doing the right thing by trying to be a mother to her child. Of course it is hard for her to care for a newborn and deal with the left's vicious hatred at the same time. Thank God she has her family. Why don't you all get off your high horses and talk about something worthwhile. well... how is it that he is a \"POS\"? and what is \"nasty\" about sex? he, like she, were thrust into the public eye and paraded across the media like some sort of annomaly. he is no diffrent than any TEENAGED boy. was he supposed to marry her? be a daddy? i think he has a great responsability, since the child is his too, but a lifetime of anger, and harsh feelings between those two would have made the raising of the baby secondary to their spite for each other. after that whole press thing, they are BOTH shy and shell shocked. it is no surprise to me that he ran, and ran as fast as his legs could carry him. and better he ran now, that whan the child was old enough to remember. i think you judge the boy harshly.(because that is what he is proving to be) Maybe he'll man up and take responsability, or Maybe he'll remain hidden. time will tell. tis is not a \"leftist\" thing. it is a \"stupid\" thing thatis being discussed This message has been edited. Last edited by: Elesso, Thu 21 May 2009 05:03 AM", 
        "intTime": 20090521, 
        "postID": 52, 
        "quote": "Originally posted by Elesso: quote: Originally posted by Elesso: quote: Originally posted by AngelHeart: quote: Originally posted by usa_girl: Hey thorin, I agree she is just a girl, but when she went on all the tv shows she became as they say fair game. On one hand, I guess it is nice she wants to try and tell young girls that it was not the right thing to do and how hard it is blah blah blah But that has been said for years and when her mother said it to her, she sure did not listen and unfortunately, many young people wont. Anyway, I think she did not help her mother, she should just be humble, hush up and stay off the tv as should her ex. Sarah doesn't need her help. Bristol is a teenager who thought she fell in love and let the nasty happen with a little POS. She was a naive, innocent girl before she made the god awful mistake you people condemn her for. What a sinner! Cast the girl into hell and get it over with. You all should be ashamed of yourselves. Only a bunch of pathetic excuses for adults with nothing better to do, would talk crap about a young girl. Nice job. Leave her alone for god sakes. She is doing the right thing by trying to be a mother to her child. Of course it is hard for her to care for a newborn and deal with the left's vicious hatred at the same time. Thank God she has her family. Why don't you all get off your high horses and talk about something worthwhile. well... how is it that he is a \"POS\"? and what is \"nasty\" about sex? he, like she, were thrust into the public eye and paraded across the media like some sort of annomaly. he is no diffrent than any TEENAGED boy. was he supposed to marry her? be a daddy? i think he has a great responsability, since the child is his too, but a lifetime of anger, and harsh feelings between those two would have made the raising of the baby secondary to their spite for each other. after that whole press thing, they are BOTH shy and shell shocked. it is no surprise to me that he ran, and ran as fast as his legs could carry him. and better he ran now, that whan the child was old enough to remember. i think you judge the boy harshly.(because that is what he is proving to be) Maybe he'll man up and take responsability, or Maybe he'll remain hidden. time will tell. tis is not a \"leftist\" thing. it is a \"stupid\" thing thatis being discussed", 
        "reply": " This message has been edited. Last edited by: Elesso, Thu 21 May 2009 05:03 AM", 
        "threadID": "672198221_4520018322001", 
        "time": "2009-05-21 04:31:00", 
        "title": "Bristol Palin Seems to Regret Having A baby", 
        "userID": "Elesso"
    }, 
    {
        "content": "I'm curious, how many of you self righteous, pompous ***holes have had cameras on you 24/7 for extended periods of time? How many of you have been thrown into the spotlight because of the success of a parent? Did Sara really scare you guys that much? Is this the warm-ups for the 2012 mudslinging contest?", 
        "intTime": 20090521, 
        "postID": 53, 
        "quote": "", 
        "reply": "I'm curious, how many of you self righteous, pompous ***holes have had cameras on you 24/7 for extended periods of time? How many of you have been thrown into the spotlight because of the success of a parent? Did Sara really scare you guys that much? Is this the warm-ups for the 2012 mudslinging contest?", 
        "threadID": "672198221_4520018322001", 
        "time": "2009-05-21 04:44:00", 
        "title": "Bristol Palin Seems to Regret Having A baby", 
        "userID": "18830518"
    }, 
    {
        "content": "quote: Originally posted by AngelHeart: Sarah doesn't need her help. Bristol is a teenager who thought she fell in love and let the nasty happen with a little POS. She was a naive, innocent girl before she made the god awful mistake...... LOL What planet are you living on? You play, you pay; and play she did! Bristol Palin: Abstinence Is 'Not Realistic' +http://gawker.com/5154805/bristol-palin-abstinence-is-not-realistic-despite-what-mom-says \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090521, 
        "postID": 54, 
        "quote": "Originally posted by AngelHeart: Sarah doesn't need her help. Bristol is a teenager who thought she fell in love and let the nasty happen with a little POS. She was a naive, innocent girl before she made the god awful mistake......", 
        "reply": " LOL What planet are you living on? You play, you pay; and play she did! Bristol Palin: Abstinence Is 'Not Realistic' +http://gawker.com/5154805/bristol-palin-abstinence-is-not-realistic-despite-what-mom-says \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_4520018322001", 
        "time": "2009-05-21 04:48:00", 
        "title": "Bristol Palin Seems to Regret Having A baby", 
        "userID": "NSNN"
    }, 
    {
        "content": "Why are you pin heads still talking about a kid that made a mistake and is trying to make up for it?", 
        "intTime": 20090521, 
        "postID": 55, 
        "quote": "", 
        "reply": "Why are you pin heads still talking about a kid that made a mistake and is trying to make up for it?", 
        "threadID": "672198221_4520018322001", 
        "time": "2009-05-21 05:07:00", 
        "title": "Bristol Palin Seems to Regret Having A baby", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Duster6: Why are you pin heads still talking about a kid that made a mistake and is trying to make up for it? Probably because these dorks who are critizing her have never done the \"nasty\" before or had to pay for it and are just jealous.", 
        "intTime": 20090521, 
        "postID": 56, 
        "quote": "Originally posted by Duster6: Why are you pin heads still talking about a kid that made a mistake and is trying to make up for it?", 
        "reply": " Probably because these dorks who are critizing her have never done the \"nasty\" before or had to pay for it and are just jealous.", 
        "threadID": "672198221_4520018322001", 
        "time": "2009-05-21 05:25:00", 
        "title": "Bristol Palin Seems to Regret Having A baby", 
        "userID": "NickBrand"
    }, 
    {
        "content": "quote: Originally posted by Duster6: Why are you pin heads still talking about a kid that made a mistake and is trying to make up for it? Getting boozed up (at 17) almost daily and screwing some (random) yahoo is a mistake? No wonder our youth today is so jacked up, with all the free passes we give them...... I don’t feel an iota of pity for her.... \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090521, 
        "postID": 57, 
        "quote": "Originally posted by Duster6: Why are you pin heads still talking about a kid that made a mistake and is trying to make up for it?", 
        "reply": " Getting boozed up (at 17) almost daily and screwing some (random) yahoo is a mistake? No wonder our youth today is so jacked up, with all the free passes we give them...... I don’t feel an iota of pity for her.... \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_4520018322001", 
        "time": "2009-05-21 05:33:00", 
        "title": "Bristol Palin Seems to Regret Having A baby", 
        "userID": "NSNN"
    }
]