[
    {
        "content": "The media, of course, has a narrative that they cannot stop spewing. On Wednesday, 300,000 people (dangerous enough to be suspicious characters to the Department of Homeland Security) gather around America with barely a traffic ticket to show for it. Thursday, the media — undeterred — is continuing their push that this network, this audience and this host might be responsible for violence that might happen. This time, they focused their furious google searches on locating conservative critics of me. Guess what? They're not hard to find. I hack off conservatives just as much as liberals. (Well, maybe not quite as much… but a lot.) Today's Glenn Beck expert: Charles Johnson, a jazz musician, software programmer and writer for the blog \"Little Green Footballs.\" Johnson says: \"I don't know if he's necessarily going to incite violence, but I do think it's irresponsible. It kind of drags down the discourse to a level that I, for one, am not comfortable with.\" As evidence of this lowered discourse, he posted a video that supposedly showed a fan of mine yelling \"burn the books\" at a 9/12 project meeting. Only later, did someone do the two clicks of research that showed she was actually just a liberal there to make fun of the gathering. That's not really the point. There probably are a couple of stupid people at the meetings. There always will be stupid people saying stupid things. There will always be violent people doing violent things. But the insinuation that this network is somehow responsible or approving of anything violent is ludicrous and quite honestly a destructive attempt to silence free speech. That's something blogger Charles Johnson should know about, since he's been called an anti-Muslim bigot by most of the same people that unfairly said the same things about me. We've come to a place where we're not even playing a game of \"blame the messenger,\" it's a game of \"blame the messenger who's specifically saying the opposite message.\" That message — for the one trillionth time — is: If you are considering violence against anyone who isn't a pirate off the coast of Somalia, you are not only wrong, you are an enemy of the state and an enemy of freedom and liberty. The Founding Fathers fought and died for our freedom so that we would have the structure available to achieve change without doing the same. And you know that: 300,000 people peacefully gathered yesterday and honored our founders. That's why today, instead of an honest critique of the spending of Barack Obama, George W Bush and both sides of the aisle in Congress, you're getting non-stop \"tea bag\" jokes and accusations. It's almost like they want to distract you from what's really important. \"http://www.foxnews.com/story/0,2933,516901,00.html\" \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090417, 
        "postID": 1, 
        "quote": "", 
        "reply": "The media, of course, has a narrative that they cannot stop spewing. On Wednesday, 300,000 people (dangerous enough to be suspicious characters to the Department of Homeland Security) gather around America with barely a traffic ticket to show for it. Thursday, the media — undeterred — is continuing their push that this network, this audience and this host might be responsible for violence that might happen. This time, they focused their furious google searches on locating conservative critics of me. Guess what? They're not hard to find. I hack off conservatives just as much as liberals. (Well, maybe not quite as much… but a lot.) Today's Glenn Beck expert: Charles Johnson, a jazz musician, software programmer and writer for the blog \"Little Green Footballs.\" Johnson says: \"I don't know if he's necessarily going to incite violence, but I do think it's irresponsible. It kind of drags down the discourse to a level that I, for one, am not comfortable with.\" As evidence of this lowered discourse, he posted a video that supposedly showed a fan of mine yelling \"burn the books\" at a 9/12 project meeting. Only later, did someone do the two clicks of research that showed she was actually just a liberal there to make fun of the gathering. That's not really the point. There probably are a couple of stupid people at the meetings. There always will be stupid people saying stupid things. There will always be violent people doing violent things. But the insinuation that this network is somehow responsible or approving of anything violent is ludicrous and quite honestly a destructive attempt to silence free speech. That's something blogger Charles Johnson should know about, since he's been called an anti-Muslim bigot by most of the same people that unfairly said the same things about me. We've come to a place where we're not even playing a game of \"blame the messenger,\" it's a game of \"blame the messenger who's specifically saying the opposite message.\" That message — for the one trillionth time — is: If you are considering violence against anyone who isn't a pirate off the coast of Somalia, you are not only wrong, you are an enemy of the state and an enemy of freedom and liberty. The Founding Fathers fought and died for our freedom so that we would have the structure available to achieve change without doing the same. And you know that: 300,000 people peacefully gathered yesterday and honored our founders. That's why today, instead of an honest critique of the spending of Barack Obama, George W Bush and both sides of the aisle in Congress, you're getting non-stop \"tea bag\" jokes and accusations. It's almost like they want to distract you from what's really important. \"http://www.foxnews.com/story/0,2933,516901,00.html\" \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_4650000122001", 
        "time": "2009-04-17 06:30:00", 
        "title": "Glenn Beck sets the record straight", 
        "userID": "Anbar7"
    }, 
    {
        "content": "For those of you that don't watch Beck, he attacks both Left and Right. He is a conservative and tells you so. Last night he blamed Bush and Obama for what we are going through right now and did not only point to one person. He went from Left to Right, Right to Left. Yes, some people on Fox do ony tend to go Right, but Beck doesn't care who you are as he supports conservatisim, but not far right ideologies. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090417, 
        "postID": 2, 
        "quote": "", 
        "reply": "For those of you that don't watch Beck, he attacks both Left and Right. He is a conservative and tells you so. Last night he blamed Bush and Obama for what we are going through right now and did not only point to one person. He went from Left to Right, Right to Left. Yes, some people on Fox do ony tend to go Right, but Beck doesn't care who you are as he supports conservatisim, but not far right ideologies. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_4650000122001", 
        "time": "2009-04-17 06:33:00", 
        "title": "Glenn Beck sets the record straight", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: It's almost like they want to distract you from what's really important. or considers your \"argument\" a complete joke.", 
        "intTime": 20090417, 
        "postID": 3, 
        "quote": "It's almost like they want to distract you from what's really important.", 
        "reply": " or considers your \"argument\" a complete joke.", 
        "threadID": "672198221_4650000122001", 
        "time": "2009-04-17 06:38:00", 
        "title": "Glenn Beck sets the record straight", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: That message — for the one trillionth time — is: If you are considering violence against anyone who isn't a pirate off the coast of Somalia, you are not only wrong, you are an enemy of the state and an enemy of freedom and liberty. What a stupid statement.", 
        "intTime": 20090417, 
        "postID": 4, 
        "quote": "Originally posted by Anbar7: That message — for the one trillionth time — is: If you are considering violence against anyone who isn't a pirate off the coast of Somalia, you are not only wrong, you are an enemy of the state and an enemy of freedom and liberty.", 
        "reply": " What a stupid statement.", 
        "threadID": "672198221_4650000122001", 
        "time": "2009-04-17 06:46:00", 
        "title": "Glenn Beck sets the record straight", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: It's almost like they want to distract you from what's really important. or considers your \"argument\" a complete joke. Since when is it the news media's job to determine if the message is significant or not? Aren't they supposed to report THE NEWS? If 300,000 democrats took part in a nationwide protest of President Bush's policies it would be the lead story on every news station. I will argue that if the news media did their job in a more unbiased manner, the \"TEA parties\" would not have even been necessary.", 
        "intTime": 20090417, 
        "postID": 5, 
        "quote": "Originally posted by karlhungusjr: quote: It's almost like they want to distract you from what's really important. or considers your \"argument\" a complete joke.", 
        "reply": " Since when is it the news media's job to determine if the message is significant or not? Aren't they supposed to report THE NEWS? If 300,000 democrats took part in a nationwide protest of President Bush's policies it would be the lead story on every news station. I will argue that if the news media did their job in a more unbiased manner, the \"TEA parties\" would not have even been necessary.", 
        "threadID": "672198221_4650000122001", 
        "time": "2009-04-17 06:47:00", 
        "title": "Glenn Beck sets the record straight", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Since when is it the news media's job to determine if the message is significant or not? Aren't they supposed to report THE NEWS? they sure are. \"report\". Not \"promote\". not provide P.R. quote: If 300,000 democrats took part in a nationwide protest of President Bush's policies it would be the lead story on every news station. wait...I was told this has nothing to do with Obama. its about taxes and thats it. so which is it? [quote]I will argue that if the news media did their job in a more unbiased manner, the \"TEA parties\" would not have even been necessary./quote] I would argue that the media DID report on the teabaggers. The problem is that guys like Beck are upset that no one really cares. JUST like no one cares about anti-war protesters. actually...no one cares about protesters in general. you all made your case. It's not censorship or a \"distraction\" when you made it very very poorly and people don't buy it.", 
        "intTime": 20090417, 
        "postID": 6, 
        "quote": "Since when is it the news media's job to determine if the message is significant or not? Aren't they supposed to report THE NEWS?", 
        "reply": " they sure are. \"report\". Not \"promote\". not provide P.R. quote: If 300,000 democrats took part in a nationwide protest of President Bush's policies it would be the lead story on every news station. wait...I was told this has nothing to do with Obama. its about taxes and thats it. so which is it? [quote]I will argue that if the news media did their job in a more unbiased manner, the \"TEA parties\" would not have even been necessary./quote] I would argue that the media DID report on the teabaggers. The problem is that guys like Beck are upset that no one really cares. JUST like no one cares about anti-war protesters. actually...no one cares about protesters in general. you all made your case. It's not censorship or a \"distraction\" when you made it very very poorly and people don't buy it.", 
        "threadID": "672198221_4650000122001", 
        "time": "2009-04-17 06:54:00", 
        "title": "Glenn Beck sets the record straight", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by Anbar7: That message — for the one trillionth time — is: If you are considering violence against anyone who isn't a pirate off the coast of Somalia, you are not only wrong, you are an enemy of the state and an enemy of freedom and liberty. What a stupid statement. So him saying that considering violence against the US is an enemy of the state, but you think that is stupid? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090417, 
        "postID": 7, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by Anbar7: That message — for the one trillionth time — is: If you are considering violence against anyone who isn't a pirate off the coast of Somalia, you are not only wrong, you are an enemy of the state and an enemy of freedom and liberty. What a stupid statement.", 
        "reply": " So him saying that considering violence against the US is an enemy of the state, but you think that is stupid? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_4650000122001", 
        "time": "2009-04-17 07:03:00", 
        "title": "Glenn Beck sets the record straight", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: So him saying that considering violence against the US is an enemy of the state, but you think that is stupid? um...no. you're being just a tad bit obtuse. the \"message\" of the so called teabaggers.", 
        "intTime": 20090417, 
        "postID": 8, 
        "quote": "So him saying that considering violence against the US is an enemy of the state, but you think that is stupid?", 
        "reply": " um...no. you're being just a tad bit obtuse. the \"message\" of the so called teabaggers.", 
        "threadID": "672198221_4650000122001", 
        "time": "2009-04-17 07:07:00", 
        "title": "Glenn Beck sets the record straight", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "my mistake Anbar7. for some reason I thought that was directed at me. sorry.", 
        "intTime": 20090417, 
        "postID": 9, 
        "quote": "", 
        "reply": "my mistake Anbar7. for some reason I thought that was directed at me. sorry.", 
        "threadID": "672198221_4650000122001", 
        "time": "2009-04-17 07:09:00", 
        "title": "Glenn Beck sets the record straight", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by Anbar7: That message — for the one trillionth time — is: If you are considering violence against anyone who isn't a pirate off the coast of Somalia, you are not only wrong, you are an enemy of the state and an enemy of freedom and liberty. What a stupid statement. So your advocating Mob Violence against fellow Americans who dont share the same political Beliefs as yourself? or your adovcating Mob Violence against our current elected leaders? Which is it?", 
        "intTime": 20090417, 
        "postID": 10, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by Anbar7: That message — for the one trillionth time — is: If you are considering violence against anyone who isn't a pirate off the coast of Somalia, you are not only wrong, you are an enemy of the state and an enemy of freedom and liberty. What a stupid statement.", 
        "reply": " So your advocating Mob Violence against fellow Americans who dont share the same political Beliefs as yourself? or your adovcating Mob Violence against our current elected leaders? Which is it?", 
        "threadID": "672198221_4650000122001", 
        "time": "2009-04-17 07:40:00", 
        "title": "Glenn Beck sets the record straight", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: [QUOTE]Since when is it the news media's job to determine if the message is significant or not? Aren't they supposed to report THE NEWS? they sure are. \"report\". Not \"promote\". not provide P.R. quote: If 300,000 democrats took part in a nationwide protest of President Bush's policies it would be the lead story on every news station. wait...I was told this has nothing to do with Obama. its about taxes and thats it. so which is it? quote: I will argue that if the news media did their job in a more unbiased manner, the \"TEA parties\" would not have even been necessary./quote] I would argue that the media DID report on the teabaggers. The problem is that guys like Beck are upset that no one really cares. JUST like no one cares about anti-war protesters. actually...no one cares about protesters in general. you all made your case. It's not censorship or a \"distraction\" when you made it very very poorly and people don't buy it. The TEA Parties weren't about Obama. They were in protest of high taxes and even higher government spending. I only mention President Bush because I can't think of many other things that Liberals protest about in those types of numbers. As far as making our case poorly goes, you are probably right. Perhaps our point could have been made more clearly if we had utilized the Liberal protest playbook. Breaking shop windows, slashing tires, vandalizing police cars, blocking traffic, and throwing red paint on things would have drawn much more attention. I think our point was made in how peaceful our protests were. How many arrests did you hear about from the TEA Parties? How much violence was reported? Liberals talk about peace, unity, and acceptance. That is, unless it involves people with political views different than their own. There is nothing more scary than a \"peaceful\" liberal protest. Just look at the G20 summit and Republican National Convention protests if you need an example.", 
        "intTime": 20090417, 
        "postID": 11, 
        "quote": "Originally posted by karlhungusjr: [QUOTE]Since when is it the news media's job to determine if the message is significant or not? Aren't they supposed to report THE NEWS?", 
        "reply": " they sure are. \"report\". Not \"promote\". not provide P.R. quote: If 300,000 democrats took part in a nationwide protest of President Bush's policies it would be the lead story on every news station. wait...I was told this has nothing to do with Obama. its about taxes and thats it. so which is it? quote: I will argue that if the news media did their job in a more unbiased manner, the \"TEA parties\" would not have even been necessary./quote] I would argue that the media DID report on the teabaggers. The problem is that guys like Beck are upset that no one really cares. JUST like no one cares about anti-war protesters. actually...no one cares about protesters in general. you all made your case. It's not censorship or a \"distraction\" when you made it very very poorly and people don't buy it. The TEA Parties weren't about Obama. They were in protest of high taxes and even higher government spending. I only mention President Bush because I can't think of many other things that Liberals protest about in those types of numbers. As far as making our case poorly goes, you are probably right. Perhaps our point could have been made more clearly if we had utilized the Liberal protest playbook. Breaking shop windows, slashing tires, vandalizing police cars, blocking traffic, and throwing red paint on things would have drawn much more attention. I think our point was made in how peaceful our protests were. How many arrests did you hear about from the TEA Parties? How much violence was reported? Liberals talk about peace, unity, and acceptance. That is, unless it involves people with political views different than their own. There is nothing more scary than a \"peaceful\" liberal protest. Just look at the G20 summit and Republican National Convention protests if you need an example.", 
        "threadID": "672198221_4650000122001", 
        "time": "2009-04-17 08:34:00", 
        "title": "Glenn Beck sets the record straight", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by Anbar7: That message — for the one trillionth time — is: If you are considering violence against anyone who isn't a pirate off the coast of Somalia, you are not only wrong, you are an enemy of the state and an enemy of freedom and liberty. What a stupid statement. Only because you don't understand or have difficulty comprehending what he is saying. That government education of yours is doing wonders... \"The World's Finest\"", 
        "intTime": 20090417, 
        "postID": 12, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by Anbar7: That message — for the one trillionth time — is: If you are considering violence against anyone who isn't a pirate off the coast of Somalia, you are not only wrong, you are an enemy of the state and an enemy of freedom and liberty. What a stupid statement.", 
        "reply": " Only because you don't understand or have difficulty comprehending what he is saying. That government education of yours is doing wonders... \"The World's Finest\"", 
        "threadID": "672198221_4650000122001", 
        "time": "2009-04-17 08:40:00", 
        "title": "Glenn Beck sets the record straight", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: The TEA Parties weren't about Obama. They were in protest of high taxes and even higher government spending. as has been stated over and over again...most of the people at those protest will see a tax CUT. and even those 5% that will see a tax increase will only have their taxes returned to what they were 8 years ago, and they will STILL be lower than what they were under Reagan. and the \"higher government spending\" rings hollow since no one complained during reagen, bush I and BushII's terms about them not even submitting balanced budget let alone aproving one.", 
        "intTime": 20090417, 
        "postID": 13, 
        "quote": "The TEA Parties weren't about Obama. They were in protest of high taxes and even higher government spending.", 
        "reply": " as has been stated over and over again...most of the people at those protest will see a tax CUT. and even those 5% that will see a tax increase will only have their taxes returned to what they were 8 years ago, and they will STILL be lower than what they were under Reagan. and the \"higher government spending\" rings hollow since no one complained during reagen, bush I and BushII's terms about them not even submitting balanced budget let alone aproving one.", 
        "threadID": "672198221_4650000122001", 
        "time": "2009-04-17 08:41:00", 
        "title": "Glenn Beck sets the record straight", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by stec74: Liberals talk about peace, unity, and acceptance. That is, unless it involves people with political views different than their own. There is nothing more scary than a \"peaceful\" liberal protest. Just look at the G20 summit and Republican National Convention protests if you need an example. I wasn't aware that the Police have broken up any of these demonstations, as was done at both the Republican and G20 sites. True, there were a handful of self described Anarchists who provided the pretext for breaking these demonstrations up - But I would hardly call these Anarchists \"Liberals.\" In fact, only by stretching defintions are they even members of the left. Dave", 
        "intTime": 20090417, 
        "postID": 14, 
        "quote": "Originally posted by stec74: Liberals talk about peace, unity, and acceptance. That is, unless it involves people with political views different than their own. There is nothing more scary than a \"peaceful\" liberal protest. Just look at the G20 summit and Republican National Convention protests if you need an example.", 
        "reply": " I wasn't aware that the Police have broken up any of these demonstations, as was done at both the Republican and G20 sites. True, there were a handful of self described Anarchists who provided the pretext for breaking these demonstrations up - But I would hardly call these Anarchists \"Liberals.\" In fact, only by stretching defintions are they even members of the left. Dave", 
        "threadID": "672198221_4650000122001", 
        "time": "2009-04-17 08:42:00", 
        "title": "Glenn Beck sets the record straight", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: But I would hardly call these Anarchists \"Liberals.\" In fact, only by stretching defintions are they even members of the left. that's why I just ignored it. beating up strawmen gets old.", 
        "intTime": 20090417, 
        "postID": 15, 
        "quote": "But I would hardly call these Anarchists \"Liberals.\" In fact, only by stretching defintions are they even members of the left.", 
        "reply": " that's why I just ignored it. beating up strawmen gets old.", 
        "threadID": "672198221_4650000122001", 
        "time": "2009-04-17 08:50:00", 
        "title": "Glenn Beck sets the record straight", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "Anyone who ever went to college and took a course in Social Studies should know the the real problem on this planet is women. Women can't and won't stop having babies. Planet earth is producing more and more people each year while less and less food and space is being provided. We have two choices. Stop having babies or start Nuking certain countries.", 
        "intTime": 20090417, 
        "postID": 16, 
        "quote": "", 
        "reply": "Anyone who ever went to college and took a course in Social Studies should know the the real problem on this planet is women. Women can't and won't stop having babies. Planet earth is producing more and more people each year while less and less food and space is being provided. We have two choices. Stop having babies or start Nuking certain countries.", 
        "threadID": "672198221_4650000122001", 
        "time": "2009-04-17 10:09:00", 
        "title": "Glenn Beck sets the record straight", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Duster6: Anyone who ever went to college and took a course in Social Studies should know the the real problem on this planet is women. Women can't and won't stop having babies. Planet earth is producing more and more people each year while less and less food and space is being provided. We have two choices. Stop having babies or start Nuking certain countries. Or we could stop destroying farm land..just a suggestion. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090417, 
        "postID": 17, 
        "quote": "Originally posted by Duster6: Anyone who ever went to college and took a course in Social Studies should know the the real problem on this planet is women. Women can't and won't stop having babies. Planet earth is producing more and more people each year while less and less food and space is being provided. We have two choices. Stop having babies or start Nuking certain countries.", 
        "reply": " Or we could stop destroying farm land..just a suggestion. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_4650000122001", 
        "time": "2009-04-17 10:13:00", 
        "title": "Glenn Beck sets the record straight", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: But I would hardly call these Anarchists \"Liberals.\" In fact, only by stretching defintions are they even members of the left. actually they are very liberal people... they are in fact more liberal then most here...", 
        "intTime": 20090417, 
        "postID": 18, 
        "quote": "But I would hardly call these Anarchists \"Liberals.\" In fact, only by stretching defintions are they even members of the left.", 
        "reply": " actually they are very liberal people... they are in fact more liberal then most here...", 
        "threadID": "672198221_4650000122001", 
        "time": "2009-04-17 10:14:00", 
        "title": "Glenn Beck sets the record straight", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: For those of you that don't watch Beck, he attacks both Left and Right. He is a conservative and tells you so. Last night he blamed Bush and Obama for what we are going through right now and did not only point to one person. He went from Left to Right, Right to Left. Yes, some people on Fox do ony tend to go Right, but Beck doesn't care who you are as he supports conservatisim, but not far right ideologies. I've noticed that whenever he goes after a Repub he almost always also blames a Demo but whenever he goes after a Demo he rarely mentions a Repub. even when the situations are similar.", 
        "intTime": 20090417, 
        "postID": 19, 
        "quote": "Originally posted by Anbar7: For those of you that don't watch Beck, he attacks both Left and Right. He is a conservative and tells you so. Last night he blamed Bush and Obama for what we are going through right now and did not only point to one person. He went from Left to Right, Right to Left. Yes, some people on Fox do ony tend to go Right, but Beck doesn't care who you are as he supports conservatisim, but not far right ideologies.", 
        "reply": " I've noticed that whenever he goes after a Repub he almost always also blames a Demo but whenever he goes after a Demo he rarely mentions a Repub. even when the situations are similar.", 
        "threadID": "672198221_4650000122001", 
        "time": "2009-04-17 10:18:00", 
        "title": "Glenn Beck sets the record straight", 
        "userID": "rayld2"
    }, 
    {
        "content": "in fact not only are they liberal but they are hired by liberals to create problems at protests.... i know been there done it... it is very common at all protest to have the anarchist around to start problems... we were hired by liberals in jan 91 in Atlanta to throw bottles of oil at the federal building... they wanted us to take it up a notch.... and we did started a riot.... and what given $25 each...", 
        "intTime": 20090417, 
        "postID": 20, 
        "quote": "", 
        "reply": "in fact not only are they liberal but they are hired by liberals to create problems at protests.... i know been there done it... it is very common at all protest to have the anarchist around to start problems... we were hired by liberals in jan 91 in Atlanta to throw bottles of oil at the federal building... they wanted us to take it up a notch.... and we did started a riot.... and what given $25 each...", 
        "threadID": "672198221_4650000122001", 
        "time": "2009-04-17 10:19:00", 
        "title": "Glenn Beck sets the record straight", 
        "userID": "outlaws93"
    }, 
    {
        "content": "The media, of course, has a narrative that they cannot stop spewing. On Wednesday, 300,000 people (dangerous enough to be suspicious characters to the Department of Homeland Security) gather around America with barely a traffic ticket to show for it. Thursday, the media — undeterred — is continuing their push that this network, this audience and this host might be responsible for violence that might happen. This time, they focused their furious google searches on locating conservative critics of me. Guess what? They're not hard to find. I hack off conservatives just as much as liberals. (Well, maybe not quite as much… but a lot.) Today's Glenn Beck expert: Charles Johnson, a jazz musician, software programmer and writer for the blog \"Little Green Footballs.\" Johnson says: \"I don't know if he's necessarily going to incite violence, but I do think it's irresponsible. It kind of drags down the discourse to a level that I, for one, am not comfortable with.\" As evidence of this lowered discourse, he posted a video that supposedly showed a fan of mine yelling \"burn the books\" at a 9/12 project meeting. Only later, did someone do the two clicks of research that showed she was actually just a liberal there to make fun of the gathering. That's not really the point. There probably are a couple of stupid people at the meetings. There always will be stupid people saying stupid things. There will always be violent people doing violent things. But the insinuation that this network is somehow responsible or approving of anything violent is ludicrous and quite honestly a destructive attempt to silence free speech. That's something blogger Charles Johnson should know about, since he's been called an anti-Muslim bigot by most of the same people that unfairly said the same things about me. We've come to a place where we're not even playing a game of \"blame the messenger,\" it's a game of \"blame the messenger who's specifically saying the opposite message.\" That message — for the one trillionth time — is: If you are considering violence against anyone who isn't a pirate off the coast of Somalia, you are not only wrong, you are an enemy of the state and an enemy of freedom and liberty. The Founding Fathers fought and died for our freedom so that we would have the structure available to achieve change without doing the same. And you know that: 300,000 people peacefully gathered yesterday and honored our founders. That's why today, instead of an honest critique of the spending of Barack Obama, George W Bush and both sides of the aisle in Congress, you're getting non-stop \"tea bag\" jokes and accusations. It's almost like they want to distract you from what's really important. \"http://www.foxnews.com/story/0,2933,516901,00.html\" \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090417, 
        "postID": 21, 
        "quote": "", 
        "reply": "The media, of course, has a narrative that they cannot stop spewing. On Wednesday, 300,000 people (dangerous enough to be suspicious characters to the Department of Homeland Security) gather around America with barely a traffic ticket to show for it. Thursday, the media — undeterred — is continuing their push that this network, this audience and this host might be responsible for violence that might happen. This time, they focused their furious google searches on locating conservative critics of me. Guess what? They're not hard to find. I hack off conservatives just as much as liberals. (Well, maybe not quite as much… but a lot.) Today's Glenn Beck expert: Charles Johnson, a jazz musician, software programmer and writer for the blog \"Little Green Footballs.\" Johnson says: \"I don't know if he's necessarily going to incite violence, but I do think it's irresponsible. It kind of drags down the discourse to a level that I, for one, am not comfortable with.\" As evidence of this lowered discourse, he posted a video that supposedly showed a fan of mine yelling \"burn the books\" at a 9/12 project meeting. Only later, did someone do the two clicks of research that showed she was actually just a liberal there to make fun of the gathering. That's not really the point. There probably are a couple of stupid people at the meetings. There always will be stupid people saying stupid things. There will always be violent people doing violent things. But the insinuation that this network is somehow responsible or approving of anything violent is ludicrous and quite honestly a destructive attempt to silence free speech. That's something blogger Charles Johnson should know about, since he's been called an anti-Muslim bigot by most of the same people that unfairly said the same things about me. We've come to a place where we're not even playing a game of \"blame the messenger,\" it's a game of \"blame the messenger who's specifically saying the opposite message.\" That message — for the one trillionth time — is: If you are considering violence against anyone who isn't a pirate off the coast of Somalia, you are not only wrong, you are an enemy of the state and an enemy of freedom and liberty. The Founding Fathers fought and died for our freedom so that we would have the structure available to achieve change without doing the same. And you know that: 300,000 people peacefully gathered yesterday and honored our founders. That's why today, instead of an honest critique of the spending of Barack Obama, George W Bush and both sides of the aisle in Congress, you're getting non-stop \"tea bag\" jokes and accusations. It's almost like they want to distract you from what's really important. \"http://www.foxnews.com/story/0,2933,516901,00.html\" \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_4650000122001", 
        "time": "2009-04-17 06:30:00", 
        "title": "Glenn Beck sets the record straight", 
        "userID": "Anbar7"
    }, 
    {
        "content": "For those of you that don't watch Beck, he attacks both Left and Right. He is a conservative and tells you so. Last night he blamed Bush and Obama for what we are going through right now and did not only point to one person. He went from Left to Right, Right to Left. Yes, some people on Fox do ony tend to go Right, but Beck doesn't care who you are as he supports conservatisim, but not far right ideologies. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090417, 
        "postID": 22, 
        "quote": "", 
        "reply": "For those of you that don't watch Beck, he attacks both Left and Right. He is a conservative and tells you so. Last night he blamed Bush and Obama for what we are going through right now and did not only point to one person. He went from Left to Right, Right to Left. Yes, some people on Fox do ony tend to go Right, but Beck doesn't care who you are as he supports conservatisim, but not far right ideologies. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_4650000122001", 
        "time": "2009-04-17 06:33:00", 
        "title": "Glenn Beck sets the record straight", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: It's almost like they want to distract you from what's really important. or considers your \"argument\" a complete joke.", 
        "intTime": 20090417, 
        "postID": 23, 
        "quote": "It's almost like they want to distract you from what's really important.", 
        "reply": " or considers your \"argument\" a complete joke.", 
        "threadID": "672198221_4650000122001", 
        "time": "2009-04-17 06:38:00", 
        "title": "Glenn Beck sets the record straight", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: That message — for the one trillionth time — is: If you are considering violence against anyone who isn't a pirate off the coast of Somalia, you are not only wrong, you are an enemy of the state and an enemy of freedom and liberty. What a stupid statement.", 
        "intTime": 20090417, 
        "postID": 24, 
        "quote": "Originally posted by Anbar7: That message — for the one trillionth time — is: If you are considering violence against anyone who isn't a pirate off the coast of Somalia, you are not only wrong, you are an enemy of the state and an enemy of freedom and liberty.", 
        "reply": " What a stupid statement.", 
        "threadID": "672198221_4650000122001", 
        "time": "2009-04-17 06:46:00", 
        "title": "Glenn Beck sets the record straight", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: It's almost like they want to distract you from what's really important. or considers your \"argument\" a complete joke. Since when is it the news media's job to determine if the message is significant or not? Aren't they supposed to report THE NEWS? If 300,000 democrats took part in a nationwide protest of President Bush's policies it would be the lead story on every news station. I will argue that if the news media did their job in a more unbiased manner, the \"TEA parties\" would not have even been necessary.", 
        "intTime": 20090417, 
        "postID": 25, 
        "quote": "Originally posted by karlhungusjr: quote: It's almost like they want to distract you from what's really important. or considers your \"argument\" a complete joke.", 
        "reply": " Since when is it the news media's job to determine if the message is significant or not? Aren't they supposed to report THE NEWS? If 300,000 democrats took part in a nationwide protest of President Bush's policies it would be the lead story on every news station. I will argue that if the news media did their job in a more unbiased manner, the \"TEA parties\" would not have even been necessary.", 
        "threadID": "672198221_4650000122001", 
        "time": "2009-04-17 06:47:00", 
        "title": "Glenn Beck sets the record straight", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Since when is it the news media's job to determine if the message is significant or not? Aren't they supposed to report THE NEWS? they sure are. \"report\". Not \"promote\". not provide P.R. quote: If 300,000 democrats took part in a nationwide protest of President Bush's policies it would be the lead story on every news station. wait...I was told this has nothing to do with Obama. its about taxes and thats it. so which is it? [quote]I will argue that if the news media did their job in a more unbiased manner, the \"TEA parties\" would not have even been necessary./quote] I would argue that the media DID report on the teabaggers. The problem is that guys like Beck are upset that no one really cares. JUST like no one cares about anti-war protesters. actually...no one cares about protesters in general. you all made your case. It's not censorship or a \"distraction\" when you made it very very poorly and people don't buy it.", 
        "intTime": 20090417, 
        "postID": 26, 
        "quote": "Since when is it the news media's job to determine if the message is significant or not? Aren't they supposed to report THE NEWS?", 
        "reply": " they sure are. \"report\". Not \"promote\". not provide P.R. quote: If 300,000 democrats took part in a nationwide protest of President Bush's policies it would be the lead story on every news station. wait...I was told this has nothing to do with Obama. its about taxes and thats it. so which is it? [quote]I will argue that if the news media did their job in a more unbiased manner, the \"TEA parties\" would not have even been necessary./quote] I would argue that the media DID report on the teabaggers. The problem is that guys like Beck are upset that no one really cares. JUST like no one cares about anti-war protesters. actually...no one cares about protesters in general. you all made your case. It's not censorship or a \"distraction\" when you made it very very poorly and people don't buy it.", 
        "threadID": "672198221_4650000122001", 
        "time": "2009-04-17 06:54:00", 
        "title": "Glenn Beck sets the record straight", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by Anbar7: That message — for the one trillionth time — is: If you are considering violence against anyone who isn't a pirate off the coast of Somalia, you are not only wrong, you are an enemy of the state and an enemy of freedom and liberty. What a stupid statement. So him saying that considering violence against the US is an enemy of the state, but you think that is stupid? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090417, 
        "postID": 27, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by Anbar7: That message — for the one trillionth time — is: If you are considering violence against anyone who isn't a pirate off the coast of Somalia, you are not only wrong, you are an enemy of the state and an enemy of freedom and liberty. What a stupid statement.", 
        "reply": " So him saying that considering violence against the US is an enemy of the state, but you think that is stupid? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_4650000122001", 
        "time": "2009-04-17 07:03:00", 
        "title": "Glenn Beck sets the record straight", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: So him saying that considering violence against the US is an enemy of the state, but you think that is stupid? um...no. you're being just a tad bit obtuse. the \"message\" of the so called teabaggers.", 
        "intTime": 20090417, 
        "postID": 28, 
        "quote": "So him saying that considering violence against the US is an enemy of the state, but you think that is stupid?", 
        "reply": " um...no. you're being just a tad bit obtuse. the \"message\" of the so called teabaggers.", 
        "threadID": "672198221_4650000122001", 
        "time": "2009-04-17 07:07:00", 
        "title": "Glenn Beck sets the record straight", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "my mistake Anbar7. for some reason I thought that was directed at me. sorry.", 
        "intTime": 20090417, 
        "postID": 29, 
        "quote": "", 
        "reply": "my mistake Anbar7. for some reason I thought that was directed at me. sorry.", 
        "threadID": "672198221_4650000122001", 
        "time": "2009-04-17 07:09:00", 
        "title": "Glenn Beck sets the record straight", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by Anbar7: That message — for the one trillionth time — is: If you are considering violence against anyone who isn't a pirate off the coast of Somalia, you are not only wrong, you are an enemy of the state and an enemy of freedom and liberty. What a stupid statement. So your advocating Mob Violence against fellow Americans who dont share the same political Beliefs as yourself? or your adovcating Mob Violence against our current elected leaders? Which is it?", 
        "intTime": 20090417, 
        "postID": 30, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by Anbar7: That message — for the one trillionth time — is: If you are considering violence against anyone who isn't a pirate off the coast of Somalia, you are not only wrong, you are an enemy of the state and an enemy of freedom and liberty. What a stupid statement.", 
        "reply": " So your advocating Mob Violence against fellow Americans who dont share the same political Beliefs as yourself? or your adovcating Mob Violence against our current elected leaders? Which is it?", 
        "threadID": "672198221_4650000122001", 
        "time": "2009-04-17 07:40:00", 
        "title": "Glenn Beck sets the record straight", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: [QUOTE]Since when is it the news media's job to determine if the message is significant or not? Aren't they supposed to report THE NEWS? they sure are. \"report\". Not \"promote\". not provide P.R. quote: If 300,000 democrats took part in a nationwide protest of President Bush's policies it would be the lead story on every news station. wait...I was told this has nothing to do with Obama. its about taxes and thats it. so which is it? quote: I will argue that if the news media did their job in a more unbiased manner, the \"TEA parties\" would not have even been necessary./quote] I would argue that the media DID report on the teabaggers. The problem is that guys like Beck are upset that no one really cares. JUST like no one cares about anti-war protesters. actually...no one cares about protesters in general. you all made your case. It's not censorship or a \"distraction\" when you made it very very poorly and people don't buy it. The TEA Parties weren't about Obama. They were in protest of high taxes and even higher government spending. I only mention President Bush because I can't think of many other things that Liberals protest about in those types of numbers. As far as making our case poorly goes, you are probably right. Perhaps our point could have been made more clearly if we had utilized the Liberal protest playbook. Breaking shop windows, slashing tires, vandalizing police cars, blocking traffic, and throwing red paint on things would have drawn much more attention. I think our point was made in how peaceful our protests were. How many arrests did you hear about from the TEA Parties? How much violence was reported? Liberals talk about peace, unity, and acceptance. That is, unless it involves people with political views different than their own. There is nothing more scary than a \"peaceful\" liberal protest. Just look at the G20 summit and Republican National Convention protests if you need an example.", 
        "intTime": 20090417, 
        "postID": 31, 
        "quote": "Originally posted by karlhungusjr: [QUOTE]Since when is it the news media's job to determine if the message is significant or not? Aren't they supposed to report THE NEWS?", 
        "reply": " they sure are. \"report\". Not \"promote\". not provide P.R. quote: If 300,000 democrats took part in a nationwide protest of President Bush's policies it would be the lead story on every news station. wait...I was told this has nothing to do with Obama. its about taxes and thats it. so which is it? quote: I will argue that if the news media did their job in a more unbiased manner, the \"TEA parties\" would not have even been necessary./quote] I would argue that the media DID report on the teabaggers. The problem is that guys like Beck are upset that no one really cares. JUST like no one cares about anti-war protesters. actually...no one cares about protesters in general. you all made your case. It's not censorship or a \"distraction\" when you made it very very poorly and people don't buy it. The TEA Parties weren't about Obama. They were in protest of high taxes and even higher government spending. I only mention President Bush because I can't think of many other things that Liberals protest about in those types of numbers. As far as making our case poorly goes, you are probably right. Perhaps our point could have been made more clearly if we had utilized the Liberal protest playbook. Breaking shop windows, slashing tires, vandalizing police cars, blocking traffic, and throwing red paint on things would have drawn much more attention. I think our point was made in how peaceful our protests were. How many arrests did you hear about from the TEA Parties? How much violence was reported? Liberals talk about peace, unity, and acceptance. That is, unless it involves people with political views different than their own. There is nothing more scary than a \"peaceful\" liberal protest. Just look at the G20 summit and Republican National Convention protests if you need an example.", 
        "threadID": "672198221_4650000122001", 
        "time": "2009-04-17 08:34:00", 
        "title": "Glenn Beck sets the record straight", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by Anbar7: That message — for the one trillionth time — is: If you are considering violence against anyone who isn't a pirate off the coast of Somalia, you are not only wrong, you are an enemy of the state and an enemy of freedom and liberty. What a stupid statement. Only because you don't understand or have difficulty comprehending what he is saying. That government education of yours is doing wonders... \"The World's Finest\"", 
        "intTime": 20090417, 
        "postID": 32, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by Anbar7: That message — for the one trillionth time — is: If you are considering violence against anyone who isn't a pirate off the coast of Somalia, you are not only wrong, you are an enemy of the state and an enemy of freedom and liberty. What a stupid statement.", 
        "reply": " Only because you don't understand or have difficulty comprehending what he is saying. That government education of yours is doing wonders... \"The World's Finest\"", 
        "threadID": "672198221_4650000122001", 
        "time": "2009-04-17 08:40:00", 
        "title": "Glenn Beck sets the record straight", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: The TEA Parties weren't about Obama. They were in protest of high taxes and even higher government spending. as has been stated over and over again...most of the people at those protest will see a tax CUT. and even those 5% that will see a tax increase will only have their taxes returned to what they were 8 years ago, and they will STILL be lower than what they were under Reagan. and the \"higher government spending\" rings hollow since no one complained during reagen, bush I and BushII's terms about them not even submitting balanced budget let alone aproving one.", 
        "intTime": 20090417, 
        "postID": 33, 
        "quote": "The TEA Parties weren't about Obama. They were in protest of high taxes and even higher government spending.", 
        "reply": " as has been stated over and over again...most of the people at those protest will see a tax CUT. and even those 5% that will see a tax increase will only have their taxes returned to what they were 8 years ago, and they will STILL be lower than what they were under Reagan. and the \"higher government spending\" rings hollow since no one complained during reagen, bush I and BushII's terms about them not even submitting balanced budget let alone aproving one.", 
        "threadID": "672198221_4650000122001", 
        "time": "2009-04-17 08:41:00", 
        "title": "Glenn Beck sets the record straight", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by stec74: Liberals talk about peace, unity, and acceptance. That is, unless it involves people with political views different than their own. There is nothing more scary than a \"peaceful\" liberal protest. Just look at the G20 summit and Republican National Convention protests if you need an example. I wasn't aware that the Police have broken up any of these demonstations, as was done at both the Republican and G20 sites. True, there were a handful of self described Anarchists who provided the pretext for breaking these demonstrations up - But I would hardly call these Anarchists \"Liberals.\" In fact, only by stretching defintions are they even members of the left. Dave", 
        "intTime": 20090417, 
        "postID": 34, 
        "quote": "Originally posted by stec74: Liberals talk about peace, unity, and acceptance. That is, unless it involves people with political views different than their own. There is nothing more scary than a \"peaceful\" liberal protest. Just look at the G20 summit and Republican National Convention protests if you need an example.", 
        "reply": " I wasn't aware that the Police have broken up any of these demonstations, as was done at both the Republican and G20 sites. True, there were a handful of self described Anarchists who provided the pretext for breaking these demonstrations up - But I would hardly call these Anarchists \"Liberals.\" In fact, only by stretching defintions are they even members of the left. Dave", 
        "threadID": "672198221_4650000122001", 
        "time": "2009-04-17 08:42:00", 
        "title": "Glenn Beck sets the record straight", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: But I would hardly call these Anarchists \"Liberals.\" In fact, only by stretching defintions are they even members of the left. that's why I just ignored it. beating up strawmen gets old.", 
        "intTime": 20090417, 
        "postID": 35, 
        "quote": "But I would hardly call these Anarchists \"Liberals.\" In fact, only by stretching defintions are they even members of the left.", 
        "reply": " that's why I just ignored it. beating up strawmen gets old.", 
        "threadID": "672198221_4650000122001", 
        "time": "2009-04-17 08:50:00", 
        "title": "Glenn Beck sets the record straight", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "Anyone who ever went to college and took a course in Social Studies should know the the real problem on this planet is women. Women can't and won't stop having babies. Planet earth is producing more and more people each year while less and less food and space is being provided. We have two choices. Stop having babies or start Nuking certain countries.", 
        "intTime": 20090417, 
        "postID": 36, 
        "quote": "", 
        "reply": "Anyone who ever went to college and took a course in Social Studies should know the the real problem on this planet is women. Women can't and won't stop having babies. Planet earth is producing more and more people each year while less and less food and space is being provided. We have two choices. Stop having babies or start Nuking certain countries.", 
        "threadID": "672198221_4650000122001", 
        "time": "2009-04-17 10:09:00", 
        "title": "Glenn Beck sets the record straight", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Duster6: Anyone who ever went to college and took a course in Social Studies should know the the real problem on this planet is women. Women can't and won't stop having babies. Planet earth is producing more and more people each year while less and less food and space is being provided. We have two choices. Stop having babies or start Nuking certain countries. Or we could stop destroying farm land..just a suggestion. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090417, 
        "postID": 37, 
        "quote": "Originally posted by Duster6: Anyone who ever went to college and took a course in Social Studies should know the the real problem on this planet is women. Women can't and won't stop having babies. Planet earth is producing more and more people each year while less and less food and space is being provided. We have two choices. Stop having babies or start Nuking certain countries.", 
        "reply": " Or we could stop destroying farm land..just a suggestion. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_4650000122001", 
        "time": "2009-04-17 10:13:00", 
        "title": "Glenn Beck sets the record straight", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: But I would hardly call these Anarchists \"Liberals.\" In fact, only by stretching defintions are they even members of the left. actually they are very liberal people... they are in fact more liberal then most here...", 
        "intTime": 20090417, 
        "postID": 38, 
        "quote": "But I would hardly call these Anarchists \"Liberals.\" In fact, only by stretching defintions are they even members of the left.", 
        "reply": " actually they are very liberal people... they are in fact more liberal then most here...", 
        "threadID": "672198221_4650000122001", 
        "time": "2009-04-17 10:14:00", 
        "title": "Glenn Beck sets the record straight", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: For those of you that don't watch Beck, he attacks both Left and Right. He is a conservative and tells you so. Last night he blamed Bush and Obama for what we are going through right now and did not only point to one person. He went from Left to Right, Right to Left. Yes, some people on Fox do ony tend to go Right, but Beck doesn't care who you are as he supports conservatisim, but not far right ideologies. I've noticed that whenever he goes after a Repub he almost always also blames a Demo but whenever he goes after a Demo he rarely mentions a Repub. even when the situations are similar.", 
        "intTime": 20090417, 
        "postID": 39, 
        "quote": "Originally posted by Anbar7: For those of you that don't watch Beck, he attacks both Left and Right. He is a conservative and tells you so. Last night he blamed Bush and Obama for what we are going through right now and did not only point to one person. He went from Left to Right, Right to Left. Yes, some people on Fox do ony tend to go Right, but Beck doesn't care who you are as he supports conservatisim, but not far right ideologies.", 
        "reply": " I've noticed that whenever he goes after a Repub he almost always also blames a Demo but whenever he goes after a Demo he rarely mentions a Repub. even when the situations are similar.", 
        "threadID": "672198221_4650000122001", 
        "time": "2009-04-17 10:18:00", 
        "title": "Glenn Beck sets the record straight", 
        "userID": "rayld2"
    }, 
    {
        "content": "in fact not only are they liberal but they are hired by liberals to create problems at protests.... i know been there done it... it is very common at all protest to have the anarchist around to start problems... we were hired by liberals in jan 91 in Atlanta to throw bottles of oil at the federal building... they wanted us to take it up a notch.... and we did started a riot.... and what given $25 each...", 
        "intTime": 20090417, 
        "postID": 40, 
        "quote": "", 
        "reply": "in fact not only are they liberal but they are hired by liberals to create problems at protests.... i know been there done it... it is very common at all protest to have the anarchist around to start problems... we were hired by liberals in jan 91 in Atlanta to throw bottles of oil at the federal building... they wanted us to take it up a notch.... and we did started a riot.... and what given $25 each...", 
        "threadID": "672198221_4650000122001", 
        "time": "2009-04-17 10:19:00", 
        "title": "Glenn Beck sets the record straight", 
        "userID": "outlaws93"
    }, 
    {
        "content": "The media, of course, has a narrative that they cannot stop spewing. On Wednesday, 300,000 people (dangerous enough to be suspicious characters to the Department of Homeland Security) gather around America with barely a traffic ticket to show for it. Thursday, the media — undeterred — is continuing their push that this network, this audience and this host might be responsible for violence that might happen. This time, they focused their furious google searches on locating conservative critics of me. Guess what? They're not hard to find. I hack off conservatives just as much as liberals. (Well, maybe not quite as much… but a lot.) Today's Glenn Beck expert: Charles Johnson, a jazz musician, software programmer and writer for the blog \"Little Green Footballs.\" Johnson says: \"I don't know if he's necessarily going to incite violence, but I do think it's irresponsible. It kind of drags down the discourse to a level that I, for one, am not comfortable with.\" As evidence of this lowered discourse, he posted a video that supposedly showed a fan of mine yelling \"burn the books\" at a 9/12 project meeting. Only later, did someone do the two clicks of research that showed she was actually just a liberal there to make fun of the gathering. That's not really the point. There probably are a couple of stupid people at the meetings. There always will be stupid people saying stupid things. There will always be violent people doing violent things. But the insinuation that this network is somehow responsible or approving of anything violent is ludicrous and quite honestly a destructive attempt to silence free speech. That's something blogger Charles Johnson should know about, since he's been called an anti-Muslim bigot by most of the same people that unfairly said the same things about me. We've come to a place where we're not even playing a game of \"blame the messenger,\" it's a game of \"blame the messenger who's specifically saying the opposite message.\" That message — for the one trillionth time — is: If you are considering violence against anyone who isn't a pirate off the coast of Somalia, you are not only wrong, you are an enemy of the state and an enemy of freedom and liberty. The Founding Fathers fought and died for our freedom so that we would have the structure available to achieve change without doing the same. And you know that: 300,000 people peacefully gathered yesterday and honored our founders. That's why today, instead of an honest critique of the spending of Barack Obama, George W Bush and both sides of the aisle in Congress, you're getting non-stop \"tea bag\" jokes and accusations. It's almost like they want to distract you from what's really important. \"http://www.foxnews.com/story/0,2933,516901,00.html\" \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090417, 
        "postID": 41, 
        "quote": "", 
        "reply": "The media, of course, has a narrative that they cannot stop spewing. On Wednesday, 300,000 people (dangerous enough to be suspicious characters to the Department of Homeland Security) gather around America with barely a traffic ticket to show for it. Thursday, the media — undeterred — is continuing their push that this network, this audience and this host might be responsible for violence that might happen. This time, they focused their furious google searches on locating conservative critics of me. Guess what? They're not hard to find. I hack off conservatives just as much as liberals. (Well, maybe not quite as much… but a lot.) Today's Glenn Beck expert: Charles Johnson, a jazz musician, software programmer and writer for the blog \"Little Green Footballs.\" Johnson says: \"I don't know if he's necessarily going to incite violence, but I do think it's irresponsible. It kind of drags down the discourse to a level that I, for one, am not comfortable with.\" As evidence of this lowered discourse, he posted a video that supposedly showed a fan of mine yelling \"burn the books\" at a 9/12 project meeting. Only later, did someone do the two clicks of research that showed she was actually just a liberal there to make fun of the gathering. That's not really the point. There probably are a couple of stupid people at the meetings. There always will be stupid people saying stupid things. There will always be violent people doing violent things. But the insinuation that this network is somehow responsible or approving of anything violent is ludicrous and quite honestly a destructive attempt to silence free speech. That's something blogger Charles Johnson should know about, since he's been called an anti-Muslim bigot by most of the same people that unfairly said the same things about me. We've come to a place where we're not even playing a game of \"blame the messenger,\" it's a game of \"blame the messenger who's specifically saying the opposite message.\" That message — for the one trillionth time — is: If you are considering violence against anyone who isn't a pirate off the coast of Somalia, you are not only wrong, you are an enemy of the state and an enemy of freedom and liberty. The Founding Fathers fought and died for our freedom so that we would have the structure available to achieve change without doing the same. And you know that: 300,000 people peacefully gathered yesterday and honored our founders. That's why today, instead of an honest critique of the spending of Barack Obama, George W Bush and both sides of the aisle in Congress, you're getting non-stop \"tea bag\" jokes and accusations. It's almost like they want to distract you from what's really important. \"http://www.foxnews.com/story/0,2933,516901,00.html\" \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_4650000122001", 
        "time": "2009-04-17 06:30:00", 
        "title": "Glenn Beck sets the record straight", 
        "userID": "Anbar7"
    }, 
    {
        "content": "For those of you that don't watch Beck, he attacks both Left and Right. He is a conservative and tells you so. Last night he blamed Bush and Obama for what we are going through right now and did not only point to one person. He went from Left to Right, Right to Left. Yes, some people on Fox do ony tend to go Right, but Beck doesn't care who you are as he supports conservatisim, but not far right ideologies. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090417, 
        "postID": 42, 
        "quote": "", 
        "reply": "For those of you that don't watch Beck, he attacks both Left and Right. He is a conservative and tells you so. Last night he blamed Bush and Obama for what we are going through right now and did not only point to one person. He went from Left to Right, Right to Left. Yes, some people on Fox do ony tend to go Right, but Beck doesn't care who you are as he supports conservatisim, but not far right ideologies. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_4650000122001", 
        "time": "2009-04-17 06:33:00", 
        "title": "Glenn Beck sets the record straight", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: It's almost like they want to distract you from what's really important. or considers your \"argument\" a complete joke.", 
        "intTime": 20090417, 
        "postID": 43, 
        "quote": "It's almost like they want to distract you from what's really important.", 
        "reply": " or considers your \"argument\" a complete joke.", 
        "threadID": "672198221_4650000122001", 
        "time": "2009-04-17 06:38:00", 
        "title": "Glenn Beck sets the record straight", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: That message — for the one trillionth time — is: If you are considering violence against anyone who isn't a pirate off the coast of Somalia, you are not only wrong, you are an enemy of the state and an enemy of freedom and liberty. What a stupid statement.", 
        "intTime": 20090417, 
        "postID": 44, 
        "quote": "Originally posted by Anbar7: That message — for the one trillionth time — is: If you are considering violence against anyone who isn't a pirate off the coast of Somalia, you are not only wrong, you are an enemy of the state and an enemy of freedom and liberty.", 
        "reply": " What a stupid statement.", 
        "threadID": "672198221_4650000122001", 
        "time": "2009-04-17 06:46:00", 
        "title": "Glenn Beck sets the record straight", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: It's almost like they want to distract you from what's really important. or considers your \"argument\" a complete joke. Since when is it the news media's job to determine if the message is significant or not? Aren't they supposed to report THE NEWS? If 300,000 democrats took part in a nationwide protest of President Bush's policies it would be the lead story on every news station. I will argue that if the news media did their job in a more unbiased manner, the \"TEA parties\" would not have even been necessary.", 
        "intTime": 20090417, 
        "postID": 45, 
        "quote": "Originally posted by karlhungusjr: quote: It's almost like they want to distract you from what's really important. or considers your \"argument\" a complete joke.", 
        "reply": " Since when is it the news media's job to determine if the message is significant or not? Aren't they supposed to report THE NEWS? If 300,000 democrats took part in a nationwide protest of President Bush's policies it would be the lead story on every news station. I will argue that if the news media did their job in a more unbiased manner, the \"TEA parties\" would not have even been necessary.", 
        "threadID": "672198221_4650000122001", 
        "time": "2009-04-17 06:47:00", 
        "title": "Glenn Beck sets the record straight", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Since when is it the news media's job to determine if the message is significant or not? Aren't they supposed to report THE NEWS? they sure are. \"report\". Not \"promote\". not provide P.R. quote: If 300,000 democrats took part in a nationwide protest of President Bush's policies it would be the lead story on every news station. wait...I was told this has nothing to do with Obama. its about taxes and thats it. so which is it? [quote]I will argue that if the news media did their job in a more unbiased manner, the \"TEA parties\" would not have even been necessary./quote] I would argue that the media DID report on the teabaggers. The problem is that guys like Beck are upset that no one really cares. JUST like no one cares about anti-war protesters. actually...no one cares about protesters in general. you all made your case. It's not censorship or a \"distraction\" when you made it very very poorly and people don't buy it.", 
        "intTime": 20090417, 
        "postID": 46, 
        "quote": "Since when is it the news media's job to determine if the message is significant or not? Aren't they supposed to report THE NEWS?", 
        "reply": " they sure are. \"report\". Not \"promote\". not provide P.R. quote: If 300,000 democrats took part in a nationwide protest of President Bush's policies it would be the lead story on every news station. wait...I was told this has nothing to do with Obama. its about taxes and thats it. so which is it? [quote]I will argue that if the news media did their job in a more unbiased manner, the \"TEA parties\" would not have even been necessary./quote] I would argue that the media DID report on the teabaggers. The problem is that guys like Beck are upset that no one really cares. JUST like no one cares about anti-war protesters. actually...no one cares about protesters in general. you all made your case. It's not censorship or a \"distraction\" when you made it very very poorly and people don't buy it.", 
        "threadID": "672198221_4650000122001", 
        "time": "2009-04-17 06:54:00", 
        "title": "Glenn Beck sets the record straight", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by Anbar7: That message — for the one trillionth time — is: If you are considering violence against anyone who isn't a pirate off the coast of Somalia, you are not only wrong, you are an enemy of the state and an enemy of freedom and liberty. What a stupid statement. So him saying that considering violence against the US is an enemy of the state, but you think that is stupid? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090417, 
        "postID": 47, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by Anbar7: That message — for the one trillionth time — is: If you are considering violence against anyone who isn't a pirate off the coast of Somalia, you are not only wrong, you are an enemy of the state and an enemy of freedom and liberty. What a stupid statement.", 
        "reply": " So him saying that considering violence against the US is an enemy of the state, but you think that is stupid? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_4650000122001", 
        "time": "2009-04-17 07:03:00", 
        "title": "Glenn Beck sets the record straight", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: So him saying that considering violence against the US is an enemy of the state, but you think that is stupid? um...no. you're being just a tad bit obtuse. the \"message\" of the so called teabaggers.", 
        "intTime": 20090417, 
        "postID": 48, 
        "quote": "So him saying that considering violence against the US is an enemy of the state, but you think that is stupid?", 
        "reply": " um...no. you're being just a tad bit obtuse. the \"message\" of the so called teabaggers.", 
        "threadID": "672198221_4650000122001", 
        "time": "2009-04-17 07:07:00", 
        "title": "Glenn Beck sets the record straight", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "my mistake Anbar7. for some reason I thought that was directed at me. sorry.", 
        "intTime": 20090417, 
        "postID": 49, 
        "quote": "", 
        "reply": "my mistake Anbar7. for some reason I thought that was directed at me. sorry.", 
        "threadID": "672198221_4650000122001", 
        "time": "2009-04-17 07:09:00", 
        "title": "Glenn Beck sets the record straight", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by Anbar7: That message — for the one trillionth time — is: If you are considering violence against anyone who isn't a pirate off the coast of Somalia, you are not only wrong, you are an enemy of the state and an enemy of freedom and liberty. What a stupid statement. So your advocating Mob Violence against fellow Americans who dont share the same political Beliefs as yourself? or your adovcating Mob Violence against our current elected leaders? Which is it?", 
        "intTime": 20090417, 
        "postID": 50, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by Anbar7: That message — for the one trillionth time — is: If you are considering violence against anyone who isn't a pirate off the coast of Somalia, you are not only wrong, you are an enemy of the state and an enemy of freedom and liberty. What a stupid statement.", 
        "reply": " So your advocating Mob Violence against fellow Americans who dont share the same political Beliefs as yourself? or your adovcating Mob Violence against our current elected leaders? Which is it?", 
        "threadID": "672198221_4650000122001", 
        "time": "2009-04-17 07:40:00", 
        "title": "Glenn Beck sets the record straight", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: [QUOTE]Since when is it the news media's job to determine if the message is significant or not? Aren't they supposed to report THE NEWS? they sure are. \"report\". Not \"promote\". not provide P.R. quote: If 300,000 democrats took part in a nationwide protest of President Bush's policies it would be the lead story on every news station. wait...I was told this has nothing to do with Obama. its about taxes and thats it. so which is it? quote: I will argue that if the news media did their job in a more unbiased manner, the \"TEA parties\" would not have even been necessary./quote] I would argue that the media DID report on the teabaggers. The problem is that guys like Beck are upset that no one really cares. JUST like no one cares about anti-war protesters. actually...no one cares about protesters in general. you all made your case. It's not censorship or a \"distraction\" when you made it very very poorly and people don't buy it. The TEA Parties weren't about Obama. They were in protest of high taxes and even higher government spending. I only mention President Bush because I can't think of many other things that Liberals protest about in those types of numbers. As far as making our case poorly goes, you are probably right. Perhaps our point could have been made more clearly if we had utilized the Liberal protest playbook. Breaking shop windows, slashing tires, vandalizing police cars, blocking traffic, and throwing red paint on things would have drawn much more attention. I think our point was made in how peaceful our protests were. How many arrests did you hear about from the TEA Parties? How much violence was reported? Liberals talk about peace, unity, and acceptance. That is, unless it involves people with political views different than their own. There is nothing more scary than a \"peaceful\" liberal protest. Just look at the G20 summit and Republican National Convention protests if you need an example.", 
        "intTime": 20090417, 
        "postID": 51, 
        "quote": "Originally posted by karlhungusjr: [QUOTE]Since when is it the news media's job to determine if the message is significant or not? Aren't they supposed to report THE NEWS?", 
        "reply": " they sure are. \"report\". Not \"promote\". not provide P.R. quote: If 300,000 democrats took part in a nationwide protest of President Bush's policies it would be the lead story on every news station. wait...I was told this has nothing to do with Obama. its about taxes and thats it. so which is it? quote: I will argue that if the news media did their job in a more unbiased manner, the \"TEA parties\" would not have even been necessary./quote] I would argue that the media DID report on the teabaggers. The problem is that guys like Beck are upset that no one really cares. JUST like no one cares about anti-war protesters. actually...no one cares about protesters in general. you all made your case. It's not censorship or a \"distraction\" when you made it very very poorly and people don't buy it. The TEA Parties weren't about Obama. They were in protest of high taxes and even higher government spending. I only mention President Bush because I can't think of many other things that Liberals protest about in those types of numbers. As far as making our case poorly goes, you are probably right. Perhaps our point could have been made more clearly if we had utilized the Liberal protest playbook. Breaking shop windows, slashing tires, vandalizing police cars, blocking traffic, and throwing red paint on things would have drawn much more attention. I think our point was made in how peaceful our protests were. How many arrests did you hear about from the TEA Parties? How much violence was reported? Liberals talk about peace, unity, and acceptance. That is, unless it involves people with political views different than their own. There is nothing more scary than a \"peaceful\" liberal protest. Just look at the G20 summit and Republican National Convention protests if you need an example.", 
        "threadID": "672198221_4650000122001", 
        "time": "2009-04-17 08:34:00", 
        "title": "Glenn Beck sets the record straight", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by Anbar7: That message — for the one trillionth time — is: If you are considering violence against anyone who isn't a pirate off the coast of Somalia, you are not only wrong, you are an enemy of the state and an enemy of freedom and liberty. What a stupid statement. Only because you don't understand or have difficulty comprehending what he is saying. That government education of yours is doing wonders... \"The World's Finest\"", 
        "intTime": 20090417, 
        "postID": 52, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by Anbar7: That message — for the one trillionth time — is: If you are considering violence against anyone who isn't a pirate off the coast of Somalia, you are not only wrong, you are an enemy of the state and an enemy of freedom and liberty. What a stupid statement.", 
        "reply": " Only because you don't understand or have difficulty comprehending what he is saying. That government education of yours is doing wonders... \"The World's Finest\"", 
        "threadID": "672198221_4650000122001", 
        "time": "2009-04-17 08:40:00", 
        "title": "Glenn Beck sets the record straight", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: The TEA Parties weren't about Obama. They were in protest of high taxes and even higher government spending. as has been stated over and over again...most of the people at those protest will see a tax CUT. and even those 5% that will see a tax increase will only have their taxes returned to what they were 8 years ago, and they will STILL be lower than what they were under Reagan. and the \"higher government spending\" rings hollow since no one complained during reagen, bush I and BushII's terms about them not even submitting balanced budget let alone aproving one.", 
        "intTime": 20090417, 
        "postID": 53, 
        "quote": "The TEA Parties weren't about Obama. They were in protest of high taxes and even higher government spending.", 
        "reply": " as has been stated over and over again...most of the people at those protest will see a tax CUT. and even those 5% that will see a tax increase will only have their taxes returned to what they were 8 years ago, and they will STILL be lower than what they were under Reagan. and the \"higher government spending\" rings hollow since no one complained during reagen, bush I and BushII's terms about them not even submitting balanced budget let alone aproving one.", 
        "threadID": "672198221_4650000122001", 
        "time": "2009-04-17 08:41:00", 
        "title": "Glenn Beck sets the record straight", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by stec74: Liberals talk about peace, unity, and acceptance. That is, unless it involves people with political views different than their own. There is nothing more scary than a \"peaceful\" liberal protest. Just look at the G20 summit and Republican National Convention protests if you need an example. I wasn't aware that the Police have broken up any of these demonstations, as was done at both the Republican and G20 sites. True, there were a handful of self described Anarchists who provided the pretext for breaking these demonstrations up - But I would hardly call these Anarchists \"Liberals.\" In fact, only by stretching defintions are they even members of the left. Dave", 
        "intTime": 20090417, 
        "postID": 54, 
        "quote": "Originally posted by stec74: Liberals talk about peace, unity, and acceptance. That is, unless it involves people with political views different than their own. There is nothing more scary than a \"peaceful\" liberal protest. Just look at the G20 summit and Republican National Convention protests if you need an example.", 
        "reply": " I wasn't aware that the Police have broken up any of these demonstations, as was done at both the Republican and G20 sites. True, there were a handful of self described Anarchists who provided the pretext for breaking these demonstrations up - But I would hardly call these Anarchists \"Liberals.\" In fact, only by stretching defintions are they even members of the left. Dave", 
        "threadID": "672198221_4650000122001", 
        "time": "2009-04-17 08:42:00", 
        "title": "Glenn Beck sets the record straight", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: But I would hardly call these Anarchists \"Liberals.\" In fact, only by stretching defintions are they even members of the left. that's why I just ignored it. beating up strawmen gets old.", 
        "intTime": 20090417, 
        "postID": 55, 
        "quote": "But I would hardly call these Anarchists \"Liberals.\" In fact, only by stretching defintions are they even members of the left.", 
        "reply": " that's why I just ignored it. beating up strawmen gets old.", 
        "threadID": "672198221_4650000122001", 
        "time": "2009-04-17 08:50:00", 
        "title": "Glenn Beck sets the record straight", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "Anyone who ever went to college and took a course in Social Studies should know the the real problem on this planet is women. Women can't and won't stop having babies. Planet earth is producing more and more people each year while less and less food and space is being provided. We have two choices. Stop having babies or start Nuking certain countries.", 
        "intTime": 20090417, 
        "postID": 56, 
        "quote": "", 
        "reply": "Anyone who ever went to college and took a course in Social Studies should know the the real problem on this planet is women. Women can't and won't stop having babies. Planet earth is producing more and more people each year while less and less food and space is being provided. We have two choices. Stop having babies or start Nuking certain countries.", 
        "threadID": "672198221_4650000122001", 
        "time": "2009-04-17 10:09:00", 
        "title": "Glenn Beck sets the record straight", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Duster6: Anyone who ever went to college and took a course in Social Studies should know the the real problem on this planet is women. Women can't and won't stop having babies. Planet earth is producing more and more people each year while less and less food and space is being provided. We have two choices. Stop having babies or start Nuking certain countries. Or we could stop destroying farm land..just a suggestion. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090417, 
        "postID": 57, 
        "quote": "Originally posted by Duster6: Anyone who ever went to college and took a course in Social Studies should know the the real problem on this planet is women. Women can't and won't stop having babies. Planet earth is producing more and more people each year while less and less food and space is being provided. We have two choices. Stop having babies or start Nuking certain countries.", 
        "reply": " Or we could stop destroying farm land..just a suggestion. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_4650000122001", 
        "time": "2009-04-17 10:13:00", 
        "title": "Glenn Beck sets the record straight", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: But I would hardly call these Anarchists \"Liberals.\" In fact, only by stretching defintions are they even members of the left. actually they are very liberal people... they are in fact more liberal then most here...", 
        "intTime": 20090417, 
        "postID": 58, 
        "quote": "But I would hardly call these Anarchists \"Liberals.\" In fact, only by stretching defintions are they even members of the left.", 
        "reply": " actually they are very liberal people... they are in fact more liberal then most here...", 
        "threadID": "672198221_4650000122001", 
        "time": "2009-04-17 10:14:00", 
        "title": "Glenn Beck sets the record straight", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: For those of you that don't watch Beck, he attacks both Left and Right. He is a conservative and tells you so. Last night he blamed Bush and Obama for what we are going through right now and did not only point to one person. He went from Left to Right, Right to Left. Yes, some people on Fox do ony tend to go Right, but Beck doesn't care who you are as he supports conservatisim, but not far right ideologies. I've noticed that whenever he goes after a Repub he almost always also blames a Demo but whenever he goes after a Demo he rarely mentions a Repub. even when the situations are similar.", 
        "intTime": 20090417, 
        "postID": 59, 
        "quote": "Originally posted by Anbar7: For those of you that don't watch Beck, he attacks both Left and Right. He is a conservative and tells you so. Last night he blamed Bush and Obama for what we are going through right now and did not only point to one person. He went from Left to Right, Right to Left. Yes, some people on Fox do ony tend to go Right, but Beck doesn't care who you are as he supports conservatisim, but not far right ideologies.", 
        "reply": " I've noticed that whenever he goes after a Repub he almost always also blames a Demo but whenever he goes after a Demo he rarely mentions a Repub. even when the situations are similar.", 
        "threadID": "672198221_4650000122001", 
        "time": "2009-04-17 10:18:00", 
        "title": "Glenn Beck sets the record straight", 
        "userID": "rayld2"
    }, 
    {
        "content": "in fact not only are they liberal but they are hired by liberals to create problems at protests.... i know been there done it... it is very common at all protest to have the anarchist around to start problems... we were hired by liberals in jan 91 in Atlanta to throw bottles of oil at the federal building... they wanted us to take it up a notch.... and we did started a riot.... and what given $25 each...", 
        "intTime": 20090417, 
        "postID": 60, 
        "quote": "", 
        "reply": "in fact not only are they liberal but they are hired by liberals to create problems at protests.... i know been there done it... it is very common at all protest to have the anarchist around to start problems... we were hired by liberals in jan 91 in Atlanta to throw bottles of oil at the federal building... they wanted us to take it up a notch.... and we did started a riot.... and what given $25 each...", 
        "threadID": "672198221_4650000122001", 
        "time": "2009-04-17 10:19:00", 
        "title": "Glenn Beck sets the record straight", 
        "userID": "outlaws93"
    }, 
    {
        "content": "The media, of course, has a narrative that they cannot stop spewing. On Wednesday, 300,000 people (dangerous enough to be suspicious characters to the Department of Homeland Security) gather around America with barely a traffic ticket to show for it. Thursday, the media — undeterred — is continuing their push that this network, this audience and this host might be responsible for violence that might happen. This time, they focused their furious google searches on locating conservative critics of me. Guess what? They're not hard to find. I hack off conservatives just as much as liberals. (Well, maybe not quite as much… but a lot.) Today's Glenn Beck expert: Charles Johnson, a jazz musician, software programmer and writer for the blog \"Little Green Footballs.\" Johnson says: \"I don't know if he's necessarily going to incite violence, but I do think it's irresponsible. It kind of drags down the discourse to a level that I, for one, am not comfortable with.\" As evidence of this lowered discourse, he posted a video that supposedly showed a fan of mine yelling \"burn the books\" at a 9/12 project meeting. Only later, did someone do the two clicks of research that showed she was actually just a liberal there to make fun of the gathering. That's not really the point. There probably are a couple of stupid people at the meetings. There always will be stupid people saying stupid things. There will always be violent people doing violent things. But the insinuation that this network is somehow responsible or approving of anything violent is ludicrous and quite honestly a destructive attempt to silence free speech. That's something blogger Charles Johnson should know about, since he's been called an anti-Muslim bigot by most of the same people that unfairly said the same things about me. We've come to a place where we're not even playing a game of \"blame the messenger,\" it's a game of \"blame the messenger who's specifically saying the opposite message.\" That message — for the one trillionth time — is: If you are considering violence against anyone who isn't a pirate off the coast of Somalia, you are not only wrong, you are an enemy of the state and an enemy of freedom and liberty. The Founding Fathers fought and died for our freedom so that we would have the structure available to achieve change without doing the same. And you know that: 300,000 people peacefully gathered yesterday and honored our founders. That's why today, instead of an honest critique of the spending of Barack Obama, George W Bush and both sides of the aisle in Congress, you're getting non-stop \"tea bag\" jokes and accusations. It's almost like they want to distract you from what's really important. \"http://www.foxnews.com/story/0,2933,516901,00.html\" \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090417, 
        "postID": 61, 
        "quote": "", 
        "reply": "The media, of course, has a narrative that they cannot stop spewing. On Wednesday, 300,000 people (dangerous enough to be suspicious characters to the Department of Homeland Security) gather around America with barely a traffic ticket to show for it. Thursday, the media — undeterred — is continuing their push that this network, this audience and this host might be responsible for violence that might happen. This time, they focused their furious google searches on locating conservative critics of me. Guess what? They're not hard to find. I hack off conservatives just as much as liberals. (Well, maybe not quite as much… but a lot.) Today's Glenn Beck expert: Charles Johnson, a jazz musician, software programmer and writer for the blog \"Little Green Footballs.\" Johnson says: \"I don't know if he's necessarily going to incite violence, but I do think it's irresponsible. It kind of drags down the discourse to a level that I, for one, am not comfortable with.\" As evidence of this lowered discourse, he posted a video that supposedly showed a fan of mine yelling \"burn the books\" at a 9/12 project meeting. Only later, did someone do the two clicks of research that showed she was actually just a liberal there to make fun of the gathering. That's not really the point. There probably are a couple of stupid people at the meetings. There always will be stupid people saying stupid things. There will always be violent people doing violent things. But the insinuation that this network is somehow responsible or approving of anything violent is ludicrous and quite honestly a destructive attempt to silence free speech. That's something blogger Charles Johnson should know about, since he's been called an anti-Muslim bigot by most of the same people that unfairly said the same things about me. We've come to a place where we're not even playing a game of \"blame the messenger,\" it's a game of \"blame the messenger who's specifically saying the opposite message.\" That message — for the one trillionth time — is: If you are considering violence against anyone who isn't a pirate off the coast of Somalia, you are not only wrong, you are an enemy of the state and an enemy of freedom and liberty. The Founding Fathers fought and died for our freedom so that we would have the structure available to achieve change without doing the same. And you know that: 300,000 people peacefully gathered yesterday and honored our founders. That's why today, instead of an honest critique of the spending of Barack Obama, George W Bush and both sides of the aisle in Congress, you're getting non-stop \"tea bag\" jokes and accusations. It's almost like they want to distract you from what's really important. \"http://www.foxnews.com/story/0,2933,516901,00.html\" \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_4650000122001", 
        "time": "2009-04-17 06:30:00", 
        "title": "Glenn Beck sets the record straight", 
        "userID": "Anbar7"
    }, 
    {
        "content": "For those of you that don't watch Beck, he attacks both Left and Right. He is a conservative and tells you so. Last night he blamed Bush and Obama for what we are going through right now and did not only point to one person. He went from Left to Right, Right to Left. Yes, some people on Fox do ony tend to go Right, but Beck doesn't care who you are as he supports conservatisim, but not far right ideologies. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090417, 
        "postID": 62, 
        "quote": "", 
        "reply": "For those of you that don't watch Beck, he attacks both Left and Right. He is a conservative and tells you so. Last night he blamed Bush and Obama for what we are going through right now and did not only point to one person. He went from Left to Right, Right to Left. Yes, some people on Fox do ony tend to go Right, but Beck doesn't care who you are as he supports conservatisim, but not far right ideologies. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_4650000122001", 
        "time": "2009-04-17 06:33:00", 
        "title": "Glenn Beck sets the record straight", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: It's almost like they want to distract you from what's really important. or considers your \"argument\" a complete joke.", 
        "intTime": 20090417, 
        "postID": 63, 
        "quote": "It's almost like they want to distract you from what's really important.", 
        "reply": " or considers your \"argument\" a complete joke.", 
        "threadID": "672198221_4650000122001", 
        "time": "2009-04-17 06:38:00", 
        "title": "Glenn Beck sets the record straight", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: That message — for the one trillionth time — is: If you are considering violence against anyone who isn't a pirate off the coast of Somalia, you are not only wrong, you are an enemy of the state and an enemy of freedom and liberty. What a stupid statement.", 
        "intTime": 20090417, 
        "postID": 64, 
        "quote": "Originally posted by Anbar7: That message — for the one trillionth time — is: If you are considering violence against anyone who isn't a pirate off the coast of Somalia, you are not only wrong, you are an enemy of the state and an enemy of freedom and liberty.", 
        "reply": " What a stupid statement.", 
        "threadID": "672198221_4650000122001", 
        "time": "2009-04-17 06:46:00", 
        "title": "Glenn Beck sets the record straight", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: It's almost like they want to distract you from what's really important. or considers your \"argument\" a complete joke. Since when is it the news media's job to determine if the message is significant or not? Aren't they supposed to report THE NEWS? If 300,000 democrats took part in a nationwide protest of President Bush's policies it would be the lead story on every news station. I will argue that if the news media did their job in a more unbiased manner, the \"TEA parties\" would not have even been necessary.", 
        "intTime": 20090417, 
        "postID": 65, 
        "quote": "Originally posted by karlhungusjr: quote: It's almost like they want to distract you from what's really important. or considers your \"argument\" a complete joke.", 
        "reply": " Since when is it the news media's job to determine if the message is significant or not? Aren't they supposed to report THE NEWS? If 300,000 democrats took part in a nationwide protest of President Bush's policies it would be the lead story on every news station. I will argue that if the news media did their job in a more unbiased manner, the \"TEA parties\" would not have even been necessary.", 
        "threadID": "672198221_4650000122001", 
        "time": "2009-04-17 06:47:00", 
        "title": "Glenn Beck sets the record straight", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Since when is it the news media's job to determine if the message is significant or not? Aren't they supposed to report THE NEWS? they sure are. \"report\". Not \"promote\". not provide P.R. quote: If 300,000 democrats took part in a nationwide protest of President Bush's policies it would be the lead story on every news station. wait...I was told this has nothing to do with Obama. its about taxes and thats it. so which is it? [quote]I will argue that if the news media did their job in a more unbiased manner, the \"TEA parties\" would not have even been necessary./quote] I would argue that the media DID report on the teabaggers. The problem is that guys like Beck are upset that no one really cares. JUST like no one cares about anti-war protesters. actually...no one cares about protesters in general. you all made your case. It's not censorship or a \"distraction\" when you made it very very poorly and people don't buy it.", 
        "intTime": 20090417, 
        "postID": 66, 
        "quote": "Since when is it the news media's job to determine if the message is significant or not? Aren't they supposed to report THE NEWS?", 
        "reply": " they sure are. \"report\". Not \"promote\". not provide P.R. quote: If 300,000 democrats took part in a nationwide protest of President Bush's policies it would be the lead story on every news station. wait...I was told this has nothing to do with Obama. its about taxes and thats it. so which is it? [quote]I will argue that if the news media did their job in a more unbiased manner, the \"TEA parties\" would not have even been necessary./quote] I would argue that the media DID report on the teabaggers. The problem is that guys like Beck are upset that no one really cares. JUST like no one cares about anti-war protesters. actually...no one cares about protesters in general. you all made your case. It's not censorship or a \"distraction\" when you made it very very poorly and people don't buy it.", 
        "threadID": "672198221_4650000122001", 
        "time": "2009-04-17 06:54:00", 
        "title": "Glenn Beck sets the record straight", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by Anbar7: That message — for the one trillionth time — is: If you are considering violence against anyone who isn't a pirate off the coast of Somalia, you are not only wrong, you are an enemy of the state and an enemy of freedom and liberty. What a stupid statement. So him saying that considering violence against the US is an enemy of the state, but you think that is stupid? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090417, 
        "postID": 67, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by Anbar7: That message — for the one trillionth time — is: If you are considering violence against anyone who isn't a pirate off the coast of Somalia, you are not only wrong, you are an enemy of the state and an enemy of freedom and liberty. What a stupid statement.", 
        "reply": " So him saying that considering violence against the US is an enemy of the state, but you think that is stupid? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_4650000122001", 
        "time": "2009-04-17 07:03:00", 
        "title": "Glenn Beck sets the record straight", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: So him saying that considering violence against the US is an enemy of the state, but you think that is stupid? um...no. you're being just a tad bit obtuse. the \"message\" of the so called teabaggers.", 
        "intTime": 20090417, 
        "postID": 68, 
        "quote": "So him saying that considering violence against the US is an enemy of the state, but you think that is stupid?", 
        "reply": " um...no. you're being just a tad bit obtuse. the \"message\" of the so called teabaggers.", 
        "threadID": "672198221_4650000122001", 
        "time": "2009-04-17 07:07:00", 
        "title": "Glenn Beck sets the record straight", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "my mistake Anbar7. for some reason I thought that was directed at me. sorry.", 
        "intTime": 20090417, 
        "postID": 69, 
        "quote": "", 
        "reply": "my mistake Anbar7. for some reason I thought that was directed at me. sorry.", 
        "threadID": "672198221_4650000122001", 
        "time": "2009-04-17 07:09:00", 
        "title": "Glenn Beck sets the record straight", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by Anbar7: That message — for the one trillionth time — is: If you are considering violence against anyone who isn't a pirate off the coast of Somalia, you are not only wrong, you are an enemy of the state and an enemy of freedom and liberty. What a stupid statement. So your advocating Mob Violence against fellow Americans who dont share the same political Beliefs as yourself? or your adovcating Mob Violence against our current elected leaders? Which is it?", 
        "intTime": 20090417, 
        "postID": 70, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by Anbar7: That message — for the one trillionth time — is: If you are considering violence against anyone who isn't a pirate off the coast of Somalia, you are not only wrong, you are an enemy of the state and an enemy of freedom and liberty. What a stupid statement.", 
        "reply": " So your advocating Mob Violence against fellow Americans who dont share the same political Beliefs as yourself? or your adovcating Mob Violence against our current elected leaders? Which is it?", 
        "threadID": "672198221_4650000122001", 
        "time": "2009-04-17 07:40:00", 
        "title": "Glenn Beck sets the record straight", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: [QUOTE]Since when is it the news media's job to determine if the message is significant or not? Aren't they supposed to report THE NEWS? they sure are. \"report\". Not \"promote\". not provide P.R. quote: If 300,000 democrats took part in a nationwide protest of President Bush's policies it would be the lead story on every news station. wait...I was told this has nothing to do with Obama. its about taxes and thats it. so which is it? quote: I will argue that if the news media did their job in a more unbiased manner, the \"TEA parties\" would not have even been necessary./quote] I would argue that the media DID report on the teabaggers. The problem is that guys like Beck are upset that no one really cares. JUST like no one cares about anti-war protesters. actually...no one cares about protesters in general. you all made your case. It's not censorship or a \"distraction\" when you made it very very poorly and people don't buy it. The TEA Parties weren't about Obama. They were in protest of high taxes and even higher government spending. I only mention President Bush because I can't think of many other things that Liberals protest about in those types of numbers. As far as making our case poorly goes, you are probably right. Perhaps our point could have been made more clearly if we had utilized the Liberal protest playbook. Breaking shop windows, slashing tires, vandalizing police cars, blocking traffic, and throwing red paint on things would have drawn much more attention. I think our point was made in how peaceful our protests were. How many arrests did you hear about from the TEA Parties? How much violence was reported? Liberals talk about peace, unity, and acceptance. That is, unless it involves people with political views different than their own. There is nothing more scary than a \"peaceful\" liberal protest. Just look at the G20 summit and Republican National Convention protests if you need an example.", 
        "intTime": 20090417, 
        "postID": 71, 
        "quote": "Originally posted by karlhungusjr: [QUOTE]Since when is it the news media's job to determine if the message is significant or not? Aren't they supposed to report THE NEWS?", 
        "reply": " they sure are. \"report\". Not \"promote\". not provide P.R. quote: If 300,000 democrats took part in a nationwide protest of President Bush's policies it would be the lead story on every news station. wait...I was told this has nothing to do with Obama. its about taxes and thats it. so which is it? quote: I will argue that if the news media did their job in a more unbiased manner, the \"TEA parties\" would not have even been necessary./quote] I would argue that the media DID report on the teabaggers. The problem is that guys like Beck are upset that no one really cares. JUST like no one cares about anti-war protesters. actually...no one cares about protesters in general. you all made your case. It's not censorship or a \"distraction\" when you made it very very poorly and people don't buy it. The TEA Parties weren't about Obama. They were in protest of high taxes and even higher government spending. I only mention President Bush because I can't think of many other things that Liberals protest about in those types of numbers. As far as making our case poorly goes, you are probably right. Perhaps our point could have been made more clearly if we had utilized the Liberal protest playbook. Breaking shop windows, slashing tires, vandalizing police cars, blocking traffic, and throwing red paint on things would have drawn much more attention. I think our point was made in how peaceful our protests were. How many arrests did you hear about from the TEA Parties? How much violence was reported? Liberals talk about peace, unity, and acceptance. That is, unless it involves people with political views different than their own. There is nothing more scary than a \"peaceful\" liberal protest. Just look at the G20 summit and Republican National Convention protests if you need an example.", 
        "threadID": "672198221_4650000122001", 
        "time": "2009-04-17 08:34:00", 
        "title": "Glenn Beck sets the record straight", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by Anbar7: That message — for the one trillionth time — is: If you are considering violence against anyone who isn't a pirate off the coast of Somalia, you are not only wrong, you are an enemy of the state and an enemy of freedom and liberty. What a stupid statement. Only because you don't understand or have difficulty comprehending what he is saying. That government education of yours is doing wonders... \"The World's Finest\"", 
        "intTime": 20090417, 
        "postID": 72, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by Anbar7: That message — for the one trillionth time — is: If you are considering violence against anyone who isn't a pirate off the coast of Somalia, you are not only wrong, you are an enemy of the state and an enemy of freedom and liberty. What a stupid statement.", 
        "reply": " Only because you don't understand or have difficulty comprehending what he is saying. That government education of yours is doing wonders... \"The World's Finest\"", 
        "threadID": "672198221_4650000122001", 
        "time": "2009-04-17 08:40:00", 
        "title": "Glenn Beck sets the record straight", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: The TEA Parties weren't about Obama. They were in protest of high taxes and even higher government spending. as has been stated over and over again...most of the people at those protest will see a tax CUT. and even those 5% that will see a tax increase will only have their taxes returned to what they were 8 years ago, and they will STILL be lower than what they were under Reagan. and the \"higher government spending\" rings hollow since no one complained during reagen, bush I and BushII's terms about them not even submitting balanced budget let alone aproving one.", 
        "intTime": 20090417, 
        "postID": 73, 
        "quote": "The TEA Parties weren't about Obama. They were in protest of high taxes and even higher government spending.", 
        "reply": " as has been stated over and over again...most of the people at those protest will see a tax CUT. and even those 5% that will see a tax increase will only have their taxes returned to what they were 8 years ago, and they will STILL be lower than what they were under Reagan. and the \"higher government spending\" rings hollow since no one complained during reagen, bush I and BushII's terms about them not even submitting balanced budget let alone aproving one.", 
        "threadID": "672198221_4650000122001", 
        "time": "2009-04-17 08:41:00", 
        "title": "Glenn Beck sets the record straight", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by stec74: Liberals talk about peace, unity, and acceptance. That is, unless it involves people with political views different than their own. There is nothing more scary than a \"peaceful\" liberal protest. Just look at the G20 summit and Republican National Convention protests if you need an example. I wasn't aware that the Police have broken up any of these demonstations, as was done at both the Republican and G20 sites. True, there were a handful of self described Anarchists who provided the pretext for breaking these demonstrations up - But I would hardly call these Anarchists \"Liberals.\" In fact, only by stretching defintions are they even members of the left. Dave", 
        "intTime": 20090417, 
        "postID": 74, 
        "quote": "Originally posted by stec74: Liberals talk about peace, unity, and acceptance. That is, unless it involves people with political views different than their own. There is nothing more scary than a \"peaceful\" liberal protest. Just look at the G20 summit and Republican National Convention protests if you need an example.", 
        "reply": " I wasn't aware that the Police have broken up any of these demonstations, as was done at both the Republican and G20 sites. True, there were a handful of self described Anarchists who provided the pretext for breaking these demonstrations up - But I would hardly call these Anarchists \"Liberals.\" In fact, only by stretching defintions are they even members of the left. Dave", 
        "threadID": "672198221_4650000122001", 
        "time": "2009-04-17 08:42:00", 
        "title": "Glenn Beck sets the record straight", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: But I would hardly call these Anarchists \"Liberals.\" In fact, only by stretching defintions are they even members of the left. that's why I just ignored it. beating up strawmen gets old.", 
        "intTime": 20090417, 
        "postID": 75, 
        "quote": "But I would hardly call these Anarchists \"Liberals.\" In fact, only by stretching defintions are they even members of the left.", 
        "reply": " that's why I just ignored it. beating up strawmen gets old.", 
        "threadID": "672198221_4650000122001", 
        "time": "2009-04-17 08:50:00", 
        "title": "Glenn Beck sets the record straight", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "Anyone who ever went to college and took a course in Social Studies should know the the real problem on this planet is women. Women can't and won't stop having babies. Planet earth is producing more and more people each year while less and less food and space is being provided. We have two choices. Stop having babies or start Nuking certain countries.", 
        "intTime": 20090417, 
        "postID": 76, 
        "quote": "", 
        "reply": "Anyone who ever went to college and took a course in Social Studies should know the the real problem on this planet is women. Women can't and won't stop having babies. Planet earth is producing more and more people each year while less and less food and space is being provided. We have two choices. Stop having babies or start Nuking certain countries.", 
        "threadID": "672198221_4650000122001", 
        "time": "2009-04-17 10:09:00", 
        "title": "Glenn Beck sets the record straight", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Duster6: Anyone who ever went to college and took a course in Social Studies should know the the real problem on this planet is women. Women can't and won't stop having babies. Planet earth is producing more and more people each year while less and less food and space is being provided. We have two choices. Stop having babies or start Nuking certain countries. Or we could stop destroying farm land..just a suggestion. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090417, 
        "postID": 77, 
        "quote": "Originally posted by Duster6: Anyone who ever went to college and took a course in Social Studies should know the the real problem on this planet is women. Women can't and won't stop having babies. Planet earth is producing more and more people each year while less and less food and space is being provided. We have two choices. Stop having babies or start Nuking certain countries.", 
        "reply": " Or we could stop destroying farm land..just a suggestion. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_4650000122001", 
        "time": "2009-04-17 10:13:00", 
        "title": "Glenn Beck sets the record straight", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: But I would hardly call these Anarchists \"Liberals.\" In fact, only by stretching defintions are they even members of the left. actually they are very liberal people... they are in fact more liberal then most here...", 
        "intTime": 20090417, 
        "postID": 78, 
        "quote": "But I would hardly call these Anarchists \"Liberals.\" In fact, only by stretching defintions are they even members of the left.", 
        "reply": " actually they are very liberal people... they are in fact more liberal then most here...", 
        "threadID": "672198221_4650000122001", 
        "time": "2009-04-17 10:14:00", 
        "title": "Glenn Beck sets the record straight", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: For those of you that don't watch Beck, he attacks both Left and Right. He is a conservative and tells you so. Last night he blamed Bush and Obama for what we are going through right now and did not only point to one person. He went from Left to Right, Right to Left. Yes, some people on Fox do ony tend to go Right, but Beck doesn't care who you are as he supports conservatisim, but not far right ideologies. I've noticed that whenever he goes after a Repub he almost always also blames a Demo but whenever he goes after a Demo he rarely mentions a Repub. even when the situations are similar.", 
        "intTime": 20090417, 
        "postID": 79, 
        "quote": "Originally posted by Anbar7: For those of you that don't watch Beck, he attacks both Left and Right. He is a conservative and tells you so. Last night he blamed Bush and Obama for what we are going through right now and did not only point to one person. He went from Left to Right, Right to Left. Yes, some people on Fox do ony tend to go Right, but Beck doesn't care who you are as he supports conservatisim, but not far right ideologies.", 
        "reply": " I've noticed that whenever he goes after a Repub he almost always also blames a Demo but whenever he goes after a Demo he rarely mentions a Repub. even when the situations are similar.", 
        "threadID": "672198221_4650000122001", 
        "time": "2009-04-17 10:18:00", 
        "title": "Glenn Beck sets the record straight", 
        "userID": "rayld2"
    }, 
    {
        "content": "in fact not only are they liberal but they are hired by liberals to create problems at protests.... i know been there done it... it is very common at all protest to have the anarchist around to start problems... we were hired by liberals in jan 91 in Atlanta to throw bottles of oil at the federal building... they wanted us to take it up a notch.... and we did started a riot.... and what given $25 each...", 
        "intTime": 20090417, 
        "postID": 80, 
        "quote": "", 
        "reply": "in fact not only are they liberal but they are hired by liberals to create problems at protests.... i know been there done it... it is very common at all protest to have the anarchist around to start problems... we were hired by liberals in jan 91 in Atlanta to throw bottles of oil at the federal building... they wanted us to take it up a notch.... and we did started a riot.... and what given $25 each...", 
        "threadID": "672198221_4650000122001", 
        "time": "2009-04-17 10:19:00", 
        "title": "Glenn Beck sets the record straight", 
        "userID": "outlaws93"
    }
]