[
    {
        "content": "RE: http://www.military.com/features/0,15240,190084,00.html Finally, could this really be, a sneak peak into the motive behind what France is really up to. They want to upgrade their tanker fleet (along with other large aircraft I am sure). Why not let the USA do or absorb all the costly Developmental Test and Evaluation work followed by the Operational Test and Evaluation work while they just sit back and reap the fruits of our knowledge. If you notice on the F-35 Program, each of the foreign countries that are interested in this aircraft were required to fess up part of the development and testing costs ahead of time. This is yet another reason to buy American and EADS/Airbus is NOT American made. France is not and can not be trusted…ever when it comes to the safety and wellbeing of the USA.", 
        "intTime": 20090501, 
        "postID": 1, 
        "quote": "", 
        "reply": "RE: http://www.military.com/features/0,15240,190084,00.html Finally, could this really be, a sneak peak into the motive behind what France is really up to. They want to upgrade their tanker fleet (along with other large aircraft I am sure). Why not let the USA do or absorb all the costly Developmental Test and Evaluation work followed by the Operational Test and Evaluation work while they just sit back and reap the fruits of our knowledge. If you notice on the F-35 Program, each of the foreign countries that are interested in this aircraft were required to fess up part of the development and testing costs ahead of time. This is yet another reason to buy American and EADS/Airbus is NOT American made. France is not and can not be trusted…ever when it comes to the safety and wellbeing of the USA.", 
        "threadID": "672198221_5930042222001", 
        "time": "2009-05-01 08:03:00", 
        "title": "France Looks for US Cue on Tanker Need", 
        "userID": "F22Flighttester"
    }, 
    {
        "content": "If we didn't sell the technology we develop to friendly countries, it would cost 10x as much. Anyways, they are the French! Are you worried about them attacking us later or something?", 
        "intTime": 20090501, 
        "postID": 2, 
        "quote": "", 
        "reply": "If we didn't sell the technology we develop to friendly countries, it would cost 10x as much. Anyways, they are the French! Are you worried about them attacking us later or something?", 
        "threadID": "672198221_5930042222001", 
        "time": "2009-05-01 09:39:00", 
        "title": "France Looks for US Cue on Tanker Need", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by F22Flighttester: France is not and can not be trusted…ever when it comes to the safety and wellbeing of the USA. So, are the french out to get us or something?", 
        "intTime": 20090501, 
        "postID": 3, 
        "quote": "Originally posted by F22Flighttester: France is not and can not be trusted…ever when it comes to the safety and wellbeing of the USA.", 
        "reply": " So, are the french out to get us or something?", 
        "threadID": "672198221_5930042222001", 
        "time": "2009-05-01 09:41:00", 
        "title": "France Looks for US Cue on Tanker Need", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "For MRMIXITUP So, are the french out to get us or something? No we see no threat from the French. However, in the case of the next tanker, they could suddenly not like out foreign politics and stop producing the airframes and needed spares to maintain them. You must remember France show its allegiance when we elected to bomb Libya and France would no allow us to over-fly their airspace. We were forced to go around yet we did it with tanker support. If our tankers are grounded due to spares, our capabilities are limited. We can not gamble with this issue or with France.", 
        "intTime": 20090501, 
        "postID": 4, 
        "quote": "", 
        "reply": "For MRMIXITUP So, are the french out to get us or something? No we see no threat from the French. However, in the case of the next tanker, they could suddenly not like out foreign politics and stop producing the airframes and needed spares to maintain them. You must remember France show its allegiance when we elected to bomb Libya and France would no allow us to over-fly their airspace. We were forced to go around yet we did it with tanker support. If our tankers are grounded due to spares, our capabilities are limited. We can not gamble with this issue or with France.", 
        "threadID": "672198221_5930042222001", 
        "time": "2009-05-01 11:48:00", 
        "title": "France Looks for US Cue on Tanker Need", 
        "userID": "F22Flighttester"
    }, 
    {
        "content": "quote: Originally posted by F22Flighttester: For MRMIXITUP So, are the french out to get us or something? No we see no threat from the French. However, in the case of the next tanker, they could suddenly not like out foreign politics and stop producing the airframes and needed spares to maintain them. You must remember France show its allegiance when we elected to bomb Libya and France would no allow us to over-fly their airspace. We were forced to go around yet we did it with tanker support. If our tankers are grounded due to spares, our capabilities are limited. We can not gamble with this issue or with France. First of all, European Aeronautic Defence and Space Company (EADS) is NOT French!!! It’s a large corporation formed by a merger of companies from France, Germany & Spain! Second, majority of parts manufacture & assembly was going to be preformed right here in the US. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090501, 
        "postID": 5, 
        "quote": "Originally posted by F22Flighttester: For MRMIXITUP So, are the french out to get us or something? No we see no threat from the French. However, in the case of the next tanker, they could suddenly not like out foreign politics and stop producing the airframes and needed spares to maintain them. You must remember France show its allegiance when we elected to bomb Libya and France would no allow us to over-fly their airspace. We were forced to go around yet we did it with tanker support. If our tankers are grounded due to spares, our capabilities are limited. We can not gamble with this issue or with France.", 
        "reply": " First of all, European Aeronautic Defence and Space Company (EADS) is NOT French!!! It’s a large corporation formed by a merger of companies from France, Germany & Spain! Second, majority of parts manufacture & assembly was going to be preformed right here in the US. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_5930042222001", 
        "time": "2009-05-01 12:01:00", 
        "title": "France Looks for US Cue on Tanker Need", 
        "userID": "NSNN"
    }, 
    {
        "content": "Why can't the French take the lead, purchase the Airbus product and put it through the paces. If it works out then maybe the U.S. should consider it. In the meantime purchase Boeings to fill the initial requirement for a medium tanker.", 
        "intTime": 20090501, 
        "postID": 6, 
        "quote": "", 
        "reply": "Why can't the French take the lead, purchase the Airbus product and put it through the paces. If it works out then maybe the U.S. should consider it. In the meantime purchase Boeings to fill the initial requirement for a medium tanker.", 
        "threadID": "672198221_5930042222001", 
        "time": "2009-05-01 15:39:00", 
        "title": "France Looks for US Cue on Tanker Need", 
        "userID": "M123Driver"
    }, 
    {
        "content": "quote: Originally posted by M123Driver: Why can't the French take the lead, purchase the Airbus product and put it through the paces. If it works out then maybe the U.S. should consider it. In the meantime purchase Boeings to fill the initial requirement for a medium tanker. The French don't want to fund it because the Crapauds don't want to be left hanging out to dry when a bit of Congressional jiggery-pokery (read Bribe or American chauvinism) means that Boeing gets the US tanker order regardless of the relative merits of the two projects. It's not unknown for partner countries to end up getting shafted by the US on this sort of project as the disputes over technology transfer on the F35 demonstrate.", 
        "intTime": 20090502, 
        "postID": 7, 
        "quote": "Originally posted by M123Driver: Why can't the French take the lead, purchase the Airbus product and put it through the paces. If it works out then maybe the U.S. should consider it. In the meantime purchase Boeings to fill the initial requirement for a medium tanker.", 
        "reply": " The French don't want to fund it because the Crapauds don't want to be left hanging out to dry when a bit of Congressional jiggery-pokery (read Bribe or American chauvinism) means that Boeing gets the US tanker order regardless of the relative merits of the two projects. It's not unknown for partner countries to end up getting shafted by the US on this sort of project as the disputes over technology transfer on the F35 demonstrate.", 
        "threadID": "672198221_5930042222001", 
        "time": "2009-05-02 02:00:00", 
        "title": "France Looks for US Cue on Tanker Need", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "For NSNN: In 2001 Airbus became a single fully integrated company incorporated under French law as a simplified joint stock company or S.A.S. (Société par Actions Simplifiée). The four national entities which had previously formed the Airbus consortium transferred their Airbus-related assets to the new company and became shareholders in Airbus -- Airbus France, Airbus Deutschland and Airbus Espana merging as the European Aeronautic Defence and Space Company (EADS) with 80% shares and BAE Systems with 20%. In 2006, following the sales of BAE Systems' shares, Airbus became an EADS company. Yes, Airbus is now part of EADS, however, it is governed by French Law which commands the politics if this issue. In short, if France does not like what the USA is doing in the World for whatever reason, they can cut the USAF off and have done so in the past. This type of issue or condition is not in the best interest of the USAF nor the USA. Their product will ONLY be assembled in the USA, most all parts will be made outside the USA and out of our control yet under the control of France/EADS/Airbus. This includes spares. Yes, Boeing also had parts of their product made outside the USA but final assemble is states-side. If Boeing has to make ALL parts, they can do so and have done so as their capabilities lie within the USA.", 
        "intTime": 20090502, 
        "postID": 8, 
        "quote": "", 
        "reply": "For NSNN: In 2001 Airbus became a single fully integrated company incorporated under French law as a simplified joint stock company or S.A.S. (Société par Actions Simplifiée). The four national entities which had previously formed the Airbus consortium transferred their Airbus-related assets to the new company and became shareholders in Airbus -- Airbus France, Airbus Deutschland and Airbus Espana merging as the European Aeronautic Defence and Space Company (EADS) with 80% shares and BAE Systems with 20%. In 2006, following the sales of BAE Systems' shares, Airbus became an EADS company. Yes, Airbus is now part of EADS, however, it is governed by French Law which commands the politics if this issue. In short, if France does not like what the USA is doing in the World for whatever reason, they can cut the USAF off and have done so in the past. This type of issue or condition is not in the best interest of the USAF nor the USA. Their product will ONLY be assembled in the USA, most all parts will be made outside the USA and out of our control yet under the control of France/EADS/Airbus. This includes spares. Yes, Boeing also had parts of their product made outside the USA but final assemble is states-side. If Boeing has to make ALL parts, they can do so and have done so as their capabilities lie within the USA.", 
        "threadID": "672198221_5930042222001", 
        "time": "2009-05-02 06:05:00", 
        "title": "France Looks for US Cue on Tanker Need", 
        "userID": "F22Flighttester"
    }, 
    {
        "content": "quote: Second, majority of parts manufacture & assembly was going to be preformed right here in the US. As F22 already pointed out, only the final assembly was going to take place in the US from components manufactured in the EU. The only items to be actually produced in the US was the refueling equipment, SOME avionics/defensive equipment and the engines. All told consisting of only 25% of the overall cost and parts.", 
        "intTime": 20090502, 
        "postID": 9, 
        "quote": "Second, majority of parts manufacture & assembly was going to be preformed right here in the US.", 
        "reply": " As F22 already pointed out, only the final assembly was going to take place in the US from components manufactured in the EU. The only items to be actually produced in the US was the refueling equipment, SOME avionics/defensive equipment and the engines. All told consisting of only 25% of the overall cost and parts.", 
        "threadID": "672198221_5930042222001", 
        "time": "2009-05-02 06:31:00", 
        "title": "France Looks for US Cue on Tanker Need", 
        "userID": "FlankerFlyer"
    }
]