[
    {
        "content": "Good Morning America how are you? More large companies are putting a freeze on pensions. Found this one on the front page of USA Today. The number of companies that have frozen their traditional pension plans has accelerated sharply this year, a trend that will likely continue as companies wrestle with declining profits and poor investment returns. At least 16 companies have announced plans to freeze their pensions so far this year, vs. 18 for all of 2008. Last week, Wells Fargo told its employees that their pension plans will stop accruing benefits July 1. When a pension is frozen, employees get to keep the benefits they've already earned, but the company usually won't contribute any more money. Older employees are particularly hard hit because they have less time to make up for the loss, says Nancy Hwa, spokeswoman for the Pension Rights Center. Severe investment losses in 2008 shrank the assets of the nation's largest pension plans to 79% of projected liabilities, down from 109% at the end of 2007, according to an analysis by Watson Wyatt. Companies, already hurting in the weak economy, have to increase contributions to make up the difference, and are facing stricter federal requirements about funding the plans. More companies will freeze their pension plans unless Congress temporarily relaxes the funding requirements, says Dena Battle, director of tax policy for the National Association of Manufacturers. \"When your funding obligations triple and you don't have the cash to deal with that and you don't get relief from Congress, you have to make hard choices,\" she says. FIND MORE STORIES IN: United States House of Representatives | Wells Fargo | National Association of Manufacturers | Watson Wyatt Worldwide Pension-rights advocates and some lawmakers support giving relief only to companies that agree not to freeze their plans. \"Congress will be hesitant to provide pension fund relief without assurance that employers would protect benefits of rank-and-file employees and not divert funding relief to other uses,\" such as corporate bonuses, says Sandra Salstrom, a spokeswoman for Rep. Earl Pomeroy, D-N.D., who is drafting a pension relief bill. Battle says many plan sponsors would reject relief on those terms. The employer-sponsored retirement system, \"has always been voluntary,\" she says. \"We work very hard to preserve that.\"", 
        "intTime": 20090511, 
        "postID": 1, 
        "quote": "", 
        "reply": "Good Morning America how are you? More large companies are putting a freeze on pensions. Found this one on the front page of USA Today. The number of companies that have frozen their traditional pension plans has accelerated sharply this year, a trend that will likely continue as companies wrestle with declining profits and poor investment returns. At least 16 companies have announced plans to freeze their pensions so far this year, vs. 18 for all of 2008. Last week, Wells Fargo told its employees that their pension plans will stop accruing benefits July 1. When a pension is frozen, employees get to keep the benefits they've already earned, but the company usually won't contribute any more money. Older employees are particularly hard hit because they have less time to make up for the loss, says Nancy Hwa, spokeswoman for the Pension Rights Center. Severe investment losses in 2008 shrank the assets of the nation's largest pension plans to 79% of projected liabilities, down from 109% at the end of 2007, according to an analysis by Watson Wyatt. Companies, already hurting in the weak economy, have to increase contributions to make up the difference, and are facing stricter federal requirements about funding the plans. More companies will freeze their pension plans unless Congress temporarily relaxes the funding requirements, says Dena Battle, director of tax policy for the National Association of Manufacturers. \"When your funding obligations triple and you don't have the cash to deal with that and you don't get relief from Congress, you have to make hard choices,\" she says. FIND MORE STORIES IN: United States House of Representatives | Wells Fargo | National Association of Manufacturers | Watson Wyatt Worldwide Pension-rights advocates and some lawmakers support giving relief only to companies that agree not to freeze their plans. \"Congress will be hesitant to provide pension fund relief without assurance that employers would protect benefits of rank-and-file employees and not divert funding relief to other uses,\" such as corporate bonuses, says Sandra Salstrom, a spokeswoman for Rep. Earl Pomeroy, D-N.D., who is drafting a pension relief bill. Battle says many plan sponsors would reject relief on those terms. The employer-sponsored retirement system, \"has always been voluntary,\" she says. \"We work very hard to preserve that.\"", 
        "threadID": "672198221_7230010322001", 
        "time": "2009-05-11 03:14:00", 
        "title": "How do you all like the new change and hope now?", 
        "userID": "Duster6"
    }, 
    {
        "content": "Hmmm.....let the \"free market\" freeze pensions that they agreed to pay or \"socialize\" the pensions...tough call... but on the bright side I'm sure it will be easy to be outraged no matter what happens! have fun!", 
        "intTime": 20090511, 
        "postID": 2, 
        "quote": "", 
        "reply": "Hmmm.....let the \"free market\" freeze pensions that they agreed to pay or \"socialize\" the pensions...tough call... but on the bright side I'm sure it will be easy to be outraged no matter what happens! have fun!", 
        "threadID": "672198221_7230010322001", 
        "time": "2009-05-11 03:20:00", 
        "title": "How do you all like the new change and hope now?", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: More companies will freeze their pension plans unless Congress temporarily relaxes the funding requirements In other words, the companies want to return to the \"good ol' days\" when they were allowed to deliberately underfund their pension liabilities with the promise that it would be there when it was needed. They've been allowed to get away with that scam since the Reagan era. Now, not suprisingly, when it's time to pay up, they don't have the money. Gee, who coulda seen that coming? But, don't worry...their bought and paid for toadies in Congress have already dealt with that problem: They'll shift their pension liabilities off on YOU, Mr and Mrs Taxpayer, via the Pension Benefit Guaranty Corporation and you retirees will be lucky to get 50 cents on the dollar.", 
        "intTime": 20090511, 
        "postID": 3, 
        "quote": "More companies will freeze their pension plans unless Congress temporarily relaxes the funding requirements", 
        "reply": " In other words, the companies want to return to the \"good ol' days\" when they were allowed to deliberately underfund their pension liabilities with the promise that it would be there when it was needed. They've been allowed to get away with that scam since the Reagan era. Now, not suprisingly, when it's time to pay up, they don't have the money. Gee, who coulda seen that coming? But, don't worry...their bought and paid for toadies in Congress have already dealt with that problem: They'll shift their pension liabilities off on YOU, Mr and Mrs Taxpayer, via the Pension Benefit Guaranty Corporation and you retirees will be lucky to get 50 cents on the dollar.", 
        "threadID": "672198221_7230010322001", 
        "time": "2009-05-11 04:26:00", 
        "title": "How do you all like the new change and hope now?", 
        "userID": "stillkit"
    }, 
    {
        "content": "Unless the corporations in question are pending bankruptcy, in which case unfunded pensions will get first dibs over secured loans, a la Chrysler... wonder what that approach means to folks privately funding their own personal pensions with corporate equity and debt issues?", 
        "intTime": 20090511, 
        "postID": 4, 
        "quote": "", 
        "reply": "Unless the corporations in question are pending bankruptcy, in which case unfunded pensions will get first dibs over secured loans, a la Chrysler... wonder what that approach means to folks privately funding their own personal pensions with corporate equity and debt issues?", 
        "threadID": "672198221_7230010322001", 
        "time": "2009-05-11 05:16:00", 
        "title": "How do you all like the new change and hope now?", 
        "userID": "godawgz"
    }, 
    {
        "content": "I'm surprised some people even are lucky enough to still get pensions.", 
        "intTime": 20090511, 
        "postID": 5, 
        "quote": "", 
        "reply": "I'm surprised some people even are lucky enough to still get pensions.", 
        "threadID": "672198221_7230010322001", 
        "time": "2009-05-11 06:09:00", 
        "title": "How do you all like the new change and hope now?", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "I say confiscate the assets of the criminal right wing extremist thugs that stole and embezzled the money in the first place. I do not have any thing against acquiring wealth honestly and ethically but these criminals just stole the money. Put the criminals in prison and their assets in a retirement fund for the good honest people who spent all of their life working.", 
        "intTime": 20090511, 
        "postID": 6, 
        "quote": "", 
        "reply": "I say confiscate the assets of the criminal right wing extremist thugs that stole and embezzled the money in the first place. I do not have any thing against acquiring wealth honestly and ethically but these criminals just stole the money. Put the criminals in prison and their assets in a retirement fund for the good honest people who spent all of their life working.", 
        "threadID": "672198221_7230010322001", 
        "time": "2009-05-11 06:18:00", 
        "title": "How do you all like the new change and hope now?", 
        "userID": "6837602"
    }, 
    {
        "content": "quote: Originally posted by stillkit: quote: More companies will freeze their pension plans unless Congress temporarily relhttp://forums.military.com/groupee_common/platform_images/blank.gifaxes the funding requirements But, don't worry...their bought and paid for toadies in Congress have already dealt with that problem: They'll shift their pension liabilities off on YOU, Mr and Mrs Taxpayer, via the Pension Benefit Guaranty Corporation and you retirees will be lucky to get 50 cents on the dollar. .....gee granddad only got a watch to keep track of the time left to live poor.... Already past the future", 
        "intTime": 20090511, 
        "postID": 7, 
        "quote": "Originally posted by stillkit: quote: More companies will freeze their pension plans unless Congress temporarily relhttp://forums.military.com/groupee_common/platform_images/blank.gifaxes the funding requirements But, don't worry...their bought and paid for toadies in Congress have already dealt with that problem: They'll shift their pension liabilities off on YOU, Mr and Mrs Taxpayer, via the Pension Benefit Guaranty Corporation and you retirees will be lucky to get 50 cents on the dollar.", 
        "reply": " .....gee granddad only got a watch to keep track of the time left to live poor.... Already past the future", 
        "threadID": "672198221_7230010322001", 
        "time": "2009-05-11 06:21:00", 
        "title": "How do you all like the new change and hope now?", 
        "userID": "6486143"
    }, 
    {
        "content": "Wonder how Pelosi and \"the gang\" are going to get the retirement taxes from the people that got screwed on their pensions? I guess the illegals will be supported by yet \"another\" tax created by Congress or Gore. With the Civil Service program, expected to reach over 3 million, and the Civil Defense Force being increased another 75 thousand...the money has to come from somewhere. We are paying for our own police state, at the expense of protecting the crooks in Washington. They plan on increasing taxes on retirement, and have the gall to reinstate the death tax.", 
        "intTime": 20090511, 
        "postID": 8, 
        "quote": "", 
        "reply": "Wonder how Pelosi and \"the gang\" are going to get the retirement taxes from the people that got screwed on their pensions? I guess the illegals will be supported by yet \"another\" tax created by Congress or Gore. With the Civil Service program, expected to reach over 3 million, and the Civil Defense Force being increased another 75 thousand...the money has to come from somewhere. We are paying for our own police state, at the expense of protecting the crooks in Washington. They plan on increasing taxes on retirement, and have the gall to reinstate the death tax.", 
        "threadID": "672198221_7230010322001", 
        "time": "2009-05-11 06:39:00", 
        "title": "How do you all like the new change and hope now?", 
        "userID": "steelthunder"
    }, 
    {
        "content": "quote: Originally posted by steelthunder: Wonder how Pelosi and \"the gang\" are going to get the retirement taxes from the people that got screwed on their pensions? I guess the illegals will be supported by yet \"another\" tax created by Congress or Gore. With the Civil Service program, expected to reach over 3 million, and the Civil Defense Force being increased another 75 thousand...the money has to come from somewhere. We are paying for our own police state, at the expense of protecting the crooks in Washington. They plan on increasing taxes on retirement, and have the gall to reinstate the death tax. I wonder if it will be as much as W gets? George H.W. Bush U.S.G Pension: $191,300 Not saying either is right, but to use this as a \"partisan slam\" just on Pelosi and \"the gang\" without including ALL the Kings and Queens (including the repubs) in the playing field is not exactly being outfront and truthful. Obama followed in Ws foot steps even at one point with a recommendatioon from W that we needed to bailout these companies. To not include W in all of this is again, not loggical and just pure partisan hogwash.", 
        "intTime": 20090511, 
        "postID": 9, 
        "quote": "Originally posted by steelthunder: Wonder how Pelosi and \"the gang\" are going to get the retirement taxes from the people that got screwed on their pensions? I guess the illegals will be supported by yet \"another\" tax created by Congress or Gore. With the Civil Service program, expected to reach over 3 million, and the Civil Defense Force being increased another 75 thousand...the money has to come from somewhere. We are paying for our own police state, at the expense of protecting the crooks in Washington. They plan on increasing taxes on retirement, and have the gall to reinstate the death tax.", 
        "reply": " I wonder if it will be as much as W gets? George H.W. Bush U.S.G Pension: $191,300 Not saying either is right, but to use this as a \"partisan slam\" just on Pelosi and \"the gang\" without including ALL the Kings and Queens (including the repubs) in the playing field is not exactly being outfront and truthful. Obama followed in Ws foot steps even at one point with a recommendatioon from W that we needed to bailout these companies. To not include W in all of this is again, not loggical and just pure partisan hogwash.", 
        "threadID": "672198221_7230010322001", 
        "time": "2009-05-11 07:46:00", 
        "title": "How do you all like the new change and hope now?", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "What I think we've lost sight of is that a guaranteed retirement is nowhere in the constitution. from the gov't side it's a self-repeating ponzi,from the corporate side it's a way to attract recruits.. no more, no less.. when you invest your SSI taxes with the gov't, or your time and energy with a company, you need to handle it as you would any other investment: returns may vary and carry a significant possibility of loss.", 
        "intTime": 20090511, 
        "postID": 10, 
        "quote": "", 
        "reply": "What I think we've lost sight of is that a guaranteed retirement is nowhere in the constitution. from the gov't side it's a self-repeating ponzi,from the corporate side it's a way to attract recruits.. no more, no less.. when you invest your SSI taxes with the gov't, or your time and energy with a company, you need to handle it as you would any other investment: returns may vary and carry a significant possibility of loss.", 
        "threadID": "672198221_7230010322001", 
        "time": "2009-05-11 08:27:00", 
        "title": "How do you all like the new change and hope now?", 
        "userID": "godawgz"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: I'm surprised some people even are lucky enough to still get pensions. Luck? Crap !!! Me, a self employed person is still working on his first. First quarter sales are down about a 1/3. But wait, there's hope. Obama's plan must be working: my April sales are only off about 26%. (Insert \"hack, cough\", here.) No savings this year---maybe never again in IRAs ..probably never more from me in any place the government can see and find.", 
        "intTime": 20090511, 
        "postID": 11, 
        "quote": "Originally posted by mrmixitup: I'm surprised some people even are lucky enough to still get pensions.", 
        "reply": " Luck? Crap !!! Me, a self employed person is still working on his first. First quarter sales are down about a 1/3. But wait, there's hope. Obama's plan must be working: my April sales are only off about 26%. (Insert \"hack, cough\", here.) No savings this year---maybe never again in IRAs ..probably never more from me in any place the government can see and find.", 
        "threadID": "672198221_7230010322001", 
        "time": "2009-05-11 09:03:00", 
        "title": "How do you all like the new change and hope now?", 
        "userID": "SemperSignsdotcom"
    }, 
    {
        "content": "quote: Originally posted by godawgz: What I think we've lost sight of is that a guaranteed retirement is nowhere in the constitution. from the gov't side it's a self-repeating ponzi,from the corporate side it's a way to attract recruits.. no more, no less.. when you invest your SSI taxes with the gov't, or your time and energy with a company, you need to handle it as you would any other investment: returns may vary and carry a significant possibility of loss. That's all well and good, but they should have to TELL you that. Loud and clear. So far, that kind of transparency just ain't around. When I first got hired in 1974, I was overwhelmed with the impression that I didn't have to worry my little head about anything, cuz I worked for this awesome company who was taking care of ALL that. Within a couple of decades, without feeling too obliged to explain much or justify their actions, we went from having a defined benefit plan, to an ESOP hybrid (100% company stock, of course); but, with a separate 401k thrown in, for good measure. But the 401k, of course, was \"just for fun\". It was just something in there to make our already cool pension.... even nicer. Nobody ever explained to us that we might have to rely on the 401k savings exclusively, or that company stock could drop from $70 a share to $6 in a few month's time. In fact, we were even told that the ups and downs of the stock market would affect our pensions... not at all. Guess they had some magical way of doing that. Only a bad employee would question it. I still have the company propaganda tucked away somewhere in my files, just to reassure myself that I didn't make that up. So since they didn't seem to take it seriously, neither did I. I kind of wish now I had ignored them all, and just put my money in a regular passbook savings. By the time you lose your a$$ ten times in your 401k and finally get it all back... are you getting ahead? When the market is up, it's fun, but it’s sort of a fool’s paradise.", 
        "intTime": 20090511, 
        "postID": 12, 
        "quote": "Originally posted by godawgz: What I think we've lost sight of is that a guaranteed retirement is nowhere in the constitution. from the gov't side it's a self-repeating ponzi,from the corporate side it's a way to attract recruits.. no more, no less.. when you invest your SSI taxes with the gov't, or your time and energy with a company, you need to handle it as you would any other investment: returns may vary and carry a significant possibility of loss.", 
        "reply": " That's all well and good, but they should have to TELL you that. Loud and clear. So far, that kind of transparency just ain't around. When I first got hired in 1974, I was overwhelmed with the impression that I didn't have to worry my little head about anything, cuz I worked for this awesome company who was taking care of ALL that. Within a couple of decades, without feeling too obliged to explain much or justify their actions, we went from having a defined benefit plan, to an ESOP hybrid (100% company stock, of course); but, with a separate 401k thrown in, for good measure. But the 401k, of course, was \"just for fun\". It was just something in there to make our already cool pension.... even nicer. Nobody ever explained to us that we might have to rely on the 401k savings exclusively, or that company stock could drop from $70 a share to $6 in a few month's time. In fact, we were even told that the ups and downs of the stock market would affect our pensions... not at all. Guess they had some magical way of doing that. Only a bad employee would question it. I still have the company propaganda tucked away somewhere in my files, just to reassure myself that I didn't make that up. So since they didn't seem to take it seriously, neither did I. I kind of wish now I had ignored them all, and just put my money in a regular passbook savings. By the time you lose your a$$ ten times in your 401k and finally get it all back... are you getting ahead? When the market is up, it's fun, but it’s sort of a fool’s paradise.", 
        "threadID": "672198221_7230010322001", 
        "time": "2009-05-11 09:38:00", 
        "title": "How do you all like the new change and hope now?", 
        "userID": "OrangeCat97"
    }, 
    {
        "content": "It's OK, OBAM already stimmed the corporate big wig pensions, be shure that ya'll hold your breath till Obam puts some stim money in for ya'll!", 
        "intTime": 20090511, 
        "postID": 13, 
        "quote": "", 
        "reply": "It's OK, OBAM already stimmed the corporate big wig pensions, be shure that ya'll hold your breath till Obam puts some stim money in for ya'll!", 
        "threadID": "672198221_7230010322001", 
        "time": "2009-05-11 09:53:00", 
        "title": "How do you all like the new change and hope now?", 
        "userID": "EAG154"
    }, 
    {
        "content": "quote: stim money Stim money my a$$. By the time I've been downsized, upsized, and sidewayssized, I've probably lost at least $120,000 in wages over the last ten years. $600 is sad and paltry. What's that supposed to do?", 
        "intTime": 20090511, 
        "postID": 14, 
        "quote": "stim money", 
        "reply": " Stim money my a$$. By the time I've been downsized, upsized, and sidewayssized, I've probably lost at least $120,000 in wages over the last ten years. $600 is sad and paltry. What's that supposed to do?", 
        "threadID": "672198221_7230010322001", 
        "time": "2009-05-11 09:57:00", 
        "title": "How do you all like the new change and hope now?", 
        "userID": "OrangeCat97"
    }, 
    {
        "content": "I love the change. Keep it coming. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090511, 
        "postID": 15, 
        "quote": "", 
        "reply": "I love the change. Keep it coming. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_7230010322001", 
        "time": "2009-05-11 10:25:00", 
        "title": "How do you all like the new change and hope now?", 
        "userID": "jack_flats"
    }, 
    {
        "content": "Firewood is still a good investment. In the early seventies it cost $50.00/cord, cut and delivered. Today, almost 40 years later (what a deal!) only $125.00 per. My current supply will keep me and my babe in heat for the next 5 years.", 
        "intTime": 20090511, 
        "postID": 16, 
        "quote": "", 
        "reply": "Firewood is still a good investment. In the early seventies it cost $50.00/cord, cut and delivered. Today, almost 40 years later (what a deal!) only $125.00 per. My current supply will keep me and my babe in heat for the next 5 years.", 
        "threadID": "672198221_7230010322001", 
        "time": "2009-05-11 10:48:00", 
        "title": "How do you all like the new change and hope now?", 
        "userID": "SemperSignsdotcom"
    }, 
    {
        "content": "You mean there has been change? Where? I suppose we could consider the messed up economy change couldn't we? Was that what he means by hope and change?", 
        "intTime": 20090511, 
        "postID": 17, 
        "quote": "", 
        "reply": "You mean there has been change? Where? I suppose we could consider the messed up economy change couldn't we? Was that what he means by hope and change?", 
        "threadID": "672198221_7230010322001", 
        "time": "2009-05-11 10:54:00", 
        "title": "How do you all like the new change and hope now?", 
        "userID": "fishnfanatic"
    }, 
    {
        "content": "I don't drink and I've never done drugs and I've given up gambling and gave up cigarettes. The other night I stepped outside and suddenly saw a bright light shining down on me. I thought, maybe I'm being taken up in Heaven, but then I remembered I have a motion detector light. That's what has changed. I forget things. Everything else still sucks.", 
        "intTime": 20090511, 
        "postID": 18, 
        "quote": "", 
        "reply": "I don't drink and I've never done drugs and I've given up gambling and gave up cigarettes. The other night I stepped outside and suddenly saw a bright light shining down on me. I thought, maybe I'm being taken up in Heaven, but then I remembered I have a motion detector light. That's what has changed. I forget things. Everything else still sucks.", 
        "threadID": "672198221_7230010322001", 
        "time": "2009-05-11 18:19:00", 
        "title": "How do you all like the new change and hope now?", 
        "userID": "OneThreeMarine"
    }, 
    {
        "content": "quote: Originally posted by SemperSignsdotcom: Firewood is still a good investment. In the early seventies it cost $50.00/cord, cut and delivered. Today, almost 40 years later (what a deal!) only $125.00 per. My current supply will keep me and my babe in heat for the next 5 years. Not when you get your Carbon Credit Tax it won't be Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090511, 
        "postID": 19, 
        "quote": "Originally posted by SemperSignsdotcom: Firewood is still a good investment. In the early seventies it cost $50.00/cord, cut and delivered. Today, almost 40 years later (what a deal!) only $125.00 per. My current supply will keep me and my babe in heat for the next 5 years.", 
        "reply": " Not when you get your Carbon Credit Tax it won't be Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_7230010322001", 
        "time": "2009-05-11 18:36:00", 
        "title": "How do you all like the new change and hope now?", 
        "userID": "L0A1"
    }, 
    {
        "content": "Chuckles, continued ~ Thanks for the 'minder. Yup, more money for Al Gore and his cheat minded sumb!t@hes. break, break What me worry? No. But, yes, my yard, once upon a time, was investigated by air---3x by 3 different A/C, all in 2 days: one was a black helo, another was by a low flying monoplane 50' above the ground (illegal if i flew like that!), inbetwixt 2 Doug Fir tree lines. Speaking of Marine KC-130s, Henry (Bud) Wildfang, USMC C-130 pilot emeritus, awardee of the Navy's Gray Eagle Trophy: “The Venerable Order of the Gray Eagle. The Most Ancient Naval Aviator on Active Duty. In recognition of a clear eye, a stout heart, a steady hand, and a daring defiance of gravity and the law of averages.” ..has the most flight hours of any of us transporters. He turns 93 this month. There's still hope, given all this Obama, Bush (et al [illuminati?]) crap. His mother died a couple of years ago at 107. He, too is from North Dakota. Where if you die in winter, you must hang around a little longer to be buried---after spring thaw when digging is easier than pounding rock.", 
        "intTime": 20090511, 
        "postID": 20, 
        "quote": "", 
        "reply": "Chuckles, continued ~ Thanks for the 'minder. Yup, more money for Al Gore and his cheat minded sumb!t@hes. break, break What me worry? No. But, yes, my yard, once upon a time, was investigated by air---3x by 3 different A/C, all in 2 days: one was a black helo, another was by a low flying monoplane 50' above the ground (illegal if i flew like that!), inbetwixt 2 Doug Fir tree lines. Speaking of Marine KC-130s, Henry (Bud) Wildfang, USMC C-130 pilot emeritus, awardee of the Navy's Gray Eagle Trophy: “The Venerable Order of the Gray Eagle. The Most Ancient Naval Aviator on Active Duty. In recognition of a clear eye, a stout heart, a steady hand, and a daring defiance of gravity and the law of averages.” ..has the most flight hours of any of us transporters. He turns 93 this month. There's still hope, given all this Obama, Bush (et al [illuminati?]) crap. His mother died a couple of years ago at 107. He, too is from North Dakota. Where if you die in winter, you must hang around a little longer to be buried---after spring thaw when digging is easier than pounding rock.", 
        "threadID": "672198221_7230010322001", 
        "time": "2009-05-11 19:32:00", 
        "title": "How do you all like the new change and hope now?", 
        "userID": "SemperSignsdotcom"
    }, 
    {
        "content": "Good Morning America how are you? More large companies are putting a freeze on pensions. Found this one on the front page of USA Today. The number of companies that have frozen their traditional pension plans has accelerated sharply this year, a trend that will likely continue as companies wrestle with declining profits and poor investment returns. At least 16 companies have announced plans to freeze their pensions so far this year, vs. 18 for all of 2008. Last week, Wells Fargo told its employees that their pension plans will stop accruing benefits July 1. When a pension is frozen, employees get to keep the benefits they've already earned, but the company usually won't contribute any more money. Older employees are particularly hard hit because they have less time to make up for the loss, says Nancy Hwa, spokeswoman for the Pension Rights Center. Severe investment losses in 2008 shrank the assets of the nation's largest pension plans to 79% of projected liabilities, down from 109% at the end of 2007, according to an analysis by Watson Wyatt. Companies, already hurting in the weak economy, have to increase contributions to make up the difference, and are facing stricter federal requirements about funding the plans. More companies will freeze their pension plans unless Congress temporarily relaxes the funding requirements, says Dena Battle, director of tax policy for the National Association of Manufacturers. \"When your funding obligations triple and you don't have the cash to deal with that and you don't get relief from Congress, you have to make hard choices,\" she says. FIND MORE STORIES IN: United States House of Representatives | Wells Fargo | National Association of Manufacturers | Watson Wyatt Worldwide Pension-rights advocates and some lawmakers support giving relief only to companies that agree not to freeze their plans. \"Congress will be hesitant to provide pension fund relief without assurance that employers would protect benefits of rank-and-file employees and not divert funding relief to other uses,\" such as corporate bonuses, says Sandra Salstrom, a spokeswoman for Rep. Earl Pomeroy, D-N.D., who is drafting a pension relief bill. Battle says many plan sponsors would reject relief on those terms. The employer-sponsored retirement system, \"has always been voluntary,\" she says. \"We work very hard to preserve that.\"", 
        "intTime": 20090511, 
        "postID": 21, 
        "quote": "", 
        "reply": "Good Morning America how are you? More large companies are putting a freeze on pensions. Found this one on the front page of USA Today. The number of companies that have frozen their traditional pension plans has accelerated sharply this year, a trend that will likely continue as companies wrestle with declining profits and poor investment returns. At least 16 companies have announced plans to freeze their pensions so far this year, vs. 18 for all of 2008. Last week, Wells Fargo told its employees that their pension plans will stop accruing benefits July 1. When a pension is frozen, employees get to keep the benefits they've already earned, but the company usually won't contribute any more money. Older employees are particularly hard hit because they have less time to make up for the loss, says Nancy Hwa, spokeswoman for the Pension Rights Center. Severe investment losses in 2008 shrank the assets of the nation's largest pension plans to 79% of projected liabilities, down from 109% at the end of 2007, according to an analysis by Watson Wyatt. Companies, already hurting in the weak economy, have to increase contributions to make up the difference, and are facing stricter federal requirements about funding the plans. More companies will freeze their pension plans unless Congress temporarily relaxes the funding requirements, says Dena Battle, director of tax policy for the National Association of Manufacturers. \"When your funding obligations triple and you don't have the cash to deal with that and you don't get relief from Congress, you have to make hard choices,\" she says. FIND MORE STORIES IN: United States House of Representatives | Wells Fargo | National Association of Manufacturers | Watson Wyatt Worldwide Pension-rights advocates and some lawmakers support giving relief only to companies that agree not to freeze their plans. \"Congress will be hesitant to provide pension fund relief without assurance that employers would protect benefits of rank-and-file employees and not divert funding relief to other uses,\" such as corporate bonuses, says Sandra Salstrom, a spokeswoman for Rep. Earl Pomeroy, D-N.D., who is drafting a pension relief bill. Battle says many plan sponsors would reject relief on those terms. The employer-sponsored retirement system, \"has always been voluntary,\" she says. \"We work very hard to preserve that.\"", 
        "threadID": "672198221_7230010322001", 
        "time": "2009-05-11 03:14:00", 
        "title": "How do you all like the new change and hope now?", 
        "userID": "Duster6"
    }, 
    {
        "content": "Hmmm.....let the \"free market\" freeze pensions that they agreed to pay or \"socialize\" the pensions...tough call... but on the bright side I'm sure it will be easy to be outraged no matter what happens! have fun!", 
        "intTime": 20090511, 
        "postID": 22, 
        "quote": "", 
        "reply": "Hmmm.....let the \"free market\" freeze pensions that they agreed to pay or \"socialize\" the pensions...tough call... but on the bright side I'm sure it will be easy to be outraged no matter what happens! have fun!", 
        "threadID": "672198221_7230010322001", 
        "time": "2009-05-11 03:20:00", 
        "title": "How do you all like the new change and hope now?", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: More companies will freeze their pension plans unless Congress temporarily relaxes the funding requirements In other words, the companies want to return to the \"good ol' days\" when they were allowed to deliberately underfund their pension liabilities with the promise that it would be there when it was needed. They've been allowed to get away with that scam since the Reagan era. Now, not suprisingly, when it's time to pay up, they don't have the money. Gee, who coulda seen that coming? But, don't worry...their bought and paid for toadies in Congress have already dealt with that problem: They'll shift their pension liabilities off on YOU, Mr and Mrs Taxpayer, via the Pension Benefit Guaranty Corporation and you retirees will be lucky to get 50 cents on the dollar.", 
        "intTime": 20090511, 
        "postID": 23, 
        "quote": "More companies will freeze their pension plans unless Congress temporarily relaxes the funding requirements", 
        "reply": " In other words, the companies want to return to the \"good ol' days\" when they were allowed to deliberately underfund their pension liabilities with the promise that it would be there when it was needed. They've been allowed to get away with that scam since the Reagan era. Now, not suprisingly, when it's time to pay up, they don't have the money. Gee, who coulda seen that coming? But, don't worry...their bought and paid for toadies in Congress have already dealt with that problem: They'll shift their pension liabilities off on YOU, Mr and Mrs Taxpayer, via the Pension Benefit Guaranty Corporation and you retirees will be lucky to get 50 cents on the dollar.", 
        "threadID": "672198221_7230010322001", 
        "time": "2009-05-11 04:26:00", 
        "title": "How do you all like the new change and hope now?", 
        "userID": "stillkit"
    }, 
    {
        "content": "Unless the corporations in question are pending bankruptcy, in which case unfunded pensions will get first dibs over secured loans, a la Chrysler... wonder what that approach means to folks privately funding their own personal pensions with corporate equity and debt issues?", 
        "intTime": 20090511, 
        "postID": 24, 
        "quote": "", 
        "reply": "Unless the corporations in question are pending bankruptcy, in which case unfunded pensions will get first dibs over secured loans, a la Chrysler... wonder what that approach means to folks privately funding their own personal pensions with corporate equity and debt issues?", 
        "threadID": "672198221_7230010322001", 
        "time": "2009-05-11 05:16:00", 
        "title": "How do you all like the new change and hope now?", 
        "userID": "godawgz"
    }, 
    {
        "content": "I'm surprised some people even are lucky enough to still get pensions.", 
        "intTime": 20090511, 
        "postID": 25, 
        "quote": "", 
        "reply": "I'm surprised some people even are lucky enough to still get pensions.", 
        "threadID": "672198221_7230010322001", 
        "time": "2009-05-11 06:09:00", 
        "title": "How do you all like the new change and hope now?", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "I say confiscate the assets of the criminal right wing extremist thugs that stole and embezzled the money in the first place. I do not have any thing against acquiring wealth honestly and ethically but these criminals just stole the money. Put the criminals in prison and their assets in a retirement fund for the good honest people who spent all of their life working.", 
        "intTime": 20090511, 
        "postID": 26, 
        "quote": "", 
        "reply": "I say confiscate the assets of the criminal right wing extremist thugs that stole and embezzled the money in the first place. I do not have any thing against acquiring wealth honestly and ethically but these criminals just stole the money. Put the criminals in prison and their assets in a retirement fund for the good honest people who spent all of their life working.", 
        "threadID": "672198221_7230010322001", 
        "time": "2009-05-11 06:18:00", 
        "title": "How do you all like the new change and hope now?", 
        "userID": "6837602"
    }, 
    {
        "content": "quote: Originally posted by stillkit: quote: More companies will freeze their pension plans unless Congress temporarily relhttp://forums.military.com/groupee_common/platform_images/blank.gifaxes the funding requirements But, don't worry...their bought and paid for toadies in Congress have already dealt with that problem: They'll shift their pension liabilities off on YOU, Mr and Mrs Taxpayer, via the Pension Benefit Guaranty Corporation and you retirees will be lucky to get 50 cents on the dollar. .....gee granddad only got a watch to keep track of the time left to live poor.... Already past the future", 
        "intTime": 20090511, 
        "postID": 27, 
        "quote": "Originally posted by stillkit: quote: More companies will freeze their pension plans unless Congress temporarily relhttp://forums.military.com/groupee_common/platform_images/blank.gifaxes the funding requirements But, don't worry...their bought and paid for toadies in Congress have already dealt with that problem: They'll shift their pension liabilities off on YOU, Mr and Mrs Taxpayer, via the Pension Benefit Guaranty Corporation and you retirees will be lucky to get 50 cents on the dollar.", 
        "reply": " .....gee granddad only got a watch to keep track of the time left to live poor.... Already past the future", 
        "threadID": "672198221_7230010322001", 
        "time": "2009-05-11 06:21:00", 
        "title": "How do you all like the new change and hope now?", 
        "userID": "6486143"
    }, 
    {
        "content": "Wonder how Pelosi and \"the gang\" are going to get the retirement taxes from the people that got screwed on their pensions? I guess the illegals will be supported by yet \"another\" tax created by Congress or Gore. With the Civil Service program, expected to reach over 3 million, and the Civil Defense Force being increased another 75 thousand...the money has to come from somewhere. We are paying for our own police state, at the expense of protecting the crooks in Washington. They plan on increasing taxes on retirement, and have the gall to reinstate the death tax.", 
        "intTime": 20090511, 
        "postID": 28, 
        "quote": "", 
        "reply": "Wonder how Pelosi and \"the gang\" are going to get the retirement taxes from the people that got screwed on their pensions? I guess the illegals will be supported by yet \"another\" tax created by Congress or Gore. With the Civil Service program, expected to reach over 3 million, and the Civil Defense Force being increased another 75 thousand...the money has to come from somewhere. We are paying for our own police state, at the expense of protecting the crooks in Washington. They plan on increasing taxes on retirement, and have the gall to reinstate the death tax.", 
        "threadID": "672198221_7230010322001", 
        "time": "2009-05-11 06:39:00", 
        "title": "How do you all like the new change and hope now?", 
        "userID": "steelthunder"
    }, 
    {
        "content": "quote: Originally posted by steelthunder: Wonder how Pelosi and \"the gang\" are going to get the retirement taxes from the people that got screwed on their pensions? I guess the illegals will be supported by yet \"another\" tax created by Congress or Gore. With the Civil Service program, expected to reach over 3 million, and the Civil Defense Force being increased another 75 thousand...the money has to come from somewhere. We are paying for our own police state, at the expense of protecting the crooks in Washington. They plan on increasing taxes on retirement, and have the gall to reinstate the death tax. I wonder if it will be as much as W gets? George H.W. Bush U.S.G Pension: $191,300 Not saying either is right, but to use this as a \"partisan slam\" just on Pelosi and \"the gang\" without including ALL the Kings and Queens (including the repubs) in the playing field is not exactly being outfront and truthful. Obama followed in Ws foot steps even at one point with a recommendatioon from W that we needed to bailout these companies. To not include W in all of this is again, not loggical and just pure partisan hogwash.", 
        "intTime": 20090511, 
        "postID": 29, 
        "quote": "Originally posted by steelthunder: Wonder how Pelosi and \"the gang\" are going to get the retirement taxes from the people that got screwed on their pensions? I guess the illegals will be supported by yet \"another\" tax created by Congress or Gore. With the Civil Service program, expected to reach over 3 million, and the Civil Defense Force being increased another 75 thousand...the money has to come from somewhere. We are paying for our own police state, at the expense of protecting the crooks in Washington. They plan on increasing taxes on retirement, and have the gall to reinstate the death tax.", 
        "reply": " I wonder if it will be as much as W gets? George H.W. Bush U.S.G Pension: $191,300 Not saying either is right, but to use this as a \"partisan slam\" just on Pelosi and \"the gang\" without including ALL the Kings and Queens (including the repubs) in the playing field is not exactly being outfront and truthful. Obama followed in Ws foot steps even at one point with a recommendatioon from W that we needed to bailout these companies. To not include W in all of this is again, not loggical and just pure partisan hogwash.", 
        "threadID": "672198221_7230010322001", 
        "time": "2009-05-11 07:46:00", 
        "title": "How do you all like the new change and hope now?", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "What I think we've lost sight of is that a guaranteed retirement is nowhere in the constitution. from the gov't side it's a self-repeating ponzi,from the corporate side it's a way to attract recruits.. no more, no less.. when you invest your SSI taxes with the gov't, or your time and energy with a company, you need to handle it as you would any other investment: returns may vary and carry a significant possibility of loss.", 
        "intTime": 20090511, 
        "postID": 30, 
        "quote": "", 
        "reply": "What I think we've lost sight of is that a guaranteed retirement is nowhere in the constitution. from the gov't side it's a self-repeating ponzi,from the corporate side it's a way to attract recruits.. no more, no less.. when you invest your SSI taxes with the gov't, or your time and energy with a company, you need to handle it as you would any other investment: returns may vary and carry a significant possibility of loss.", 
        "threadID": "672198221_7230010322001", 
        "time": "2009-05-11 08:27:00", 
        "title": "How do you all like the new change and hope now?", 
        "userID": "godawgz"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: I'm surprised some people even are lucky enough to still get pensions. Luck? Crap !!! Me, a self employed person is still working on his first. First quarter sales are down about a 1/3. But wait, there's hope. Obama's plan must be working: my April sales are only off about 26%. (Insert \"hack, cough\", here.) No savings this year---maybe never again in IRAs ..probably never more from me in any place the government can see and find.", 
        "intTime": 20090511, 
        "postID": 31, 
        "quote": "Originally posted by mrmixitup: I'm surprised some people even are lucky enough to still get pensions.", 
        "reply": " Luck? Crap !!! Me, a self employed person is still working on his first. First quarter sales are down about a 1/3. But wait, there's hope. Obama's plan must be working: my April sales are only off about 26%. (Insert \"hack, cough\", here.) No savings this year---maybe never again in IRAs ..probably never more from me in any place the government can see and find.", 
        "threadID": "672198221_7230010322001", 
        "time": "2009-05-11 09:03:00", 
        "title": "How do you all like the new change and hope now?", 
        "userID": "SemperSignsdotcom"
    }, 
    {
        "content": "quote: Originally posted by godawgz: What I think we've lost sight of is that a guaranteed retirement is nowhere in the constitution. from the gov't side it's a self-repeating ponzi,from the corporate side it's a way to attract recruits.. no more, no less.. when you invest your SSI taxes with the gov't, or your time and energy with a company, you need to handle it as you would any other investment: returns may vary and carry a significant possibility of loss. That's all well and good, but they should have to TELL you that. Loud and clear. So far, that kind of transparency just ain't around. When I first got hired in 1974, I was overwhelmed with the impression that I didn't have to worry my little head about anything, cuz I worked for this awesome company who was taking care of ALL that. Within a couple of decades, without feeling too obliged to explain much or justify their actions, we went from having a defined benefit plan, to an ESOP hybrid (100% company stock, of course); but, with a separate 401k thrown in, for good measure. But the 401k, of course, was \"just for fun\". It was just something in there to make our already cool pension.... even nicer. Nobody ever explained to us that we might have to rely on the 401k savings exclusively, or that company stock could drop from $70 a share to $6 in a few month's time. In fact, we were even told that the ups and downs of the stock market would affect our pensions... not at all. Guess they had some magical way of doing that. Only a bad employee would question it. I still have the company propaganda tucked away somewhere in my files, just to reassure myself that I didn't make that up. So since they didn't seem to take it seriously, neither did I. I kind of wish now I had ignored them all, and just put my money in a regular passbook savings. By the time you lose your a$$ ten times in your 401k and finally get it all back... are you getting ahead? When the market is up, it's fun, but it’s sort of a fool’s paradise.", 
        "intTime": 20090511, 
        "postID": 32, 
        "quote": "Originally posted by godawgz: What I think we've lost sight of is that a guaranteed retirement is nowhere in the constitution. from the gov't side it's a self-repeating ponzi,from the corporate side it's a way to attract recruits.. no more, no less.. when you invest your SSI taxes with the gov't, or your time and energy with a company, you need to handle it as you would any other investment: returns may vary and carry a significant possibility of loss.", 
        "reply": " That's all well and good, but they should have to TELL you that. Loud and clear. So far, that kind of transparency just ain't around. When I first got hired in 1974, I was overwhelmed with the impression that I didn't have to worry my little head about anything, cuz I worked for this awesome company who was taking care of ALL that. Within a couple of decades, without feeling too obliged to explain much or justify their actions, we went from having a defined benefit plan, to an ESOP hybrid (100% company stock, of course); but, with a separate 401k thrown in, for good measure. But the 401k, of course, was \"just for fun\". It was just something in there to make our already cool pension.... even nicer. Nobody ever explained to us that we might have to rely on the 401k savings exclusively, or that company stock could drop from $70 a share to $6 in a few month's time. In fact, we were even told that the ups and downs of the stock market would affect our pensions... not at all. Guess they had some magical way of doing that. Only a bad employee would question it. I still have the company propaganda tucked away somewhere in my files, just to reassure myself that I didn't make that up. So since they didn't seem to take it seriously, neither did I. I kind of wish now I had ignored them all, and just put my money in a regular passbook savings. By the time you lose your a$$ ten times in your 401k and finally get it all back... are you getting ahead? When the market is up, it's fun, but it’s sort of a fool’s paradise.", 
        "threadID": "672198221_7230010322001", 
        "time": "2009-05-11 09:38:00", 
        "title": "How do you all like the new change and hope now?", 
        "userID": "OrangeCat97"
    }, 
    {
        "content": "It's OK, OBAM already stimmed the corporate big wig pensions, be shure that ya'll hold your breath till Obam puts some stim money in for ya'll!", 
        "intTime": 20090511, 
        "postID": 33, 
        "quote": "", 
        "reply": "It's OK, OBAM already stimmed the corporate big wig pensions, be shure that ya'll hold your breath till Obam puts some stim money in for ya'll!", 
        "threadID": "672198221_7230010322001", 
        "time": "2009-05-11 09:53:00", 
        "title": "How do you all like the new change and hope now?", 
        "userID": "EAG154"
    }, 
    {
        "content": "quote: stim money Stim money my a$$. By the time I've been downsized, upsized, and sidewayssized, I've probably lost at least $120,000 in wages over the last ten years. $600 is sad and paltry. What's that supposed to do?", 
        "intTime": 20090511, 
        "postID": 34, 
        "quote": "stim money", 
        "reply": " Stim money my a$$. By the time I've been downsized, upsized, and sidewayssized, I've probably lost at least $120,000 in wages over the last ten years. $600 is sad and paltry. What's that supposed to do?", 
        "threadID": "672198221_7230010322001", 
        "time": "2009-05-11 09:57:00", 
        "title": "How do you all like the new change and hope now?", 
        "userID": "OrangeCat97"
    }, 
    {
        "content": "I love the change. Keep it coming. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090511, 
        "postID": 35, 
        "quote": "", 
        "reply": "I love the change. Keep it coming. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_7230010322001", 
        "time": "2009-05-11 10:25:00", 
        "title": "How do you all like the new change and hope now?", 
        "userID": "jack_flats"
    }, 
    {
        "content": "Firewood is still a good investment. In the early seventies it cost $50.00/cord, cut and delivered. Today, almost 40 years later (what a deal!) only $125.00 per. My current supply will keep me and my babe in heat for the next 5 years.", 
        "intTime": 20090511, 
        "postID": 36, 
        "quote": "", 
        "reply": "Firewood is still a good investment. In the early seventies it cost $50.00/cord, cut and delivered. Today, almost 40 years later (what a deal!) only $125.00 per. My current supply will keep me and my babe in heat for the next 5 years.", 
        "threadID": "672198221_7230010322001", 
        "time": "2009-05-11 10:48:00", 
        "title": "How do you all like the new change and hope now?", 
        "userID": "SemperSignsdotcom"
    }, 
    {
        "content": "You mean there has been change? Where? I suppose we could consider the messed up economy change couldn't we? Was that what he means by hope and change?", 
        "intTime": 20090511, 
        "postID": 37, 
        "quote": "", 
        "reply": "You mean there has been change? Where? I suppose we could consider the messed up economy change couldn't we? Was that what he means by hope and change?", 
        "threadID": "672198221_7230010322001", 
        "time": "2009-05-11 10:54:00", 
        "title": "How do you all like the new change and hope now?", 
        "userID": "fishnfanatic"
    }, 
    {
        "content": "I don't drink and I've never done drugs and I've given up gambling and gave up cigarettes. The other night I stepped outside and suddenly saw a bright light shining down on me. I thought, maybe I'm being taken up in Heaven, but then I remembered I have a motion detector light. That's what has changed. I forget things. Everything else still sucks.", 
        "intTime": 20090511, 
        "postID": 38, 
        "quote": "", 
        "reply": "I don't drink and I've never done drugs and I've given up gambling and gave up cigarettes. The other night I stepped outside and suddenly saw a bright light shining down on me. I thought, maybe I'm being taken up in Heaven, but then I remembered I have a motion detector light. That's what has changed. I forget things. Everything else still sucks.", 
        "threadID": "672198221_7230010322001", 
        "time": "2009-05-11 18:19:00", 
        "title": "How do you all like the new change and hope now?", 
        "userID": "OneThreeMarine"
    }, 
    {
        "content": "quote: Originally posted by SemperSignsdotcom: Firewood is still a good investment. In the early seventies it cost $50.00/cord, cut and delivered. Today, almost 40 years later (what a deal!) only $125.00 per. My current supply will keep me and my babe in heat for the next 5 years. Not when you get your Carbon Credit Tax it won't be Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090511, 
        "postID": 39, 
        "quote": "Originally posted by SemperSignsdotcom: Firewood is still a good investment. In the early seventies it cost $50.00/cord, cut and delivered. Today, almost 40 years later (what a deal!) only $125.00 per. My current supply will keep me and my babe in heat for the next 5 years.", 
        "reply": " Not when you get your Carbon Credit Tax it won't be Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_7230010322001", 
        "time": "2009-05-11 18:36:00", 
        "title": "How do you all like the new change and hope now?", 
        "userID": "L0A1"
    }, 
    {
        "content": "Chuckles, continued ~ Thanks for the 'minder. Yup, more money for Al Gore and his cheat minded sumb!t@hes. break, break What me worry? No. But, yes, my yard, once upon a time, was investigated by air---3x by 3 different A/C, all in 2 days: one was a black helo, another was by a low flying monoplane 50' above the ground (illegal if i flew like that!), inbetwixt 2 Doug Fir tree lines. Speaking of Marine KC-130s, Henry (Bud) Wildfang, USMC C-130 pilot emeritus, awardee of the Navy's Gray Eagle Trophy: “The Venerable Order of the Gray Eagle. The Most Ancient Naval Aviator on Active Duty. In recognition of a clear eye, a stout heart, a steady hand, and a daring defiance of gravity and the law of averages.” ..has the most flight hours of any of us transporters. He turns 93 this month. There's still hope, given all this Obama, Bush (et al [illuminati?]) crap. His mother died a couple of years ago at 107. He, too is from North Dakota. Where if you die in winter, you must hang around a little longer to be buried---after spring thaw when digging is easier than pounding rock.", 
        "intTime": 20090511, 
        "postID": 40, 
        "quote": "", 
        "reply": "Chuckles, continued ~ Thanks for the 'minder. Yup, more money for Al Gore and his cheat minded sumb!t@hes. break, break What me worry? No. But, yes, my yard, once upon a time, was investigated by air---3x by 3 different A/C, all in 2 days: one was a black helo, another was by a low flying monoplane 50' above the ground (illegal if i flew like that!), inbetwixt 2 Doug Fir tree lines. Speaking of Marine KC-130s, Henry (Bud) Wildfang, USMC C-130 pilot emeritus, awardee of the Navy's Gray Eagle Trophy: “The Venerable Order of the Gray Eagle. The Most Ancient Naval Aviator on Active Duty. In recognition of a clear eye, a stout heart, a steady hand, and a daring defiance of gravity and the law of averages.” ..has the most flight hours of any of us transporters. He turns 93 this month. There's still hope, given all this Obama, Bush (et al [illuminati?]) crap. His mother died a couple of years ago at 107. He, too is from North Dakota. Where if you die in winter, you must hang around a little longer to be buried---after spring thaw when digging is easier than pounding rock.", 
        "threadID": "672198221_7230010322001", 
        "time": "2009-05-11 19:32:00", 
        "title": "How do you all like the new change and hope now?", 
        "userID": "SemperSignsdotcom"
    }
]