[
    {
        "content": "And yet another update: Obama manages to get other NATO nations to commit 5,000 new military trainers and police to the Afghanistan front alongside the further 21,000 US forces he is committing there, IIRC, since he did emphasize in one of his speeches in Europe just this past week about how America must not shoulder the burden of Afghanistan alone. ++http://news.yahoo.com/s/ap/20090404/ap_on_go_pr_wh/eu_obama quote: Obama hails 5,000 more NATO forces for Afghanistan By TOM RAUM, Associated Press Writer Tom Raum, Associated Press Writer 1 hr 3 mins ago STRASBOURG, France – President Barack Obama hailed \"strong and unanimous support\" from NATO allies on Saturday for his stepped-up anti-terror strategy in Afghanistan and Pakistan and welcomed their \"down payment\" promises of 5,000 fresh forces. The allies rebuffed U.S. appeals for more combat forces to join the war, but the backing Obama did gain at a European summit allowed him to claim an early victory on the world's foreign policy stage. NATO allies agreed to send up to 5,000 more military trainers and police to Afghanistan, including forces to help protect candidates and voters at upcoming elections. Obama called that \"a strong down payment\" on both Afghanistan and NATO itself at the end of a gathering celebrating the 60th anniversary of the North Atlantic Treaty Organization. He waved off questions on whether the size and makeup of the commitments were disappointing in light of an anti-terrorism struggle he himself portrayed as daunting. Since becoming president, Obama has begun switching America's anti-terror emphasis to fighting al-Qaida in the Afghanistan-Pakistan area as the war in Iraq winds down. The new president insisted that \"terrorists threaten every member of NATO,\" but he also... (...) Among countries resisting U.S. appeals for more combat troops were France, which on Saturday rejoined the alliance as a full military partner after decades of being a nonmilitary member, and Germany. Obama weighed in on a controversial new law in Afghanistan, his remarks underscoring his administration's shift away from a U.S. focus on building democracy in the country. Asked about the law, which a United Nations agency says makes it legal for men to rape their wives, Obama called it \"abhorrent.\" He also noted that Afghan President Hamid Karzai has said the law will be studied and possibly sent back to parliament for review — and that the NATO conference's closing statement specifically states that human rights should be respected. But Obama said pointedly that, while improving conditions in Afghanistan is a commendable goal, people need to remember that the primary reason U.S. troops are fighting there is to protect Americans at home from terrorist attacks. As for new troops, the White House said NATO countries agreed to send more personnel, including about 3,000 on short-term deployments, to help stabilize Afghanistan before elections in August. An additional 1,400 to 2,000 will provide training for Afghanistan's national army. Obama said those figures should not be considered a ceiling, suggesting more could be sought and offered at some point to confront a threat that he emphasized endangers Europe as well as the U.S. \"We'll need more resources and a sustained effort to achieve our ultimate goals,\" he said. Obama's national security adviser, retired Marine Corps Gen. James Jones, said the additional training commitments are a crucial piece of the puzzle. As NATO's top military chief from 2003-2006, Jones said he had asked for this to be pursued aggressively but that his requests were always rejected. (...) Last week, Gen. David Petraeus, head of the U.S. Central Command and architect of the new military strategy, told Congress that the White House will soon be mulling a request for 10,000 more American troops to be deployed in Afghanistan next year — a blunt acknowledgment that the U.S. will continue to take the brunt of the fighting and casualties. Still, Petraeus carefully acknowledged that more civilian aid — along the lines of NATO's new commitment emerging from the summit — was also critical. Along with the divide over troops and money, the Europeans have also long been reluctant to accept the U.S. view that al-Qaida and, to a lesser extent, the Taliban, remain a threat to the existence of democratic societies. The war in Afghanistan more and more is looking like an American war, and the U.S. will continue to do the bulk of the heavy lifting even with the new NATO pledges. Since Obama took office in January, the United States has committed to sending 21,000 additional troops as part of his new strategy. Obama left the summit for Prague, where he will meet with Czech President Vaclav Klaus and Prime Minister Mirek Topolanek, and give a speech expected to focus on weapons proliferation. Then he visits Turkey, his first Muslim country as president, with stops in both the capital of Ankara and Istanbul before returning to Washington next Tuesday. This message has been edited. Last edited by: Canuck_Centaur, Sat 04 April 2009 03:55 PM", 
        "intTime": 20090404, 
        "postID": 1, 
        "quote": "Obama hails 5,000 more NATO forces for Afghanistan By TOM RAUM, Associated Press Writer Tom Raum, Associated Press Writer 1 hr 3 mins ago STRASBOURG, France – President Barack Obama hailed \"strong and unanimous support\" from NATO allies on Saturday for his stepped-up anti-terror strategy in Afghanistan and Pakistan and welcomed their \"down payment\" promises of 5,000 fresh forces. The allies rebuffed U.S. appeals for more combat forces to join the war, but the backing Obama did gain at a European summit allowed him to claim an early victory on the world's foreign policy stage. NATO allies agreed to send up to 5,000 more military trainers and police to Afghanistan, including forces to help protect candidates and voters at upcoming elections. Obama called that \"a strong down payment\" on both Afghanistan and NATO itself at the end of a gathering celebrating the 60th anniversary of the North Atlantic Treaty Organization. He waved off questions on whether the size and makeup of the commitments were disappointing in light of an anti-terrorism struggle he himself portrayed as daunting. Since becoming president, Obama has begun switching America's anti-terror emphasis to fighting al-Qaida in the Afghanistan-Pakistan area as the war in Iraq winds down. The new president insisted that \"terrorists threaten every member of NATO,\" but he also... (...) Among countries resisting U.S. appeals for more combat troops were France, which on Saturday rejoined the alliance as a full military partner after decades of being a nonmilitary member, and Germany. Obama weighed in on a controversial new law in Afghanistan, his remarks underscoring his administration's shift away from a U.S. focus on building democracy in the country. Asked about the law, which a United Nations agency says makes it legal for men to rape their wives, Obama called it \"abhorrent.\" He also noted that Afghan President Hamid Karzai has said the law will be studied and possibly sent back to parliament for review — and that the NATO conference's closing statement specifically states that human rights should be respected. But Obama said pointedly that, while improving conditions in Afghanistan is a commendable goal, people need to remember that the primary reason U.S. troops are fighting there is to protect Americans at home from terrorist attacks. As for new troops, the White House said NATO countries agreed to send more personnel, including about 3,000 on short-term deployments, to help stabilize Afghanistan before elections in August. An additional 1,400 to 2,000 will provide training for Afghanistan's national army. Obama said those figures should not be considered a ceiling, suggesting more could be sought and offered at some point to confront a threat that he emphasized endangers Europe as well as the U.S. \"We'll need more resources and a sustained effort to achieve our ultimate goals,\" he said. Obama's national security adviser, retired Marine Corps Gen. James Jones, said the additional training commitments are a crucial piece of the puzzle. As NATO's top military chief from 2003-2006, Jones said he had asked for this to be pursued aggressively but that his requests were always rejected. (...) Last week, Gen. David Petraeus, head of the U.S. Central Command and architect of the new military strategy, told Congress that the White House will soon be mulling a request for 10,000 more American troops to be deployed in Afghanistan next year — a blunt acknowledgment that the U.S. will continue to take the brunt of the fighting and casualties. Still, Petraeus carefully acknowledged that more civilian aid — along the lines of NATO's new commitment emerging from the summit — was also critical. Along with the divide over troops and money, the Europeans have also long been reluctant to accept the U.S. view that al-Qaida and, to a lesser extent, the Taliban, remain a threat to the existence of democratic societies. The war in Afghanistan more and more is looking like an American war, and the U.S. will continue to do the bulk of the heavy lifting even with the new NATO pledges. Since Obama took office in January, the United States has committed to sending 21,000 additional troops as part of his new strategy. Obama left the summit for Prague, where he will meet with Czech President Vaclav Klaus and Prime Minister Mirek Topolanek, and give a speech expected to focus on weapons proliferation. Then he visits Turkey, his first Muslim country as president, with stops in both the capital of Ankara and Istanbul before returning to Washington next Tuesday.", 
        "reply": "And yet another update: Obama manages to get other NATO nations to commit 5,000 new military trainers and police to the Afghanistan front alongside the further 21,000 US forces he is committing there, IIRC, since he did emphasize in one of his speeches in Europe just this past week about how America must not shoulder the burden of Afghanistan alone. ++http://news.yahoo.com/s/ap/20090404/ap_on_go_pr_wh/eu_obama  This message has been edited. Last edited by: Canuck_Centaur, Sat 04 April 2009 03:55 PM", 
        "threadID": "672198221_4870038912001", 
        "time": "2009-04-04 13:27:00", 
        "title": "Obama gets NATO to send 5,000 more mil.trainers&police to Afghanistan", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "Woo-hoo! Let's hear it for our Dear Leader and vegetables! Woo-hoo!! \"The World's Finest\"", 
        "intTime": 20090404, 
        "postID": 2, 
        "quote": "", 
        "reply": "Woo-hoo! Let's hear it for our Dear Leader and vegetables! Woo-hoo!! \"The World's Finest\"", 
        "threadID": "672198221_4870038912001", 
        "time": "2009-04-04 13:33:00", 
        "title": "Obama gets NATO to send 5,000 more mil.trainers&police to Afghanistan", 
        "userID": "Kegler300"
    }, 
    {
        "content": "Hey, its better than nothing more, which is what GWB has gotten in the last few years..", 
        "intTime": 20090404, 
        "postID": 3, 
        "quote": "", 
        "reply": "Hey, its better than nothing more, which is what GWB has gotten in the last few years..", 
        "threadID": "672198221_4870038912001", 
        "time": "2009-04-04 13:59:00", 
        "title": "Obama gets NATO to send 5,000 more mil.trainers&police to Afghanistan", 
        "userID": "s122604"
    }, 
    {
        "content": "good.", 
        "intTime": 20090404, 
        "postID": 4, 
        "quote": "", 
        "reply": "good.", 
        "threadID": "672198221_4870038912001", 
        "time": "2009-04-04 14:02:00", 
        "title": "Obama gets NATO to send 5,000 more mil.trainers&police to Afghanistan", 
        "userID": "godawgz"
    }, 
    {
        "content": "quote: Obama hails 5,000 more NATO forces for Afghanistan CORRECTION... Teleprompter hails 5,000 more NATO forces for Afghanistan. C.R.", 
        "intTime": 20090404, 
        "postID": 5, 
        "quote": "Obama hails 5,000 more NATO forces for Afghanistan", 
        "reply": " CORRECTION... Teleprompter hails 5,000 more NATO forces for Afghanistan. C.R.", 
        "threadID": "672198221_4870038912001", 
        "time": "2009-04-04 14:09:00", 
        "title": "Obama gets NATO to send 5,000 more mil.trainers&police to Afghanistan", 
        "userID": "CYCLIC_RUNAWAY"
    }, 
    {
        "content": "quote: Originally posted by CYCLIC_RUNAWAY: quote: Obama hails 5,000 more NATO forces for Afghanistan CORRECTION... Teleprompter hails 5,000 more NATO forces for Afghanistan. C.R. Lead, follow, or get the H&ll out of the way!", 
        "intTime": 20090404, 
        "postID": 6, 
        "quote": "Originally posted by CYCLIC_RUNAWAY: quote: Obama hails 5,000 more NATO forces for Afghanistan CORRECTION... Teleprompter hails 5,000 more NATO forces for Afghanistan. C.R.", 
        "reply": " Lead, follow, or get the H&ll out of the way!", 
        "threadID": "672198221_4870038912001", 
        "time": "2009-04-04 14:48:00", 
        "title": "Obama gets NATO to send 5,000 more mil.trainers&police to Afghanistan", 
        "userID": "Motive25"
    }, 
    {
        "content": "You can say hell, we won't mind", 
        "intTime": 20090404, 
        "postID": 7, 
        "quote": "", 
        "reply": "You can say hell, we won't mind", 
        "threadID": "672198221_4870038912001", 
        "time": "2009-04-04 14:58:00", 
        "title": "Obama gets NATO to send 5,000 more mil.trainers&police to Afghanistan", 
        "userID": "godawgz"
    }, 
    {
        "content": "Lead, follow or get the hell out of the way! From the February 2008 files: \"ISAF forces have grown from 16,000 to 43,000 troops over two years, but commanders have been calling for another 7,500 troops to fight the resurgent Taliban, which has used bases in remote tribal areas of northern Pakistan to regroup\". my take on that is 27,000 troops were increase in those two years and not a word or praise of the leadership of NATO. March 18, 2009 Agence France-Presse \"NATO secretary general Jaap de Hoop Scheffer promised today to send extra troops to Afghanistan to safeguard upcoming presidential elections in the war-torn nation\". http://www.military.com/news/article/nato-vows-more-tro...&ESRC=topstories.RSS note the date, note the speaker, note the publication. Next you give Obama the credit for Easter Sunday. hahaha", 
        "intTime": 20090404, 
        "postID": 8, 
        "quote": "", 
        "reply": "Lead, follow or get the hell out of the way! From the February 2008 files: \"ISAF forces have grown from 16,000 to 43,000 troops over two years, but commanders have been calling for another 7,500 troops to fight the resurgent Taliban, which has used bases in remote tribal areas of northern Pakistan to regroup\". my take on that is 27,000 troops were increase in those two years and not a word or praise of the leadership of NATO. March 18, 2009 Agence France-Presse \"NATO secretary general Jaap de Hoop Scheffer promised today to send extra troops to Afghanistan to safeguard upcoming presidential elections in the war-torn nation\". http://www.military.com/news/article/nato-vows-more-tro...&ESRC=topstories.RSS note the date, note the speaker, note the publication. Next you give Obama the credit for Easter Sunday. hahaha", 
        "threadID": "672198221_4870038912001", 
        "time": "2009-04-04 15:39:00", 
        "title": "Obama gets NATO to send 5,000 more mil.trainers&police to Afghanistan", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: Originally posted by _cash_: The first time an IED kills a few of them......they'll pull out and go home. Maybe you should join Fox and crew? Their \"hilarious\" depiction of cowardly Canadians (on the same day that four Canadians got killed) could use your contribution. Yuk it up about people who risk their lives to contribute. I love a good laugh as well... Dave", 
        "intTime": 20090404, 
        "postID": 9, 
        "quote": "Originally posted by _cash_: The first time an IED kills a few of them......they'll pull out and go home.", 
        "reply": " Maybe you should join Fox and crew? Their \"hilarious\" depiction of cowardly Canadians (on the same day that four Canadians got killed) could use your contribution. Yuk it up about people who risk their lives to contribute. I love a good laugh as well... Dave", 
        "threadID": "672198221_4870038912001", 
        "time": "2009-04-04 17:35:00", 
        "title": "Obama gets NATO to send 5,000 more mil.trainers&police to Afghanistan", 
        "userID": "Grachus"
    }, 
    {
        "content": "Something is better than nothing, but this falls far short of what the administration was really hoping for from the Euros. Unfortunately, for the US.", 
        "intTime": 20090404, 
        "postID": 10, 
        "quote": "", 
        "reply": "Something is better than nothing, but this falls far short of what the administration was really hoping for from the Euros. Unfortunately, for the US.", 
        "threadID": "672198221_4870038912001", 
        "time": "2009-04-04 18:13:00", 
        "title": "Obama gets NATO to send 5,000 more mil.trainers&police to Afghanistan", 
        "userID": "RRR52"
    }, 
    {
        "content": "quote: Originally posted by Motive25: Lead, follow, or get the H&ll out of the way! Try it sometime.", 
        "intTime": 20090404, 
        "postID": 11, 
        "quote": "Originally posted by Motive25: Lead, follow, or get the H&ll out of the way!", 
        "reply": " Try it sometime.", 
        "threadID": "672198221_4870038912001", 
        "time": "2009-04-04 18:14:00", 
        "title": "Obama gets NATO to send 5,000 more mil.trainers&police to Afghanistan", 
        "userID": "RRR52"
    }, 
    {
        "content": "quote: Originally posted by RRR52: Something is better than nothing, but this falls far short of what the administration was really hoping for from the Euros. Unfortunately, for the US. You are aware that all of Europe combined has probably a quarter of our military capability? They've contributed as much money as we have, and you can't get blood from a stone. This is especially true when you consider that for the last eight years, we've been calling them cowards and traitors, and in general covering them with buckets of schit. Pkens post - \"The first time an IED kills a few of them......they'll pull out and go home.\" Is pretty typical of the attitude of many even now. Personally I'm surprised they give us any support. Dave", 
        "intTime": 20090404, 
        "postID": 12, 
        "quote": "Originally posted by RRR52: Something is better than nothing, but this falls far short of what the administration was really hoping for from the Euros. Unfortunately, for the US.", 
        "reply": " You are aware that all of Europe combined has probably a quarter of our military capability? They've contributed as much money as we have, and you can't get blood from a stone. This is especially true when you consider that for the last eight years, we've been calling them cowards and traitors, and in general covering them with buckets of schit. Pkens post - \"The first time an IED kills a few of them......they'll pull out and go home.\" Is pretty typical of the attitude of many even now. Personally I'm surprised they give us any support. Dave", 
        "threadID": "672198221_4870038912001", 
        "time": "2009-04-04 18:19:00", 
        "title": "Obama gets NATO to send 5,000 more mil.trainers&police to Afghanistan", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by RRR52: Something is better than nothing, but this falls far short of what the administration was really hoping for from the Euros. Unfortunately, for the US. You are aware that all of Europe combined has probably a quarter of our military capability? They've contributed as much money as we have, and you can't get blood from a stone. This is especially true when you consider that for the last eight years, we've been calling them cowards and traitors, and in general covering them with buckets of schit. Pkens post - \"The first time an IED kills a few of them......they'll pull out and go home.\" Is pretty typical of the attitude of many even now. Personally I'm surprised they give us any support. Dave Like Obama said the next terrorist attack will most likely be in Europe, these people had better contribute and lend support. The next group of deaths might be their family and country men!", 
        "intTime": 20090404, 
        "postID": 13, 
        "quote": "Originally posted by Grachus: quote: Originally posted by RRR52: Something is better than nothing, but this falls far short of what the administration was really hoping for from the Euros. Unfortunately, for the US. You are aware that all of Europe combined has probably a quarter of our military capability? They've contributed as much money as we have, and you can't get blood from a stone. This is especially true when you consider that for the last eight years, we've been calling them cowards and traitors, and in general covering them with buckets of schit. Pkens post - \"The first time an IED kills a few of them......they'll pull out and go home.\" Is pretty typical of the attitude of many even now. Personally I'm surprised they give us any support. Dave", 
        "reply": " Like Obama said the next terrorist attack will most likely be in Europe, these people had better contribute and lend support. The next group of deaths might be their family and country men!", 
        "threadID": "672198221_4870038912001", 
        "time": "2009-04-04 18:30:00", 
        "title": "Obama gets NATO to send 5,000 more mil.trainers&police to Afghanistan", 
        "userID": "EAG154"
    }, 
    {
        "content": "I don't see anyone (Europe) giving us anything. As we can't use the Marshall Plan since most of it has been payed back, they can't use we owe them because they aided a war in Arabland. Both had interest, some took the other side. They're in this world the same as we are. I do agree wholeheartily of condemnation of Europe or Canadians is bad exercise. This is playing into the hands of those that would see us both in ashes. Europe as a whole is 100 million more people than the United States. We always hear of France, Germany or Brits, but as a whole the Euro economy is larger, but military's are smaller along with their budgets. Again, President Obama says if we stick together there will be no problem too large to handle. Problem, sticking together, with the ego's on both sides of the pond.", 
        "intTime": 20090404, 
        "postID": 14, 
        "quote": "", 
        "reply": "I don't see anyone (Europe) giving us anything. As we can't use the Marshall Plan since most of it has been payed back, they can't use we owe them because they aided a war in Arabland. Both had interest, some took the other side. They're in this world the same as we are. I do agree wholeheartily of condemnation of Europe or Canadians is bad exercise. This is playing into the hands of those that would see us both in ashes. Europe as a whole is 100 million more people than the United States. We always hear of France, Germany or Brits, but as a whole the Euro economy is larger, but military's are smaller along with their budgets. Again, President Obama says if we stick together there will be no problem too large to handle. Problem, sticking together, with the ego's on both sides of the pond.", 
        "threadID": "672198221_4870038912001", 
        "time": "2009-04-04 18:33:00", 
        "title": "Obama gets NATO to send 5,000 more mil.trainers&police to Afghanistan", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: Originally posted by EAG154: quote: Originally posted by Grachus: quote: Originally posted by RRR52: Something is better than nothing, but this falls far short of what the administration was really hoping for from the Euros. Unfortunately, for the US. You are aware that all of Europe combined has probably a quarter of our military capability? They've contributed as much money as we have, and you can't get blood from a stone. This is especially true when you consider that for the last eight years, we've been calling them cowards and traitors, and in general covering them with buckets of schit. Pkens post - \"The first time an IED kills a few of them......they'll pull out and go home.\" Is pretty typical of the attitude of many even now. Personally I'm surprised they give us any support. Dave Like Obama said the next terrorist attack will most likely be in Europe, these people had better contribute and lend support. The next group of deaths might be their family and country men! Do you really think they don't know that? Spain doesn't know that? The Spanish, when they pulled out of Iraq, because they called it a BS war, were called cowards and traitors - Of course the men they pulled out of Iraq, went right to Afghanistan... Dave", 
        "intTime": 20090404, 
        "postID": 15, 
        "quote": "Originally posted by EAG154: quote: Originally posted by Grachus: quote: Originally posted by RRR52: Something is better than nothing, but this falls far short of what the administration was really hoping for from the Euros. Unfortunately, for the US. You are aware that all of Europe combined has probably a quarter of our military capability? They've contributed as much money as we have, and you can't get blood from a stone. This is especially true when you consider that for the last eight years, we've been calling them cowards and traitors, and in general covering them with buckets of schit. Pkens post - \"The first time an IED kills a few of them......they'll pull out and go home.\" Is pretty typical of the attitude of many even now. Personally I'm surprised they give us any support. Dave Like Obama said the next terrorist attack will most likely be in Europe, these people had better contribute and lend support. The next group of deaths might be their family and country men!", 
        "reply": " Do you really think they don't know that? Spain doesn't know that? The Spanish, when they pulled out of Iraq, because they called it a BS war, were called cowards and traitors - Of course the men they pulled out of Iraq, went right to Afghanistan... Dave", 
        "threadID": "672198221_4870038912001", 
        "time": "2009-04-04 18:34:00", 
        "title": "Obama gets NATO to send 5,000 more mil.trainers&police to Afghanistan", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by EAG154: quote: Originally posted by Grachus: quote: Originally posted by RRR52: Something is better than nothing, but this falls far short of what the administration was really hoping for from the Euros. Unfortunately, for the US. You are aware that all of Europe combined has probably a quarter of our military capability? They've contributed as much money as we have, and you can't get blood from a stone. This is especially true when you consider that for the last eight years, we've been calling them cowards and traitors, and in general covering them with buckets of schit. Pkens post - \"The first time an IED kills a few of them......they'll pull out and go home.\" Is pretty typical of the attitude of many even now. Personally I'm surprised they give us any support. Dave Like Obama said the next terrorist attack will most likely be in Europe, these people had better contribute and lend support. The next group of deaths might be their family and country men! Do you really think they don't know that? Spain doesn't know that? The Spanish, when they pulled out of Iraq, because they called it a BS war, were called cowards and traitors - Of course the men they pulled out of Iraq, went right to Afghanistan... Dave Did they?... Respectfully, SUNLINER81", 
        "intTime": 20090404, 
        "postID": 16, 
        "quote": "Originally posted by Grachus: quote: Originally posted by EAG154: quote: Originally posted by Grachus: quote: Originally posted by RRR52: Something is better than nothing, but this falls far short of what the administration was really hoping for from the Euros. Unfortunately, for the US. You are aware that all of Europe combined has probably a quarter of our military capability? They've contributed as much money as we have, and you can't get blood from a stone. This is especially true when you consider that for the last eight years, we've been calling them cowards and traitors, and in general covering them with buckets of schit. Pkens post - \"The first time an IED kills a few of them......they'll pull out and go home.\" Is pretty typical of the attitude of many even now. Personally I'm surprised they give us any support. Dave Like Obama said the next terrorist attack will most likely be in Europe, these people had better contribute and lend support. The next group of deaths might be their family and country men! Do you really think they don't know that? Spain doesn't know that? The Spanish, when they pulled out of Iraq, because they called it a BS war, were called cowards and traitors - Of course the men they pulled out of Iraq, went right to Afghanistan... Dave", 
        "reply": " Did they?... Respectfully, SUNLINER81", 
        "threadID": "672198221_4870038912001", 
        "time": "2009-04-04 18:38:00", 
        "title": "Obama gets NATO to send 5,000 more mil.trainers&police to Afghanistan", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: quote: Originally posted by Grachus: quote: Originally posted by EAG154: quote: Originally posted by Grachus: quote: Originally posted by RRR52: Something is better than nothing, but this falls far short of what the administration was really hoping for from the Euros. Unfortunately, for the US. You are aware that all of Europe combined has probably a quarter of our military capability? They've contributed as much money as we have, and you can't get blood from a stone. This is especially true when you consider that for the last eight years, we've been calling them cowards and traitors, and in general covering them with buckets of schit. Pkens post - \"The first time an IED kills a few of them......they'll pull out and go home.\" Is pretty typical of the attitude of many even now. Personally I'm surprised they give us any support. Dave Like Obama said the next terrorist attack will most likely be in Europe, these people had better contribute and lend support. The next group of deaths might be their family and country men! Do you really think they don't know that? Spain doesn't know that? The Spanish, when they pulled out of Iraq, because they called it a BS war, were called cowards and traitors - Of course the men they pulled out of Iraq, went right to Afghanistan... Dave Did they?... Respectfully, SUNLINER81 You bet! And while I'm not going to bust my chops looking for proof, here's the result of the first page of Google after punching in: \"Spain\" +\"Afghanistan\" quote: 10 July 2006 NATO Secretary General Jaap de Hoop Scheffer praised the Spanish government for its commitment to NATO’s Afghanistan mission during a visit to Madrid on 10 July. Mr. De Hoop Scheffer expressed his condolences for the death on 8 July of a Spanish soldier serving in the NATO-led force in Afghanistan, in an explosion which wounded four other Spanish soldiers. He said the Alliance remained fully committed to its “number one” priority and stressed the importance of the mission in the context of the fight against terrorism. \"http://www.nato.int/docu/update/2006/07-july/e0710a.htm\" Dave", 
        "intTime": 20090404, 
        "postID": 17, 
        "quote": "Originally posted by SUNLINER81: quote: Originally posted by Grachus: quote: Originally posted by EAG154: quote: Originally posted by Grachus: quote: Originally posted by RRR52: Something is better than nothing, but this falls far short of what the administration was really hoping for from the Euros. Unfortunately, for the US. You are aware that all of Europe combined has probably a quarter of our military capability? They've contributed as much money as we have, and you can't get blood from a stone. This is especially true when you consider that for the last eight years, we've been calling them cowards and traitors, and in general covering them with buckets of schit. Pkens post - \"The first time an IED kills a few of them......they'll pull out and go home.\" Is pretty typical of the attitude of many even now. Personally I'm surprised they give us any support. Dave Like Obama said the next terrorist attack will most likely be in Europe, these people had better contribute and lend support. The next group of deaths might be their family and country men! Do you really think they don't know that? Spain doesn't know that? The Spanish, when they pulled out of Iraq, because they called it a BS war, were called cowards and traitors - Of course the men they pulled out of Iraq, went right to Afghanistan... Dave Did they?... Respectfully, SUNLINER81", 
        "reply": " You bet! And while I'm not going to bust my chops looking for proof, here's the result of the first page of Google after punching in: \"Spain\" +\"Afghanistan\" quote: 10 July 2006 NATO Secretary General Jaap de Hoop Scheffer praised the Spanish government for its commitment to NATO’s Afghanistan mission during a visit to Madrid on 10 July. Mr. De Hoop Scheffer expressed his condolences for the death on 8 July of a Spanish soldier serving in the NATO-led force in Afghanistan, in an explosion which wounded four other Spanish soldiers. He said the Alliance remained fully committed to its “number one” priority and stressed the importance of the mission in the context of the fight against terrorism. \"http://www.nato.int/docu/update/2006/07-july/e0710a.htm\" Dave", 
        "threadID": "672198221_4870038912001", 
        "time": "2009-04-04 18:52:00", 
        "title": "Obama gets NATO to send 5,000 more mil.trainers&police to Afghanistan", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by EAG154: quote: Originally posted by Grachus: quote: Originally posted by RRR52: Something is better than nothing, but this falls far short of what the administration was really hoping for from the Euros. Unfortunately, for the US. You are aware that all of Europe combined has probably a quarter of our military capability? They've contributed as much money as we have, and you can't get blood from a stone. This is especially true when you consider that for the last eight years, we've been calling them cowards and traitors, and in general covering them with buckets of schit. Pkens post - \"The first time an IED kills a few of them......they'll pull out and go home.\" Is pretty typical of the attitude of many even now. Personally I'm surprised they give us any support. Dave Like Obama said the next terrorist attack will most likely be in Europe, these people had better contribute and lend support. The next group of deaths might be their family and country men! Do you really think they don't know that? Spain doesn't know that? The Spanish, when they pulled out of Iraq, because they called it a BS war, were called cowards and traitors - Of course the men they pulled out of Iraq, went right to Afghanistan... Dave shure they know, problem is they would rather we carry the load, mabey with Obamas popularity in Europia they will kick in more!", 
        "intTime": 20090404, 
        "postID": 18, 
        "quote": "Originally posted by Grachus: quote: Originally posted by EAG154: quote: Originally posted by Grachus: quote: Originally posted by RRR52: Something is better than nothing, but this falls far short of what the administration was really hoping for from the Euros. Unfortunately, for the US. You are aware that all of Europe combined has probably a quarter of our military capability? They've contributed as much money as we have, and you can't get blood from a stone. This is especially true when you consider that for the last eight years, we've been calling them cowards and traitors, and in general covering them with buckets of schit. Pkens post - \"The first time an IED kills a few of them......they'll pull out and go home.\" Is pretty typical of the attitude of many even now. Personally I'm surprised they give us any support. Dave Like Obama said the next terrorist attack will most likely be in Europe, these people had better contribute and lend support. The next group of deaths might be their family and country men! Do you really think they don't know that? Spain doesn't know that? The Spanish, when they pulled out of Iraq, because they called it a BS war, were called cowards and traitors - Of course the men they pulled out of Iraq, went right to Afghanistan... Dave", 
        "reply": " shure they know, problem is they would rather we carry the load, mabey with Obamas popularity in Europia they will kick in more!", 
        "threadID": "672198221_4870038912001", 
        "time": "2009-04-04 20:51:00", 
        "title": "Obama gets NATO to send 5,000 more mil.trainers&police to Afghanistan", 
        "userID": "EAG154"
    }, 
    {
        "content": "more gestures of nothingness... make it look like he is doing something but in fact is doing nothing...", 
        "intTime": 20090404, 
        "postID": 19, 
        "quote": "", 
        "reply": "more gestures of nothingness... make it look like he is doing something but in fact is doing nothing...", 
        "threadID": "672198221_4870038912001", 
        "time": "2009-04-04 21:04:00", 
        "title": "Obama gets NATO to send 5,000 more mil.trainers&police to Afghanistan", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by _cash_: The first time an IED kills a few of them......they'll pull out and go home. yea if they even go...", 
        "intTime": 20090404, 
        "postID": 20, 
        "quote": "Originally posted by _cash_: The first time an IED kills a few of them......they'll pull out and go home.", 
        "reply": " yea if they even go...", 
        "threadID": "672198221_4870038912001", 
        "time": "2009-04-04 21:09:00", 
        "title": "Obama gets NATO to send 5,000 more mil.trainers&police to Afghanistan", 
        "userID": "outlaws93"
    }, 
    {
        "content": "And yet another update: Obama manages to get other NATO nations to commit 5,000 new military trainers and police to the Afghanistan front alongside the further 21,000 US forces he is committing there, IIRC, since he did emphasize in one of his speeches in Europe just this past week about how America must not shoulder the burden of Afghanistan alone. ++http://news.yahoo.com/s/ap/20090404/ap_on_go_pr_wh/eu_obama quote: Obama hails 5,000 more NATO forces for Afghanistan By TOM RAUM, Associated Press Writer Tom Raum, Associated Press Writer 1 hr 3 mins ago STRASBOURG, France – President Barack Obama hailed \"strong and unanimous support\" from NATO allies on Saturday for his stepped-up anti-terror strategy in Afghanistan and Pakistan and welcomed their \"down payment\" promises of 5,000 fresh forces. The allies rebuffed U.S. appeals for more combat forces to join the war, but the backing Obama did gain at a European summit allowed him to claim an early victory on the world's foreign policy stage. NATO allies agreed to send up to 5,000 more military trainers and police to Afghanistan, including forces to help protect candidates and voters at upcoming elections. Obama called that \"a strong down payment\" on both Afghanistan and NATO itself at the end of a gathering celebrating the 60th anniversary of the North Atlantic Treaty Organization. He waved off questions on whether the size and makeup of the commitments were disappointing in light of an anti-terrorism struggle he himself portrayed as daunting. Since becoming president, Obama has begun switching America's anti-terror emphasis to fighting al-Qaida in the Afghanistan-Pakistan area as the war in Iraq winds down. The new president insisted that \"terrorists threaten every member of NATO,\" but he also... (...) Among countries resisting U.S. appeals for more combat troops were France, which on Saturday rejoined the alliance as a full military partner after decades of being a nonmilitary member, and Germany. Obama weighed in on a controversial new law in Afghanistan, his remarks underscoring his administration's shift away from a U.S. focus on building democracy in the country. Asked about the law, which a United Nations agency says makes it legal for men to rape their wives, Obama called it \"abhorrent.\" He also noted that Afghan President Hamid Karzai has said the law will be studied and possibly sent back to parliament for review — and that the NATO conference's closing statement specifically states that human rights should be respected. But Obama said pointedly that, while improving conditions in Afghanistan is a commendable goal, people need to remember that the primary reason U.S. troops are fighting there is to protect Americans at home from terrorist attacks. As for new troops, the White House said NATO countries agreed to send more personnel, including about 3,000 on short-term deployments, to help stabilize Afghanistan before elections in August. An additional 1,400 to 2,000 will provide training for Afghanistan's national army. Obama said those figures should not be considered a ceiling, suggesting more could be sought and offered at some point to confront a threat that he emphasized endangers Europe as well as the U.S. \"We'll need more resources and a sustained effort to achieve our ultimate goals,\" he said. Obama's national security adviser, retired Marine Corps Gen. James Jones, said the additional training commitments are a crucial piece of the puzzle. As NATO's top military chief from 2003-2006, Jones said he had asked for this to be pursued aggressively but that his requests were always rejected. (...) Last week, Gen. David Petraeus, head of the U.S. Central Command and architect of the new military strategy, told Congress that the White House will soon be mulling a request for 10,000 more American troops to be deployed in Afghanistan next year — a blunt acknowledgment that the U.S. will continue to take the brunt of the fighting and casualties. Still, Petraeus carefully acknowledged that more civilian aid — along the lines of NATO's new commitment emerging from the summit — was also critical. Along with the divide over troops and money, the Europeans have also long been reluctant to accept the U.S. view that al-Qaida and, to a lesser extent, the Taliban, remain a threat to the existence of democratic societies. The war in Afghanistan more and more is looking like an American war, and the U.S. will continue to do the bulk of the heavy lifting even with the new NATO pledges. Since Obama took office in January, the United States has committed to sending 21,000 additional troops as part of his new strategy. Obama left the summit for Prague, where he will meet with Czech President Vaclav Klaus and Prime Minister Mirek Topolanek, and give a speech expected to focus on weapons proliferation. Then he visits Turkey, his first Muslim country as president, with stops in both the capital of Ankara and Istanbul before returning to Washington next Tuesday. This message has been edited. Last edited by: Canuck_Centaur, Sat 04 April 2009 03:55 PM", 
        "intTime": 20090404, 
        "postID": 21, 
        "quote": "Obama hails 5,000 more NATO forces for Afghanistan By TOM RAUM, Associated Press Writer Tom Raum, Associated Press Writer 1 hr 3 mins ago STRASBOURG, France – President Barack Obama hailed \"strong and unanimous support\" from NATO allies on Saturday for his stepped-up anti-terror strategy in Afghanistan and Pakistan and welcomed their \"down payment\" promises of 5,000 fresh forces. The allies rebuffed U.S. appeals for more combat forces to join the war, but the backing Obama did gain at a European summit allowed him to claim an early victory on the world's foreign policy stage. NATO allies agreed to send up to 5,000 more military trainers and police to Afghanistan, including forces to help protect candidates and voters at upcoming elections. Obama called that \"a strong down payment\" on both Afghanistan and NATO itself at the end of a gathering celebrating the 60th anniversary of the North Atlantic Treaty Organization. He waved off questions on whether the size and makeup of the commitments were disappointing in light of an anti-terrorism struggle he himself portrayed as daunting. Since becoming president, Obama has begun switching America's anti-terror emphasis to fighting al-Qaida in the Afghanistan-Pakistan area as the war in Iraq winds down. The new president insisted that \"terrorists threaten every member of NATO,\" but he also... (...) Among countries resisting U.S. appeals for more combat troops were France, which on Saturday rejoined the alliance as a full military partner after decades of being a nonmilitary member, and Germany. Obama weighed in on a controversial new law in Afghanistan, his remarks underscoring his administration's shift away from a U.S. focus on building democracy in the country. Asked about the law, which a United Nations agency says makes it legal for men to rape their wives, Obama called it \"abhorrent.\" He also noted that Afghan President Hamid Karzai has said the law will be studied and possibly sent back to parliament for review — and that the NATO conference's closing statement specifically states that human rights should be respected. But Obama said pointedly that, while improving conditions in Afghanistan is a commendable goal, people need to remember that the primary reason U.S. troops are fighting there is to protect Americans at home from terrorist attacks. As for new troops, the White House said NATO countries agreed to send more personnel, including about 3,000 on short-term deployments, to help stabilize Afghanistan before elections in August. An additional 1,400 to 2,000 will provide training for Afghanistan's national army. Obama said those figures should not be considered a ceiling, suggesting more could be sought and offered at some point to confront a threat that he emphasized endangers Europe as well as the U.S. \"We'll need more resources and a sustained effort to achieve our ultimate goals,\" he said. Obama's national security adviser, retired Marine Corps Gen. James Jones, said the additional training commitments are a crucial piece of the puzzle. As NATO's top military chief from 2003-2006, Jones said he had asked for this to be pursued aggressively but that his requests were always rejected. (...) Last week, Gen. David Petraeus, head of the U.S. Central Command and architect of the new military strategy, told Congress that the White House will soon be mulling a request for 10,000 more American troops to be deployed in Afghanistan next year — a blunt acknowledgment that the U.S. will continue to take the brunt of the fighting and casualties. Still, Petraeus carefully acknowledged that more civilian aid — along the lines of NATO's new commitment emerging from the summit — was also critical. Along with the divide over troops and money, the Europeans have also long been reluctant to accept the U.S. view that al-Qaida and, to a lesser extent, the Taliban, remain a threat to the existence of democratic societies. The war in Afghanistan more and more is looking like an American war, and the U.S. will continue to do the bulk of the heavy lifting even with the new NATO pledges. Since Obama took office in January, the United States has committed to sending 21,000 additional troops as part of his new strategy. Obama left the summit for Prague, where he will meet with Czech President Vaclav Klaus and Prime Minister Mirek Topolanek, and give a speech expected to focus on weapons proliferation. Then he visits Turkey, his first Muslim country as president, with stops in both the capital of Ankara and Istanbul before returning to Washington next Tuesday.", 
        "reply": "And yet another update: Obama manages to get other NATO nations to commit 5,000 new military trainers and police to the Afghanistan front alongside the further 21,000 US forces he is committing there, IIRC, since he did emphasize in one of his speeches in Europe just this past week about how America must not shoulder the burden of Afghanistan alone. ++http://news.yahoo.com/s/ap/20090404/ap_on_go_pr_wh/eu_obama  This message has been edited. Last edited by: Canuck_Centaur, Sat 04 April 2009 03:55 PM", 
        "threadID": "672198221_4870038912001", 
        "time": "2009-04-04 13:27:00", 
        "title": "Obama gets NATO to send 5,000 more mil.trainers&police to Afghanistan", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "Woo-hoo! Let's hear it for our Dear Leader and vegetables! Woo-hoo!! \"The World's Finest\"", 
        "intTime": 20090404, 
        "postID": 22, 
        "quote": "", 
        "reply": "Woo-hoo! Let's hear it for our Dear Leader and vegetables! Woo-hoo!! \"The World's Finest\"", 
        "threadID": "672198221_4870038912001", 
        "time": "2009-04-04 13:33:00", 
        "title": "Obama gets NATO to send 5,000 more mil.trainers&police to Afghanistan", 
        "userID": "Kegler300"
    }, 
    {
        "content": "Hey, its better than nothing more, which is what GWB has gotten in the last few years..", 
        "intTime": 20090404, 
        "postID": 23, 
        "quote": "", 
        "reply": "Hey, its better than nothing more, which is what GWB has gotten in the last few years..", 
        "threadID": "672198221_4870038912001", 
        "time": "2009-04-04 13:59:00", 
        "title": "Obama gets NATO to send 5,000 more mil.trainers&police to Afghanistan", 
        "userID": "s122604"
    }, 
    {
        "content": "good.", 
        "intTime": 20090404, 
        "postID": 24, 
        "quote": "", 
        "reply": "good.", 
        "threadID": "672198221_4870038912001", 
        "time": "2009-04-04 14:02:00", 
        "title": "Obama gets NATO to send 5,000 more mil.trainers&police to Afghanistan", 
        "userID": "godawgz"
    }, 
    {
        "content": "quote: Obama hails 5,000 more NATO forces for Afghanistan CORRECTION... Teleprompter hails 5,000 more NATO forces for Afghanistan. C.R.", 
        "intTime": 20090404, 
        "postID": 25, 
        "quote": "Obama hails 5,000 more NATO forces for Afghanistan", 
        "reply": " CORRECTION... Teleprompter hails 5,000 more NATO forces for Afghanistan. C.R.", 
        "threadID": "672198221_4870038912001", 
        "time": "2009-04-04 14:09:00", 
        "title": "Obama gets NATO to send 5,000 more mil.trainers&police to Afghanistan", 
        "userID": "CYCLIC_RUNAWAY"
    }, 
    {
        "content": "quote: Originally posted by CYCLIC_RUNAWAY: quote: Obama hails 5,000 more NATO forces for Afghanistan CORRECTION... Teleprompter hails 5,000 more NATO forces for Afghanistan. C.R. Lead, follow, or get the H&ll out of the way!", 
        "intTime": 20090404, 
        "postID": 26, 
        "quote": "Originally posted by CYCLIC_RUNAWAY: quote: Obama hails 5,000 more NATO forces for Afghanistan CORRECTION... Teleprompter hails 5,000 more NATO forces for Afghanistan. C.R.", 
        "reply": " Lead, follow, or get the H&ll out of the way!", 
        "threadID": "672198221_4870038912001", 
        "time": "2009-04-04 14:48:00", 
        "title": "Obama gets NATO to send 5,000 more mil.trainers&police to Afghanistan", 
        "userID": "Motive25"
    }, 
    {
        "content": "You can say hell, we won't mind", 
        "intTime": 20090404, 
        "postID": 27, 
        "quote": "", 
        "reply": "You can say hell, we won't mind", 
        "threadID": "672198221_4870038912001", 
        "time": "2009-04-04 14:58:00", 
        "title": "Obama gets NATO to send 5,000 more mil.trainers&police to Afghanistan", 
        "userID": "godawgz"
    }, 
    {
        "content": "Lead, follow or get the hell out of the way! From the February 2008 files: \"ISAF forces have grown from 16,000 to 43,000 troops over two years, but commanders have been calling for another 7,500 troops to fight the resurgent Taliban, which has used bases in remote tribal areas of northern Pakistan to regroup\". my take on that is 27,000 troops were increase in those two years and not a word or praise of the leadership of NATO. March 18, 2009 Agence France-Presse \"NATO secretary general Jaap de Hoop Scheffer promised today to send extra troops to Afghanistan to safeguard upcoming presidential elections in the war-torn nation\". http://www.military.com/news/article/nato-vows-more-tro...&ESRC=topstories.RSS note the date, note the speaker, note the publication. Next you give Obama the credit for Easter Sunday. hahaha", 
        "intTime": 20090404, 
        "postID": 28, 
        "quote": "", 
        "reply": "Lead, follow or get the hell out of the way! From the February 2008 files: \"ISAF forces have grown from 16,000 to 43,000 troops over two years, but commanders have been calling for another 7,500 troops to fight the resurgent Taliban, which has used bases in remote tribal areas of northern Pakistan to regroup\". my take on that is 27,000 troops were increase in those two years and not a word or praise of the leadership of NATO. March 18, 2009 Agence France-Presse \"NATO secretary general Jaap de Hoop Scheffer promised today to send extra troops to Afghanistan to safeguard upcoming presidential elections in the war-torn nation\". http://www.military.com/news/article/nato-vows-more-tro...&ESRC=topstories.RSS note the date, note the speaker, note the publication. Next you give Obama the credit for Easter Sunday. hahaha", 
        "threadID": "672198221_4870038912001", 
        "time": "2009-04-04 15:39:00", 
        "title": "Obama gets NATO to send 5,000 more mil.trainers&police to Afghanistan", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: Originally posted by _cash_: The first time an IED kills a few of them......they'll pull out and go home. Maybe you should join Fox and crew? Their \"hilarious\" depiction of cowardly Canadians (on the same day that four Canadians got killed) could use your contribution. Yuk it up about people who risk their lives to contribute. I love a good laugh as well... Dave", 
        "intTime": 20090404, 
        "postID": 29, 
        "quote": "Originally posted by _cash_: The first time an IED kills a few of them......they'll pull out and go home.", 
        "reply": " Maybe you should join Fox and crew? Their \"hilarious\" depiction of cowardly Canadians (on the same day that four Canadians got killed) could use your contribution. Yuk it up about people who risk their lives to contribute. I love a good laugh as well... Dave", 
        "threadID": "672198221_4870038912001", 
        "time": "2009-04-04 17:35:00", 
        "title": "Obama gets NATO to send 5,000 more mil.trainers&police to Afghanistan", 
        "userID": "Grachus"
    }, 
    {
        "content": "Something is better than nothing, but this falls far short of what the administration was really hoping for from the Euros. Unfortunately, for the US.", 
        "intTime": 20090404, 
        "postID": 30, 
        "quote": "", 
        "reply": "Something is better than nothing, but this falls far short of what the administration was really hoping for from the Euros. Unfortunately, for the US.", 
        "threadID": "672198221_4870038912001", 
        "time": "2009-04-04 18:13:00", 
        "title": "Obama gets NATO to send 5,000 more mil.trainers&police to Afghanistan", 
        "userID": "RRR52"
    }, 
    {
        "content": "quote: Originally posted by Motive25: Lead, follow, or get the H&ll out of the way! Try it sometime.", 
        "intTime": 20090404, 
        "postID": 31, 
        "quote": "Originally posted by Motive25: Lead, follow, or get the H&ll out of the way!", 
        "reply": " Try it sometime.", 
        "threadID": "672198221_4870038912001", 
        "time": "2009-04-04 18:14:00", 
        "title": "Obama gets NATO to send 5,000 more mil.trainers&police to Afghanistan", 
        "userID": "RRR52"
    }, 
    {
        "content": "quote: Originally posted by RRR52: Something is better than nothing, but this falls far short of what the administration was really hoping for from the Euros. Unfortunately, for the US. You are aware that all of Europe combined has probably a quarter of our military capability? They've contributed as much money as we have, and you can't get blood from a stone. This is especially true when you consider that for the last eight years, we've been calling them cowards and traitors, and in general covering them with buckets of schit. Pkens post - \"The first time an IED kills a few of them......they'll pull out and go home.\" Is pretty typical of the attitude of many even now. Personally I'm surprised they give us any support. Dave", 
        "intTime": 20090404, 
        "postID": 32, 
        "quote": "Originally posted by RRR52: Something is better than nothing, but this falls far short of what the administration was really hoping for from the Euros. Unfortunately, for the US.", 
        "reply": " You are aware that all of Europe combined has probably a quarter of our military capability? They've contributed as much money as we have, and you can't get blood from a stone. This is especially true when you consider that for the last eight years, we've been calling them cowards and traitors, and in general covering them with buckets of schit. Pkens post - \"The first time an IED kills a few of them......they'll pull out and go home.\" Is pretty typical of the attitude of many even now. Personally I'm surprised they give us any support. Dave", 
        "threadID": "672198221_4870038912001", 
        "time": "2009-04-04 18:19:00", 
        "title": "Obama gets NATO to send 5,000 more mil.trainers&police to Afghanistan", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by RRR52: Something is better than nothing, but this falls far short of what the administration was really hoping for from the Euros. Unfortunately, for the US. You are aware that all of Europe combined has probably a quarter of our military capability? They've contributed as much money as we have, and you can't get blood from a stone. This is especially true when you consider that for the last eight years, we've been calling them cowards and traitors, and in general covering them with buckets of schit. Pkens post - \"The first time an IED kills a few of them......they'll pull out and go home.\" Is pretty typical of the attitude of many even now. Personally I'm surprised they give us any support. Dave Like Obama said the next terrorist attack will most likely be in Europe, these people had better contribute and lend support. The next group of deaths might be their family and country men!", 
        "intTime": 20090404, 
        "postID": 33, 
        "quote": "Originally posted by Grachus: quote: Originally posted by RRR52: Something is better than nothing, but this falls far short of what the administration was really hoping for from the Euros. Unfortunately, for the US. You are aware that all of Europe combined has probably a quarter of our military capability? They've contributed as much money as we have, and you can't get blood from a stone. This is especially true when you consider that for the last eight years, we've been calling them cowards and traitors, and in general covering them with buckets of schit. Pkens post - \"The first time an IED kills a few of them......they'll pull out and go home.\" Is pretty typical of the attitude of many even now. Personally I'm surprised they give us any support. Dave", 
        "reply": " Like Obama said the next terrorist attack will most likely be in Europe, these people had better contribute and lend support. The next group of deaths might be their family and country men!", 
        "threadID": "672198221_4870038912001", 
        "time": "2009-04-04 18:30:00", 
        "title": "Obama gets NATO to send 5,000 more mil.trainers&police to Afghanistan", 
        "userID": "EAG154"
    }, 
    {
        "content": "I don't see anyone (Europe) giving us anything. As we can't use the Marshall Plan since most of it has been payed back, they can't use we owe them because they aided a war in Arabland. Both had interest, some took the other side. They're in this world the same as we are. I do agree wholeheartily of condemnation of Europe or Canadians is bad exercise. This is playing into the hands of those that would see us both in ashes. Europe as a whole is 100 million more people than the United States. We always hear of France, Germany or Brits, but as a whole the Euro economy is larger, but military's are smaller along with their budgets. Again, President Obama says if we stick together there will be no problem too large to handle. Problem, sticking together, with the ego's on both sides of the pond.", 
        "intTime": 20090404, 
        "postID": 34, 
        "quote": "", 
        "reply": "I don't see anyone (Europe) giving us anything. As we can't use the Marshall Plan since most of it has been payed back, they can't use we owe them because they aided a war in Arabland. Both had interest, some took the other side. They're in this world the same as we are. I do agree wholeheartily of condemnation of Europe or Canadians is bad exercise. This is playing into the hands of those that would see us both in ashes. Europe as a whole is 100 million more people than the United States. We always hear of France, Germany or Brits, but as a whole the Euro economy is larger, but military's are smaller along with their budgets. Again, President Obama says if we stick together there will be no problem too large to handle. Problem, sticking together, with the ego's on both sides of the pond.", 
        "threadID": "672198221_4870038912001", 
        "time": "2009-04-04 18:33:00", 
        "title": "Obama gets NATO to send 5,000 more mil.trainers&police to Afghanistan", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: Originally posted by EAG154: quote: Originally posted by Grachus: quote: Originally posted by RRR52: Something is better than nothing, but this falls far short of what the administration was really hoping for from the Euros. Unfortunately, for the US. You are aware that all of Europe combined has probably a quarter of our military capability? They've contributed as much money as we have, and you can't get blood from a stone. This is especially true when you consider that for the last eight years, we've been calling them cowards and traitors, and in general covering them with buckets of schit. Pkens post - \"The first time an IED kills a few of them......they'll pull out and go home.\" Is pretty typical of the attitude of many even now. Personally I'm surprised they give us any support. Dave Like Obama said the next terrorist attack will most likely be in Europe, these people had better contribute and lend support. The next group of deaths might be their family and country men! Do you really think they don't know that? Spain doesn't know that? The Spanish, when they pulled out of Iraq, because they called it a BS war, were called cowards and traitors - Of course the men they pulled out of Iraq, went right to Afghanistan... Dave", 
        "intTime": 20090404, 
        "postID": 35, 
        "quote": "Originally posted by EAG154: quote: Originally posted by Grachus: quote: Originally posted by RRR52: Something is better than nothing, but this falls far short of what the administration was really hoping for from the Euros. Unfortunately, for the US. You are aware that all of Europe combined has probably a quarter of our military capability? They've contributed as much money as we have, and you can't get blood from a stone. This is especially true when you consider that for the last eight years, we've been calling them cowards and traitors, and in general covering them with buckets of schit. Pkens post - \"The first time an IED kills a few of them......they'll pull out and go home.\" Is pretty typical of the attitude of many even now. Personally I'm surprised they give us any support. Dave Like Obama said the next terrorist attack will most likely be in Europe, these people had better contribute and lend support. The next group of deaths might be their family and country men!", 
        "reply": " Do you really think they don't know that? Spain doesn't know that? The Spanish, when they pulled out of Iraq, because they called it a BS war, were called cowards and traitors - Of course the men they pulled out of Iraq, went right to Afghanistan... Dave", 
        "threadID": "672198221_4870038912001", 
        "time": "2009-04-04 18:34:00", 
        "title": "Obama gets NATO to send 5,000 more mil.trainers&police to Afghanistan", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by EAG154: quote: Originally posted by Grachus: quote: Originally posted by RRR52: Something is better than nothing, but this falls far short of what the administration was really hoping for from the Euros. Unfortunately, for the US. You are aware that all of Europe combined has probably a quarter of our military capability? They've contributed as much money as we have, and you can't get blood from a stone. This is especially true when you consider that for the last eight years, we've been calling them cowards and traitors, and in general covering them with buckets of schit. Pkens post - \"The first time an IED kills a few of them......they'll pull out and go home.\" Is pretty typical of the attitude of many even now. Personally I'm surprised they give us any support. Dave Like Obama said the next terrorist attack will most likely be in Europe, these people had better contribute and lend support. The next group of deaths might be their family and country men! Do you really think they don't know that? Spain doesn't know that? The Spanish, when they pulled out of Iraq, because they called it a BS war, were called cowards and traitors - Of course the men they pulled out of Iraq, went right to Afghanistan... Dave Did they?... Respectfully, SUNLINER81", 
        "intTime": 20090404, 
        "postID": 36, 
        "quote": "Originally posted by Grachus: quote: Originally posted by EAG154: quote: Originally posted by Grachus: quote: Originally posted by RRR52: Something is better than nothing, but this falls far short of what the administration was really hoping for from the Euros. Unfortunately, for the US. You are aware that all of Europe combined has probably a quarter of our military capability? They've contributed as much money as we have, and you can't get blood from a stone. This is especially true when you consider that for the last eight years, we've been calling them cowards and traitors, and in general covering them with buckets of schit. Pkens post - \"The first time an IED kills a few of them......they'll pull out and go home.\" Is pretty typical of the attitude of many even now. Personally I'm surprised they give us any support. Dave Like Obama said the next terrorist attack will most likely be in Europe, these people had better contribute and lend support. The next group of deaths might be their family and country men! Do you really think they don't know that? Spain doesn't know that? The Spanish, when they pulled out of Iraq, because they called it a BS war, were called cowards and traitors - Of course the men they pulled out of Iraq, went right to Afghanistan... Dave", 
        "reply": " Did they?... Respectfully, SUNLINER81", 
        "threadID": "672198221_4870038912001", 
        "time": "2009-04-04 18:38:00", 
        "title": "Obama gets NATO to send 5,000 more mil.trainers&police to Afghanistan", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: quote: Originally posted by Grachus: quote: Originally posted by EAG154: quote: Originally posted by Grachus: quote: Originally posted by RRR52: Something is better than nothing, but this falls far short of what the administration was really hoping for from the Euros. Unfortunately, for the US. You are aware that all of Europe combined has probably a quarter of our military capability? They've contributed as much money as we have, and you can't get blood from a stone. This is especially true when you consider that for the last eight years, we've been calling them cowards and traitors, and in general covering them with buckets of schit. Pkens post - \"The first time an IED kills a few of them......they'll pull out and go home.\" Is pretty typical of the attitude of many even now. Personally I'm surprised they give us any support. Dave Like Obama said the next terrorist attack will most likely be in Europe, these people had better contribute and lend support. The next group of deaths might be their family and country men! Do you really think they don't know that? Spain doesn't know that? The Spanish, when they pulled out of Iraq, because they called it a BS war, were called cowards and traitors - Of course the men they pulled out of Iraq, went right to Afghanistan... Dave Did they?... Respectfully, SUNLINER81 You bet! And while I'm not going to bust my chops looking for proof, here's the result of the first page of Google after punching in: \"Spain\" +\"Afghanistan\" quote: 10 July 2006 NATO Secretary General Jaap de Hoop Scheffer praised the Spanish government for its commitment to NATO’s Afghanistan mission during a visit to Madrid on 10 July. Mr. De Hoop Scheffer expressed his condolences for the death on 8 July of a Spanish soldier serving in the NATO-led force in Afghanistan, in an explosion which wounded four other Spanish soldiers. He said the Alliance remained fully committed to its “number one” priority and stressed the importance of the mission in the context of the fight against terrorism. \"http://www.nato.int/docu/update/2006/07-july/e0710a.htm\" Dave", 
        "intTime": 20090404, 
        "postID": 37, 
        "quote": "Originally posted by SUNLINER81: quote: Originally posted by Grachus: quote: Originally posted by EAG154: quote: Originally posted by Grachus: quote: Originally posted by RRR52: Something is better than nothing, but this falls far short of what the administration was really hoping for from the Euros. Unfortunately, for the US. You are aware that all of Europe combined has probably a quarter of our military capability? They've contributed as much money as we have, and you can't get blood from a stone. This is especially true when you consider that for the last eight years, we've been calling them cowards and traitors, and in general covering them with buckets of schit. Pkens post - \"The first time an IED kills a few of them......they'll pull out and go home.\" Is pretty typical of the attitude of many even now. Personally I'm surprised they give us any support. Dave Like Obama said the next terrorist attack will most likely be in Europe, these people had better contribute and lend support. The next group of deaths might be their family and country men! Do you really think they don't know that? Spain doesn't know that? The Spanish, when they pulled out of Iraq, because they called it a BS war, were called cowards and traitors - Of course the men they pulled out of Iraq, went right to Afghanistan... Dave Did they?... Respectfully, SUNLINER81", 
        "reply": " You bet! And while I'm not going to bust my chops looking for proof, here's the result of the first page of Google after punching in: \"Spain\" +\"Afghanistan\" quote: 10 July 2006 NATO Secretary General Jaap de Hoop Scheffer praised the Spanish government for its commitment to NATO’s Afghanistan mission during a visit to Madrid on 10 July. Mr. De Hoop Scheffer expressed his condolences for the death on 8 July of a Spanish soldier serving in the NATO-led force in Afghanistan, in an explosion which wounded four other Spanish soldiers. He said the Alliance remained fully committed to its “number one” priority and stressed the importance of the mission in the context of the fight against terrorism. \"http://www.nato.int/docu/update/2006/07-july/e0710a.htm\" Dave", 
        "threadID": "672198221_4870038912001", 
        "time": "2009-04-04 18:52:00", 
        "title": "Obama gets NATO to send 5,000 more mil.trainers&police to Afghanistan", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by EAG154: quote: Originally posted by Grachus: quote: Originally posted by RRR52: Something is better than nothing, but this falls far short of what the administration was really hoping for from the Euros. Unfortunately, for the US. You are aware that all of Europe combined has probably a quarter of our military capability? They've contributed as much money as we have, and you can't get blood from a stone. This is especially true when you consider that for the last eight years, we've been calling them cowards and traitors, and in general covering them with buckets of schit. Pkens post - \"The first time an IED kills a few of them......they'll pull out and go home.\" Is pretty typical of the attitude of many even now. Personally I'm surprised they give us any support. Dave Like Obama said the next terrorist attack will most likely be in Europe, these people had better contribute and lend support. The next group of deaths might be their family and country men! Do you really think they don't know that? Spain doesn't know that? The Spanish, when they pulled out of Iraq, because they called it a BS war, were called cowards and traitors - Of course the men they pulled out of Iraq, went right to Afghanistan... Dave shure they know, problem is they would rather we carry the load, mabey with Obamas popularity in Europia they will kick in more!", 
        "intTime": 20090404, 
        "postID": 38, 
        "quote": "Originally posted by Grachus: quote: Originally posted by EAG154: quote: Originally posted by Grachus: quote: Originally posted by RRR52: Something is better than nothing, but this falls far short of what the administration was really hoping for from the Euros. Unfortunately, for the US. You are aware that all of Europe combined has probably a quarter of our military capability? They've contributed as much money as we have, and you can't get blood from a stone. This is especially true when you consider that for the last eight years, we've been calling them cowards and traitors, and in general covering them with buckets of schit. Pkens post - \"The first time an IED kills a few of them......they'll pull out and go home.\" Is pretty typical of the attitude of many even now. Personally I'm surprised they give us any support. Dave Like Obama said the next terrorist attack will most likely be in Europe, these people had better contribute and lend support. The next group of deaths might be their family and country men! Do you really think they don't know that? Spain doesn't know that? The Spanish, when they pulled out of Iraq, because they called it a BS war, were called cowards and traitors - Of course the men they pulled out of Iraq, went right to Afghanistan... Dave", 
        "reply": " shure they know, problem is they would rather we carry the load, mabey with Obamas popularity in Europia they will kick in more!", 
        "threadID": "672198221_4870038912001", 
        "time": "2009-04-04 20:51:00", 
        "title": "Obama gets NATO to send 5,000 more mil.trainers&police to Afghanistan", 
        "userID": "EAG154"
    }, 
    {
        "content": "more gestures of nothingness... make it look like he is doing something but in fact is doing nothing...", 
        "intTime": 20090404, 
        "postID": 39, 
        "quote": "", 
        "reply": "more gestures of nothingness... make it look like he is doing something but in fact is doing nothing...", 
        "threadID": "672198221_4870038912001", 
        "time": "2009-04-04 21:04:00", 
        "title": "Obama gets NATO to send 5,000 more mil.trainers&police to Afghanistan", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by _cash_: The first time an IED kills a few of them......they'll pull out and go home. yea if they even go...", 
        "intTime": 20090404, 
        "postID": 40, 
        "quote": "Originally posted by _cash_: The first time an IED kills a few of them......they'll pull out and go home.", 
        "reply": " yea if they even go...", 
        "threadID": "672198221_4870038912001", 
        "time": "2009-04-04 21:09:00", 
        "title": "Obama gets NATO to send 5,000 more mil.trainers&police to Afghanistan", 
        "userID": "outlaws93"
    }, 
    {
        "content": "And yet another update: Obama manages to get other NATO nations to commit 5,000 new military trainers and police to the Afghanistan front alongside the further 21,000 US forces he is committing there, IIRC, since he did emphasize in one of his speeches in Europe just this past week about how America must not shoulder the burden of Afghanistan alone. ++http://news.yahoo.com/s/ap/20090404/ap_on_go_pr_wh/eu_obama quote: Obama hails 5,000 more NATO forces for Afghanistan By TOM RAUM, Associated Press Writer Tom Raum, Associated Press Writer 1 hr 3 mins ago STRASBOURG, France – President Barack Obama hailed \"strong and unanimous support\" from NATO allies on Saturday for his stepped-up anti-terror strategy in Afghanistan and Pakistan and welcomed their \"down payment\" promises of 5,000 fresh forces. The allies rebuffed U.S. appeals for more combat forces to join the war, but the backing Obama did gain at a European summit allowed him to claim an early victory on the world's foreign policy stage. NATO allies agreed to send up to 5,000 more military trainers and police to Afghanistan, including forces to help protect candidates and voters at upcoming elections. Obama called that \"a strong down payment\" on both Afghanistan and NATO itself at the end of a gathering celebrating the 60th anniversary of the North Atlantic Treaty Organization. He waved off questions on whether the size and makeup of the commitments were disappointing in light of an anti-terrorism struggle he himself portrayed as daunting. Since becoming president, Obama has begun switching America's anti-terror emphasis to fighting al-Qaida in the Afghanistan-Pakistan area as the war in Iraq winds down. The new president insisted that \"terrorists threaten every member of NATO,\" but he also... (...) Among countries resisting U.S. appeals for more combat troops were France, which on Saturday rejoined the alliance as a full military partner after decades of being a nonmilitary member, and Germany. Obama weighed in on a controversial new law in Afghanistan, his remarks underscoring his administration's shift away from a U.S. focus on building democracy in the country. Asked about the law, which a United Nations agency says makes it legal for men to rape their wives, Obama called it \"abhorrent.\" He also noted that Afghan President Hamid Karzai has said the law will be studied and possibly sent back to parliament for review — and that the NATO conference's closing statement specifically states that human rights should be respected. But Obama said pointedly that, while improving conditions in Afghanistan is a commendable goal, people need to remember that the primary reason U.S. troops are fighting there is to protect Americans at home from terrorist attacks. As for new troops, the White House said NATO countries agreed to send more personnel, including about 3,000 on short-term deployments, to help stabilize Afghanistan before elections in August. An additional 1,400 to 2,000 will provide training for Afghanistan's national army. Obama said those figures should not be considered a ceiling, suggesting more could be sought and offered at some point to confront a threat that he emphasized endangers Europe as well as the U.S. \"We'll need more resources and a sustained effort to achieve our ultimate goals,\" he said. Obama's national security adviser, retired Marine Corps Gen. James Jones, said the additional training commitments are a crucial piece of the puzzle. As NATO's top military chief from 2003-2006, Jones said he had asked for this to be pursued aggressively but that his requests were always rejected. (...) Last week, Gen. David Petraeus, head of the U.S. Central Command and architect of the new military strategy, told Congress that the White House will soon be mulling a request for 10,000 more American troops to be deployed in Afghanistan next year — a blunt acknowledgment that the U.S. will continue to take the brunt of the fighting and casualties. Still, Petraeus carefully acknowledged that more civilian aid — along the lines of NATO's new commitment emerging from the summit — was also critical. Along with the divide over troops and money, the Europeans have also long been reluctant to accept the U.S. view that al-Qaida and, to a lesser extent, the Taliban, remain a threat to the existence of democratic societies. The war in Afghanistan more and more is looking like an American war, and the U.S. will continue to do the bulk of the heavy lifting even with the new NATO pledges. Since Obama took office in January, the United States has committed to sending 21,000 additional troops as part of his new strategy. Obama left the summit for Prague, where he will meet with Czech President Vaclav Klaus and Prime Minister Mirek Topolanek, and give a speech expected to focus on weapons proliferation. Then he visits Turkey, his first Muslim country as president, with stops in both the capital of Ankara and Istanbul before returning to Washington next Tuesday. This message has been edited. Last edited by: Canuck_Centaur, Sat 04 April 2009 03:55 PM", 
        "intTime": 20090404, 
        "postID": 41, 
        "quote": "Obama hails 5,000 more NATO forces for Afghanistan By TOM RAUM, Associated Press Writer Tom Raum, Associated Press Writer 1 hr 3 mins ago STRASBOURG, France – President Barack Obama hailed \"strong and unanimous support\" from NATO allies on Saturday for his stepped-up anti-terror strategy in Afghanistan and Pakistan and welcomed their \"down payment\" promises of 5,000 fresh forces. The allies rebuffed U.S. appeals for more combat forces to join the war, but the backing Obama did gain at a European summit allowed him to claim an early victory on the world's foreign policy stage. NATO allies agreed to send up to 5,000 more military trainers and police to Afghanistan, including forces to help protect candidates and voters at upcoming elections. Obama called that \"a strong down payment\" on both Afghanistan and NATO itself at the end of a gathering celebrating the 60th anniversary of the North Atlantic Treaty Organization. He waved off questions on whether the size and makeup of the commitments were disappointing in light of an anti-terrorism struggle he himself portrayed as daunting. Since becoming president, Obama has begun switching America's anti-terror emphasis to fighting al-Qaida in the Afghanistan-Pakistan area as the war in Iraq winds down. The new president insisted that \"terrorists threaten every member of NATO,\" but he also... (...) Among countries resisting U.S. appeals for more combat troops were France, which on Saturday rejoined the alliance as a full military partner after decades of being a nonmilitary member, and Germany. Obama weighed in on a controversial new law in Afghanistan, his remarks underscoring his administration's shift away from a U.S. focus on building democracy in the country. Asked about the law, which a United Nations agency says makes it legal for men to rape their wives, Obama called it \"abhorrent.\" He also noted that Afghan President Hamid Karzai has said the law will be studied and possibly sent back to parliament for review — and that the NATO conference's closing statement specifically states that human rights should be respected. But Obama said pointedly that, while improving conditions in Afghanistan is a commendable goal, people need to remember that the primary reason U.S. troops are fighting there is to protect Americans at home from terrorist attacks. As for new troops, the White House said NATO countries agreed to send more personnel, including about 3,000 on short-term deployments, to help stabilize Afghanistan before elections in August. An additional 1,400 to 2,000 will provide training for Afghanistan's national army. Obama said those figures should not be considered a ceiling, suggesting more could be sought and offered at some point to confront a threat that he emphasized endangers Europe as well as the U.S. \"We'll need more resources and a sustained effort to achieve our ultimate goals,\" he said. Obama's national security adviser, retired Marine Corps Gen. James Jones, said the additional training commitments are a crucial piece of the puzzle. As NATO's top military chief from 2003-2006, Jones said he had asked for this to be pursued aggressively but that his requests were always rejected. (...) Last week, Gen. David Petraeus, head of the U.S. Central Command and architect of the new military strategy, told Congress that the White House will soon be mulling a request for 10,000 more American troops to be deployed in Afghanistan next year — a blunt acknowledgment that the U.S. will continue to take the brunt of the fighting and casualties. Still, Petraeus carefully acknowledged that more civilian aid — along the lines of NATO's new commitment emerging from the summit — was also critical. Along with the divide over troops and money, the Europeans have also long been reluctant to accept the U.S. view that al-Qaida and, to a lesser extent, the Taliban, remain a threat to the existence of democratic societies. The war in Afghanistan more and more is looking like an American war, and the U.S. will continue to do the bulk of the heavy lifting even with the new NATO pledges. Since Obama took office in January, the United States has committed to sending 21,000 additional troops as part of his new strategy. Obama left the summit for Prague, where he will meet with Czech President Vaclav Klaus and Prime Minister Mirek Topolanek, and give a speech expected to focus on weapons proliferation. Then he visits Turkey, his first Muslim country as president, with stops in both the capital of Ankara and Istanbul before returning to Washington next Tuesday.", 
        "reply": "And yet another update: Obama manages to get other NATO nations to commit 5,000 new military trainers and police to the Afghanistan front alongside the further 21,000 US forces he is committing there, IIRC, since he did emphasize in one of his speeches in Europe just this past week about how America must not shoulder the burden of Afghanistan alone. ++http://news.yahoo.com/s/ap/20090404/ap_on_go_pr_wh/eu_obama  This message has been edited. Last edited by: Canuck_Centaur, Sat 04 April 2009 03:55 PM", 
        "threadID": "672198221_4870038912001", 
        "time": "2009-04-04 13:27:00", 
        "title": "Obama gets NATO to send 5,000 more mil.trainers&police to Afghanistan", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "Woo-hoo! Let's hear it for our Dear Leader and vegetables! Woo-hoo!! \"The World's Finest\"", 
        "intTime": 20090404, 
        "postID": 42, 
        "quote": "", 
        "reply": "Woo-hoo! Let's hear it for our Dear Leader and vegetables! Woo-hoo!! \"The World's Finest\"", 
        "threadID": "672198221_4870038912001", 
        "time": "2009-04-04 13:33:00", 
        "title": "Obama gets NATO to send 5,000 more mil.trainers&police to Afghanistan", 
        "userID": "Kegler300"
    }, 
    {
        "content": "Hey, its better than nothing more, which is what GWB has gotten in the last few years..", 
        "intTime": 20090404, 
        "postID": 43, 
        "quote": "", 
        "reply": "Hey, its better than nothing more, which is what GWB has gotten in the last few years..", 
        "threadID": "672198221_4870038912001", 
        "time": "2009-04-04 13:59:00", 
        "title": "Obama gets NATO to send 5,000 more mil.trainers&police to Afghanistan", 
        "userID": "s122604"
    }, 
    {
        "content": "good.", 
        "intTime": 20090404, 
        "postID": 44, 
        "quote": "", 
        "reply": "good.", 
        "threadID": "672198221_4870038912001", 
        "time": "2009-04-04 14:02:00", 
        "title": "Obama gets NATO to send 5,000 more mil.trainers&police to Afghanistan", 
        "userID": "godawgz"
    }, 
    {
        "content": "quote: Obama hails 5,000 more NATO forces for Afghanistan CORRECTION... Teleprompter hails 5,000 more NATO forces for Afghanistan. C.R.", 
        "intTime": 20090404, 
        "postID": 45, 
        "quote": "Obama hails 5,000 more NATO forces for Afghanistan", 
        "reply": " CORRECTION... Teleprompter hails 5,000 more NATO forces for Afghanistan. C.R.", 
        "threadID": "672198221_4870038912001", 
        "time": "2009-04-04 14:09:00", 
        "title": "Obama gets NATO to send 5,000 more mil.trainers&police to Afghanistan", 
        "userID": "CYCLIC_RUNAWAY"
    }, 
    {
        "content": "quote: Originally posted by CYCLIC_RUNAWAY: quote: Obama hails 5,000 more NATO forces for Afghanistan CORRECTION... Teleprompter hails 5,000 more NATO forces for Afghanistan. C.R. Lead, follow, or get the H&ll out of the way!", 
        "intTime": 20090404, 
        "postID": 46, 
        "quote": "Originally posted by CYCLIC_RUNAWAY: quote: Obama hails 5,000 more NATO forces for Afghanistan CORRECTION... Teleprompter hails 5,000 more NATO forces for Afghanistan. C.R.", 
        "reply": " Lead, follow, or get the H&ll out of the way!", 
        "threadID": "672198221_4870038912001", 
        "time": "2009-04-04 14:48:00", 
        "title": "Obama gets NATO to send 5,000 more mil.trainers&police to Afghanistan", 
        "userID": "Motive25"
    }, 
    {
        "content": "You can say hell, we won't mind", 
        "intTime": 20090404, 
        "postID": 47, 
        "quote": "", 
        "reply": "You can say hell, we won't mind", 
        "threadID": "672198221_4870038912001", 
        "time": "2009-04-04 14:58:00", 
        "title": "Obama gets NATO to send 5,000 more mil.trainers&police to Afghanistan", 
        "userID": "godawgz"
    }, 
    {
        "content": "Lead, follow or get the hell out of the way! From the February 2008 files: \"ISAF forces have grown from 16,000 to 43,000 troops over two years, but commanders have been calling for another 7,500 troops to fight the resurgent Taliban, which has used bases in remote tribal areas of northern Pakistan to regroup\". my take on that is 27,000 troops were increase in those two years and not a word or praise of the leadership of NATO. March 18, 2009 Agence France-Presse \"NATO secretary general Jaap de Hoop Scheffer promised today to send extra troops to Afghanistan to safeguard upcoming presidential elections in the war-torn nation\". http://www.military.com/news/article/nato-vows-more-tro...&ESRC=topstories.RSS note the date, note the speaker, note the publication. Next you give Obama the credit for Easter Sunday. hahaha", 
        "intTime": 20090404, 
        "postID": 48, 
        "quote": "", 
        "reply": "Lead, follow or get the hell out of the way! From the February 2008 files: \"ISAF forces have grown from 16,000 to 43,000 troops over two years, but commanders have been calling for another 7,500 troops to fight the resurgent Taliban, which has used bases in remote tribal areas of northern Pakistan to regroup\". my take on that is 27,000 troops were increase in those two years and not a word or praise of the leadership of NATO. March 18, 2009 Agence France-Presse \"NATO secretary general Jaap de Hoop Scheffer promised today to send extra troops to Afghanistan to safeguard upcoming presidential elections in the war-torn nation\". http://www.military.com/news/article/nato-vows-more-tro...&ESRC=topstories.RSS note the date, note the speaker, note the publication. Next you give Obama the credit for Easter Sunday. hahaha", 
        "threadID": "672198221_4870038912001", 
        "time": "2009-04-04 15:39:00", 
        "title": "Obama gets NATO to send 5,000 more mil.trainers&police to Afghanistan", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: Originally posted by _cash_: The first time an IED kills a few of them......they'll pull out and go home. Maybe you should join Fox and crew? Their \"hilarious\" depiction of cowardly Canadians (on the same day that four Canadians got killed) could use your contribution. Yuk it up about people who risk their lives to contribute. I love a good laugh as well... Dave", 
        "intTime": 20090404, 
        "postID": 49, 
        "quote": "Originally posted by _cash_: The first time an IED kills a few of them......they'll pull out and go home.", 
        "reply": " Maybe you should join Fox and crew? Their \"hilarious\" depiction of cowardly Canadians (on the same day that four Canadians got killed) could use your contribution. Yuk it up about people who risk their lives to contribute. I love a good laugh as well... Dave", 
        "threadID": "672198221_4870038912001", 
        "time": "2009-04-04 17:35:00", 
        "title": "Obama gets NATO to send 5,000 more mil.trainers&police to Afghanistan", 
        "userID": "Grachus"
    }, 
    {
        "content": "Something is better than nothing, but this falls far short of what the administration was really hoping for from the Euros. Unfortunately, for the US.", 
        "intTime": 20090404, 
        "postID": 50, 
        "quote": "", 
        "reply": "Something is better than nothing, but this falls far short of what the administration was really hoping for from the Euros. Unfortunately, for the US.", 
        "threadID": "672198221_4870038912001", 
        "time": "2009-04-04 18:13:00", 
        "title": "Obama gets NATO to send 5,000 more mil.trainers&police to Afghanistan", 
        "userID": "RRR52"
    }, 
    {
        "content": "quote: Originally posted by Motive25: Lead, follow, or get the H&ll out of the way! Try it sometime.", 
        "intTime": 20090404, 
        "postID": 51, 
        "quote": "Originally posted by Motive25: Lead, follow, or get the H&ll out of the way!", 
        "reply": " Try it sometime.", 
        "threadID": "672198221_4870038912001", 
        "time": "2009-04-04 18:14:00", 
        "title": "Obama gets NATO to send 5,000 more mil.trainers&police to Afghanistan", 
        "userID": "RRR52"
    }, 
    {
        "content": "quote: Originally posted by RRR52: Something is better than nothing, but this falls far short of what the administration was really hoping for from the Euros. Unfortunately, for the US. You are aware that all of Europe combined has probably a quarter of our military capability? They've contributed as much money as we have, and you can't get blood from a stone. This is especially true when you consider that for the last eight years, we've been calling them cowards and traitors, and in general covering them with buckets of schit. Pkens post - \"The first time an IED kills a few of them......they'll pull out and go home.\" Is pretty typical of the attitude of many even now. Personally I'm surprised they give us any support. Dave", 
        "intTime": 20090404, 
        "postID": 52, 
        "quote": "Originally posted by RRR52: Something is better than nothing, but this falls far short of what the administration was really hoping for from the Euros. Unfortunately, for the US.", 
        "reply": " You are aware that all of Europe combined has probably a quarter of our military capability? They've contributed as much money as we have, and you can't get blood from a stone. This is especially true when you consider that for the last eight years, we've been calling them cowards and traitors, and in general covering them with buckets of schit. Pkens post - \"The first time an IED kills a few of them......they'll pull out and go home.\" Is pretty typical of the attitude of many even now. Personally I'm surprised they give us any support. Dave", 
        "threadID": "672198221_4870038912001", 
        "time": "2009-04-04 18:19:00", 
        "title": "Obama gets NATO to send 5,000 more mil.trainers&police to Afghanistan", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by RRR52: Something is better than nothing, but this falls far short of what the administration was really hoping for from the Euros. Unfortunately, for the US. You are aware that all of Europe combined has probably a quarter of our military capability? They've contributed as much money as we have, and you can't get blood from a stone. This is especially true when you consider that for the last eight years, we've been calling them cowards and traitors, and in general covering them with buckets of schit. Pkens post - \"The first time an IED kills a few of them......they'll pull out and go home.\" Is pretty typical of the attitude of many even now. Personally I'm surprised they give us any support. Dave Like Obama said the next terrorist attack will most likely be in Europe, these people had better contribute and lend support. The next group of deaths might be their family and country men!", 
        "intTime": 20090404, 
        "postID": 53, 
        "quote": "Originally posted by Grachus: quote: Originally posted by RRR52: Something is better than nothing, but this falls far short of what the administration was really hoping for from the Euros. Unfortunately, for the US. You are aware that all of Europe combined has probably a quarter of our military capability? They've contributed as much money as we have, and you can't get blood from a stone. This is especially true when you consider that for the last eight years, we've been calling them cowards and traitors, and in general covering them with buckets of schit. Pkens post - \"The first time an IED kills a few of them......they'll pull out and go home.\" Is pretty typical of the attitude of many even now. Personally I'm surprised they give us any support. Dave", 
        "reply": " Like Obama said the next terrorist attack will most likely be in Europe, these people had better contribute and lend support. The next group of deaths might be their family and country men!", 
        "threadID": "672198221_4870038912001", 
        "time": "2009-04-04 18:30:00", 
        "title": "Obama gets NATO to send 5,000 more mil.trainers&police to Afghanistan", 
        "userID": "EAG154"
    }, 
    {
        "content": "I don't see anyone (Europe) giving us anything. As we can't use the Marshall Plan since most of it has been payed back, they can't use we owe them because they aided a war in Arabland. Both had interest, some took the other side. They're in this world the same as we are. I do agree wholeheartily of condemnation of Europe or Canadians is bad exercise. This is playing into the hands of those that would see us both in ashes. Europe as a whole is 100 million more people than the United States. We always hear of France, Germany or Brits, but as a whole the Euro economy is larger, but military's are smaller along with their budgets. Again, President Obama says if we stick together there will be no problem too large to handle. Problem, sticking together, with the ego's on both sides of the pond.", 
        "intTime": 20090404, 
        "postID": 54, 
        "quote": "", 
        "reply": "I don't see anyone (Europe) giving us anything. As we can't use the Marshall Plan since most of it has been payed back, they can't use we owe them because they aided a war in Arabland. Both had interest, some took the other side. They're in this world the same as we are. I do agree wholeheartily of condemnation of Europe or Canadians is bad exercise. This is playing into the hands of those that would see us both in ashes. Europe as a whole is 100 million more people than the United States. We always hear of France, Germany or Brits, but as a whole the Euro economy is larger, but military's are smaller along with their budgets. Again, President Obama says if we stick together there will be no problem too large to handle. Problem, sticking together, with the ego's on both sides of the pond.", 
        "threadID": "672198221_4870038912001", 
        "time": "2009-04-04 18:33:00", 
        "title": "Obama gets NATO to send 5,000 more mil.trainers&police to Afghanistan", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: Originally posted by EAG154: quote: Originally posted by Grachus: quote: Originally posted by RRR52: Something is better than nothing, but this falls far short of what the administration was really hoping for from the Euros. Unfortunately, for the US. You are aware that all of Europe combined has probably a quarter of our military capability? They've contributed as much money as we have, and you can't get blood from a stone. This is especially true when you consider that for the last eight years, we've been calling them cowards and traitors, and in general covering them with buckets of schit. Pkens post - \"The first time an IED kills a few of them......they'll pull out and go home.\" Is pretty typical of the attitude of many even now. Personally I'm surprised they give us any support. Dave Like Obama said the next terrorist attack will most likely be in Europe, these people had better contribute and lend support. The next group of deaths might be their family and country men! Do you really think they don't know that? Spain doesn't know that? The Spanish, when they pulled out of Iraq, because they called it a BS war, were called cowards and traitors - Of course the men they pulled out of Iraq, went right to Afghanistan... Dave", 
        "intTime": 20090404, 
        "postID": 55, 
        "quote": "Originally posted by EAG154: quote: Originally posted by Grachus: quote: Originally posted by RRR52: Something is better than nothing, but this falls far short of what the administration was really hoping for from the Euros. Unfortunately, for the US. You are aware that all of Europe combined has probably a quarter of our military capability? They've contributed as much money as we have, and you can't get blood from a stone. This is especially true when you consider that for the last eight years, we've been calling them cowards and traitors, and in general covering them with buckets of schit. Pkens post - \"The first time an IED kills a few of them......they'll pull out and go home.\" Is pretty typical of the attitude of many even now. Personally I'm surprised they give us any support. Dave Like Obama said the next terrorist attack will most likely be in Europe, these people had better contribute and lend support. The next group of deaths might be their family and country men!", 
        "reply": " Do you really think they don't know that? Spain doesn't know that? The Spanish, when they pulled out of Iraq, because they called it a BS war, were called cowards and traitors - Of course the men they pulled out of Iraq, went right to Afghanistan... Dave", 
        "threadID": "672198221_4870038912001", 
        "time": "2009-04-04 18:34:00", 
        "title": "Obama gets NATO to send 5,000 more mil.trainers&police to Afghanistan", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by EAG154: quote: Originally posted by Grachus: quote: Originally posted by RRR52: Something is better than nothing, but this falls far short of what the administration was really hoping for from the Euros. Unfortunately, for the US. You are aware that all of Europe combined has probably a quarter of our military capability? They've contributed as much money as we have, and you can't get blood from a stone. This is especially true when you consider that for the last eight years, we've been calling them cowards and traitors, and in general covering them with buckets of schit. Pkens post - \"The first time an IED kills a few of them......they'll pull out and go home.\" Is pretty typical of the attitude of many even now. Personally I'm surprised they give us any support. Dave Like Obama said the next terrorist attack will most likely be in Europe, these people had better contribute and lend support. The next group of deaths might be their family and country men! Do you really think they don't know that? Spain doesn't know that? The Spanish, when they pulled out of Iraq, because they called it a BS war, were called cowards and traitors - Of course the men they pulled out of Iraq, went right to Afghanistan... Dave Did they?... Respectfully, SUNLINER81", 
        "intTime": 20090404, 
        "postID": 56, 
        "quote": "Originally posted by Grachus: quote: Originally posted by EAG154: quote: Originally posted by Grachus: quote: Originally posted by RRR52: Something is better than nothing, but this falls far short of what the administration was really hoping for from the Euros. Unfortunately, for the US. You are aware that all of Europe combined has probably a quarter of our military capability? They've contributed as much money as we have, and you can't get blood from a stone. This is especially true when you consider that for the last eight years, we've been calling them cowards and traitors, and in general covering them with buckets of schit. Pkens post - \"The first time an IED kills a few of them......they'll pull out and go home.\" Is pretty typical of the attitude of many even now. Personally I'm surprised they give us any support. Dave Like Obama said the next terrorist attack will most likely be in Europe, these people had better contribute and lend support. The next group of deaths might be their family and country men! Do you really think they don't know that? Spain doesn't know that? The Spanish, when they pulled out of Iraq, because they called it a BS war, were called cowards and traitors - Of course the men they pulled out of Iraq, went right to Afghanistan... Dave", 
        "reply": " Did they?... Respectfully, SUNLINER81", 
        "threadID": "672198221_4870038912001", 
        "time": "2009-04-04 18:38:00", 
        "title": "Obama gets NATO to send 5,000 more mil.trainers&police to Afghanistan", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: quote: Originally posted by Grachus: quote: Originally posted by EAG154: quote: Originally posted by Grachus: quote: Originally posted by RRR52: Something is better than nothing, but this falls far short of what the administration was really hoping for from the Euros. Unfortunately, for the US. You are aware that all of Europe combined has probably a quarter of our military capability? They've contributed as much money as we have, and you can't get blood from a stone. This is especially true when you consider that for the last eight years, we've been calling them cowards and traitors, and in general covering them with buckets of schit. Pkens post - \"The first time an IED kills a few of them......they'll pull out and go home.\" Is pretty typical of the attitude of many even now. Personally I'm surprised they give us any support. Dave Like Obama said the next terrorist attack will most likely be in Europe, these people had better contribute and lend support. The next group of deaths might be their family and country men! Do you really think they don't know that? Spain doesn't know that? The Spanish, when they pulled out of Iraq, because they called it a BS war, were called cowards and traitors - Of course the men they pulled out of Iraq, went right to Afghanistan... Dave Did they?... Respectfully, SUNLINER81 You bet! And while I'm not going to bust my chops looking for proof, here's the result of the first page of Google after punching in: \"Spain\" +\"Afghanistan\" quote: 10 July 2006 NATO Secretary General Jaap de Hoop Scheffer praised the Spanish government for its commitment to NATO’s Afghanistan mission during a visit to Madrid on 10 July. Mr. De Hoop Scheffer expressed his condolences for the death on 8 July of a Spanish soldier serving in the NATO-led force in Afghanistan, in an explosion which wounded four other Spanish soldiers. He said the Alliance remained fully committed to its “number one” priority and stressed the importance of the mission in the context of the fight against terrorism. \"http://www.nato.int/docu/update/2006/07-july/e0710a.htm\" Dave", 
        "intTime": 20090404, 
        "postID": 57, 
        "quote": "Originally posted by SUNLINER81: quote: Originally posted by Grachus: quote: Originally posted by EAG154: quote: Originally posted by Grachus: quote: Originally posted by RRR52: Something is better than nothing, but this falls far short of what the administration was really hoping for from the Euros. Unfortunately, for the US. You are aware that all of Europe combined has probably a quarter of our military capability? They've contributed as much money as we have, and you can't get blood from a stone. This is especially true when you consider that for the last eight years, we've been calling them cowards and traitors, and in general covering them with buckets of schit. Pkens post - \"The first time an IED kills a few of them......they'll pull out and go home.\" Is pretty typical of the attitude of many even now. Personally I'm surprised they give us any support. Dave Like Obama said the next terrorist attack will most likely be in Europe, these people had better contribute and lend support. The next group of deaths might be their family and country men! Do you really think they don't know that? Spain doesn't know that? The Spanish, when they pulled out of Iraq, because they called it a BS war, were called cowards and traitors - Of course the men they pulled out of Iraq, went right to Afghanistan... Dave Did they?... Respectfully, SUNLINER81", 
        "reply": " You bet! And while I'm not going to bust my chops looking for proof, here's the result of the first page of Google after punching in: \"Spain\" +\"Afghanistan\" quote: 10 July 2006 NATO Secretary General Jaap de Hoop Scheffer praised the Spanish government for its commitment to NATO’s Afghanistan mission during a visit to Madrid on 10 July. Mr. De Hoop Scheffer expressed his condolences for the death on 8 July of a Spanish soldier serving in the NATO-led force in Afghanistan, in an explosion which wounded four other Spanish soldiers. He said the Alliance remained fully committed to its “number one” priority and stressed the importance of the mission in the context of the fight against terrorism. \"http://www.nato.int/docu/update/2006/07-july/e0710a.htm\" Dave", 
        "threadID": "672198221_4870038912001", 
        "time": "2009-04-04 18:52:00", 
        "title": "Obama gets NATO to send 5,000 more mil.trainers&police to Afghanistan", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by EAG154: quote: Originally posted by Grachus: quote: Originally posted by RRR52: Something is better than nothing, but this falls far short of what the administration was really hoping for from the Euros. Unfortunately, for the US. You are aware that all of Europe combined has probably a quarter of our military capability? They've contributed as much money as we have, and you can't get blood from a stone. This is especially true when you consider that for the last eight years, we've been calling them cowards and traitors, and in general covering them with buckets of schit. Pkens post - \"The first time an IED kills a few of them......they'll pull out and go home.\" Is pretty typical of the attitude of many even now. Personally I'm surprised they give us any support. Dave Like Obama said the next terrorist attack will most likely be in Europe, these people had better contribute and lend support. The next group of deaths might be their family and country men! Do you really think they don't know that? Spain doesn't know that? The Spanish, when they pulled out of Iraq, because they called it a BS war, were called cowards and traitors - Of course the men they pulled out of Iraq, went right to Afghanistan... Dave shure they know, problem is they would rather we carry the load, mabey with Obamas popularity in Europia they will kick in more!", 
        "intTime": 20090404, 
        "postID": 58, 
        "quote": "Originally posted by Grachus: quote: Originally posted by EAG154: quote: Originally posted by Grachus: quote: Originally posted by RRR52: Something is better than nothing, but this falls far short of what the administration was really hoping for from the Euros. Unfortunately, for the US. You are aware that all of Europe combined has probably a quarter of our military capability? They've contributed as much money as we have, and you can't get blood from a stone. This is especially true when you consider that for the last eight years, we've been calling them cowards and traitors, and in general covering them with buckets of schit. Pkens post - \"The first time an IED kills a few of them......they'll pull out and go home.\" Is pretty typical of the attitude of many even now. Personally I'm surprised they give us any support. Dave Like Obama said the next terrorist attack will most likely be in Europe, these people had better contribute and lend support. The next group of deaths might be their family and country men! Do you really think they don't know that? Spain doesn't know that? The Spanish, when they pulled out of Iraq, because they called it a BS war, were called cowards and traitors - Of course the men they pulled out of Iraq, went right to Afghanistan... Dave", 
        "reply": " shure they know, problem is they would rather we carry the load, mabey with Obamas popularity in Europia they will kick in more!", 
        "threadID": "672198221_4870038912001", 
        "time": "2009-04-04 20:51:00", 
        "title": "Obama gets NATO to send 5,000 more mil.trainers&police to Afghanistan", 
        "userID": "EAG154"
    }, 
    {
        "content": "more gestures of nothingness... make it look like he is doing something but in fact is doing nothing...", 
        "intTime": 20090404, 
        "postID": 59, 
        "quote": "", 
        "reply": "more gestures of nothingness... make it look like he is doing something but in fact is doing nothing...", 
        "threadID": "672198221_4870038912001", 
        "time": "2009-04-04 21:04:00", 
        "title": "Obama gets NATO to send 5,000 more mil.trainers&police to Afghanistan", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by _cash_: The first time an IED kills a few of them......they'll pull out and go home. yea if they even go...", 
        "intTime": 20090404, 
        "postID": 60, 
        "quote": "Originally posted by _cash_: The first time an IED kills a few of them......they'll pull out and go home.", 
        "reply": " yea if they even go...", 
        "threadID": "672198221_4870038912001", 
        "time": "2009-04-04 21:09:00", 
        "title": "Obama gets NATO to send 5,000 more mil.trainers&police to Afghanistan", 
        "userID": "outlaws93"
    }
]