[
    {
        "content": "\"http://www.timesonline.co.uk/tol/news/uk/article5822265.ece\" I will never forget those words coming from Reagan, Bush Jr and Bush Sr. It must be in the President's secret notebook passdown as well since President Obama is now acting on it. \"The New World Order\" Thank you Republicans for searing the sovereignty of my nation and my flag. In the name of economic freedom, you have pushed our personal freedoms and liberties aside because they will be the next to go global.", 
        "intTime": 20090302, 
        "postID": 1, 
        "quote": "", 
        "reply": "\"http://www.timesonline.co.uk/tol/news/uk/article5822265.ece\" I will never forget those words coming from Reagan, Bush Jr and Bush Sr. It must be in the President's secret notebook passdown as well since President Obama is now acting on it. \"The New World Order\" Thank you Republicans for searing the sovereignty of my nation and my flag. In the name of economic freedom, you have pushed our personal freedoms and liberties aside because they will be the next to go global.", 
        "threadID": "672198221_5700027612001", 
        "time": "2009-03-02 15:34:00", 
        "title": "Republican Globalist Finally Get Their Wish..A Global Economy", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: \"http://www.timesonline.co.uk/tol/news/uk/article5822265.ece\" I will never forget those words coming from Reagan, Bush Jr and Bush Sr. It must be in the President's secret notebook passdown as well since President Obama is now acting on it. \"The New World Order\" Thank you Republicans for searing the sovereignty of my nation and my flag. In the name of economic freedom, you have pushed our personal freedoms and liberties aside because they will be the next to go global. A little late Cracker \"The term \"new world order\" has been used to refer to a new period of history evidencing a dramatic change in world political thought and the balance of power. The first Western usages of the term surrounded Woodrow Wilson's Fourteen Points and call for a League of Nations following the devastation of World War I. The phrase was used sparingly at the end of the Second World War when describing the plans for the United Nations and Bretton Woods system, in part because of the negative association to the failed League of Nations the phrase would bring. In retrospect however, many commentators have applied the term retroactively to the order put in place by the WWII victors as a \"new world order.\" \"http://en.wikipedia.org/wiki/New_world_order\" You could go back to the time of Theodore Roosevelt sending an armada into the Hawiian isles and the Philippines since this led to occupation and colonialism for both.", 
        "intTime": 20090302, 
        "postID": 2, 
        "quote": "Originally posted by crackerjacks61: \"http://www.timesonline.co.uk/tol/news/uk/article5822265.ece\" I will never forget those words coming from Reagan, Bush Jr and Bush Sr. It must be in the President's secret notebook passdown as well since President Obama is now acting on it. \"The New World Order\" Thank you Republicans for searing the sovereignty of my nation and my flag. In the name of economic freedom, you have pushed our personal freedoms and liberties aside because they will be the next to go global.", 
        "reply": " A little late Cracker \"The term \"new world order\" has been used to refer to a new period of history evidencing a dramatic change in world political thought and the balance of power. The first Western usages of the term surrounded Woodrow Wilson's Fourteen Points and call for a League of Nations following the devastation of World War I. The phrase was used sparingly at the end of the Second World War when describing the plans for the United Nations and Bretton Woods system, in part because of the negative association to the failed League of Nations the phrase would bring. In retrospect however, many commentators have applied the term retroactively to the order put in place by the WWII victors as a \"new world order.\" \"http://en.wikipedia.org/wiki/New_world_order\" You could go back to the time of Theodore Roosevelt sending an armada into the Hawiian isles and the Philippines since this led to occupation and colonialism for both.", 
        "threadID": "672198221_5700027612001", 
        "time": "2009-03-02 16:37:00", 
        "title": "Republican Globalist Finally Get Their Wish..A Global Economy", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "Bet they have a 'plan' to salvage the wreck after it piles up on the rocks. And we'll all be glad they did.", 
        "intTime": 20090303, 
        "postID": 3, 
        "quote": "", 
        "reply": "Bet they have a 'plan' to salvage the wreck after it piles up on the rocks. And we'll all be glad they did.", 
        "threadID": "672198221_5700027612001", 
        "time": "2009-03-03 08:17:00", 
        "title": "Republican Globalist Finally Get Their Wish..A Global Economy", 
        "userID": "popsiq"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: \"http://www.timesonline.co.uk/tol/news/uk/article5822265.ece\" I will never forget those words coming from Reagan, Bush Jr and Bush Sr. It must be in the President's secret notebook passdown as well since President Obama is now acting on it. \"The New World Order\" Thank you Republicans for searing the sovereignty of my nation and my flag. In the name of economic freedom, you have pushed our personal freedoms and liberties aside because they will be the next to go global. CJ, don't forget to thank Dems. If you think that they're not to blame also, you're wrong. Remember a certain POTUS who ran against NAFTA & then signed it? What has that done to US jobs & furthering the New World Order. Our problem is that we always see the \"other guy\"(Dems or Repubs) as the bad guy. We buy into a soundbite & don't look past it. It sounds too good to look any further, we may not like what we find.", 
        "intTime": 20090303, 
        "postID": 4, 
        "quote": "Originally posted by crackerjacks61: \"http://www.timesonline.co.uk/tol/news/uk/article5822265.ece\" I will never forget those words coming from Reagan, Bush Jr and Bush Sr. It must be in the President's secret notebook passdown as well since President Obama is now acting on it. \"The New World Order\" Thank you Republicans for searing the sovereignty of my nation and my flag. In the name of economic freedom, you have pushed our personal freedoms and liberties aside because they will be the next to go global.", 
        "reply": " CJ, don't forget to thank Dems. If you think that they're not to blame also, you're wrong. Remember a certain POTUS who ran against NAFTA & then signed it? What has that done to US jobs & furthering the New World Order. Our problem is that we always see the \"other guy\"(Dems or Repubs) as the bad guy. We buy into a soundbite & don't look past it. It sounds too good to look any further, we may not like what we find.", 
        "threadID": "672198221_5700027612001", 
        "time": "2009-03-03 09:12:00", 
        "title": "Republican Globalist Finally Get Their Wish..A Global Economy", 
        "userID": "67NOV"
    }
]