[
    {
        "content": "VAT Sales Tax AND still an Income Tax. We need the FT that would get rid of Income Tax. \"http://www.washingtonpost.com/wp-dyn/content/article/2009/05/26/AR2009052602909_pf.html\"", 
        "intTime": 20090527, 
        "postID": 1, 
        "quote": "", 
        "reply": "VAT Sales Tax AND still an Income Tax. We need the FT that would get rid of Income Tax. \"http://www.washingtonpost.com/wp-dyn/content/article/2009/05/26/AR2009052602909_pf.html\"", 
        "threadID": "672198221_4070024422001", 
        "time": "2009-05-27 15:31:00", 
        "title": "U.S. Sales Tax Gets Fresh Look", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "The Taxaholics are in charge, so much for his promise not to raise taxes on the Middle Class. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090527, 
        "postID": 2, 
        "quote": "", 
        "reply": "The Taxaholics are in charge, so much for his promise not to raise taxes on the Middle Class. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_4070024422001", 
        "time": "2009-05-27 15:36:00", 
        "title": "U.S. Sales Tax Gets Fresh Look", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: The Taxaholics are in charge, so much for his promise not to raise taxes on the Middle Class. They are looking at a \"higher income tax\" tax along with a VAT. I do not and will not support a VAT and an Income Tax because I do not support an income tax period. Reps need to get on board with the Fair Tax or were going to end up with both. That is what I was afraid of would happen no matter which party was in charge. Of course taxing the rich will get all of us, when is the little guy ever left out of paying anything? NEVER! and the big rich republicans are soo worried they are they ones getting screwed or my fellow middle class are of afraid of \"class warfare\" hurting the rich man...PLEASE!", 
        "intTime": 20090527, 
        "postID": 3, 
        "quote": "Originally posted by L0A1: The Taxaholics are in charge, so much for his promise not to raise taxes on the Middle Class.", 
        "reply": " They are looking at a \"higher income tax\" tax along with a VAT. I do not and will not support a VAT and an Income Tax because I do not support an income tax period. Reps need to get on board with the Fair Tax or were going to end up with both. That is what I was afraid of would happen no matter which party was in charge. Of course taxing the rich will get all of us, when is the little guy ever left out of paying anything? NEVER! and the big rich republicans are soo worried they are they ones getting screwed or my fellow middle class are of afraid of \"class warfare\" hurting the rich man...PLEASE!", 
        "threadID": "672198221_4070024422001", 
        "time": "2009-05-27 15:56:00", 
        "title": "U.S. Sales Tax Gets Fresh Look", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: quote: Originally posted by L0A1: The Taxaholics are in charge, so much for his promise not to raise taxes on the Middle Class. They are looking at a \"higher income tax\" tax along with a VAT. I do not and will not support a VAT and an Income Tax because I do not support an income tax period. Reps need to get on board with the Fair Tax or were going to end up with both. That is what I was afraid of would happen no matter which party was in charge. Of course taxing the rich will get all of us, when is the little guy ever left out of paying anything? NEVER! and the big rich republicans are soo worried they are they ones getting screwed or my fellow middle class are of afraid of \"class warfare\" hurting the rich man...PLEASE! Oh you know how I feel as well, I would go for either a VAT with a FLAT tax, no income tax. Or Fair Tax without VAT. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090527, 
        "postID": 4, 
        "quote": "Originally posted by crackerjacks61: quote: Originally posted by L0A1: The Taxaholics are in charge, so much for his promise not to raise taxes on the Middle Class. They are looking at a \"higher income tax\" tax along with a VAT. I do not and will not support a VAT and an Income Tax because I do not support an income tax period. Reps need to get on board with the Fair Tax or were going to end up with both. That is what I was afraid of would happen no matter which party was in charge. Of course taxing the rich will get all of us, when is the little guy ever left out of paying anything? NEVER! and the big rich republicans are soo worried they are they ones getting screwed or my fellow middle class are of afraid of \"class warfare\" hurting the rich man...PLEASE!", 
        "reply": " Oh you know how I feel as well, I would go for either a VAT with a FLAT tax, no income tax. Or Fair Tax without VAT. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_4070024422001", 
        "time": "2009-05-27 15:59:00", 
        "title": "U.S. Sales Tax Gets Fresh Look", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by crackerjacks61: quote: Originally posted by L0A1: The Taxaholics are in charge, so much for his promise not to raise taxes on the Middle Class. They are looking at a \"higher income tax\" tax along with a VAT. I do not and will not support a VAT and an Income Tax because I do not support an income tax period. Reps need to get on board with the Fair Tax or were going to end up with both. That is what I was afraid of would happen no matter which party was in charge. Of course taxing the rich will get all of us, when is the little guy ever left out of paying anything? NEVER! and the big rich republicans are soo worried they are they ones getting screwed or my fellow middle class are of afraid of \"class warfare\" hurting the rich man...PLEASE! Oh you know how I feel as well, I would go for either a VAT with a FLAT tax, no income tax. Or Fair Tax without VAT. Ain't gonna happen. Replacing the income tax with a flat tax has been the wet dream of Conseervatives for years. They've learned that they have to give these sales taxes a new name, and new trimings - and thus the \"name\" Flat tax. Complicated beyond belief, in the way it hits the poorest, it's simple as hell for the wealthy - Pay less, pass the real costs of society onto the States where ALL taxes are flat. Obama, while barely a liberal, will smell a rat. Dave", 
        "intTime": 20090527, 
        "postID": 5, 
        "quote": "Originally posted by L0A1: quote: Originally posted by crackerjacks61: quote: Originally posted by L0A1: The Taxaholics are in charge, so much for his promise not to raise taxes on the Middle Class. They are looking at a \"higher income tax\" tax along with a VAT. I do not and will not support a VAT and an Income Tax because I do not support an income tax period. Reps need to get on board with the Fair Tax or were going to end up with both. That is what I was afraid of would happen no matter which party was in charge. Of course taxing the rich will get all of us, when is the little guy ever left out of paying anything? NEVER! and the big rich republicans are soo worried they are they ones getting screwed or my fellow middle class are of afraid of \"class warfare\" hurting the rich man...PLEASE! Oh you know how I feel as well, I would go for either a VAT with a FLAT tax, no income tax. Or Fair Tax without VAT.", 
        "reply": " Ain't gonna happen. Replacing the income tax with a flat tax has been the wet dream of Conseervatives for years. They've learned that they have to give these sales taxes a new name, and new trimings - and thus the \"name\" Flat tax. Complicated beyond belief, in the way it hits the poorest, it's simple as hell for the wealthy - Pay less, pass the real costs of society onto the States where ALL taxes are flat. Obama, while barely a liberal, will smell a rat. Dave", 
        "threadID": "672198221_4070024422001", 
        "time": "2009-05-27 16:32:00", 
        "title": "U.S. Sales Tax Gets Fresh Look", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by L0A1: quote: Originally posted by crackerjacks61: quote: Originally posted by L0A1: The Taxaholics are in charge, so much for his promise not to raise taxes on the Middle Class. They are looking at a \"higher income tax\" tax along with a VAT. I do not and will not support a VAT and an Income Tax because I do not support an income tax period. Reps need to get on board with the Fair Tax or were going to end up with both. That is what I was afraid of would happen no matter which party was in charge. Of course taxing the rich will get all of us, when is the little guy ever left out of paying anything? NEVER! and the big rich republicans are soo worried they are they ones getting screwed or my fellow middle class are of afraid of \"class warfare\" hurting the rich man...PLEASE! Oh you know how I feel as well, I would go for either a VAT with a FLAT tax, no income tax. Or Fair Tax without VAT. Ain't gonna happen. Replacing the income tax with a flat tax has been the wet dream of Conseervatives for years. They've learned that they have to give these sales taxes a new name, and new trimings - and thus the \"name\" Flat tax. Complicated beyond belief, in the way it hits the poorest, it's simple as hell for the wealthy - Pay less, pass the real costs of society onto the States where ALL taxes are flat. Obama, while barely a liberal, will smell a rat. Dave You could of at least humored us. But VAT and Income tax is complete BS. You know it, I know it. Especially after he promised no one making under 250,000.00 would see a tax increase. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090527, 
        "postID": 6, 
        "quote": "Originally posted by Grachus: quote: Originally posted by L0A1: quote: Originally posted by crackerjacks61: quote: Originally posted by L0A1: The Taxaholics are in charge, so much for his promise not to raise taxes on the Middle Class. They are looking at a \"higher income tax\" tax along with a VAT. I do not and will not support a VAT and an Income Tax because I do not support an income tax period. Reps need to get on board with the Fair Tax or were going to end up with both. That is what I was afraid of would happen no matter which party was in charge. Of course taxing the rich will get all of us, when is the little guy ever left out of paying anything? NEVER! and the big rich republicans are soo worried they are they ones getting screwed or my fellow middle class are of afraid of \"class warfare\" hurting the rich man...PLEASE! Oh you know how I feel as well, I would go for either a VAT with a FLAT tax, no income tax. Or Fair Tax without VAT. Ain't gonna happen. Replacing the income tax with a flat tax has been the wet dream of Conseervatives for years. They've learned that they have to give these sales taxes a new name, and new trimings - and thus the \"name\" Flat tax. Complicated beyond belief, in the way it hits the poorest, it's simple as hell for the wealthy - Pay less, pass the real costs of society onto the States where ALL taxes are flat. Obama, while barely a liberal, will smell a rat. Dave", 
        "reply": " You could of at least humored us. But VAT and Income tax is complete BS. You know it, I know it. Especially after he promised no one making under 250,000.00 would see a tax increase. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_4070024422001", 
        "time": "2009-05-27 16:57:00", 
        "title": "U.S. Sales Tax Gets Fresh Look", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by Grachus: Ain't gonna happen. Replacing the income tax with a flat tax has been the wet dream of Conseervatives for years. They've learned that they have to give these sales taxes a new name, and new trimings - and thus the \"name\" Flat tax. Complicated beyond belief, in the way it hits the poorest, it's simple as hell for the wealthy - Pay less, pass the real costs of society onto the States where ALL taxes are flat. Obama, while barely a liberal, will smell a rat. Dave quote: Originally posted by L0A1: You could of at least humored us. But VAT and Income tax is complete BS. You know it, I know it. Especially after he promised no one making under 250,000.00 would see a tax increase. One thing I've noticed about Obama is that he makes a virtue out of \"tact.\" Normally I regard this as a big plus. Too soon to say if this is the case with him... But when his spokespersons say, \"(close paraphrase) that the President doesn't take ideas like this seriously, but naturally everything is on the table,\" those first words tell me what his real attitude is. Ain't gonna happen, making the last part of your statement, a brutal attack on thin air... Dave", 
        "intTime": 20090527, 
        "postID": 7, 
        "quote": "Originally posted by Grachus: Ain't gonna happen. Replacing the income tax with a flat tax has been the wet dream of Conseervatives for years. They've learned that they have to give these sales taxes a new name, and new trimings - and thus the \"name\" Flat tax. Complicated beyond belief, in the way it hits the poorest, it's simple as hell for the wealthy - Pay less, pass the real costs of society onto the States where ALL taxes are flat. Obama, while barely a liberal, will smell a rat. Dave", 
        "reply": " quote: Originally posted by L0A1: You could of at least humored us. But VAT and Income tax is complete BS. You know it, I know it. Especially after he promised no one making under 250,000.00 would see a tax increase. One thing I've noticed about Obama is that he makes a virtue out of \"tact.\" Normally I regard this as a big plus. Too soon to say if this is the case with him... But when his spokespersons say, \"(close paraphrase) that the President doesn't take ideas like this seriously, but naturally everything is on the table,\" those first words tell me what his real attitude is. Ain't gonna happen, making the last part of your statement, a brutal attack on thin air... Dave", 
        "threadID": "672198221_4070024422001", 
        "time": "2009-05-27 17:04:00", 
        "title": "U.S. Sales Tax Gets Fresh Look", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by L0A1: The Taxaholics are in charge, so much for his promise not to raise taxes on the Middle Class. The Change you Wanted is the Change you got", 
        "intTime": 20090527, 
        "postID": 8, 
        "quote": "Originally posted by L0A1: The Taxaholics are in charge, so much for his promise not to raise taxes on the Middle Class.", 
        "reply": " The Change you Wanted is the Change you got", 
        "threadID": "672198221_4070024422001", 
        "time": "2009-05-27 17:54:00", 
        "title": "U.S. Sales Tax Gets Fresh Look", 
        "userID": "ss_287"
    }, 
    {
        "content": "quote: Originally posted by L0A1: The Taxaholics are in charge, so much for his promise not to raise taxes on the Middle Class. Seems to me the \"Taxaholics \" have been in charge since 1913. The reps have had PLENTY of time to right a wrong but they chose NOT to. So yeah, support them and vote for them again next time people, that will put things back the way they should be.", 
        "intTime": 20090527, 
        "postID": 9, 
        "quote": "Originally posted by L0A1: The Taxaholics are in charge, so much for his promise not to raise taxes on the Middle Class.", 
        "reply": " Seems to me the \"Taxaholics \" have been in charge since 1913. The reps have had PLENTY of time to right a wrong but they chose NOT to. So yeah, support them and vote for them again next time people, that will put things back the way they should be.", 
        "threadID": "672198221_4070024422001", 
        "time": "2009-05-27 18:38:00", 
        "title": "U.S. Sales Tax Gets Fresh Look", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "L0A1; quote: You could of at least humored us. But VAT and Income tax is complete BS. You know it, I know it. Especially after he promised no one making under 250,000.00 would see a tax increase. He was only referring to an income tax increase.. but even that is a lie, if they allow the Bush tax cuts to expire like they are supposed to, and which HE IS IN favor of..", 
        "intTime": 20090527, 
        "postID": 10, 
        "quote": "You could of at least humored us. But VAT and Income tax is complete BS. You know it, I know it. Especially after he promised no one making under 250,000.00 would see a tax increase.", 
        "reply": "L0A1;  He was only referring to an income tax increase.. but even that is a lie, if they allow the Bush tax cuts to expire like they are supposed to, and which HE IS IN favor of..", 
        "threadID": "672198221_4070024422001", 
        "time": "2009-05-27 21:04:00", 
        "title": "U.S. Sales Tax Gets Fresh Look", 
        "userID": "3678131"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: quote: Originally posted by L0A1: The Taxaholics are in charge, so much for his promise not to raise taxes on the Middle Class. Seems to me the \"Taxaholics \" have been in charge since 1913. The reps have had PLENTY of time to right a wrong but they chose NOT to. So yeah, support them and vote for them again next time people, that will put things back the way they should be. Remember Steve Forbes? He ran for president in '96. His platform included a flat tax. When he appeared on CBS News his ideas were called a \"scheme.\" For CBS reporter Bernie Goldberg this led to his exit from the network he had come to view as biased to the political left. Read about it in his book. I did.", 
        "intTime": 20090527, 
        "postID": 11, 
        "quote": "Originally posted by crackerjacks61: quote: Originally posted by L0A1: The Taxaholics are in charge, so much for his promise not to raise taxes on the Middle Class. Seems to me the \"Taxaholics \" have been in charge since 1913. The reps have had PLENTY of time to right a wrong but they chose NOT to. So yeah, support them and vote for them again next time people, that will put things back the way they should be.", 
        "reply": " Remember Steve Forbes? He ran for president in '96. His platform included a flat tax. When he appeared on CBS News his ideas were called a \"scheme.\" For CBS reporter Bernie Goldberg this led to his exit from the network he had come to view as biased to the political left. Read about it in his book. I did.", 
        "threadID": "672198221_4070024422001", 
        "time": "2009-05-27 23:15:00", 
        "title": "U.S. Sales Tax Gets Fresh Look", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "it's people that do the voting but everyone is caught on this it's gota be dem or rep kick. and if it does not fit the dem or rep agenda, it's no good.", 
        "intTime": 20090531, 
        "postID": 12, 
        "quote": "", 
        "reply": "it's people that do the voting but everyone is caught on this it's gota be dem or rep kick. and if it does not fit the dem or rep agenda, it's no good.", 
        "threadID": "672198221_4070024422001", 
        "time": "2009-05-31 01:43:00", 
        "title": "U.S. Sales Tax Gets Fresh Look", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "Taxes, after all, are dues that we pay for the privileges of membership in an organized society. ~Franklin D. Roosevelt All governments require taxes in order to provide the services the its people need. The taxes should be allocated among the people in a fair manner and based upon the ability to pay. The \"flat tax\" and the VAT are allocated unfairly among the people. They are based generally upon the expenditures of the individual and are unrelated to the individual's ability to pay. Consequently, the poor would pay a greater percentage of their incomes in this form of taxes than would the wealthy. The fairest form of taxation is the progressive income tax. It levies a greater amount and percentage from the wealthy than it does from the poorer individual -- and that is the way it should be. Let's never fall into the trap of the politician's dream tax -- the flat tax or the VAT or a national sales tax, whatever it is called!", 
        "intTime": 20090531, 
        "postID": 13, 
        "quote": "", 
        "reply": "Taxes, after all, are dues that we pay for the privileges of membership in an organized society. ~Franklin D. Roosevelt All governments require taxes in order to provide the services the its people need. The taxes should be allocated among the people in a fair manner and based upon the ability to pay. The \"flat tax\" and the VAT are allocated unfairly among the people. They are based generally upon the expenditures of the individual and are unrelated to the individual's ability to pay. Consequently, the poor would pay a greater percentage of their incomes in this form of taxes than would the wealthy. The fairest form of taxation is the progressive income tax. It levies a greater amount and percentage from the wealthy than it does from the poorer individual -- and that is the way it should be. Let's never fall into the trap of the politician's dream tax -- the flat tax or the VAT or a national sales tax, whatever it is called!", 
        "threadID": "672198221_4070024422001", 
        "time": "2009-05-31 11:12:00", 
        "title": "U.S. Sales Tax Gets Fresh Look", 
        "userID": "fnewt"
    }, 
    {
        "content": "quote: Originally posted by fnewt: Taxes, after all, are dues that we pay for the privileges of membership in an organized society. ~Franklin D. Roosevelt All governments require taxes in order to provide the services the its people need. The taxes should be allocated among the people in a fair manner and based upon the ability to pay. The \"flat tax\" and the VAT are allocated unfairly among the people. They are based generally upon the expenditures of the individual and are unrelated to the individual's ability to pay. Consequently, the poor would pay a greater percentage of their incomes in this form of taxes than would the wealthy. The fairest form of taxation is the progressive income tax. It levies a greater amount and percentage from the wealthy than it does from the poorer individual -- and that is the way it should be. Let's never fall into the trap of the politician's dream tax -- the flat tax or the VAT or a national sales tax, whatever it is called! Dave", 
        "intTime": 20090531, 
        "postID": 14, 
        "quote": "Originally posted by fnewt: Taxes, after all, are dues that we pay for the privileges of membership in an organized society. ~Franklin D. Roosevelt All governments require taxes in order to provide the services the its people need. The taxes should be allocated among the people in a fair manner and based upon the ability to pay. The \"flat tax\" and the VAT are allocated unfairly among the people. They are based generally upon the expenditures of the individual and are unrelated to the individual's ability to pay. Consequently, the poor would pay a greater percentage of their incomes in this form of taxes than would the wealthy. The fairest form of taxation is the progressive income tax. It levies a greater amount and percentage from the wealthy than it does from the poorer individual -- and that is the way it should be. Let's never fall into the trap of the politician's dream tax -- the flat tax or the VAT or a national sales tax, whatever it is called!", 
        "reply": " Dave", 
        "threadID": "672198221_4070024422001", 
        "time": "2009-05-31 11:18:00", 
        "title": "U.S. Sales Tax Gets Fresh Look", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: VAT Sales Tax AND still an Income Tax. We need the FT that would get rid of Income Tax. \"http://www.washingtonpost.com/wp-dyn/content/article/2009/05/26/AR2009052602909_pf.html\" If you'd scream about the debt as much as you are about how we are taxed--who is and who isn't--maybe a lot of this conversation wouldn't be necessary?", 
        "intTime": 20090531, 
        "postID": 15, 
        "quote": "Originally posted by crackerjacks61: VAT Sales Tax AND still an Income Tax. We need the FT that would get rid of Income Tax. \"http://www.washingtonpost.com/wp-dyn/content/article/2009/05/26/AR2009052602909_pf.html\"", 
        "reply": " If you'd scream about the debt as much as you are about how we are taxed--who is and who isn't--maybe a lot of this conversation wouldn't be necessary?", 
        "threadID": "672198221_4070024422001", 
        "time": "2009-05-31 12:36:00", 
        "title": "U.S. Sales Tax Gets Fresh Look", 
        "userID": "busnrete8"
    }, 
    {
        "content": "Dave - Thanks for all that applause. Frank", 
        "intTime": 20090601, 
        "postID": 16, 
        "quote": "", 
        "reply": "Dave - Thanks for all that applause. Frank", 
        "threadID": "672198221_4070024422001", 
        "time": "2009-06-01 07:03:00", 
        "title": "U.S. Sales Tax Gets Fresh Look", 
        "userID": "fnewt"
    }, 
    {
        "content": "quote: Originally posted by fnewt: Taxes, after all, are dues that we pay for the privileges of membership in an organized society. ~Franklin D. Roosevelt All governments require taxes in order to provide the services the its people need. The taxes should be allocated among the people in a fair manner and based upon the ability to pay. The \"flat tax\" and the VAT are allocated unfairly among the people. They are based generally upon the expenditures of the individual and are unrelated to the individual's ability to pay. Consequently, the poor would pay a greater percentage of their incomes in this form of taxes than would the wealthy. The fairest form of taxation is the progressive income tax. It levies a greater amount and percentage from the wealthy than it does from the poorer individual -- and that is the way it should be. Let's never fall into the trap of the politician's dream tax -- the flat tax or the VAT or a national sales tax, whatever it is called! I actually agree with most of this. A national sales tax, increased gas taxes, or whatever will impact the lower and middle classes more than anyone. That is why I am against them. On income taxes, I think that several \"flat\" rates coupled to doing away with a lot of deductions (except for dependents so familiy size can be taken into account) could work. Have a progressive scale, but without all the loopholes and write offs. I do not think one size fits all flat rate would be the utopian answer some believe. The argument/disagreement is definition of \"fair\" tax rates. Some believe that 60,70, or higher percentage tax rates on the \"rich\" or \"wealthy\" is OK. I do not.", 
        "intTime": 20090601, 
        "postID": 17, 
        "quote": "Originally posted by fnewt: Taxes, after all, are dues that we pay for the privileges of membership in an organized society. ~Franklin D. Roosevelt All governments require taxes in order to provide the services the its people need. The taxes should be allocated among the people in a fair manner and based upon the ability to pay. The \"flat tax\" and the VAT are allocated unfairly among the people. They are based generally upon the expenditures of the individual and are unrelated to the individual's ability to pay. Consequently, the poor would pay a greater percentage of their incomes in this form of taxes than would the wealthy. The fairest form of taxation is the progressive income tax. It levies a greater amount and percentage from the wealthy than it does from the poorer individual -- and that is the way it should be. Let's never fall into the trap of the politician's dream tax -- the flat tax or the VAT or a national sales tax, whatever it is called!", 
        "reply": " I actually agree with most of this. A national sales tax, increased gas taxes, or whatever will impact the lower and middle classes more than anyone. That is why I am against them. On income taxes, I think that several \"flat\" rates coupled to doing away with a lot of deductions (except for dependents so familiy size can be taken into account) could work. Have a progressive scale, but without all the loopholes and write offs. I do not think one size fits all flat rate would be the utopian answer some believe. The argument/disagreement is definition of \"fair\" tax rates. Some believe that 60,70, or higher percentage tax rates on the \"rich\" or \"wealthy\" is OK. I do not.", 
        "threadID": "672198221_4070024422001", 
        "time": "2009-06-01 07:20:00", 
        "title": "U.S. Sales Tax Gets Fresh Look", 
        "userID": "sw614"
    }, 
    {
        "content": "\"Complicated beyond belief, in the way it hits the poorest, it's simple as hell for the wealthy - Pay less, pass the real costs of society onto the States where ALL taxes are flat.\" Sales taxes, property taxes, etc, are flat. Most income taxes, in those states who have them, are progressive. So not ALL taxes are flat. Of course, we all understand you believe the federal government should pay for everything....", 
        "intTime": 20090601, 
        "postID": 18, 
        "quote": "", 
        "reply": "\"Complicated beyond belief, in the way it hits the poorest, it's simple as hell for the wealthy - Pay less, pass the real costs of society onto the States where ALL taxes are flat.\" Sales taxes, property taxes, etc, are flat. Most income taxes, in those states who have them, are progressive. So not ALL taxes are flat. Of course, we all understand you believe the federal government should pay for everything....", 
        "threadID": "672198221_4070024422001", 
        "time": "2009-06-01 07:23:00", 
        "title": "U.S. Sales Tax Gets Fresh Look", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: The fairest form of taxation is the progressive income tax. It levies a greater amount and percentage from the wealthy than it does from the poorer individual -- and that is the way it should be. If you're Communist.", 
        "intTime": 20090601, 
        "postID": 19, 
        "quote": "The fairest form of taxation is the progressive income tax. It levies a greater amount and percentage from the wealthy than it does from the poorer individual -- and that is the way it should be.", 
        "reply": " If you're Communist.", 
        "threadID": "672198221_4070024422001", 
        "time": "2009-06-01 11:39:00", 
        "title": "U.S. Sales Tax Gets Fresh Look", 
        "userID": "shuman14"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: quote: Originally posted by L0A1: The Taxaholics are in charge, so much for his promise not to raise taxes on the Middle Class. They are looking at a \"higher income tax\" tax along with a VAT. I do not and will not support a VAT and an Income Tax because I do not support an income tax period. Reps need to get on board with the Fair Tax or were going to end up with both. That is what I was afraid of would happen no matter which party was in charge. Of course taxing the rich will get all of us, when is the little guy ever left out of paying anything? NEVER! and the big rich republicans are soo worried they are they ones getting screwed or my fellow middle class are of afraid of \"class warfare\" hurting the rich man...PLEASE! Well, to a certain extent, I agree with you, THAT'S SPOOKY!... Respectfully, SUNLINER81", 
        "intTime": 20090601, 
        "postID": 20, 
        "quote": "Originally posted by crackerjacks61: quote: Originally posted by L0A1: The Taxaholics are in charge, so much for his promise not to raise taxes on the Middle Class. They are looking at a \"higher income tax\" tax along with a VAT. I do not and will not support a VAT and an Income Tax because I do not support an income tax period. Reps need to get on board with the Fair Tax or were going to end up with both. That is what I was afraid of would happen no matter which party was in charge. Of course taxing the rich will get all of us, when is the little guy ever left out of paying anything? NEVER! and the big rich republicans are soo worried they are they ones getting screwed or my fellow middle class are of afraid of \"class warfare\" hurting the rich man...PLEASE!", 
        "reply": " Well, to a certain extent, I agree with you, THAT'S SPOOKY!... Respectfully, SUNLINER81", 
        "threadID": "672198221_4070024422001", 
        "time": "2009-06-01 11:59:00", 
        "title": "U.S. Sales Tax Gets Fresh Look", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "VAT Sales Tax AND still an Income Tax. We need the FT that would get rid of Income Tax. \"http://www.washingtonpost.com/wp-dyn/content/article/2009/05/26/AR2009052602909_pf.html\"", 
        "intTime": 20090527, 
        "postID": 21, 
        "quote": "", 
        "reply": "VAT Sales Tax AND still an Income Tax. We need the FT that would get rid of Income Tax. \"http://www.washingtonpost.com/wp-dyn/content/article/2009/05/26/AR2009052602909_pf.html\"", 
        "threadID": "672198221_4070024422001", 
        "time": "2009-05-27 15:31:00", 
        "title": "U.S. Sales Tax Gets Fresh Look", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "The Taxaholics are in charge, so much for his promise not to raise taxes on the Middle Class. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090527, 
        "postID": 22, 
        "quote": "", 
        "reply": "The Taxaholics are in charge, so much for his promise not to raise taxes on the Middle Class. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_4070024422001", 
        "time": "2009-05-27 15:36:00", 
        "title": "U.S. Sales Tax Gets Fresh Look", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: The Taxaholics are in charge, so much for his promise not to raise taxes on the Middle Class. They are looking at a \"higher income tax\" tax along with a VAT. I do not and will not support a VAT and an Income Tax because I do not support an income tax period. Reps need to get on board with the Fair Tax or were going to end up with both. That is what I was afraid of would happen no matter which party was in charge. Of course taxing the rich will get all of us, when is the little guy ever left out of paying anything? NEVER! and the big rich republicans are soo worried they are they ones getting screwed or my fellow middle class are of afraid of \"class warfare\" hurting the rich man...PLEASE!", 
        "intTime": 20090527, 
        "postID": 23, 
        "quote": "Originally posted by L0A1: The Taxaholics are in charge, so much for his promise not to raise taxes on the Middle Class.", 
        "reply": " They are looking at a \"higher income tax\" tax along with a VAT. I do not and will not support a VAT and an Income Tax because I do not support an income tax period. Reps need to get on board with the Fair Tax or were going to end up with both. That is what I was afraid of would happen no matter which party was in charge. Of course taxing the rich will get all of us, when is the little guy ever left out of paying anything? NEVER! and the big rich republicans are soo worried they are they ones getting screwed or my fellow middle class are of afraid of \"class warfare\" hurting the rich man...PLEASE!", 
        "threadID": "672198221_4070024422001", 
        "time": "2009-05-27 15:56:00", 
        "title": "U.S. Sales Tax Gets Fresh Look", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: quote: Originally posted by L0A1: The Taxaholics are in charge, so much for his promise not to raise taxes on the Middle Class. They are looking at a \"higher income tax\" tax along with a VAT. I do not and will not support a VAT and an Income Tax because I do not support an income tax period. Reps need to get on board with the Fair Tax or were going to end up with both. That is what I was afraid of would happen no matter which party was in charge. Of course taxing the rich will get all of us, when is the little guy ever left out of paying anything? NEVER! and the big rich republicans are soo worried they are they ones getting screwed or my fellow middle class are of afraid of \"class warfare\" hurting the rich man...PLEASE! Oh you know how I feel as well, I would go for either a VAT with a FLAT tax, no income tax. Or Fair Tax without VAT. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090527, 
        "postID": 24, 
        "quote": "Originally posted by crackerjacks61: quote: Originally posted by L0A1: The Taxaholics are in charge, so much for his promise not to raise taxes on the Middle Class. They are looking at a \"higher income tax\" tax along with a VAT. I do not and will not support a VAT and an Income Tax because I do not support an income tax period. Reps need to get on board with the Fair Tax or were going to end up with both. That is what I was afraid of would happen no matter which party was in charge. Of course taxing the rich will get all of us, when is the little guy ever left out of paying anything? NEVER! and the big rich republicans are soo worried they are they ones getting screwed or my fellow middle class are of afraid of \"class warfare\" hurting the rich man...PLEASE!", 
        "reply": " Oh you know how I feel as well, I would go for either a VAT with a FLAT tax, no income tax. Or Fair Tax without VAT. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_4070024422001", 
        "time": "2009-05-27 15:59:00", 
        "title": "U.S. Sales Tax Gets Fresh Look", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by crackerjacks61: quote: Originally posted by L0A1: The Taxaholics are in charge, so much for his promise not to raise taxes on the Middle Class. They are looking at a \"higher income tax\" tax along with a VAT. I do not and will not support a VAT and an Income Tax because I do not support an income tax period. Reps need to get on board with the Fair Tax or were going to end up with both. That is what I was afraid of would happen no matter which party was in charge. Of course taxing the rich will get all of us, when is the little guy ever left out of paying anything? NEVER! and the big rich republicans are soo worried they are they ones getting screwed or my fellow middle class are of afraid of \"class warfare\" hurting the rich man...PLEASE! Oh you know how I feel as well, I would go for either a VAT with a FLAT tax, no income tax. Or Fair Tax without VAT. Ain't gonna happen. Replacing the income tax with a flat tax has been the wet dream of Conseervatives for years. They've learned that they have to give these sales taxes a new name, and new trimings - and thus the \"name\" Flat tax. Complicated beyond belief, in the way it hits the poorest, it's simple as hell for the wealthy - Pay less, pass the real costs of society onto the States where ALL taxes are flat. Obama, while barely a liberal, will smell a rat. Dave", 
        "intTime": 20090527, 
        "postID": 25, 
        "quote": "Originally posted by L0A1: quote: Originally posted by crackerjacks61: quote: Originally posted by L0A1: The Taxaholics are in charge, so much for his promise not to raise taxes on the Middle Class. They are looking at a \"higher income tax\" tax along with a VAT. I do not and will not support a VAT and an Income Tax because I do not support an income tax period. Reps need to get on board with the Fair Tax or were going to end up with both. That is what I was afraid of would happen no matter which party was in charge. Of course taxing the rich will get all of us, when is the little guy ever left out of paying anything? NEVER! and the big rich republicans are soo worried they are they ones getting screwed or my fellow middle class are of afraid of \"class warfare\" hurting the rich man...PLEASE! Oh you know how I feel as well, I would go for either a VAT with a FLAT tax, no income tax. Or Fair Tax without VAT.", 
        "reply": " Ain't gonna happen. Replacing the income tax with a flat tax has been the wet dream of Conseervatives for years. They've learned that they have to give these sales taxes a new name, and new trimings - and thus the \"name\" Flat tax. Complicated beyond belief, in the way it hits the poorest, it's simple as hell for the wealthy - Pay less, pass the real costs of society onto the States where ALL taxes are flat. Obama, while barely a liberal, will smell a rat. Dave", 
        "threadID": "672198221_4070024422001", 
        "time": "2009-05-27 16:32:00", 
        "title": "U.S. Sales Tax Gets Fresh Look", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by L0A1: quote: Originally posted by crackerjacks61: quote: Originally posted by L0A1: The Taxaholics are in charge, so much for his promise not to raise taxes on the Middle Class. They are looking at a \"higher income tax\" tax along with a VAT. I do not and will not support a VAT and an Income Tax because I do not support an income tax period. Reps need to get on board with the Fair Tax or were going to end up with both. That is what I was afraid of would happen no matter which party was in charge. Of course taxing the rich will get all of us, when is the little guy ever left out of paying anything? NEVER! and the big rich republicans are soo worried they are they ones getting screwed or my fellow middle class are of afraid of \"class warfare\" hurting the rich man...PLEASE! Oh you know how I feel as well, I would go for either a VAT with a FLAT tax, no income tax. Or Fair Tax without VAT. Ain't gonna happen. Replacing the income tax with a flat tax has been the wet dream of Conseervatives for years. They've learned that they have to give these sales taxes a new name, and new trimings - and thus the \"name\" Flat tax. Complicated beyond belief, in the way it hits the poorest, it's simple as hell for the wealthy - Pay less, pass the real costs of society onto the States where ALL taxes are flat. Obama, while barely a liberal, will smell a rat. Dave You could of at least humored us. But VAT and Income tax is complete BS. You know it, I know it. Especially after he promised no one making under 250,000.00 would see a tax increase. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090527, 
        "postID": 26, 
        "quote": "Originally posted by Grachus: quote: Originally posted by L0A1: quote: Originally posted by crackerjacks61: quote: Originally posted by L0A1: The Taxaholics are in charge, so much for his promise not to raise taxes on the Middle Class. They are looking at a \"higher income tax\" tax along with a VAT. I do not and will not support a VAT and an Income Tax because I do not support an income tax period. Reps need to get on board with the Fair Tax or were going to end up with both. That is what I was afraid of would happen no matter which party was in charge. Of course taxing the rich will get all of us, when is the little guy ever left out of paying anything? NEVER! and the big rich republicans are soo worried they are they ones getting screwed or my fellow middle class are of afraid of \"class warfare\" hurting the rich man...PLEASE! Oh you know how I feel as well, I would go for either a VAT with a FLAT tax, no income tax. Or Fair Tax without VAT. Ain't gonna happen. Replacing the income tax with a flat tax has been the wet dream of Conseervatives for years. They've learned that they have to give these sales taxes a new name, and new trimings - and thus the \"name\" Flat tax. Complicated beyond belief, in the way it hits the poorest, it's simple as hell for the wealthy - Pay less, pass the real costs of society onto the States where ALL taxes are flat. Obama, while barely a liberal, will smell a rat. Dave", 
        "reply": " You could of at least humored us. But VAT and Income tax is complete BS. You know it, I know it. Especially after he promised no one making under 250,000.00 would see a tax increase. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_4070024422001", 
        "time": "2009-05-27 16:57:00", 
        "title": "U.S. Sales Tax Gets Fresh Look", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by Grachus: Ain't gonna happen. Replacing the income tax with a flat tax has been the wet dream of Conseervatives for years. They've learned that they have to give these sales taxes a new name, and new trimings - and thus the \"name\" Flat tax. Complicated beyond belief, in the way it hits the poorest, it's simple as hell for the wealthy - Pay less, pass the real costs of society onto the States where ALL taxes are flat. Obama, while barely a liberal, will smell a rat. Dave quote: Originally posted by L0A1: You could of at least humored us. But VAT and Income tax is complete BS. You know it, I know it. Especially after he promised no one making under 250,000.00 would see a tax increase. One thing I've noticed about Obama is that he makes a virtue out of \"tact.\" Normally I regard this as a big plus. Too soon to say if this is the case with him... But when his spokespersons say, \"(close paraphrase) that the President doesn't take ideas like this seriously, but naturally everything is on the table,\" those first words tell me what his real attitude is. Ain't gonna happen, making the last part of your statement, a brutal attack on thin air... Dave", 
        "intTime": 20090527, 
        "postID": 27, 
        "quote": "Originally posted by Grachus: Ain't gonna happen. Replacing the income tax with a flat tax has been the wet dream of Conseervatives for years. They've learned that they have to give these sales taxes a new name, and new trimings - and thus the \"name\" Flat tax. Complicated beyond belief, in the way it hits the poorest, it's simple as hell for the wealthy - Pay less, pass the real costs of society onto the States where ALL taxes are flat. Obama, while barely a liberal, will smell a rat. Dave", 
        "reply": " quote: Originally posted by L0A1: You could of at least humored us. But VAT and Income tax is complete BS. You know it, I know it. Especially after he promised no one making under 250,000.00 would see a tax increase. One thing I've noticed about Obama is that he makes a virtue out of \"tact.\" Normally I regard this as a big plus. Too soon to say if this is the case with him... But when his spokespersons say, \"(close paraphrase) that the President doesn't take ideas like this seriously, but naturally everything is on the table,\" those first words tell me what his real attitude is. Ain't gonna happen, making the last part of your statement, a brutal attack on thin air... Dave", 
        "threadID": "672198221_4070024422001", 
        "time": "2009-05-27 17:04:00", 
        "title": "U.S. Sales Tax Gets Fresh Look", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by L0A1: The Taxaholics are in charge, so much for his promise not to raise taxes on the Middle Class. The Change you Wanted is the Change you got", 
        "intTime": 20090527, 
        "postID": 28, 
        "quote": "Originally posted by L0A1: The Taxaholics are in charge, so much for his promise not to raise taxes on the Middle Class.", 
        "reply": " The Change you Wanted is the Change you got", 
        "threadID": "672198221_4070024422001", 
        "time": "2009-05-27 17:54:00", 
        "title": "U.S. Sales Tax Gets Fresh Look", 
        "userID": "ss_287"
    }, 
    {
        "content": "quote: Originally posted by L0A1: The Taxaholics are in charge, so much for his promise not to raise taxes on the Middle Class. Seems to me the \"Taxaholics \" have been in charge since 1913. The reps have had PLENTY of time to right a wrong but they chose NOT to. So yeah, support them and vote for them again next time people, that will put things back the way they should be.", 
        "intTime": 20090527, 
        "postID": 29, 
        "quote": "Originally posted by L0A1: The Taxaholics are in charge, so much for his promise not to raise taxes on the Middle Class.", 
        "reply": " Seems to me the \"Taxaholics \" have been in charge since 1913. The reps have had PLENTY of time to right a wrong but they chose NOT to. So yeah, support them and vote for them again next time people, that will put things back the way they should be.", 
        "threadID": "672198221_4070024422001", 
        "time": "2009-05-27 18:38:00", 
        "title": "U.S. Sales Tax Gets Fresh Look", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "L0A1; quote: You could of at least humored us. But VAT and Income tax is complete BS. You know it, I know it. Especially after he promised no one making under 250,000.00 would see a tax increase. He was only referring to an income tax increase.. but even that is a lie, if they allow the Bush tax cuts to expire like they are supposed to, and which HE IS IN favor of..", 
        "intTime": 20090527, 
        "postID": 30, 
        "quote": "You could of at least humored us. But VAT and Income tax is complete BS. You know it, I know it. Especially after he promised no one making under 250,000.00 would see a tax increase.", 
        "reply": "L0A1;  He was only referring to an income tax increase.. but even that is a lie, if they allow the Bush tax cuts to expire like they are supposed to, and which HE IS IN favor of..", 
        "threadID": "672198221_4070024422001", 
        "time": "2009-05-27 21:04:00", 
        "title": "U.S. Sales Tax Gets Fresh Look", 
        "userID": "3678131"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: quote: Originally posted by L0A1: The Taxaholics are in charge, so much for his promise not to raise taxes on the Middle Class. Seems to me the \"Taxaholics \" have been in charge since 1913. The reps have had PLENTY of time to right a wrong but they chose NOT to. So yeah, support them and vote for them again next time people, that will put things back the way they should be. Remember Steve Forbes? He ran for president in '96. His platform included a flat tax. When he appeared on CBS News his ideas were called a \"scheme.\" For CBS reporter Bernie Goldberg this led to his exit from the network he had come to view as biased to the political left. Read about it in his book. I did.", 
        "intTime": 20090527, 
        "postID": 31, 
        "quote": "Originally posted by crackerjacks61: quote: Originally posted by L0A1: The Taxaholics are in charge, so much for his promise not to raise taxes on the Middle Class. Seems to me the \"Taxaholics \" have been in charge since 1913. The reps have had PLENTY of time to right a wrong but they chose NOT to. So yeah, support them and vote for them again next time people, that will put things back the way they should be.", 
        "reply": " Remember Steve Forbes? He ran for president in '96. His platform included a flat tax. When he appeared on CBS News his ideas were called a \"scheme.\" For CBS reporter Bernie Goldberg this led to his exit from the network he had come to view as biased to the political left. Read about it in his book. I did.", 
        "threadID": "672198221_4070024422001", 
        "time": "2009-05-27 23:15:00", 
        "title": "U.S. Sales Tax Gets Fresh Look", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "it's people that do the voting but everyone is caught on this it's gota be dem or rep kick. and if it does not fit the dem or rep agenda, it's no good.", 
        "intTime": 20090531, 
        "postID": 32, 
        "quote": "", 
        "reply": "it's people that do the voting but everyone is caught on this it's gota be dem or rep kick. and if it does not fit the dem or rep agenda, it's no good.", 
        "threadID": "672198221_4070024422001", 
        "time": "2009-05-31 01:43:00", 
        "title": "U.S. Sales Tax Gets Fresh Look", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "Taxes, after all, are dues that we pay for the privileges of membership in an organized society. ~Franklin D. Roosevelt All governments require taxes in order to provide the services the its people need. The taxes should be allocated among the people in a fair manner and based upon the ability to pay. The \"flat tax\" and the VAT are allocated unfairly among the people. They are based generally upon the expenditures of the individual and are unrelated to the individual's ability to pay. Consequently, the poor would pay a greater percentage of their incomes in this form of taxes than would the wealthy. The fairest form of taxation is the progressive income tax. It levies a greater amount and percentage from the wealthy than it does from the poorer individual -- and that is the way it should be. Let's never fall into the trap of the politician's dream tax -- the flat tax or the VAT or a national sales tax, whatever it is called!", 
        "intTime": 20090531, 
        "postID": 33, 
        "quote": "", 
        "reply": "Taxes, after all, are dues that we pay for the privileges of membership in an organized society. ~Franklin D. Roosevelt All governments require taxes in order to provide the services the its people need. The taxes should be allocated among the people in a fair manner and based upon the ability to pay. The \"flat tax\" and the VAT are allocated unfairly among the people. They are based generally upon the expenditures of the individual and are unrelated to the individual's ability to pay. Consequently, the poor would pay a greater percentage of their incomes in this form of taxes than would the wealthy. The fairest form of taxation is the progressive income tax. It levies a greater amount and percentage from the wealthy than it does from the poorer individual -- and that is the way it should be. Let's never fall into the trap of the politician's dream tax -- the flat tax or the VAT or a national sales tax, whatever it is called!", 
        "threadID": "672198221_4070024422001", 
        "time": "2009-05-31 11:12:00", 
        "title": "U.S. Sales Tax Gets Fresh Look", 
        "userID": "fnewt"
    }, 
    {
        "content": "quote: Originally posted by fnewt: Taxes, after all, are dues that we pay for the privileges of membership in an organized society. ~Franklin D. Roosevelt All governments require taxes in order to provide the services the its people need. The taxes should be allocated among the people in a fair manner and based upon the ability to pay. The \"flat tax\" and the VAT are allocated unfairly among the people. They are based generally upon the expenditures of the individual and are unrelated to the individual's ability to pay. Consequently, the poor would pay a greater percentage of their incomes in this form of taxes than would the wealthy. The fairest form of taxation is the progressive income tax. It levies a greater amount and percentage from the wealthy than it does from the poorer individual -- and that is the way it should be. Let's never fall into the trap of the politician's dream tax -- the flat tax or the VAT or a national sales tax, whatever it is called! Dave", 
        "intTime": 20090531, 
        "postID": 34, 
        "quote": "Originally posted by fnewt: Taxes, after all, are dues that we pay for the privileges of membership in an organized society. ~Franklin D. Roosevelt All governments require taxes in order to provide the services the its people need. The taxes should be allocated among the people in a fair manner and based upon the ability to pay. The \"flat tax\" and the VAT are allocated unfairly among the people. They are based generally upon the expenditures of the individual and are unrelated to the individual's ability to pay. Consequently, the poor would pay a greater percentage of their incomes in this form of taxes than would the wealthy. The fairest form of taxation is the progressive income tax. It levies a greater amount and percentage from the wealthy than it does from the poorer individual -- and that is the way it should be. Let's never fall into the trap of the politician's dream tax -- the flat tax or the VAT or a national sales tax, whatever it is called!", 
        "reply": " Dave", 
        "threadID": "672198221_4070024422001", 
        "time": "2009-05-31 11:18:00", 
        "title": "U.S. Sales Tax Gets Fresh Look", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: VAT Sales Tax AND still an Income Tax. We need the FT that would get rid of Income Tax. \"http://www.washingtonpost.com/wp-dyn/content/article/2009/05/26/AR2009052602909_pf.html\" If you'd scream about the debt as much as you are about how we are taxed--who is and who isn't--maybe a lot of this conversation wouldn't be necessary?", 
        "intTime": 20090531, 
        "postID": 35, 
        "quote": "Originally posted by crackerjacks61: VAT Sales Tax AND still an Income Tax. We need the FT that would get rid of Income Tax. \"http://www.washingtonpost.com/wp-dyn/content/article/2009/05/26/AR2009052602909_pf.html\"", 
        "reply": " If you'd scream about the debt as much as you are about how we are taxed--who is and who isn't--maybe a lot of this conversation wouldn't be necessary?", 
        "threadID": "672198221_4070024422001", 
        "time": "2009-05-31 12:36:00", 
        "title": "U.S. Sales Tax Gets Fresh Look", 
        "userID": "busnrete8"
    }, 
    {
        "content": "Dave - Thanks for all that applause. Frank", 
        "intTime": 20090601, 
        "postID": 36, 
        "quote": "", 
        "reply": "Dave - Thanks for all that applause. Frank", 
        "threadID": "672198221_4070024422001", 
        "time": "2009-06-01 07:03:00", 
        "title": "U.S. Sales Tax Gets Fresh Look", 
        "userID": "fnewt"
    }, 
    {
        "content": "quote: Originally posted by fnewt: Taxes, after all, are dues that we pay for the privileges of membership in an organized society. ~Franklin D. Roosevelt All governments require taxes in order to provide the services the its people need. The taxes should be allocated among the people in a fair manner and based upon the ability to pay. The \"flat tax\" and the VAT are allocated unfairly among the people. They are based generally upon the expenditures of the individual and are unrelated to the individual's ability to pay. Consequently, the poor would pay a greater percentage of their incomes in this form of taxes than would the wealthy. The fairest form of taxation is the progressive income tax. It levies a greater amount and percentage from the wealthy than it does from the poorer individual -- and that is the way it should be. Let's never fall into the trap of the politician's dream tax -- the flat tax or the VAT or a national sales tax, whatever it is called! I actually agree with most of this. A national sales tax, increased gas taxes, or whatever will impact the lower and middle classes more than anyone. That is why I am against them. On income taxes, I think that several \"flat\" rates coupled to doing away with a lot of deductions (except for dependents so familiy size can be taken into account) could work. Have a progressive scale, but without all the loopholes and write offs. I do not think one size fits all flat rate would be the utopian answer some believe. The argument/disagreement is definition of \"fair\" tax rates. Some believe that 60,70, or higher percentage tax rates on the \"rich\" or \"wealthy\" is OK. I do not.", 
        "intTime": 20090601, 
        "postID": 37, 
        "quote": "Originally posted by fnewt: Taxes, after all, are dues that we pay for the privileges of membership in an organized society. ~Franklin D. Roosevelt All governments require taxes in order to provide the services the its people need. The taxes should be allocated among the people in a fair manner and based upon the ability to pay. The \"flat tax\" and the VAT are allocated unfairly among the people. They are based generally upon the expenditures of the individual and are unrelated to the individual's ability to pay. Consequently, the poor would pay a greater percentage of their incomes in this form of taxes than would the wealthy. The fairest form of taxation is the progressive income tax. It levies a greater amount and percentage from the wealthy than it does from the poorer individual -- and that is the way it should be. Let's never fall into the trap of the politician's dream tax -- the flat tax or the VAT or a national sales tax, whatever it is called!", 
        "reply": " I actually agree with most of this. A national sales tax, increased gas taxes, or whatever will impact the lower and middle classes more than anyone. That is why I am against them. On income taxes, I think that several \"flat\" rates coupled to doing away with a lot of deductions (except for dependents so familiy size can be taken into account) could work. Have a progressive scale, but without all the loopholes and write offs. I do not think one size fits all flat rate would be the utopian answer some believe. The argument/disagreement is definition of \"fair\" tax rates. Some believe that 60,70, or higher percentage tax rates on the \"rich\" or \"wealthy\" is OK. I do not.", 
        "threadID": "672198221_4070024422001", 
        "time": "2009-06-01 07:20:00", 
        "title": "U.S. Sales Tax Gets Fresh Look", 
        "userID": "sw614"
    }, 
    {
        "content": "\"Complicated beyond belief, in the way it hits the poorest, it's simple as hell for the wealthy - Pay less, pass the real costs of society onto the States where ALL taxes are flat.\" Sales taxes, property taxes, etc, are flat. Most income taxes, in those states who have them, are progressive. So not ALL taxes are flat. Of course, we all understand you believe the federal government should pay for everything....", 
        "intTime": 20090601, 
        "postID": 38, 
        "quote": "", 
        "reply": "\"Complicated beyond belief, in the way it hits the poorest, it's simple as hell for the wealthy - Pay less, pass the real costs of society onto the States where ALL taxes are flat.\" Sales taxes, property taxes, etc, are flat. Most income taxes, in those states who have them, are progressive. So not ALL taxes are flat. Of course, we all understand you believe the federal government should pay for everything....", 
        "threadID": "672198221_4070024422001", 
        "time": "2009-06-01 07:23:00", 
        "title": "U.S. Sales Tax Gets Fresh Look", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: The fairest form of taxation is the progressive income tax. It levies a greater amount and percentage from the wealthy than it does from the poorer individual -- and that is the way it should be. If you're Communist.", 
        "intTime": 20090601, 
        "postID": 39, 
        "quote": "The fairest form of taxation is the progressive income tax. It levies a greater amount and percentage from the wealthy than it does from the poorer individual -- and that is the way it should be.", 
        "reply": " If you're Communist.", 
        "threadID": "672198221_4070024422001", 
        "time": "2009-06-01 11:39:00", 
        "title": "U.S. Sales Tax Gets Fresh Look", 
        "userID": "shuman14"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: quote: Originally posted by L0A1: The Taxaholics are in charge, so much for his promise not to raise taxes on the Middle Class. They are looking at a \"higher income tax\" tax along with a VAT. I do not and will not support a VAT and an Income Tax because I do not support an income tax period. Reps need to get on board with the Fair Tax or were going to end up with both. That is what I was afraid of would happen no matter which party was in charge. Of course taxing the rich will get all of us, when is the little guy ever left out of paying anything? NEVER! and the big rich republicans are soo worried they are they ones getting screwed or my fellow middle class are of afraid of \"class warfare\" hurting the rich man...PLEASE! Well, to a certain extent, I agree with you, THAT'S SPOOKY!... Respectfully, SUNLINER81", 
        "intTime": 20090601, 
        "postID": 40, 
        "quote": "Originally posted by crackerjacks61: quote: Originally posted by L0A1: The Taxaholics are in charge, so much for his promise not to raise taxes on the Middle Class. They are looking at a \"higher income tax\" tax along with a VAT. I do not and will not support a VAT and an Income Tax because I do not support an income tax period. Reps need to get on board with the Fair Tax or were going to end up with both. That is what I was afraid of would happen no matter which party was in charge. Of course taxing the rich will get all of us, when is the little guy ever left out of paying anything? NEVER! and the big rich republicans are soo worried they are they ones getting screwed or my fellow middle class are of afraid of \"class warfare\" hurting the rich man...PLEASE!", 
        "reply": " Well, to a certain extent, I agree with you, THAT'S SPOOKY!... Respectfully, SUNLINER81", 
        "threadID": "672198221_4070024422001", 
        "time": "2009-06-01 11:59:00", 
        "title": "U.S. Sales Tax Gets Fresh Look", 
        "userID": "SUNLINER81"
    }
]