[
    {
        "content": "Yikes!To think there are already cases in California and Texas! NOTE:This is a retitled older thread, please go to the next page or the newest post for the latest update ++http://news.yahoo.com/s/ap/20090425/ap_on_re_la_am_ca/med_swine_flu quote: Mexico fights swine flu with 'pandemic potential' By MARK STEVENSON, Associated Press Writer Mark Stevenson, Associated Press Writer 43 mins ago MEXICO CITY – A new swine flu strain that has killed as many as 68 people and sickened more than 1,000 across Mexico has \"pandemic potential,\" the World Health Organization chief said Saturday, and it may be too late to contain the sudden outbreak. The disease has already reached Texas and California, and with 24 new suspected cases reported Saturday in Mexico City alone, schools were closed and all public events suspended in the capital until further notice — including more than 500 concerts and other gatherings in the metropolis of 20 million. A hot line fielded 2,366 calls in its first hours from frightened city residents who suspected they might have the disease. Soldiers and health workers handed out masks at subway stops, and hospitals dealt with crowds of people seeking help. The World Health Organization's director-general, Margaret Chan, said the outbreak of the never-before-seen virus is a very serious situation and has \"pandemic potential.\" But she said it is still too early to tell if it would become a worldwide outbreak. (...) Mexican President Felipe Calderon said his government only discovered the nature of the virus late Thursday, with the help of international laboratories. \"We are doing everything necessary,\" he said in a brief statement. (...) Associated Press Writers David Koop and Peter Orsi in Mexico City; Frank Jordans in Geneva; Mike Stobbe in Atlanta; Malcolm Ritter in New York; and Maria Cheng in London contributed to this report. This message has been edited. Last edited by: Canuck_Centaur, Thu 11 June 2009 08:00 AM",
        "intTime": 20090425,
        "postID": 1,
        "quote": "Mexico fights swine flu with 'pandemic potential' By MARK STEVENSON, Associated Press Writer Mark Stevenson, Associated Press Writer 43 mins ago MEXICO CITY – A new swine flu strain that has killed as many as 68 people and sickened more than 1,000 across Mexico has \"pandemic potential,\" the World Health Organization chief said Saturday, and it may be too late to contain the sudden outbreak. The disease has already reached Texas and California, and with 24 new suspected cases reported Saturday in Mexico City alone, schools were closed and all public events suspended in the capital until further notice — including more than 500 concerts and other gatherings in the metropolis of 20 million. A hot line fielded 2,366 calls in its first hours from frightened city residents who suspected they might have the disease. Soldiers and health workers handed out masks at subway stops, and hospitals dealt with crowds of people seeking help. The World Health Organization's director-general, Margaret Chan, said the outbreak of the never-before-seen virus is a very serious situation and has \"pandemic potential.\" But she said it is still too early to tell if it would become a worldwide outbreak. (...) Mexican President Felipe Calderon said his government only discovered the nature of the virus late Thursday, with the help of international laboratories. \"We are doing everything necessary,\" he said in a brief statement. (...) Associated Press Writers David Koop and Peter Orsi in Mexico City; Frank Jordans in Geneva; Mike Stobbe in Atlanta; Malcolm Ritter in New York; and Maria Cheng in London contributed to this report.",
        "reply": "Yikes!To think there are already cases in California and Texas! NOTE:This is a retitled older thread, please go to the next page or the newest post for the latest update ++http://news.yahoo.com/s/ap/20090425/ap_on_re_la_am_ca/med_swine_flu  This message has been edited. Last edited by: Canuck_Centaur, Thu 11 June 2009 08:00 AM",
        "threadID": "672198221_9880057122001",
        "time": "2009-04-25 12:37:00",
        "title": "Swine Flu updates thread (latest: WHO says Swine Flu is now GLOBAL PANDEMIC) level 6",
        "userID": "Canuck_Centaur"
    },
    {
        "content": "Another reason the fuqqin border should have been closed off ears ago. Most of these poor, poor folks who we all are just coming to the US for work , dont get vaccinations or regular medical care, they flood the ER rooms across the country and invade communities bringing all kinds of disease with them that haven't been seen in the US in decades. Notice all the contaminated food comes from places with illegal workers or from Mexican farms without any health standards. Spinach, tomatoes, lettuce and then the stuff from China is another story altogether. Perhaps the government could get a clue and close the border....naw, that would be too easy.",
        "intTime": 20090425,
        "postID": 2,
        "quote": "",
        "reply": "Another reason the fuqqin border should have been closed off ears ago. Most of these poor, poor folks who we all are just coming to the US for work , dont get vaccinations or regular medical care, they flood the ER rooms across the country and invade communities bringing all kinds of disease with them that haven't been seen in the US in decades. Notice all the contaminated food comes from places with illegal workers or from Mexican farms without any health standards. Spinach, tomatoes, lettuce and then the stuff from China is another story altogether. Perhaps the government could get a clue and close the border....naw, that would be too easy.",
        "threadID": "672198221_9880057122001",
        "time": "2009-04-25 19:11:00",
        "title": "Swine Flu updates thread (latest: WHO says Swine Flu is now GLOBAL PANDEMIC) level 6",
        "userID": "FlankerFlyer"
    },
    {
        "content": "quote: Originally posted by FlankerFlyer: Another reason the fuqqin border should have been closed off ears ago. Most of these poor, poor folks who we all are just coming to the US for work , dont get vaccinations or regular medical care, they flood the ER rooms across the country and invade communities bringing all kinds of disease with them that haven't been seen in the US in decades. Notice all the contaminated food comes from places with illegal workers or from Mexican farms without any health standards. Spinach, tomatoes, lettuce and then the stuff from China is another story altogether. Perhaps the government could get a clue and close the border....naw, that would be too easy. Hey Mr. Flanker - Did it ever occur to you that there are people who come in legally? You know, Mexico is a big trading partner? Legal check points for the \"two way\" traffic has NOTHING to do with the problems of illegal immigrants. Have you ever gone to the border check points? Well, no illegals do either. Dave",
        "intTime": 20090425,
        "postID": 3,
        "quote": "Originally posted by FlankerFlyer: Another reason the fuqqin border should have been closed off ears ago. Most of these poor, poor folks who we all are just coming to the US for work , dont get vaccinations or regular medical care, they flood the ER rooms across the country and invade communities bringing all kinds of disease with them that haven't been seen in the US in decades. Notice all the contaminated food comes from places with illegal workers or from Mexican farms without any health standards. Spinach, tomatoes, lettuce and then the stuff from China is another story altogether. Perhaps the government could get a clue and close the border....naw, that would be too easy.",
        "reply": " Hey Mr. Flanker - Did it ever occur to you that there are people who come in legally? You know, Mexico is a big trading partner? Legal check points for the \"two way\" traffic has NOTHING to do with the problems of illegal immigrants. Have you ever gone to the border check points? Well, no illegals do either. Dave",
        "threadID": "672198221_9880057122001",
        "time": "2009-04-25 19:18:00",
        "title": "Swine Flu updates thread (latest: WHO says Swine Flu is now GLOBAL PANDEMIC) level 6",
        "userID": "Grachus"
    },
    {
        "content": "quote: Hey Mr. Flanker - Did it ever occur to you that there are people who come in legally? You know, Mexico is a big trading partner? Did you know medical screening is part of legal immigration process? quote: Legal check points for the \"two way\" traffic has NOTHING to do with the problems of illegal immigrants. No they dont, not having a proper double layer fence across the entire border to keep illegals out IS the problem as well as unscrupulous employers who need to be fined out of business when they continue to hire them. Like some others here Dave, Ive been through them hundreds, if not a couple thousand times, whats the point? Build a damn wall and keep them OUT.",
        "intTime": 20090425,
        "postID": 4,
        "quote": "Hey Mr. Flanker - Did it ever occur to you that there are people who come in legally? You know, Mexico is a big trading partner?",
        "reply": " Did you know medical screening is part of legal immigration process? quote: Legal check points for the \"two way\" traffic has NOTHING to do with the problems of illegal immigrants. No they dont, not having a proper double layer fence across the entire border to keep illegals out IS the problem as well as unscrupulous employers who need to be fined out of business when they continue to hire them. Like some others here Dave, Ive been through them hundreds, if not a couple thousand times, whats the point? Build a damn wall and keep them OUT.",
        "threadID": "672198221_9880057122001",
        "time": "2009-04-25 19:29:00",
        "title": "Swine Flu updates thread (latest: WHO says Swine Flu is now GLOBAL PANDEMIC) level 6",
        "userID": "FlankerFlyer"
    },
    {
        "content": "quote: Originally posted by FlankerFlyer: quote: Hey Mr. Flanker - Did it ever occur to you that there are people who come in legally? You know, Mexico is a big trading partner? Did you know medical screening is part of legal immigration process? quote: Legal check points for the \"two way\" traffic has NOTHING to do with the problems of illegal immigrants. No they dont, not having a proper double layer fence across the entire border to keep illegals out IS the problem as well as unscrupulous employers who need to be fined out of business when they continue to hire them. Like some others here Dave, Ive been through them hundreds, if not a couple thousand times, whats the point? Build a damn wall and keep them OUT. This has nothing to do with immigration, legal or other wise. It falls in to the catagory of \"schit happens.\" I just read that eight cases have been diagnosed in New York. The problem here is that this disease, bad as it may be, is not the second coming of the Black Plague. By the time authorities knew it even existed, it was too late. Stock up on fruit juices, tylanol and aspirin - Or go to Ukraine and spread the disease to them... Dave",
        "intTime": 20090425,
        "postID": 5,
        "quote": "Originally posted by FlankerFlyer: quote: Hey Mr. Flanker - Did it ever occur to you that there are people who come in legally? You know, Mexico is a big trading partner? Did you know medical screening is part of legal immigration process? quote: Legal check points for the \"two way\" traffic has NOTHING to do with the problems of illegal immigrants. No they dont, not having a proper double layer fence across the entire border to keep illegals out IS the problem as well as unscrupulous employers who need to be fined out of business when they continue to hire them. Like some others here Dave, Ive been through them hundreds, if not a couple thousand times, whats the point? Build a damn wall and keep them OUT.",
        "reply": " This has nothing to do with immigration, legal or other wise. It falls in to the catagory of \"schit happens.\" I just read that eight cases have been diagnosed in New York. The problem here is that this disease, bad as it may be, is not the second coming of the Black Plague. By the time authorities knew it even existed, it was too late. Stock up on fruit juices, tylanol and aspirin - Or go to Ukraine and spread the disease to them... Dave",
        "threadID": "672198221_9880057122001",
        "time": "2009-04-25 19:36:00",
        "title": "Swine Flu updates thread (latest: WHO says Swine Flu is now GLOBAL PANDEMIC) level 6",
        "userID": "Grachus"
    },
    {
        "content": "Americans go south too, don't they? Try stopping that.",
        "intTime": 20090427,
        "postID": 6,
        "quote": "",
        "reply": "Americans go south too, don't they? Try stopping that.",
        "threadID": "672198221_9880057122001",
        "time": "2009-04-27 13:01:00",
        "title": "Swine Flu updates thread (latest: WHO says Swine Flu is now GLOBAL PANDEMIC) level 6",
        "userID": "popsiq"
    },
    {
        "content": "quote: Originally posted by popsiq: Americans go south too, don't they? Try stopping that. I think it's funny that a new disease pops into existance, and the first thing that occurs to some people is blaming immigrants... New York now has 28 verified cases, with another 100 suspect - All from a private school that sent some kids on a trip to Cancun. And they all traveled by air. I might add, that all but two of the verified cases, have made a recovery, and the two that haven't, aren't getting worse. Go figure? Dave",
        "intTime": 20090427,
        "postID": 7,
        "quote": "Originally posted by popsiq: Americans go south too, don't they? Try stopping that.",
        "reply": " I think it's funny that a new disease pops into existance, and the first thing that occurs to some people is blaming immigrants... New York now has 28 verified cases, with another 100 suspect - All from a private school that sent some kids on a trip to Cancun. And they all traveled by air. I might add, that all but two of the verified cases, have made a recovery, and the two that haven't, aren't getting worse. Go figure? Dave",
        "threadID": "672198221_9880057122001",
        "time": "2009-04-27 13:08:00",
        "title": "Swine Flu updates thread (latest: WHO says Swine Flu is now GLOBAL PANDEMIC) level 6",
        "userID": "Grachus"
    },
    {
        "content": "quote: Originally posted by popsiq: Americans go south too, don't they? Try stopping that. What's the percentage of Americans illegaly entering Mexico as opposed to Mexicans illegaly entering the US??? Not blaming illegals(or legals), it's just that when you don't have control of the borders, you don't know what is entering.",
        "intTime": 20090427,
        "postID": 8,
        "quote": "Originally posted by popsiq: Americans go south too, don't they? Try stopping that.",
        "reply": " What's the percentage of Americans illegaly entering Mexico as opposed to Mexicans illegaly entering the US??? Not blaming illegals(or legals), it's just that when you don't have control of the borders, you don't know what is entering.",
        "threadID": "672198221_9880057122001",
        "time": "2009-04-27 13:58:00",
        "title": "Swine Flu updates thread (latest: WHO says Swine Flu is now GLOBAL PANDEMIC) level 6",
        "userID": "67NOV"
    },
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by popsiq: Americans go south too, don't they? Try stopping that. I think it's funny that a new disease pops into existance, and the first thing that occurs to some people is blaming immigrants... New York now has 28 verified cases, with another 100 suspect - All from a private school that sent some kids on a trip to Cancun. And they all traveled by air. I might add, that all but two of the verified cases, have made a recovery, and the two that haven't, aren't getting worse. Go figure? Dave Agreed, it's a matter of medical treatment. Guess our Health care system isn't THAT bad yet. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin",
        "intTime": 20090427,
        "postID": 9,
        "quote": "Originally posted by Grachus: quote: Originally posted by popsiq: Americans go south too, don't they? Try stopping that. I think it's funny that a new disease pops into existance, and the first thing that occurs to some people is blaming immigrants... New York now has 28 verified cases, with another 100 suspect - All from a private school that sent some kids on a trip to Cancun. And they all traveled by air. I might add, that all but two of the verified cases, have made a recovery, and the two that haven't, aren't getting worse. Go figure? Dave",
        "reply": " Agreed, it's a matter of medical treatment. Guess our Health care system isn't THAT bad yet. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin",
        "threadID": "672198221_9880057122001",
        "time": "2009-04-27 15:10:00",
        "title": "Swine Flu updates thread (latest: WHO says Swine Flu is now GLOBAL PANDEMIC) level 6",
        "userID": "L0A1"
    },
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by Grachus: quote: Originally posted by popsiq: Americans go south too, don't they? Try stopping that. I think it's funny that a new disease pops into existance, and the first thing that occurs to some people is blaming immigrants... New York now has 28 verified cases, with another 100 suspect - All from a private school that sent some kids on a trip to Cancun. And they all traveled by air. I might add, that all but two of the verified cases, have made a recovery, and the two that haven't, aren't getting worse. Go figure? Dave Agreed, it's a matter of medical treatment. Guess our Health care system isn't THAT bad yet. I wish it was as simple as that. The infected kids basically were treated in the normal manner for the flu. None of them were hospitalised, none of them were in a life threatening situation. Very puzzling and I doubt if we will know any answers for weeks if not months. Dave",
        "intTime": 20090427,
        "postID": 10,
        "quote": "Originally posted by L0A1: quote: Originally posted by Grachus: quote: Originally posted by popsiq: Americans go south too, don't they? Try stopping that. I think it's funny that a new disease pops into existance, and the first thing that occurs to some people is blaming immigrants... New York now has 28 verified cases, with another 100 suspect - All from a private school that sent some kids on a trip to Cancun. And they all traveled by air. I might add, that all but two of the verified cases, have made a recovery, and the two that haven't, aren't getting worse. Go figure? Dave Agreed, it's a matter of medical treatment. Guess our Health care system isn't THAT bad yet.",
        "reply": " I wish it was as simple as that. The infected kids basically were treated in the normal manner for the flu. None of them were hospitalised, none of them were in a life threatening situation. Very puzzling and I doubt if we will know any answers for weeks if not months. Dave",
        "threadID": "672198221_9880057122001",
        "time": "2009-04-27 16:12:00",
        "title": "Swine Flu updates thread (latest: WHO says Swine Flu is now GLOBAL PANDEMIC) level 6",
        "userID": "Grachus"
    },
    {
        "content": "quote: I wish it was as simple as that. The infected kids basically were treated in the normal manner for the flu. None of them were hospitalised, none of them were in a life threatening situation. Very puzzling and I doubt if we will know any answers for weeks if not months. Oh, I dont know....could it be the high quality private medical that millions of people use in the USA. You know proper immunizations and routine medical care, better hygiene, kids and adults in the US have access to better than government run healthcare. The local hospital that first had contact with Geraldo Leyva Lolis, one of the first victims of this flu strain, didnt even have anti-virals or a means to even test him. But hey, Under Obama's grand plan, that kind of superb government run health care is coming your way to the USA.",
        "intTime": 20090427,
        "postID": 11,
        "quote": "I wish it was as simple as that. The infected kids basically were treated in the normal manner for the flu. None of them were hospitalised, none of them were in a life threatening situation. Very puzzling and I doubt if we will know any answers for weeks if not months.",
        "reply": " Oh, I dont know....could it be the high quality private medical that millions of people use in the USA. You know proper immunizations and routine medical care, better hygiene, kids and adults in the US have access to better than government run healthcare. The local hospital that first had contact with Geraldo Leyva Lolis, one of the first victims of this flu strain, didnt even have anti-virals or a means to even test him. But hey, Under Obama's grand plan, that kind of superb government run health care is coming your way to the USA.",
        "threadID": "672198221_9880057122001",
        "time": "2009-04-27 19:44:00",
        "title": "Swine Flu updates thread (latest: WHO says Swine Flu is now GLOBAL PANDEMIC) level 6",
        "userID": "FlankerFlyer"
    },
    {
        "content": "Mexico is having a bad time of it right now.... the drug gangs killing right and left, the economy not worth a peso, the earthquack and this flu thing..... we should say up a prayer for those innocents who want nothing more then to live life and enjoy ones family. One Flag......One Heart......One Nation............EVERMORE",
        "intTime": 20090427,
        "postID": 12,
        "quote": "",
        "reply": "Mexico is having a bad time of it right now.... the drug gangs killing right and left, the economy not worth a peso, the earthquack and this flu thing..... we should say up a prayer for those innocents who want nothing more then to live life and enjoy ones family. One Flag......One Heart......One Nation............EVERMORE",
        "threadID": "672198221_9880057122001",
        "time": "2009-04-27 21:08:00",
        "title": "Swine Flu updates thread (latest: WHO says Swine Flu is now GLOBAL PANDEMIC) level 6",
        "userID": "m551sheridan"
    },
    {
        "content": "So far this seems to be a bunch of crapola about little to nothing, hell we have 80 or more people die an hour on highways in America and it isn't called a \"pandemic\". The news did the same thing with SARS (the \"mysterious disease\" that would kill us all), Avian flu, etc. To no avail. Conspiracy theory of the day: The swine flu \"pandemic\" is nothing more than an attempt to scare the American public into approving a universal healthcare system. In a few months we will hear that the only way to combat this disease will have all hospitals work together, share patient information, demographics, drugs etc. The only way to do this is to unite the healthcare system under one \"command\"... Mark my words this will be used as an yet another excuse to federalize our healthcare system.",
        "intTime": 20090427,
        "postID": 13,
        "quote": "",
        "reply": "So far this seems to be a bunch of crapola about little to nothing, hell we have 80 or more people die an hour on highways in America and it isn't called a \"pandemic\". The news did the same thing with SARS (the \"mysterious disease\" that would kill us all), Avian flu, etc. To no avail. Conspiracy theory of the day: The swine flu \"pandemic\" is nothing more than an attempt to scare the American public into approving a universal healthcare system. In a few months we will hear that the only way to combat this disease will have all hospitals work together, share patient information, demographics, drugs etc. The only way to do this is to unite the healthcare system under one \"command\"... Mark my words this will be used as an yet another excuse to federalize our healthcare system.",
        "threadID": "672198221_9880057122001",
        "time": "2009-04-27 21:28:00",
        "title": "Swine Flu updates thread (latest: WHO says Swine Flu is now GLOBAL PANDEMIC) level 6",
        "userID": "ronald45"
    },
    {
        "content": "I agree with Ron...I aint scared.",
        "intTime": 20090427,
        "postID": 14,
        "quote": "",
        "reply": "I agree with Ron...I aint scared.",
        "threadID": "672198221_9880057122001",
        "time": "2009-04-27 21:33:00",
        "title": "Swine Flu updates thread (latest: WHO says Swine Flu is now GLOBAL PANDEMIC) level 6",
        "userID": "Bad_Moon_Rising"
    },
    {
        "content": "If this becomes a major pandemic, and instead of the benighn flu that we've been seeing in New York, a really serious \"1918\" type flu, you will indeed see massive government action and coordination. And you will see that because there's no other way to fight such diseases. While it will be a \"Socialist\" response, that response will NOT be Socialism. It will be common sense. You guys must be Very VERY young. When I was a kid in the early fifties, the government intervened MASSIVELY to fight polio. ALl of us got free or low cost vaccinations. Treatment and health teams scoured the country. Any use of a Pandemic to push a political agenda is of course wrong - On the other hand, to make believe that you fight epidemics on the basis of, \"you're all on your own, you should have made better choices,\" is just plain STUPID. Dave",
        "intTime": 20090428,
        "postID": 15,
        "quote": "",
        "reply": "If this becomes a major pandemic, and instead of the benighn flu that we've been seeing in New York, a really serious \"1918\" type flu, you will indeed see massive government action and coordination. And you will see that because there's no other way to fight such diseases. While it will be a \"Socialist\" response, that response will NOT be Socialism. It will be common sense. You guys must be Very VERY young. When I was a kid in the early fifties, the government intervened MASSIVELY to fight polio. ALl of us got free or low cost vaccinations. Treatment and health teams scoured the country. Any use of a Pandemic to push a political agenda is of course wrong - On the other hand, to make believe that you fight epidemics on the basis of, \"you're all on your own, you should have made better choices,\" is just plain STUPID. Dave",
        "threadID": "672198221_9880057122001",
        "time": "2009-04-28 08:11:00",
        "title": "Swine Flu updates thread (latest: WHO says Swine Flu is now GLOBAL PANDEMIC) level 6",
        "userID": "Grachus"
    },
    {
        "content": "Grachus, although yes I would hate to see this on the pandemic magnitude, it has already been confirmed that the few cases in the US were mild. Now whether or not this strain has mutated, or the simple fact that we Americans are immunized beyond belief and Mexicans arent has anything to do with that, I dont know. I'm glad to see the Gov is active in figuring it out now instead of waiting until it becomes a severe problem. Anyway I agree, this isnt a political agenda",
        "intTime": 20090428,
        "postID": 16,
        "quote": "",
        "reply": "Grachus, although yes I would hate to see this on the pandemic magnitude, it has already been confirmed that the few cases in the US were mild. Now whether or not this strain has mutated, or the simple fact that we Americans are immunized beyond belief and Mexicans arent has anything to do with that, I dont know. I'm glad to see the Gov is active in figuring it out now instead of waiting until it becomes a severe problem. Anyway I agree, this isnt a political agenda",
        "threadID": "672198221_9880057122001",
        "time": "2009-04-28 21:06:00",
        "title": "Swine Flu updates thread (latest: WHO says Swine Flu is now GLOBAL PANDEMIC) level 6",
        "userID": "Bad_Moon_Rising"
    },
    {
        "content": "quote: Anyway I agree, this isnt a political agenda Not yet but lets remember the current White House motto \"never let a crisis go to waste\". Im sure they are working on a way to spin it into a political advantage.",
        "intTime": 20090428,
        "postID": 17,
        "quote": "Anyway I agree, this isnt a political agenda",
        "reply": " Not yet but lets remember the current White House motto \"never let a crisis go to waste\". Im sure they are working on a way to spin it into a political advantage.",
        "threadID": "672198221_9880057122001",
        "time": "2009-04-28 21:45:00",
        "title": "Swine Flu updates thread (latest: WHO says Swine Flu is now GLOBAL PANDEMIC) level 6",
        "userID": "FlankerFlyer"
    },
    {
        "content": "68 cases so far most in a major city. i wouldn't be surprise to see 200 and rising. They need to deploy the military to the border or face a country with a out of control virus.",
        "intTime": 20090429,
        "postID": 18,
        "quote": "",
        "reply": "68 cases so far most in a major city. i wouldn't be surprise to see 200 and rising. They need to deploy the military to the border or face a country with a out of control virus.",
        "threadID": "672198221_9880057122001",
        "time": "2009-04-29 00:20:00",
        "title": "Swine Flu updates thread (latest: WHO says Swine Flu is now GLOBAL PANDEMIC) level 6",
        "userID": "world_king377"
    },
    {
        "content": "Gosh if only we would have had the same sense of \"urgency\" when AIDS first appeared . 68 dead in a city of over 10 million is hardly the pandemic it is being made out to be. Of course it has been a slow news week.",
        "intTime": 20090429,
        "postID": 19,
        "quote": "",
        "reply": "Gosh if only we would have had the same sense of \"urgency\" when AIDS first appeared . 68 dead in a city of over 10 million is hardly the pandemic it is being made out to be. Of course it has been a slow news week.",
        "threadID": "672198221_9880057122001",
        "time": "2009-04-29 04:49:00",
        "title": "Swine Flu updates thread (latest: WHO says Swine Flu is now GLOBAL PANDEMIC) level 6",
        "userID": "ronald45"
    },
    {
        "content": "quote: Originally posted by ronald45: Gosh if only we would have had the same sense of \"urgency\" when AIDS first appeared . 68 dead in a city of over 10 million is hardly the pandemic it is being made out to be. Of course it has been a slow news week. Of course it may be a slow information processing week for you. get up to speed, pokey. quote: Mexico's government says up to 159 people have been killed by the virus there with more than 2,400 sickened. Cases of swine flu have also been confirmed in the United States, Canada, New Zealand, Israel, Britain and Spain. German officials said a man who recently returned from holiday in Mexico had tested positive for the new H1N1 strain. >>http://www.msnbc.msn.com/id/30398682/ figured MSPMS would be a source YOU would trust.",
        "intTime": 20090429,
        "postID": 20,
        "quote": "Originally posted by ronald45: Gosh if only we would have had the same sense of \"urgency\" when AIDS first appeared . 68 dead in a city of over 10 million is hardly the pandemic it is being made out to be. Of course it has been a slow news week.",
        "reply": " Of course it may be a slow information processing week for you. get up to speed, pokey. quote: Mexico's government says up to 159 people have been killed by the virus there with more than 2,400 sickened. Cases of swine flu have also been confirmed in the United States, Canada, New Zealand, Israel, Britain and Spain. German officials said a man who recently returned from holiday in Mexico had tested positive for the new H1N1 strain. >>http://www.msnbc.msn.com/id/30398682/ figured MSPMS would be a source YOU would trust.",
        "threadID": "672198221_9880057122001",
        "time": "2009-04-29 05:00:00",
        "title": "Swine Flu updates thread (latest: WHO says Swine Flu is now GLOBAL PANDEMIC) level 6",
        "userID": "FlankerFlyer"
    },
    {
        "content": "Yikes!To think there are already cases in California and Texas! NOTE:This is a retitled older thread, please go to the next page or the newest post for the latest update ++http://news.yahoo.com/s/ap/20090425/ap_on_re_la_am_ca/med_swine_flu quote: Mexico fights swine flu with 'pandemic potential' By MARK STEVENSON, Associated Press Writer Mark Stevenson, Associated Press Writer 43 mins ago MEXICO CITY – A new swine flu strain that has killed as many as 68 people and sickened more than 1,000 across Mexico has \"pandemic potential,\" the World Health Organization chief said Saturday, and it may be too late to contain the sudden outbreak. The disease has already reached Texas and California, and with 24 new suspected cases reported Saturday in Mexico City alone, schools were closed and all public events suspended in the capital until further notice — including more than 500 concerts and other gatherings in the metropolis of 20 million. A hot line fielded 2,366 calls in its first hours from frightened city residents who suspected they might have the disease. Soldiers and health workers handed out masks at subway stops, and hospitals dealt with crowds of people seeking help. The World Health Organization's director-general, Margaret Chan, said the outbreak of the never-before-seen virus is a very serious situation and has \"pandemic potential.\" But she said it is still too early to tell if it would become a worldwide outbreak. (...) Mexican President Felipe Calderon said his government only discovered the nature of the virus late Thursday, with the help of international laboratories. \"We are doing everything necessary,\" he said in a brief statement. (...) Associated Press Writers David Koop and Peter Orsi in Mexico City; Frank Jordans in Geneva; Mike Stobbe in Atlanta; Malcolm Ritter in New York; and Maria Cheng in London contributed to this report. This message has been edited. Last edited by: Canuck_Centaur, Thu 11 June 2009 08:00 AM",
        "intTime": 20090425,
        "postID": 21,
        "quote": "Mexico fights swine flu with 'pandemic potential' By MARK STEVENSON, Associated Press Writer Mark Stevenson, Associated Press Writer 43 mins ago MEXICO CITY – A new swine flu strain that has killed as many as 68 people and sickened more than 1,000 across Mexico has \"pandemic potential,\" the World Health Organization chief said Saturday, and it may be too late to contain the sudden outbreak. The disease has already reached Texas and California, and with 24 new suspected cases reported Saturday in Mexico City alone, schools were closed and all public events suspended in the capital until further notice — including more than 500 concerts and other gatherings in the metropolis of 20 million. A hot line fielded 2,366 calls in its first hours from frightened city residents who suspected they might have the disease. Soldiers and health workers handed out masks at subway stops, and hospitals dealt with crowds of people seeking help. The World Health Organization's director-general, Margaret Chan, said the outbreak of the never-before-seen virus is a very serious situation and has \"pandemic potential.\" But she said it is still too early to tell if it would become a worldwide outbreak. (...) Mexican President Felipe Calderon said his government only discovered the nature of the virus late Thursday, with the help of international laboratories. \"We are doing everything necessary,\" he said in a brief statement. (...) Associated Press Writers David Koop and Peter Orsi in Mexico City; Frank Jordans in Geneva; Mike Stobbe in Atlanta; Malcolm Ritter in New York; and Maria Cheng in London contributed to this report.",
        "reply": "Yikes!To think there are already cases in California and Texas! NOTE:This is a retitled older thread, please go to the next page or the newest post for the latest update ++http://news.yahoo.com/s/ap/20090425/ap_on_re_la_am_ca/med_swine_flu  This message has been edited. Last edited by: Canuck_Centaur, Thu 11 June 2009 08:00 AM",
        "threadID": "672198221_9880057122001",
        "time": "2009-04-25 12:37:00",
        "title": "Swine Flu updates thread (latest: WHO says Swine Flu is now GLOBAL PANDEMIC) level 6",
        "userID": "Canuck_Centaur"
    },
    {
        "content": "Another reason the fuqqin border should have been closed off ears ago. Most of these poor, poor folks who we all are just coming to the US for work , dont get vaccinations or regular medical care, they flood the ER rooms across the country and invade communities bringing all kinds of disease with them that haven't been seen in the US in decades. Notice all the contaminated food comes from places with illegal workers or from Mexican farms without any health standards. Spinach, tomatoes, lettuce and then the stuff from China is another story altogether. Perhaps the government could get a clue and close the border....naw, that would be too easy.",
        "intTime": 20090425,
        "postID": 22,
        "quote": "",
        "reply": "Another reason the fuqqin border should have been closed off ears ago. Most of these poor, poor folks who we all are just coming to the US for work , dont get vaccinations or regular medical care, they flood the ER rooms across the country and invade communities bringing all kinds of disease with them that haven't been seen in the US in decades. Notice all the contaminated food comes from places with illegal workers or from Mexican farms without any health standards. Spinach, tomatoes, lettuce and then the stuff from China is another story altogether. Perhaps the government could get a clue and close the border....naw, that would be too easy.",
        "threadID": "672198221_9880057122001",
        "time": "2009-04-25 19:11:00",
        "title": "Swine Flu updates thread (latest: WHO says Swine Flu is now GLOBAL PANDEMIC) level 6",
        "userID": "FlankerFlyer"
    },
    {
        "content": "quote: Originally posted by FlankerFlyer: Another reason the fuqqin border should have been closed off ears ago. Most of these poor, poor folks who we all are just coming to the US for work , dont get vaccinations or regular medical care, they flood the ER rooms across the country and invade communities bringing all kinds of disease with them that haven't been seen in the US in decades. Notice all the contaminated food comes from places with illegal workers or from Mexican farms without any health standards. Spinach, tomatoes, lettuce and then the stuff from China is another story altogether. Perhaps the government could get a clue and close the border....naw, that would be too easy. Hey Mr. Flanker - Did it ever occur to you that there are people who come in legally? You know, Mexico is a big trading partner? Legal check points for the \"two way\" traffic has NOTHING to do with the problems of illegal immigrants. Have you ever gone to the border check points? Well, no illegals do either. Dave",
        "intTime": 20090425,
        "postID": 23,
        "quote": "Originally posted by FlankerFlyer: Another reason the fuqqin border should have been closed off ears ago. Most of these poor, poor folks who we all are just coming to the US for work , dont get vaccinations or regular medical care, they flood the ER rooms across the country and invade communities bringing all kinds of disease with them that haven't been seen in the US in decades. Notice all the contaminated food comes from places with illegal workers or from Mexican farms without any health standards. Spinach, tomatoes, lettuce and then the stuff from China is another story altogether. Perhaps the government could get a clue and close the border....naw, that would be too easy.",
        "reply": " Hey Mr. Flanker - Did it ever occur to you that there are people who come in legally? You know, Mexico is a big trading partner? Legal check points for the \"two way\" traffic has NOTHING to do with the problems of illegal immigrants. Have you ever gone to the border check points? Well, no illegals do either. Dave",
        "threadID": "672198221_9880057122001",
        "time": "2009-04-25 19:18:00",
        "title": "Swine Flu updates thread (latest: WHO says Swine Flu is now GLOBAL PANDEMIC) level 6",
        "userID": "Grachus"
    },
    {
        "content": "quote: Hey Mr. Flanker - Did it ever occur to you that there are people who come in legally? You know, Mexico is a big trading partner? Did you know medical screening is part of legal immigration process? quote: Legal check points for the \"two way\" traffic has NOTHING to do with the problems of illegal immigrants. No they dont, not having a proper double layer fence across the entire border to keep illegals out IS the problem as well as unscrupulous employers who need to be fined out of business when they continue to hire them. Like some others here Dave, Ive been through them hundreds, if not a couple thousand times, whats the point? Build a damn wall and keep them OUT.",
        "intTime": 20090425,
        "postID": 24,
        "quote": "Hey Mr. Flanker - Did it ever occur to you that there are people who come in legally? You know, Mexico is a big trading partner?",
        "reply": " Did you know medical screening is part of legal immigration process? quote: Legal check points for the \"two way\" traffic has NOTHING to do with the problems of illegal immigrants. No they dont, not having a proper double layer fence across the entire border to keep illegals out IS the problem as well as unscrupulous employers who need to be fined out of business when they continue to hire them. Like some others here Dave, Ive been through them hundreds, if not a couple thousand times, whats the point? Build a damn wall and keep them OUT.",
        "threadID": "672198221_9880057122001",
        "time": "2009-04-25 19:29:00",
        "title": "Swine Flu updates thread (latest: WHO says Swine Flu is now GLOBAL PANDEMIC) level 6",
        "userID": "FlankerFlyer"
    },
    {
        "content": "quote: Originally posted by FlankerFlyer: quote: Hey Mr. Flanker - Did it ever occur to you that there are people who come in legally? You know, Mexico is a big trading partner? Did you know medical screening is part of legal immigration process? quote: Legal check points for the \"two way\" traffic has NOTHING to do with the problems of illegal immigrants. No they dont, not having a proper double layer fence across the entire border to keep illegals out IS the problem as well as unscrupulous employers who need to be fined out of business when they continue to hire them. Like some others here Dave, Ive been through them hundreds, if not a couple thousand times, whats the point? Build a damn wall and keep them OUT. This has nothing to do with immigration, legal or other wise. It falls in to the catagory of \"schit happens.\" I just read that eight cases have been diagnosed in New York. The problem here is that this disease, bad as it may be, is not the second coming of the Black Plague. By the time authorities knew it even existed, it was too late. Stock up on fruit juices, tylanol and aspirin - Or go to Ukraine and spread the disease to them... Dave",
        "intTime": 20090425,
        "postID": 25,
        "quote": "Originally posted by FlankerFlyer: quote: Hey Mr. Flanker - Did it ever occur to you that there are people who come in legally? You know, Mexico is a big trading partner? Did you know medical screening is part of legal immigration process? quote: Legal check points for the \"two way\" traffic has NOTHING to do with the problems of illegal immigrants. No they dont, not having a proper double layer fence across the entire border to keep illegals out IS the problem as well as unscrupulous employers who need to be fined out of business when they continue to hire them. Like some others here Dave, Ive been through them hundreds, if not a couple thousand times, whats the point? Build a damn wall and keep them OUT.",
        "reply": " This has nothing to do with immigration, legal or other wise. It falls in to the catagory of \"schit happens.\" I just read that eight cases have been diagnosed in New York. The problem here is that this disease, bad as it may be, is not the second coming of the Black Plague. By the time authorities knew it even existed, it was too late. Stock up on fruit juices, tylanol and aspirin - Or go to Ukraine and spread the disease to them... Dave",
        "threadID": "672198221_9880057122001",
        "time": "2009-04-25 19:36:00",
        "title": "Swine Flu updates thread (latest: WHO says Swine Flu is now GLOBAL PANDEMIC) level 6",
        "userID": "Grachus"
    },
    {
        "content": "Americans go south too, don't they? Try stopping that.",
        "intTime": 20090427,
        "postID": 26,
        "quote": "",
        "reply": "Americans go south too, don't they? Try stopping that.",
        "threadID": "672198221_9880057122001",
        "time": "2009-04-27 13:01:00",
        "title": "Swine Flu updates thread (latest: WHO says Swine Flu is now GLOBAL PANDEMIC) level 6",
        "userID": "popsiq"
    },
    {
        "content": "quote: Originally posted by popsiq: Americans go south too, don't they? Try stopping that. I think it's funny that a new disease pops into existance, and the first thing that occurs to some people is blaming immigrants... New York now has 28 verified cases, with another 100 suspect - All from a private school that sent some kids on a trip to Cancun. And they all traveled by air. I might add, that all but two of the verified cases, have made a recovery, and the two that haven't, aren't getting worse. Go figure? Dave",
        "intTime": 20090427,
        "postID": 27,
        "quote": "Originally posted by popsiq: Americans go south too, don't they? Try stopping that.",
        "reply": " I think it's funny that a new disease pops into existance, and the first thing that occurs to some people is blaming immigrants... New York now has 28 verified cases, with another 100 suspect - All from a private school that sent some kids on a trip to Cancun. And they all traveled by air. I might add, that all but two of the verified cases, have made a recovery, and the two that haven't, aren't getting worse. Go figure? Dave",
        "threadID": "672198221_9880057122001",
        "time": "2009-04-27 13:08:00",
        "title": "Swine Flu updates thread (latest: WHO says Swine Flu is now GLOBAL PANDEMIC) level 6",
        "userID": "Grachus"
    },
    {
        "content": "quote: Originally posted by popsiq: Americans go south too, don't they? Try stopping that. What's the percentage of Americans illegaly entering Mexico as opposed to Mexicans illegaly entering the US??? Not blaming illegals(or legals), it's just that when you don't have control of the borders, you don't know what is entering.",
        "intTime": 20090427,
        "postID": 28,
        "quote": "Originally posted by popsiq: Americans go south too, don't they? Try stopping that.",
        "reply": " What's the percentage of Americans illegaly entering Mexico as opposed to Mexicans illegaly entering the US??? Not blaming illegals(or legals), it's just that when you don't have control of the borders, you don't know what is entering.",
        "threadID": "672198221_9880057122001",
        "time": "2009-04-27 13:58:00",
        "title": "Swine Flu updates thread (latest: WHO says Swine Flu is now GLOBAL PANDEMIC) level 6",
        "userID": "67NOV"
    },
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by popsiq: Americans go south too, don't they? Try stopping that. I think it's funny that a new disease pops into existance, and the first thing that occurs to some people is blaming immigrants... New York now has 28 verified cases, with another 100 suspect - All from a private school that sent some kids on a trip to Cancun. And they all traveled by air. I might add, that all but two of the verified cases, have made a recovery, and the two that haven't, aren't getting worse. Go figure? Dave Agreed, it's a matter of medical treatment. Guess our Health care system isn't THAT bad yet. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin",
        "intTime": 20090427,
        "postID": 29,
        "quote": "Originally posted by Grachus: quote: Originally posted by popsiq: Americans go south too, don't they? Try stopping that. I think it's funny that a new disease pops into existance, and the first thing that occurs to some people is blaming immigrants... New York now has 28 verified cases, with another 100 suspect - All from a private school that sent some kids on a trip to Cancun. And they all traveled by air. I might add, that all but two of the verified cases, have made a recovery, and the two that haven't, aren't getting worse. Go figure? Dave",
        "reply": " Agreed, it's a matter of medical treatment. Guess our Health care system isn't THAT bad yet. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin",
        "threadID": "672198221_9880057122001",
        "time": "2009-04-27 15:10:00",
        "title": "Swine Flu updates thread (latest: WHO says Swine Flu is now GLOBAL PANDEMIC) level 6",
        "userID": "L0A1"
    },
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by Grachus: quote: Originally posted by popsiq: Americans go south too, don't they? Try stopping that. I think it's funny that a new disease pops into existance, and the first thing that occurs to some people is blaming immigrants... New York now has 28 verified cases, with another 100 suspect - All from a private school that sent some kids on a trip to Cancun. And they all traveled by air. I might add, that all but two of the verified cases, have made a recovery, and the two that haven't, aren't getting worse. Go figure? Dave Agreed, it's a matter of medical treatment. Guess our Health care system isn't THAT bad yet. I wish it was as simple as that. The infected kids basically were treated in the normal manner for the flu. None of them were hospitalised, none of them were in a life threatening situation. Very puzzling and I doubt if we will know any answers for weeks if not months. Dave",
        "intTime": 20090427,
        "postID": 30,
        "quote": "Originally posted by L0A1: quote: Originally posted by Grachus: quote: Originally posted by popsiq: Americans go south too, don't they? Try stopping that. I think it's funny that a new disease pops into existance, and the first thing that occurs to some people is blaming immigrants... New York now has 28 verified cases, with another 100 suspect - All from a private school that sent some kids on a trip to Cancun. And they all traveled by air. I might add, that all but two of the verified cases, have made a recovery, and the two that haven't, aren't getting worse. Go figure? Dave Agreed, it's a matter of medical treatment. Guess our Health care system isn't THAT bad yet.",
        "reply": " I wish it was as simple as that. The infected kids basically were treated in the normal manner for the flu. None of them were hospitalised, none of them were in a life threatening situation. Very puzzling and I doubt if we will know any answers for weeks if not months. Dave",
        "threadID": "672198221_9880057122001",
        "time": "2009-04-27 16:12:00",
        "title": "Swine Flu updates thread (latest: WHO says Swine Flu is now GLOBAL PANDEMIC) level 6",
        "userID": "Grachus"
    },
    {
        "content": "quote: I wish it was as simple as that. The infected kids basically were treated in the normal manner for the flu. None of them were hospitalised, none of them were in a life threatening situation. Very puzzling and I doubt if we will know any answers for weeks if not months. Oh, I dont know....could it be the high quality private medical that millions of people use in the USA. You know proper immunizations and routine medical care, better hygiene, kids and adults in the US have access to better than government run healthcare. The local hospital that first had contact with Geraldo Leyva Lolis, one of the first victims of this flu strain, didnt even have anti-virals or a means to even test him. But hey, Under Obama's grand plan, that kind of superb government run health care is coming your way to the USA.",
        "intTime": 20090427,
        "postID": 31,
        "quote": "I wish it was as simple as that. The infected kids basically were treated in the normal manner for the flu. None of them were hospitalised, none of them were in a life threatening situation. Very puzzling and I doubt if we will know any answers for weeks if not months.",
        "reply": " Oh, I dont know....could it be the high quality private medical that millions of people use in the USA. You know proper immunizations and routine medical care, better hygiene, kids and adults in the US have access to better than government run healthcare. The local hospital that first had contact with Geraldo Leyva Lolis, one of the first victims of this flu strain, didnt even have anti-virals or a means to even test him. But hey, Under Obama's grand plan, that kind of superb government run health care is coming your way to the USA.",
        "threadID": "672198221_9880057122001",
        "time": "2009-04-27 19:44:00",
        "title": "Swine Flu updates thread (latest: WHO says Swine Flu is now GLOBAL PANDEMIC) level 6",
        "userID": "FlankerFlyer"
    },
    {
        "content": "Mexico is having a bad time of it right now.... the drug gangs killing right and left, the economy not worth a peso, the earthquack and this flu thing..... we should say up a prayer for those innocents who want nothing more then to live life and enjoy ones family. One Flag......One Heart......One Nation............EVERMORE",
        "intTime": 20090427,
        "postID": 32,
        "quote": "",
        "reply": "Mexico is having a bad time of it right now.... the drug gangs killing right and left, the economy not worth a peso, the earthquack and this flu thing..... we should say up a prayer for those innocents who want nothing more then to live life and enjoy ones family. One Flag......One Heart......One Nation............EVERMORE",
        "threadID": "672198221_9880057122001",
        "time": "2009-04-27 21:08:00",
        "title": "Swine Flu updates thread (latest: WHO says Swine Flu is now GLOBAL PANDEMIC) level 6",
        "userID": "m551sheridan"
    },
    {
        "content": "So far this seems to be a bunch of crapola about little to nothing, hell we have 80 or more people die an hour on highways in America and it isn't called a \"pandemic\". The news did the same thing with SARS (the \"mysterious disease\" that would kill us all), Avian flu, etc. To no avail. Conspiracy theory of the day: The swine flu \"pandemic\" is nothing more than an attempt to scare the American public into approving a universal healthcare system. In a few months we will hear that the only way to combat this disease will have all hospitals work together, share patient information, demographics, drugs etc. The only way to do this is to unite the healthcare system under one \"command\"... Mark my words this will be used as an yet another excuse to federalize our healthcare system.",
        "intTime": 20090427,
        "postID": 33,
        "quote": "",
        "reply": "So far this seems to be a bunch of crapola about little to nothing, hell we have 80 or more people die an hour on highways in America and it isn't called a \"pandemic\". The news did the same thing with SARS (the \"mysterious disease\" that would kill us all), Avian flu, etc. To no avail. Conspiracy theory of the day: The swine flu \"pandemic\" is nothing more than an attempt to scare the American public into approving a universal healthcare system. In a few months we will hear that the only way to combat this disease will have all hospitals work together, share patient information, demographics, drugs etc. The only way to do this is to unite the healthcare system under one \"command\"... Mark my words this will be used as an yet another excuse to federalize our healthcare system.",
        "threadID": "672198221_9880057122001",
        "time": "2009-04-27 21:28:00",
        "title": "Swine Flu updates thread (latest: WHO says Swine Flu is now GLOBAL PANDEMIC) level 6",
        "userID": "ronald45"
    },
    {
        "content": "I agree with Ron...I aint scared.",
        "intTime": 20090427,
        "postID": 34,
        "quote": "",
        "reply": "I agree with Ron...I aint scared.",
        "threadID": "672198221_9880057122001",
        "time": "2009-04-27 21:33:00",
        "title": "Swine Flu updates thread (latest: WHO says Swine Flu is now GLOBAL PANDEMIC) level 6",
        "userID": "Bad_Moon_Rising"
    },
    {
        "content": "If this becomes a major pandemic, and instead of the benighn flu that we've been seeing in New York, a really serious \"1918\" type flu, you will indeed see massive government action and coordination. And you will see that because there's no other way to fight such diseases. While it will be a \"Socialist\" response, that response will NOT be Socialism. It will be common sense. You guys must be Very VERY young. When I was a kid in the early fifties, the government intervened MASSIVELY to fight polio. ALl of us got free or low cost vaccinations. Treatment and health teams scoured the country. Any use of a Pandemic to push a political agenda is of course wrong - On the other hand, to make believe that you fight epidemics on the basis of, \"you're all on your own, you should have made better choices,\" is just plain STUPID. Dave",
        "intTime": 20090428,
        "postID": 35,
        "quote": "",
        "reply": "If this becomes a major pandemic, and instead of the benighn flu that we've been seeing in New York, a really serious \"1918\" type flu, you will indeed see massive government action and coordination. And you will see that because there's no other way to fight such diseases. While it will be a \"Socialist\" response, that response will NOT be Socialism. It will be common sense. You guys must be Very VERY young. When I was a kid in the early fifties, the government intervened MASSIVELY to fight polio. ALl of us got free or low cost vaccinations. Treatment and health teams scoured the country. Any use of a Pandemic to push a political agenda is of course wrong - On the other hand, to make believe that you fight epidemics on the basis of, \"you're all on your own, you should have made better choices,\" is just plain STUPID. Dave",
        "threadID": "672198221_9880057122001",
        "time": "2009-04-28 08:11:00",
        "title": "Swine Flu updates thread (latest: WHO says Swine Flu is now GLOBAL PANDEMIC) level 6",
        "userID": "Grachus"
    },
    {
        "content": "Grachus, although yes I would hate to see this on the pandemic magnitude, it has already been confirmed that the few cases in the US were mild. Now whether or not this strain has mutated, or the simple fact that we Americans are immunized beyond belief and Mexicans arent has anything to do with that, I dont know. I'm glad to see the Gov is active in figuring it out now instead of waiting until it becomes a severe problem. Anyway I agree, this isnt a political agenda",
        "intTime": 20090428,
        "postID": 36,
        "quote": "",
        "reply": "Grachus, although yes I would hate to see this on the pandemic magnitude, it has already been confirmed that the few cases in the US were mild. Now whether or not this strain has mutated, or the simple fact that we Americans are immunized beyond belief and Mexicans arent has anything to do with that, I dont know. I'm glad to see the Gov is active in figuring it out now instead of waiting until it becomes a severe problem. Anyway I agree, this isnt a political agenda",
        "threadID": "672198221_9880057122001",
        "time": "2009-04-28 21:06:00",
        "title": "Swine Flu updates thread (latest: WHO says Swine Flu is now GLOBAL PANDEMIC) level 6",
        "userID": "Bad_Moon_Rising"
    },
    {
        "content": "quote: Anyway I agree, this isnt a political agenda Not yet but lets remember the current White House motto \"never let a crisis go to waste\". Im sure they are working on a way to spin it into a political advantage.",
        "intTime": 20090428,
        "postID": 37,
        "quote": "Anyway I agree, this isnt a political agenda",
        "reply": " Not yet but lets remember the current White House motto \"never let a crisis go to waste\". Im sure they are working on a way to spin it into a political advantage.",
        "threadID": "672198221_9880057122001",
        "time": "2009-04-28 21:45:00",
        "title": "Swine Flu updates thread (latest: WHO says Swine Flu is now GLOBAL PANDEMIC) level 6",
        "userID": "FlankerFlyer"
    },
    {
        "content": "68 cases so far most in a major city. i wouldn't be surprise to see 200 and rising. They need to deploy the military to the border or face a country with a out of control virus.",
        "intTime": 20090429,
        "postID": 38,
        "quote": "",
        "reply": "68 cases so far most in a major city. i wouldn't be surprise to see 200 and rising. They need to deploy the military to the border or face a country with a out of control virus.",
        "threadID": "672198221_9880057122001",
        "time": "2009-04-29 00:20:00",
        "title": "Swine Flu updates thread (latest: WHO says Swine Flu is now GLOBAL PANDEMIC) level 6",
        "userID": "world_king377"
    },
    {
        "content": "Gosh if only we would have had the same sense of \"urgency\" when AIDS first appeared . 68 dead in a city of over 10 million is hardly the pandemic it is being made out to be. Of course it has been a slow news week.",
        "intTime": 20090429,
        "postID": 39,
        "quote": "",
        "reply": "Gosh if only we would have had the same sense of \"urgency\" when AIDS first appeared . 68 dead in a city of over 10 million is hardly the pandemic it is being made out to be. Of course it has been a slow news week.",
        "threadID": "672198221_9880057122001",
        "time": "2009-04-29 04:49:00",
        "title": "Swine Flu updates thread (latest: WHO says Swine Flu is now GLOBAL PANDEMIC) level 6",
        "userID": "ronald45"
    },
    {
        "content": "quote: Originally posted by ronald45: Gosh if only we would have had the same sense of \"urgency\" when AIDS first appeared . 68 dead in a city of over 10 million is hardly the pandemic it is being made out to be. Of course it has been a slow news week. Of course it may be a slow information processing week for you. get up to speed, pokey. quote: Mexico's government says up to 159 people have been killed by the virus there with more than 2,400 sickened. Cases of swine flu have also been confirmed in the United States, Canada, New Zealand, Israel, Britain and Spain. German officials said a man who recently returned from holiday in Mexico had tested positive for the new H1N1 strain. >>http://www.msnbc.msn.com/id/30398682/ figured MSPMS would be a source YOU would trust.",
        "intTime": 20090429,
        "postID": 40,
        "quote": "Originally posted by ronald45: Gosh if only we would have had the same sense of \"urgency\" when AIDS first appeared . 68 dead in a city of over 10 million is hardly the pandemic it is being made out to be. Of course it has been a slow news week.",
        "reply": " Of course it may be a slow information processing week for you. get up to speed, pokey. quote: Mexico's government says up to 159 people have been killed by the virus there with more than 2,400 sickened. Cases of swine flu have also been confirmed in the United States, Canada, New Zealand, Israel, Britain and Spain. German officials said a man who recently returned from holiday in Mexico had tested positive for the new H1N1 strain. >>http://www.msnbc.msn.com/id/30398682/ figured MSPMS would be a source YOU would trust.",
        "threadID": "672198221_9880057122001",
        "time": "2009-04-29 05:00:00",
        "title": "Swine Flu updates thread (latest: WHO says Swine Flu is now GLOBAL PANDEMIC) level 6",
        "userID": "FlankerFlyer"
    }
]