[
    {
        "content": ">http://www.nytimes.com/2009/03/18/world/europe/18medvedev.html It's a too bad they're broke and don't have a proverbial pot to urinate in. But not having a massive public debt, as well as proximity to the last appreciable sources of petroleum on earth should stand the Rooskies in good stead when they go, afganka in hand, looking for funding. They noticed 'deficiencies' when they taped the gallant l'il Georgians and want to put things right.", 
        "intTime": 20090317, 
        "postID": 1, 
        "quote": "", 
        "reply": ">http://www.nytimes.com/2009/03/18/world/europe/18medvedev.html It's a too bad they're broke and don't have a proverbial pot to urinate in. But not having a massive public debt, as well as proximity to the last appreciable sources of petroleum on earth should stand the Rooskies in good stead when they go, afganka in hand, looking for funding. They noticed 'deficiencies' when they taped the gallant l'il Georgians and want to put things right.", 
        "threadID": "672198221_4920021812001", 
        "time": "2009-03-17 13:20:00", 
        "title": "Russian Re-Armament", 
        "userID": "popsiq"
    }, 
    {
        "content": "quote: Originally posted by popsiq: >http://www.nytimes.com/2009/03/18/world/europe/18medvedev.html It's a too bad they're broke and don't have a proverbial pot to urinate in. But not having a massive public debt, as well as proximity to the last appreciable sources of petroleum on earth should stand the Rooskies in good stead when they go, afganka in hand, looking for funding. They noticed 'deficiencies' when they taped the gallant l'il Georgians and want to put things right. Let's see, a balanced budget, unfettered access to energy sources, their industrial base still in their country, a really big chip on their shoulder with the west, Europe dependent on the Russian Federation for their natural gas and oil... A political leader with a hatred of the west and a goal to subjugate the west... Naw, I can't see any probable cause for concern at all, not at all... Respectfully, SUNLINER81", 
        "intTime": 20090317, 
        "postID": 2, 
        "quote": "Originally posted by popsiq: >http://www.nytimes.com/2009/03/18/world/europe/18medvedev.html It's a too bad they're broke and don't have a proverbial pot to urinate in. But not having a massive public debt, as well as proximity to the last appreciable sources of petroleum on earth should stand the Rooskies in good stead when they go, afganka in hand, looking for funding. They noticed 'deficiencies' when they taped the gallant l'il Georgians and want to put things right.", 
        "reply": " Let's see, a balanced budget, unfettered access to energy sources, their industrial base still in their country, a really big chip on their shoulder with the west, Europe dependent on the Russian Federation for their natural gas and oil... A political leader with a hatred of the west and a goal to subjugate the west... Naw, I can't see any probable cause for concern at all, not at all... Respectfully, SUNLINER81", 
        "threadID": "672198221_4920021812001", 
        "time": "2009-03-17 13:29:00", 
        "title": "Russian Re-Armament", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "The title is misleading; it implies added numbers when the new restructuring is all about modernization & downsizing, particularly their officer corps (some 200,000 will get cut by 2012)! BBC has a report on it (tonight I believe), focusing on the paratroopers who unlike the rest of military are 80% volunteer/professional…..... Also, despite the drop in crude prices, defense budget remains the same!", 
        "intTime": 20090317, 
        "postID": 3, 
        "quote": "", 
        "reply": "The title is misleading; it implies added numbers when the new restructuring is all about modernization & downsizing, particularly their officer corps (some 200,000 will get cut by 2012)! BBC has a report on it (tonight I believe), focusing on the paratroopers who unlike the rest of military are 80% volunteer/professional…..... Also, despite the drop in crude prices, defense budget remains the same!", 
        "threadID": "672198221_4920021812001", 
        "time": "2009-03-17 13:33:00", 
        "title": "Russian Re-Armament", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by Knele: The title is misleading; it implies added numbers when the new restructuring is all about modernization & downsizing, particularly their officer corps (some 200,000 will get cut by 2012)! BBC has a report on it (tonight I believe), focusing on the paratroopers who unlike the rest of military are 80% volunteer/professional…..... Also, despite the drop in crude prices, defense budget remains the same! The point is, that with a balanced budget and that they are an exporting nation now, with an on shore industrial base, they are in a position to do just about what they want, if they decide, that it is in their best interests to do it... That's the point, they aren't economically broke, like we are, as well as the majority of the western nations... Respectfully, SUNLINER81", 
        "intTime": 20090317, 
        "postID": 4, 
        "quote": "Originally posted by Knele: The title is misleading; it implies added numbers when the new restructuring is all about modernization & downsizing, particularly their officer corps (some 200,000 will get cut by 2012)! BBC has a report on it (tonight I believe), focusing on the paratroopers who unlike the rest of military are 80% volunteer/professional…..... Also, despite the drop in crude prices, defense budget remains the same!", 
        "reply": " The point is, that with a balanced budget and that they are an exporting nation now, with an on shore industrial base, they are in a position to do just about what they want, if they decide, that it is in their best interests to do it... That's the point, they aren't economically broke, like we are, as well as the majority of the western nations... Respectfully, SUNLINER81", 
        "threadID": "672198221_4920021812001", 
        "time": "2009-03-17 13:36:00", 
        "title": "Russian Re-Armament", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "+", 
        "intTime": 20090317, 
        "postID": 5, 
        "quote": "", 
        "reply": "+", 
        "threadID": "672198221_4920021812001", 
        "time": "2009-03-17 13:37:00", 
        "title": "Russian Re-Armament", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by popsiq: >http://www.nytimes.com/2009/03/18/world/europe/18medvedev.html It's a too bad they're broke and don't have a proverbial pot to urinate in. But not having a massive public debt, as well as proximity to the last appreciable sources of petroleum on earth should stand the Rooskies in good stead when they go, afganka in hand, looking for funding. They noticed 'deficiencies' when they taped the gallant l'il Georgians and want to put things right. As President Obama holds options open to Russia and wants to discontinue harsh rhetoric the Kremlin seems to be finding ways of emphasizing its importance. Posturing as this, as Flanker stated in an earlier thread, is to have tools of negotiation at hand. As some might report these overtures of returning to the old cold war ways is to test Obama. I don't think it has anything to do with the US as much as with events on the sub-continent and Asia as a whole. Which btw is not to our disadvantage but clearly would aid NATO. The announcement by Russia that the UN should be dominate in the Afghanistan/Pakistan turmoil could prove to our great benefit. \"The Shanghai Cooperation Organization (SCO) is scheduled to hold a conference on Afghanistan in Moscow on March 27, a few days ahead of a similar United Nations meeting in The Hague in the Netherlands. Russia, which holds the current SCO presidency, has sent out invitations to India, Turkey, Pakistan, Iran, the Group of Eight nations, the UN, as well as the North Atlantic Treaty Organization (NATO) to what is increasingly shaping up as a landmark event\". \"http://atimes.com/atimes/South_Asia/KC18Df02.html", 
        "intTime": 20090317, 
        "postID": 6, 
        "quote": "Originally posted by popsiq: >http://www.nytimes.com/2009/03/18/world/europe/18medvedev.html It's a too bad they're broke and don't have a proverbial pot to urinate in. But not having a massive public debt, as well as proximity to the last appreciable sources of petroleum on earth should stand the Rooskies in good stead when they go, afganka in hand, looking for funding. They noticed 'deficiencies' when they taped the gallant l'il Georgians and want to put things right.", 
        "reply": " As President Obama holds options open to Russia and wants to discontinue harsh rhetoric the Kremlin seems to be finding ways of emphasizing its importance. Posturing as this, as Flanker stated in an earlier thread, is to have tools of negotiation at hand. As some might report these overtures of returning to the old cold war ways is to test Obama. I don't think it has anything to do with the US as much as with events on the sub-continent and Asia as a whole. Which btw is not to our disadvantage but clearly would aid NATO. The announcement by Russia that the UN should be dominate in the Afghanistan/Pakistan turmoil could prove to our great benefit. \"The Shanghai Cooperation Organization (SCO) is scheduled to hold a conference on Afghanistan in Moscow on March 27, a few days ahead of a similar United Nations meeting in The Hague in the Netherlands. Russia, which holds the current SCO presidency, has sent out invitations to India, Turkey, Pakistan, Iran, the Group of Eight nations, the UN, as well as the North Atlantic Treaty Organization (NATO) to what is increasingly shaping up as a landmark event\". \"http://atimes.com/atimes/South_Asia/KC18Df02.html", 
        "threadID": "672198221_4920021812001", 
        "time": "2009-03-17 13:48:00", 
        "title": "Russian Re-Armament", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "The U.N. ?? You must be joking !", 
        "intTime": 20090317, 
        "postID": 7, 
        "quote": "", 
        "reply": "The U.N. ?? You must be joking !", 
        "threadID": "672198221_4920021812001", 
        "time": "2009-03-17 14:07:00", 
        "title": "Russian Re-Armament", 
        "userID": "MaddogK"
    }, 
    {
        "content": "quote: I don't think it has anything to do with the US as much as with events on the sub-continent and Asia as a whole. Which btw is not to our disadvantage but clearly would aid NATO. The announcement by Russia that the UN should be dominate in the Afghanistan/Pakistan turmoil could prove to our great benefit. Russia is getting a little worried with endless hunting for Ben Laden in Afghanistan, that ultimutely drove the drug production in Afghanistan to all time high. Their poppy crops are better than ever under American occupation. Given that Russia is the main market for those drugs, yes, Russia is a little bit concern. And given that American operations, that are going on 9th year are making situation only worse, I'd say they have a reason to be concerned. Afghanistan is the worst commercial ever to American forces.", 
        "intTime": 20090317, 
        "postID": 8, 
        "quote": "I don't think it has anything to do with the US as much as with events on the sub-continent and Asia as a whole. Which btw is not to our disadvantage but clearly would aid NATO. The announcement by Russia that the UN should be dominate in the Afghanistan/Pakistan turmoil could prove to our great benefit.", 
        "reply": " Russia is getting a little worried with endless hunting for Ben Laden in Afghanistan, that ultimutely drove the drug production in Afghanistan to all time high. Their poppy crops are better than ever under American occupation. Given that Russia is the main market for those drugs, yes, Russia is a little bit concern. And given that American operations, that are going on 9th year are making situation only worse, I'd say they have a reason to be concerned. Afghanistan is the worst commercial ever to American forces.", 
        "threadID": "672198221_4920021812001", 
        "time": "2009-03-17 17:10:00", 
        "title": "Russian Re-Armament", 
        "userID": "TataH"
    }, 
    {
        "content": "quote: Originally posted by MaddogK: The U.N. ?? You must be joking ! I wish I was. But someone has to ask you to the dance and they don't belong to NATO as you know. Tatah sums it up nicely. Along with the Asian market prosperity comes with a price, in China who btw has surpass Africa with new HIV infections.", 
        "intTime": 20090317, 
        "postID": 9, 
        "quote": "Originally posted by MaddogK: The U.N. ?? You must be joking !", 
        "reply": " I wish I was. But someone has to ask you to the dance and they don't belong to NATO as you know. Tatah sums it up nicely. Along with the Asian market prosperity comes with a price, in China who btw has surpass Africa with new HIV infections.", 
        "threadID": "672198221_4920021812001", 
        "time": "2009-03-17 17:22:00", 
        "title": "Russian Re-Armament", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: Medvedev Pushes Plan to Remake Russian Military Russian President Dmitry Medvedev vowed to press ahead with an ambitious overhaul of Russia’s armed forces despite the nation’s economic problems and vocal opposition from within the military. Medvedev promised weapons upgrades but also endorsed organizational changes that will cut the officer corps by more than half, or as many as 200,000 positions. The plan, first disclosed in October, envisions the most dramatic transformation of the Russian military since World War II, abandoning a structure designed to mobilize large numbers of new troops to fight a major war and replacing it with a leaner, standing army that can respond more quickly to local conflicts. Thousands of combat units now staffed only with officers would be eliminated, and the military’s four-level command structure would be trimmed to a three-tier hierarchy. (Washington Post, March 18, 2009, Pg. 8)", 
        "intTime": 20090318, 
        "postID": 10, 
        "quote": "Medvedev Pushes Plan to Remake Russian Military Russian President Dmitry Medvedev vowed to press ahead with an ambitious overhaul of Russia’s armed forces despite the nation’s economic problems and vocal opposition from within the military. Medvedev promised weapons upgrades but also endorsed organizational changes that will cut the officer corps by more than half, or as many as 200,000 positions. The plan, first disclosed in October, envisions the most dramatic transformation of the Russian military since World War II, abandoning a structure designed to mobilize large numbers of new troops to fight a major war and replacing it with a leaner, standing army that can respond more quickly to local conflicts. Thousands of combat units now staffed only with officers would be eliminated, and the military’s four-level command structure would be trimmed to a three-tier hierarchy. (Washington Post, March 18, 2009, Pg. 8)", 
        "reply": "", 
        "threadID": "672198221_4920021812001", 
        "time": "2009-03-18 08:15:00", 
        "title": "Russian Re-Armament", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: quote: Originally posted by Knele: The title is misleading; it implies added numbers when the new restructuring is all about modernization & downsizing, particularly their officer corps (some 200,000 will get cut by 2012)! BBC has a report on it (tonight I believe), focusing on the paratroopers who unlike the rest of military are 80% volunteer/professional…..... Also, despite the drop in crude prices, defense budget remains the same! The point is, that with a balanced budget and that they are an exporting nation now, with an on shore industrial base, they are in a position to do just about what they want, if they decide, that it is in their best interests to do it... That's the point, they aren't economically broke, like we are, as well as the majority of the western nations... Respectfully, SUNLINER81 ya the trillions dollars bailouts will keep us economically week [broke] for decades! if we don't return to diciplined economics Russia will soon make the U.S. look like a third world country!", 
        "intTime": 20090318, 
        "postID": 11, 
        "quote": "Originally posted by SUNLINER81: quote: Originally posted by Knele: The title is misleading; it implies added numbers when the new restructuring is all about modernization & downsizing, particularly their officer corps (some 200,000 will get cut by 2012)! BBC has a report on it (tonight I believe), focusing on the paratroopers who unlike the rest of military are 80% volunteer/professional…..... Also, despite the drop in crude prices, defense budget remains the same! The point is, that with a balanced budget and that they are an exporting nation now, with an on shore industrial base, they are in a position to do just about what they want, if they decide, that it is in their best interests to do it... That's the point, they aren't economically broke, like we are, as well as the majority of the western nations... Respectfully, SUNLINER81", 
        "reply": " ya the trillions dollars bailouts will keep us economically week [broke] for decades! if we don't return to diciplined economics Russia will soon make the U.S. look like a third world country!", 
        "threadID": "672198221_4920021812001", 
        "time": "2009-03-18 08:31:00", 
        "title": "Russian Re-Armament", 
        "userID": "EAG154"
    }, 
    {
        "content": "quote: Defense Secretary Robert M. Gates played down the risk of new military challenges to the U.S. from its two former Cold War adversaries — Russia and China. A day after Russian President Dmitry Medvedev announced that Russia would rearm its military and boost its nuclear forces, the U.S. defense chief said Moscow is actually moving to reduce the size of its traditional military force. Gates told reporters at a Pentagon briefing he also does not believe aggressive Chinese behavior against U.S. Navy surveillance vessels in the South China Sea suggests Beijing wants to force the U.S. Pacific fleet from the region. (Reuters.com, March 18, 2009)", 
        "intTime": 20090319, 
        "postID": 12, 
        "quote": "Defense Secretary Robert M. Gates played down the risk of new military challenges to the U.S. from its two former Cold War adversaries — Russia and China. A day after Russian President Dmitry Medvedev announced that Russia would rearm its military and boost its nuclear forces, the U.S. defense chief said Moscow is actually moving to reduce the size of its traditional military force. Gates told reporters at a Pentagon briefing he also does not believe aggressive Chinese behavior against U.S. Navy surveillance vessels in the South China Sea suggests Beijing wants to force the U.S. Pacific fleet from the region. (Reuters.com, March 18, 2009)", 
        "reply": "", 
        "threadID": "672198221_4920021812001", 
        "time": "2009-03-19 07:15:00", 
        "title": "Russian Re-Armament", 
        "userID": "Knele"
    }, 
    {
        "content": "reducing the size of the military to a manageable and professional level will save the Military as much as US8 billion per year and thats no small potatoes in Russia. Modern weapons systems and communications integration are central to this plan. The ability to do more with less has been an Achilles heel for the Russian military that has traditionally relied upon massive and overwhelming numbers instead of tactical skill and battlefield management. It literally takes 10 Russian soldiers to do what 5 American ones can do in terms of training and mission capability.", 
        "intTime": 20090319, 
        "postID": 13, 
        "quote": "", 
        "reply": "reducing the size of the military to a manageable and professional level will save the Military as much as US8 billion per year and thats no small potatoes in Russia. Modern weapons systems and communications integration are central to this plan. The ability to do more with less has been an Achilles heel for the Russian military that has traditionally relied upon massive and overwhelming numbers instead of tactical skill and battlefield management. It literally takes 10 Russian soldiers to do what 5 American ones can do in terms of training and mission capability.", 
        "threadID": "672198221_4920021812001", 
        "time": "2009-03-19 18:47:00", 
        "title": "Russian Re-Armament", 
        "userID": "FlankerFlyer"
    }
]