[
    {
        "content": "quote: SHCHUCHYE, Russia, May 29 (Reuters) - Much of Russia's vast Cold War stockpile of chemical weapons, many with single warheads that could kill thousands, will be destroyed at a remote facility launched on Friday. Sarin, Soman and the most potent nerve gas VX are held at the plant near the Urals town of Shchuchye, some 1,800 km (1,125 miles) east of Moscow. Two million of these weapons will be rendered harmless by 2012. \"In favourable weather conditions and in a densely populated area, just one artillery shell filled with Sarin could kill thousands of people,\" a Russian colonel, who declined to be named, told Reuters at a ceremony at the plant. Russia and its Cold War-era foe the United States held more than 71,000 metric tonnes of deadly chemical agents in 1997, more than 90 percent of the world's total stockpiles. Russia's arsenal alone stood at 40,000 tonnes. The United States has contributed more than $1 billion to the construction of the plant. At the launching ceremony, the retired U.S. Senator, Richard Lugar, recalled that nine years ago a Russian major showed him how an 85mm chemical weapon shell could fit inside a briefcase. This had concentrated minds in Washington about the dangers of not dealing with the stockpiles, he said. \"The path to peace and prosperity for both Russia and the United States depend on how we resolve the threats posed by the arsenals built to fight World War III,\" Lugar said. \"Thankfully that confrontation never came but today we must ensure that the weapons are never used and never fall into the hands of those who would do harm to us or others.\" Russia has not stated how much it invested in the plant, but it was due to fund around half the construction costs, with the United States paying 36 percent and the European Union and some of its member states paying the rest. (....) Under the 1997 Chemical Weapons Convention, Moscow and Washington committed themselves to destroy all their stockpiles of chemical weapons by 2012. By May 2009, Russia had destroyed 30.35 percent and the United States had destroyed 60.11 percent of their arsenal of chemical weapons, according to data provided by the Organisation for the Prohibition of Chemical Weapons (OPCW). Nukes, Biological, chemical......Its amazing that some actually thought (and still do) war with USSR was “winnable” for either side. I for one I'm glad cooler heads prevailed. +http://www.reuters.com/article/latestCrisis/idUSLS10945 \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe",
        "intTime": 20090529,
        "postID": 1,
        "quote": "SHCHUCHYE, Russia, May 29 (Reuters) - Much of Russia's vast Cold War stockpile of chemical weapons, many with single warheads that could kill thousands, will be destroyed at a remote facility launched on Friday. Sarin, Soman and the most potent nerve gas VX are held at the plant near the Urals town of Shchuchye, some 1,800 km (1,125 miles) east of Moscow. Two million of these weapons will be rendered harmless by 2012. \"In favourable weather conditions and in a densely populated area, just one artillery shell filled with Sarin could kill thousands of people,\" a Russian colonel, who declined to be named, told Reuters at a ceremony at the plant. Russia and its Cold War-era foe the United States held more than 71,000 metric tonnes of deadly chemical agents in 1997, more than 90 percent of the world's total stockpiles. Russia's arsenal alone stood at 40,000 tonnes. The United States has contributed more than $1 billion to the construction of the plant. At the launching ceremony, the retired U.S. Senator, Richard Lugar, recalled that nine years ago a Russian major showed him how an 85mm chemical weapon shell could fit inside a briefcase. This had concentrated minds in Washington about the dangers of not dealing with the stockpiles, he said. \"The path to peace and prosperity for both Russia and the United States depend on how we resolve the threats posed by the arsenals built to fight World War III,\" Lugar said. \"Thankfully that confrontation never came but today we must ensure that the weapons are never used and never fall into the hands of those who would do harm to us or others.\" Russia has not stated how much it invested in the plant, but it was due to fund around half the construction costs, with the United States paying 36 percent and the European Union and some of its member states paying the rest. (....) Under the 1997 Chemical Weapons Convention, Moscow and Washington committed themselves to destroy all their stockpiles of chemical weapons by 2012. By May 2009, Russia had destroyed 30.35 percent and the United States had destroyed 60.11 percent of their arsenal of chemical weapons, according to data provided by the Organisation for the Prohibition of Chemical Weapons (OPCW).",
        "reply": " Nukes, Biological, chemical......Its amazing that some actually thought (and still do) war with USSR was “winnable” for either side. I for one I'm glad cooler heads prevailed. +http://www.reuters.com/article/latestCrisis/idUSLS10945 \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe",
        "threadID": "672198221_9270095422001",
        "time": "2009-05-29 10:47:00",
        "title": "Russia plant destroys chemical weapons designed for WWIII",
        "userID": "NSNN"
    },
    {
        "content": "So am I.",
        "intTime": 20090529,
        "postID": 2,
        "quote": "",
        "reply": "So am I.",
        "threadID": "672198221_9270095422001",
        "time": "2009-05-29 20:00:00",
        "title": "Russia plant destroys chemical weapons designed for WWIII",
        "userID": "RMax304823"
    }
]