[
    {
        "content": "quote: Jurors on Thursday told a judge they could not reach a decision on whether a former U.S. soldier should be sentenced to death for war crimes -- including rape and murder -- he committed in Iraq. The lack of a unanimous decision means Steven Green will be sentenced to life in prison without parole, according to instructions given to jurors as they began deliberations on the sentence Wednesday. Green was convicted earlier this month of murder, rape, conspiracy and obstruction of justice in connection with a 2006 incident near Yusufiya, about 20 miles south of Baghdad. Jurors decided he was guilty of raping a 14-year-old girl, then killing her and setting her body on fire to destroy evidence. He was also convicted of killing the girl's parents and 6-year-old sister. As jurors reported their inability to reach a decision, Green appeared to issue a sigh of relief and a small smile crossed his face. A member of his defense team, a paralegal, burst into sobs. When I first heard the sentence on the radio they said he could have been sentence to death. I thought \"You mispronounced that, it's not pronounced could, it's pronounced should.\" cnn.com/2009/CRIME/05/21/kentucky.soldier.iraq.murder/index.html This message has been edited. Last edited by: iamgonzo, Fri 22 May 2009 05:24 AM", 
        "intTime": 20090521, 
        "postID": 1, 
        "quote": "Jurors on Thursday told a judge they could not reach a decision on whether a former U.S. soldier should be sentenced to death for war crimes -- including rape and murder -- he committed in Iraq. The lack of a unanimous decision means Steven Green will be sentenced to life in prison without parole, according to instructions given to jurors as they began deliberations on the sentence Wednesday. Green was convicted earlier this month of murder, rape, conspiracy and obstruction of justice in connection with a 2006 incident near Yusufiya, about 20 miles south of Baghdad. Jurors decided he was guilty of raping a 14-year-old girl, then killing her and setting her body on fire to destroy evidence. He was also convicted of killing the girl's parents and 6-year-old sister. As jurors reported their inability to reach a decision, Green appeared to issue a sigh of relief and a small smile crossed his face. A member of his defense team, a paralegal, burst into sobs.", 
        "reply": " When I first heard the sentence on the radio they said he could have been sentence to death. I thought \"You mispronounced that, it's not pronounced could, it's pronounced should.\" cnn.com/2009/CRIME/05/21/kentucky.soldier.iraq.murder/index.html This message has been edited. Last edited by: iamgonzo, Fri 22 May 2009 05:24 AM", 
        "threadID": "672198221_7940039322001", 
        "time": "2009-05-21 21:08:00", 
        "title": "Life in prison for Steven Green.", 
        "userID": "iamgonzo"
    }, 
    {
        "content": "Bad Decision. This was Premeditated Murder and Rape of a Child & her family. Piece of Filth should be hanged right in the center of the Village the crime happened in.", 
        "intTime": 20090521, 
        "postID": 2, 
        "quote": "", 
        "reply": "Bad Decision. This was Premeditated Murder and Rape of a Child & her family. Piece of Filth should be hanged right in the center of the Village the crime happened in.", 
        "threadID": "672198221_7940039322001", 
        "time": "2009-05-21 21:42:00", 
        "title": "Life in prison for Steven Green.", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "quote: Originally posted by LineDoggie: Bad Decision. This was Premeditated Murder and Rape of a Child & her family. Piece of Filth should be hanged right in the center of the Village the crime happened in. naw that bring more Anti American from there. let him die a slow painful death at stake.", 
        "intTime": 20090522, 
        "postID": 3, 
        "quote": "Originally posted by LineDoggie: Bad Decision. This was Premeditated Murder and Rape of a Child & her family. Piece of Filth should be hanged right in the center of the Village the crime happened in.", 
        "reply": " naw that bring more Anti American from there. let him die a slow painful death at stake.", 
        "threadID": "672198221_7940039322001", 
        "time": "2009-05-22 00:41:00", 
        "title": "Life in prison for Steven Green.", 
        "userID": "world_king377"
    }, 
    {
        "content": "quote: Originally posted by LineDoggie: Bad Decision. This was Premeditated Murder and Rape of a Child & her family. Piece of Filth should be hanged right in the center of the Village the crime happened in. No kidding. This is the worst of worst crimes. I don't care if you saw the inside of your buddy's guts and then had to eat them. There is no event so traumatic that I'd repeatedly rape a 14 year old girl and then slaughter her whole family and then try to cover it up. That guy is a psycho and slimeball. Hope he gets raped repeatedly himself.", 
        "intTime": 20090522, 
        "postID": 4, 
        "quote": "Originally posted by LineDoggie: Bad Decision. This was Premeditated Murder and Rape of a Child & her family. Piece of Filth should be hanged right in the center of the Village the crime happened in.", 
        "reply": " No kidding. This is the worst of worst crimes. I don't care if you saw the inside of your buddy's guts and then had to eat them. There is no event so traumatic that I'd repeatedly rape a 14 year old girl and then slaughter her whole family and then try to cover it up. That guy is a psycho and slimeball. Hope he gets raped repeatedly himself.", 
        "threadID": "672198221_7940039322001", 
        "time": "2009-05-22 06:29:00", 
        "title": "Life in prison for Steven Green.", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "As someone who is Pro-Life, I cannot support his execution - so I feel that the life sentence is appropriate. Of course, an even more appropriate sentence would be for him to serve that life sentence in an Iraqi prison, rather than an American prison...", 
        "intTime": 20090522, 
        "postID": 5, 
        "quote": "", 
        "reply": "As someone who is Pro-Life, I cannot support his execution - so I feel that the life sentence is appropriate. Of course, an even more appropriate sentence would be for him to serve that life sentence in an Iraqi prison, rather than an American prison...", 
        "threadID": "672198221_7940039322001", 
        "time": "2009-05-22 06:33:00", 
        "title": "Life in prison for Steven Green.", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "He should have been tried in Iraq, by Iraqis. Maybe, someday, he will. His buddies, too. This message has been edited. Last edited by: AliBubba, Sat 23 May 2009 02:42 AM", 
        "intTime": 20090522, 
        "postID": 6, 
        "quote": "", 
        "reply": "He should have been tried in Iraq, by Iraqis. Maybe, someday, he will. His buddies, too. This message has been edited. Last edited by: AliBubba, Sat 23 May 2009 02:42 AM", 
        "threadID": "672198221_7940039322001", 
        "time": "2009-05-22 09:00:00", 
        "title": "Life in prison for Steven Green.", 
        "userID": "AliBubba"
    }, 
    {
        "content": "This is a country of laws. The jury system may not always work to the public's satisfaction and the jury may not always be right in its verdict (or lack thereof) but it is the best system yet devised. The jury heard the facts, both condemning and mitigating, while we did not. Whether we like the jury's decision or not, the jury's decision is an informed one while ours is not. Accept it!", 
        "intTime": 20090522, 
        "postID": 7, 
        "quote": "", 
        "reply": "This is a country of laws. The jury system may not always work to the public's satisfaction and the jury may not always be right in its verdict (or lack thereof) but it is the best system yet devised. The jury heard the facts, both condemning and mitigating, while we did not. Whether we like the jury's decision or not, the jury's decision is an informed one while ours is not. Accept it!", 
        "threadID": "672198221_7940039322001", 
        "time": "2009-05-22 13:30:00", 
        "title": "Life in prison for Steven Green.", 
        "userID": "fnewt"
    }, 
    {
        "content": "I don't understand our justice system most of the time. Back in 95 my Son was shot by a sniper while in PT formation with the 82nd Abn. Div. at Fort Bragg. The sniper, a Sgt. in the Army also killed my Son's commanding officer. The loser got life in prison. This guy kills people and then rapes children and he gets life also. Do we or don't we believe in the death penalty anymore?", 
        "intTime": 20090522, 
        "postID": 8, 
        "quote": "", 
        "reply": "I don't understand our justice system most of the time. Back in 95 my Son was shot by a sniper while in PT formation with the 82nd Abn. Div. at Fort Bragg. The sniper, a Sgt. in the Army also killed my Son's commanding officer. The loser got life in prison. This guy kills people and then rapes children and he gets life also. Do we or don't we believe in the death penalty anymore?", 
        "threadID": "672198221_7940039322001", 
        "time": "2009-05-22 16:25:00", 
        "title": "Life in prison for Steven Green.", 
        "userID": "Duster6"
    }, 
    {
        "content": "Crap happens...war dehumanizes everyone, and it impacted this guy hard. What he did was horrible, but crap happens...", 
        "intTime": 20090522, 
        "postID": 9, 
        "quote": "", 
        "reply": "Crap happens...war dehumanizes everyone, and it impacted this guy hard. What he did was horrible, but crap happens...", 
        "threadID": "672198221_7940039322001", 
        "time": "2009-05-22 16:33:00", 
        "title": "Life in prison for Steven Green.", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by fnewt: This is a country of laws. The jury system may not always work to the public's satisfaction and the jury may not always be right in its verdict (or lack thereof) but it is the best system yet devised. The jury heard the facts, both condemning and mitigating, while we did not. Whether we like the jury's decision or not, the jury's decision is an informed one while ours is not. Accept it! The jury should have either been military, since the crime was committed while wearing the uniform and stationed overseas, or a jury of Iraqis in Iraq.", 
        "intTime": 20090522, 
        "postID": 10, 
        "quote": "Originally posted by fnewt: This is a country of laws. The jury system may not always work to the public's satisfaction and the jury may not always be right in its verdict (or lack thereof) but it is the best system yet devised. The jury heard the facts, both condemning and mitigating, while we did not. Whether we like the jury's decision or not, the jury's decision is an informed one while ours is not. Accept it!", 
        "reply": " The jury should have either been military, since the crime was committed while wearing the uniform and stationed overseas, or a jury of Iraqis in Iraq.", 
        "threadID": "672198221_7940039322001", 
        "time": "2009-05-22 17:34:00", 
        "title": "Life in prison for Steven Green.", 
        "userID": "iamgonzo"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: Crap happens...war dehumanizes everyone, and it impacted this guy hard. What he did was horrible, but crap happens... Rape and murder is \"crap happens\"? An accidental shooting of a civilian or an ally could be chalked up to \"it happens in war\", but premeditated rape and murder, get real.", 
        "intTime": 20090522, 
        "postID": 11, 
        "quote": "Originally posted by Irwin_R_Schyster: Crap happens...war dehumanizes everyone, and it impacted this guy hard. What he did was horrible, but crap happens...", 
        "reply": " Rape and murder is \"crap happens\"? An accidental shooting of a civilian or an ally could be chalked up to \"it happens in war\", but premeditated rape and murder, get real.", 
        "threadID": "672198221_7940039322001", 
        "time": "2009-05-22 17:36:00", 
        "title": "Life in prison for Steven Green.", 
        "userID": "iamgonzo"
    }, 
    {
        "content": "quote: Originally posted by iamgonzo: quote: Originally posted by Irwin_R_Schyster: Crap happens...war dehumanizes everyone, and it impacted this guy hard. What he did was horrible, but crap happens... Rape and murder is \"crap happens\"? An accidental shooting of a civilian or an ally could be chalked up to \"it happens in war\", but premeditated rape and murder, get real. I agree, but..... There is a well known and recognised legal doctrine called \"Mitigating factors.\" I believe that they came into play. Not for me to second guess the Jury. Dave", 
        "intTime": 20090522, 
        "postID": 12, 
        "quote": "Originally posted by iamgonzo: quote: Originally posted by Irwin_R_Schyster: Crap happens...war dehumanizes everyone, and it impacted this guy hard. What he did was horrible, but crap happens... Rape and murder is \"crap happens\"? An accidental shooting of a civilian or an ally could be chalked up to \"it happens in war\", but premeditated rape and murder, get real.", 
        "reply": " I agree, but..... There is a well known and recognised legal doctrine called \"Mitigating factors.\" I believe that they came into play. Not for me to second guess the Jury. Dave", 
        "threadID": "672198221_7940039322001", 
        "time": "2009-05-22 17:41:00", 
        "title": "Life in prison for Steven Green.", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by iamgonzo: quote: Originally posted by Irwin_R_Schyster: Crap happens...war dehumanizes everyone, and it impacted this guy hard. What he did was horrible, but crap happens... Rape and murder is \"crap happens\"? An accidental shooting of a civilian or an ally could be chalked up to \"it happens in war\", but premeditated rape and murder, get real. I agree, but..... There is a well known and recognised legal doctrine called \"Mitigating factors.\" I believe that they came into play. Not for me to second guess the Jury. Dave Yes, there can be mitigating factors, which is why we are to be tried by a jury of our peers. A bunch of civilians in Kentucky is not a jury of peers for events that happened in a combat zone.", 
        "intTime": 20090522, 
        "postID": 13, 
        "quote": "Originally posted by Grachus: quote: Originally posted by iamgonzo: quote: Originally posted by Irwin_R_Schyster: Crap happens...war dehumanizes everyone, and it impacted this guy hard. What he did was horrible, but crap happens... Rape and murder is \"crap happens\"? An accidental shooting of a civilian or an ally could be chalked up to \"it happens in war\", but premeditated rape and murder, get real. I agree, but..... There is a well known and recognised legal doctrine called \"Mitigating factors.\" I believe that they came into play. Not for me to second guess the Jury. Dave", 
        "reply": " Yes, there can be mitigating factors, which is why we are to be tried by a jury of our peers. A bunch of civilians in Kentucky is not a jury of peers for events that happened in a combat zone.", 
        "threadID": "672198221_7940039322001", 
        "time": "2009-05-22 19:10:00", 
        "title": "Life in prison for Steven Green.", 
        "userID": "iamgonzo"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: Crap happens...war dehumanizes everyone, and it impacted this guy hard. What he did was horrible, but crap happens... If that's the case, then any civilized nation should go to 'war' only at an extremity and shouldn't be 'preparing' for it. 'Military' training and discipline should be designed to mitigate againste such 'crap', the military knowing best how war can dehumanize everybody. 'Crap happens' naturally, but this 'crap' is prepared and perpetrated purely by people and, hence, should be avoidable, or severely punished by military law.", 
        "intTime": 20090523, 
        "postID": 14, 
        "quote": "Originally posted by Irwin_R_Schyster: Crap happens...war dehumanizes everyone, and it impacted this guy hard. What he did was horrible, but crap happens...", 
        "reply": " If that's the case, then any civilized nation should go to 'war' only at an extremity and shouldn't be 'preparing' for it. 'Military' training and discipline should be designed to mitigate againste such 'crap', the military knowing best how war can dehumanize everybody. 'Crap happens' naturally, but this 'crap' is prepared and perpetrated purely by people and, hence, should be avoidable, or severely punished by military law.", 
        "threadID": "672198221_7940039322001", 
        "time": "2009-05-23 02:49:00", 
        "title": "Life in prison for Steven Green.", 
        "userID": "AliBubba"
    }, 
    {
        "content": "quote: Originally posted by iamgonzo: quote: Originally posted by fnewt: This is a country of laws. The jury system may not always work to the public's satisfaction and the jury may not always be right in its verdict (or lack thereof) but it is the best system yet devised. The jury heard the facts, both condemning and mitigating, while we did not. Whether we like the jury's decision or not, the jury's decision is an informed one while ours is not. Accept it! The jury should have either been military, since the crime was committed while wearing the uniform and stationed overseas, or a jury of Iraqis in Iraq. YES! It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090523, 
        "postID": 15, 
        "quote": "Originally posted by iamgonzo: quote: Originally posted by fnewt: This is a country of laws. The jury system may not always work to the public's satisfaction and the jury may not always be right in its verdict (or lack thereof) but it is the best system yet devised. The jury heard the facts, both condemning and mitigating, while we did not. Whether we like the jury's decision or not, the jury's decision is an informed one while ours is not. Accept it! The jury should have either been military, since the crime was committed while wearing the uniform and stationed overseas, or a jury of Iraqis in Iraq.", 
        "reply": " YES! It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "672198221_7940039322001", 
        "time": "2009-05-23 03:30:00", 
        "title": "Life in prison for Steven Green.", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by iamgonzo: quote: Originally posted by Irwin_R_Schyster: Crap happens...war dehumanizes everyone, and it impacted this guy hard. What he did was horrible, but crap happens... Rape and murder is \"crap happens\"? An accidental shooting of a civilian or an ally could be chalked up to \"it happens in war\", but premeditated rape and murder, get real. I agree, but..... There is a well known and recognised legal doctrine called \"Mitigating factors.\" I believe that they came into play. Not for me to second guess the Jury. Dave Yes, mitigating factors often exist. But not always. Had he raped the girl and left it at that, I'd hear mitigation. But, instead: He raped a 14-year old girl. Then he killed her. Then he tried to cover it up by burning her body. Then he went even further and killed her ENTIRE FAMILY. Mom, dad, and little sister. Dead. Killed in cold blood so that they couldn't tell on him. He went back to his unit and soldiered on. When confronted, he denied EVERYTHING. There's no mitigating factors in that. At all. Period. It was rape, murder (times 4), obstruction of justice and just evil. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090523, 
        "postID": 16, 
        "quote": "Originally posted by Grachus: quote: Originally posted by iamgonzo: quote: Originally posted by Irwin_R_Schyster: Crap happens...war dehumanizes everyone, and it impacted this guy hard. What he did was horrible, but crap happens... Rape and murder is \"crap happens\"? An accidental shooting of a civilian or an ally could be chalked up to \"it happens in war\", but premeditated rape and murder, get real. I agree, but..... There is a well known and recognised legal doctrine called \"Mitigating factors.\" I believe that they came into play. Not for me to second guess the Jury. Dave", 
        "reply": " Yes, mitigating factors often exist. But not always. Had he raped the girl and left it at that, I'd hear mitigation. But, instead: He raped a 14-year old girl. Then he killed her. Then he tried to cover it up by burning her body. Then he went even further and killed her ENTIRE FAMILY. Mom, dad, and little sister. Dead. Killed in cold blood so that they couldn't tell on him. He went back to his unit and soldiered on. When confronted, he denied EVERYTHING. There's no mitigating factors in that. At all. Period. It was rape, murder (times 4), obstruction of justice and just evil. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "672198221_7940039322001", 
        "time": "2009-05-23 03:46:00", 
        "title": "Life in prison for Steven Green.", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "Iamgonzo said it right - he should have had a jury of his PEERS judge him; rather, instruct the judge on what they recommend (juries do not convict people). We're out there in these places HONORABLY, and some criminal in a uniform is tainting our name. Had he been tried FAIRLY, his sentence would have likely been death. \"Fairly\" doesn't mean just making certain he doesn't face a guilty-before-proven-innocent panel. It also means that he should be judged by a group who are similar to him. Too many people forget that little fact. What would have been true \"fairness\" is for the military to have rendered his verdict AND sentenced him. 12 civilians in KY know nothing about war, the military, or what transpired. But his command structure does and did. Military knows military. This life in prison stinks to high heaven. Let's look at some facts. It costs... $70k a year to put a man away for life when one accounts for all the associated costs? He'll live... what? Another 50-ish years? A .45 round costs 32 cents. Why are OUR tax dollars being abused to put this man -- I use that term ONLY in its most generic sense -- away for life when 32 cents will accomplish the same thing? Why not take all that saved money and better fund the military needs for mental health care so that incidents like this are cut off before they even happen? This moral superiority of professed narcissism that is life in prison instead of instant death is nonsensical, wasteful, and costly. Guess what? You're still killing him! You're just prolonging his own suffering and agony, as well as burdening taxpayers. You lock a man in a cage like an animal and he'll become... an animal. He's just as dead. Now he's just dying for your sick sense of retribution. That ain't justice. That's just twisted and perverted. A sentence of more than 20 years should be a bullet to the brain pan. Period. And before you scoffers lay into me about DNA and the few true innocents that have been falsely imprisoned - don't. Do you have any clue at all what it is like to be jailed for a crime you never committed? Well, I do. I'd prefer death. And so would you if they were going to lock you, an innocent, up for 20+ years. Just get it over, don't make me suffer for something I owe no penance to, and let me go meet my maker. 20-year sentence = instant and public execution. Stop locking up people for simple possession crimes. Stop making stupid laws that MAKE otherwise innocent people criminals. Get the church out of the justice system. We'd pay off our deficit in 2 years. Victims would have justice, and swiftly. Innocents wouldn't suffer false incarceration. Would-be criminals would think twice if they saw just ONE public shooting. Gang violence in jails would drop dramatically. America is thinking with her heart and not with her head. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090523, 
        "postID": 17, 
        "quote": "", 
        "reply": "Iamgonzo said it right - he should have had a jury of his PEERS judge him; rather, instruct the judge on what they recommend (juries do not convict people). We're out there in these places HONORABLY, and some criminal in a uniform is tainting our name. Had he been tried FAIRLY, his sentence would have likely been death. \"Fairly\" doesn't mean just making certain he doesn't face a guilty-before-proven-innocent panel. It also means that he should be judged by a group who are similar to him. Too many people forget that little fact. What would have been true \"fairness\" is for the military to have rendered his verdict AND sentenced him. 12 civilians in KY know nothing about war, the military, or what transpired. But his command structure does and did. Military knows military. This life in prison stinks to high heaven. Let's look at some facts. It costs... $70k a year to put a man away for life when one accounts for all the associated costs? He'll live... what? Another 50-ish years? A .45 round costs 32 cents. Why are OUR tax dollars being abused to put this man -- I use that term ONLY in its most generic sense -- away for life when 32 cents will accomplish the same thing? Why not take all that saved money and better fund the military needs for mental health care so that incidents like this are cut off before they even happen? This moral superiority of professed narcissism that is life in prison instead of instant death is nonsensical, wasteful, and costly. Guess what? You're still killing him! You're just prolonging his own suffering and agony, as well as burdening taxpayers. You lock a man in a cage like an animal and he'll become... an animal. He's just as dead. Now he's just dying for your sick sense of retribution. That ain't justice. That's just twisted and perverted. A sentence of more than 20 years should be a bullet to the brain pan. Period. And before you scoffers lay into me about DNA and the few true innocents that have been falsely imprisoned - don't. Do you have any clue at all what it is like to be jailed for a crime you never committed? Well, I do. I'd prefer death. And so would you if they were going to lock you, an innocent, up for 20+ years. Just get it over, don't make me suffer for something I owe no penance to, and let me go meet my maker. 20-year sentence = instant and public execution. Stop locking up people for simple possession crimes. Stop making stupid laws that MAKE otherwise innocent people criminals. Get the church out of the justice system. We'd pay off our deficit in 2 years. Victims would have justice, and swiftly. Innocents wouldn't suffer false incarceration. Would-be criminals would think twice if they saw just ONE public shooting. Gang violence in jails would drop dramatically. America is thinking with her heart and not with her head. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "672198221_7940039322001", 
        "time": "2009-05-23 04:07:00", 
        "title": "Life in prison for Steven Green.", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Originally posted by FollowMeInfantry: Yes, mitigating factors often exist. But not always. Had he raped the girl and left it at that, I'd hear mitigation. But, instead: He raped a 14-year old girl. Then he killed her. Then he tried to cover it up by burning her body. Then he went even further and killed her ENTIRE FAMILY. Mom, dad, and little sister. Dead. Killed in cold blood so that they couldn't tell on him. He went back to his unit and soldiered on. When confronted, he denied EVERYTHING. There's no mitigating factors in that. At all. Period. It was rape, murder (times 4), obstruction of justice and just evil. I make no claims to more knowledge than anyone else about this case. And as a civilian, I have defacto LESS knowledge about this case. Here are excerpts from two different stories on this incident. quote: In his defense, Wendelsdorf mentioned the testimony of psychiatric nurse practitioner Lt. Col. Karen Marrs. She interviewed Green in Iraq and said he exhibited characteristics that put him at risk for killing himself or others. Green was not pulled from combat but instead was given sleeping pills and returned to his checkpoint. Defense lawyers said the army knew Green was suffering psychologically and chose to ignore it rather than give him the mental health care he needed. *************** The prosecution claimed that Green committed a heinous, cold-blooded, premeditated crime and that the stresses of war -- including the deaths of many of his fellow soldiers -- were irrelevant. But the defense contended that the Army made the crimes more likely to happen by failing to evacuate Green after he was diagnosed with homicidal thoughts toward all Iraqis -- and by failing to provide adequate leadership for his platoon, which suffered the most casualties in the war. So apparently the Army KNEW that this guy was a loose canon waiting to explode. Are these not mitigating factors? Dave", 
        "intTime": 20090523, 
        "postID": 18, 
        "quote": "Originally posted by FollowMeInfantry: Yes, mitigating factors often exist. But not always. Had he raped the girl and left it at that, I'd hear mitigation. But, instead: He raped a 14-year old girl. Then he killed her. Then he tried to cover it up by burning her body. Then he went even further and killed her ENTIRE FAMILY. Mom, dad, and little sister. Dead. Killed in cold blood so that they couldn't tell on him. He went back to his unit and soldiered on. When confronted, he denied EVERYTHING. There's no mitigating factors in that. At all. Period. It was rape, murder (times 4), obstruction of justice and just evil.", 
        "reply": " I make no claims to more knowledge than anyone else about this case. And as a civilian, I have defacto LESS knowledge about this case. Here are excerpts from two different stories on this incident. quote: In his defense, Wendelsdorf mentioned the testimony of psychiatric nurse practitioner Lt. Col. Karen Marrs. She interviewed Green in Iraq and said he exhibited characteristics that put him at risk for killing himself or others. Green was not pulled from combat but instead was given sleeping pills and returned to his checkpoint. Defense lawyers said the army knew Green was suffering psychologically and chose to ignore it rather than give him the mental health care he needed. *************** The prosecution claimed that Green committed a heinous, cold-blooded, premeditated crime and that the stresses of war -- including the deaths of many of his fellow soldiers -- were irrelevant. But the defense contended that the Army made the crimes more likely to happen by failing to evacuate Green after he was diagnosed with homicidal thoughts toward all Iraqis -- and by failing to provide adequate leadership for his platoon, which suffered the most casualties in the war. So apparently the Army KNEW that this guy was a loose canon waiting to explode. Are these not mitigating factors? Dave", 
        "threadID": "672198221_7940039322001", 
        "time": "2009-05-23 08:58:00", 
        "title": "Life in prison for Steven Green.", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: <huge snip> So apparently the Army KNEW that this guy was a loose canon waiting to explode. Are these not mitigating factors? Dave C'mon, Dave, let's drop the political crap for a minute and focus on reality. He had friends die. Me too. Probably you too. I sit here today stressed over the death of a VERY good friend killed in Iraq [sometime in the past they're not telling us] that I heard about last week. His wife is suicidal. God only knows what his kids and parents are going through. He didn't rape, kill and burn a TEENAGER for Christ sake! And neither of us killed 3 other people, including another teenager to cover up our crime (had we committed one). Regardless, you're arguing against your own case. If he's that damn dirtbag nutty, then killing him is STILL appropriate. Why are you defending spending MY money to keep some lunatic locked in a 5 by 9 cell for 60 years? Put that poor kid out of his misery and our misery. Now, if you decide to debate the FACTS of life in prison versus capital punishment, I am gladly your huckleberry. But until then, NOTHING excuses what this boy did, mitigating or otherwise. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090523, 
        "postID": 19, 
        "quote": "Originally posted by Grachus: <huge snip> So apparently the Army KNEW that this guy was a loose canon waiting to explode. Are these not mitigating factors? Dave", 
        "reply": " C'mon, Dave, let's drop the political crap for a minute and focus on reality. He had friends die. Me too. Probably you too. I sit here today stressed over the death of a VERY good friend killed in Iraq [sometime in the past they're not telling us] that I heard about last week. His wife is suicidal. God only knows what his kids and parents are going through. He didn't rape, kill and burn a TEENAGER for Christ sake! And neither of us killed 3 other people, including another teenager to cover up our crime (had we committed one). Regardless, you're arguing against your own case. If he's that damn dirtbag nutty, then killing him is STILL appropriate. Why are you defending spending MY money to keep some lunatic locked in a 5 by 9 cell for 60 years? Put that poor kid out of his misery and our misery. Now, if you decide to debate the FACTS of life in prison versus capital punishment, I am gladly your huckleberry. But until then, NOTHING excuses what this boy did, mitigating or otherwise. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "672198221_7940039322001", 
        "time": "2009-05-23 09:29:00", 
        "title": "Life in prison for Steven Green.", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Originally posted by FollowMeInfantry: quote: Originally posted by Grachus: <huge snip> So apparently the Army KNEW that this guy was a loose canon waiting to explode. Are these not mitigating factors? Dave C'mon, Dave, let's drop the political crap for a minute and focus on reality. He had friends die. Me too. Probably you too. I sit here today stressed over the death of a VERY good friend killed in Iraq [sometime in the past they're not telling us] that I heard about last week. His wife is suicidal. God only knows what his kids and parents are going through. He didn't rape, kill and burn a TEENAGER for Christ sake! And neither of us killed 3 other people, including another teenager to cover up our crime (had we committed one). Regardless, you're arguing against your own case. If he's that damn dirtbag nutty, then killing him is STILL appropriate. Why are you defending spending MY money to keep some lunatic locked in a 5 by 9 cell for 60 years? Put that poor kid out of his misery and our misery. Now, if you decide to debate the FACTS of life in prison versus capital punishment, I am gladly your huckleberry. But until then, NOTHING excuses what this boy did, mitigating or otherwise. Mitigating factors is NOT an excuse for a crime. You don't go into Court and plead, \"Mitigating Factors.\" You don't use mitigating factors as your defense. They excuse nothing - They are an explanation, as to \"why\" a crime took place. They come into play AFTER a verdict. The man who just shot five of his comrades may wind up being tried for these killings. Maybe not, maybe the prosecution will agree that he was insane. I make no predictions. But that guy was thought abnormal enough to be sent to a facility where he could be treated. THIS guy was given some pills and put back on the job. Did I sit in the jury room and hear ALL the evidence? Have I lived through combat? While I can be an arrogant person, I am not being so in this case. I believe ONLY that I shouldn't second guess the Jury, who no doubt was just as troubled as I am. Nor am I making this incident \"political.\" I'm giving my opinion. Dave", 
        "intTime": 20090523, 
        "postID": 20, 
        "quote": "Originally posted by FollowMeInfantry: quote: Originally posted by Grachus: <huge snip> So apparently the Army KNEW that this guy was a loose canon waiting to explode. Are these not mitigating factors? Dave C'mon, Dave, let's drop the political crap for a minute and focus on reality. He had friends die. Me too. Probably you too. I sit here today stressed over the death of a VERY good friend killed in Iraq [sometime in the past they're not telling us] that I heard about last week. His wife is suicidal. God only knows what his kids and parents are going through. He didn't rape, kill and burn a TEENAGER for Christ sake! And neither of us killed 3 other people, including another teenager to cover up our crime (had we committed one). Regardless, you're arguing against your own case. If he's that damn dirtbag nutty, then killing him is STILL appropriate. Why are you defending spending MY money to keep some lunatic locked in a 5 by 9 cell for 60 years? Put that poor kid out of his misery and our misery. Now, if you decide to debate the FACTS of life in prison versus capital punishment, I am gladly your huckleberry. But until then, NOTHING excuses what this boy did, mitigating or otherwise.", 
        "reply": " Mitigating factors is NOT an excuse for a crime. You don't go into Court and plead, \"Mitigating Factors.\" You don't use mitigating factors as your defense. They excuse nothing - They are an explanation, as to \"why\" a crime took place. They come into play AFTER a verdict. The man who just shot five of his comrades may wind up being tried for these killings. Maybe not, maybe the prosecution will agree that he was insane. I make no predictions. But that guy was thought abnormal enough to be sent to a facility where he could be treated. THIS guy was given some pills and put back on the job. Did I sit in the jury room and hear ALL the evidence? Have I lived through combat? While I can be an arrogant person, I am not being so in this case. I believe ONLY that I shouldn't second guess the Jury, who no doubt was just as troubled as I am. Nor am I making this incident \"political.\" I'm giving my opinion. Dave", 
        "threadID": "672198221_7940039322001", 
        "time": "2009-05-23 09:40:00", 
        "title": "Life in prison for Steven Green.", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Jurors on Thursday told a judge they could not reach a decision on whether a former U.S. soldier should be sentenced to death for war crimes -- including rape and murder -- he committed in Iraq. The lack of a unanimous decision means Steven Green will be sentenced to life in prison without parole, according to instructions given to jurors as they began deliberations on the sentence Wednesday. Green was convicted earlier this month of murder, rape, conspiracy and obstruction of justice in connection with a 2006 incident near Yusufiya, about 20 miles south of Baghdad. Jurors decided he was guilty of raping a 14-year-old girl, then killing her and setting her body on fire to destroy evidence. He was also convicted of killing the girl's parents and 6-year-old sister. As jurors reported their inability to reach a decision, Green appeared to issue a sigh of relief and a small smile crossed his face. A member of his defense team, a paralegal, burst into sobs. When I first heard the sentence on the radio they said he could have been sentence to death. I thought \"You mispronounced that, it's not pronounced could, it's pronounced should.\" cnn.com/2009/CRIME/05/21/kentucky.soldier.iraq.murder/index.html This message has been edited. Last edited by: iamgonzo, Fri 22 May 2009 05:24 AM", 
        "intTime": 20090521, 
        "postID": 21, 
        "quote": "Jurors on Thursday told a judge they could not reach a decision on whether a former U.S. soldier should be sentenced to death for war crimes -- including rape and murder -- he committed in Iraq. The lack of a unanimous decision means Steven Green will be sentenced to life in prison without parole, according to instructions given to jurors as they began deliberations on the sentence Wednesday. Green was convicted earlier this month of murder, rape, conspiracy and obstruction of justice in connection with a 2006 incident near Yusufiya, about 20 miles south of Baghdad. Jurors decided he was guilty of raping a 14-year-old girl, then killing her and setting her body on fire to destroy evidence. He was also convicted of killing the girl's parents and 6-year-old sister. As jurors reported their inability to reach a decision, Green appeared to issue a sigh of relief and a small smile crossed his face. A member of his defense team, a paralegal, burst into sobs.", 
        "reply": " When I first heard the sentence on the radio they said he could have been sentence to death. I thought \"You mispronounced that, it's not pronounced could, it's pronounced should.\" cnn.com/2009/CRIME/05/21/kentucky.soldier.iraq.murder/index.html This message has been edited. Last edited by: iamgonzo, Fri 22 May 2009 05:24 AM", 
        "threadID": "672198221_7940039322001", 
        "time": "2009-05-21 21:08:00", 
        "title": "Life in prison for Steven Green.", 
        "userID": "iamgonzo"
    }, 
    {
        "content": "Bad Decision. This was Premeditated Murder and Rape of a Child & her family. Piece of Filth should be hanged right in the center of the Village the crime happened in.", 
        "intTime": 20090521, 
        "postID": 22, 
        "quote": "", 
        "reply": "Bad Decision. This was Premeditated Murder and Rape of a Child & her family. Piece of Filth should be hanged right in the center of the Village the crime happened in.", 
        "threadID": "672198221_7940039322001", 
        "time": "2009-05-21 21:42:00", 
        "title": "Life in prison for Steven Green.", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "quote: Originally posted by LineDoggie: Bad Decision. This was Premeditated Murder and Rape of a Child & her family. Piece of Filth should be hanged right in the center of the Village the crime happened in. naw that bring more Anti American from there. let him die a slow painful death at stake.", 
        "intTime": 20090522, 
        "postID": 23, 
        "quote": "Originally posted by LineDoggie: Bad Decision. This was Premeditated Murder and Rape of a Child & her family. Piece of Filth should be hanged right in the center of the Village the crime happened in.", 
        "reply": " naw that bring more Anti American from there. let him die a slow painful death at stake.", 
        "threadID": "672198221_7940039322001", 
        "time": "2009-05-22 00:41:00", 
        "title": "Life in prison for Steven Green.", 
        "userID": "world_king377"
    }, 
    {
        "content": "quote: Originally posted by LineDoggie: Bad Decision. This was Premeditated Murder and Rape of a Child & her family. Piece of Filth should be hanged right in the center of the Village the crime happened in. No kidding. This is the worst of worst crimes. I don't care if you saw the inside of your buddy's guts and then had to eat them. There is no event so traumatic that I'd repeatedly rape a 14 year old girl and then slaughter her whole family and then try to cover it up. That guy is a psycho and slimeball. Hope he gets raped repeatedly himself.", 
        "intTime": 20090522, 
        "postID": 24, 
        "quote": "Originally posted by LineDoggie: Bad Decision. This was Premeditated Murder and Rape of a Child & her family. Piece of Filth should be hanged right in the center of the Village the crime happened in.", 
        "reply": " No kidding. This is the worst of worst crimes. I don't care if you saw the inside of your buddy's guts and then had to eat them. There is no event so traumatic that I'd repeatedly rape a 14 year old girl and then slaughter her whole family and then try to cover it up. That guy is a psycho and slimeball. Hope he gets raped repeatedly himself.", 
        "threadID": "672198221_7940039322001", 
        "time": "2009-05-22 06:29:00", 
        "title": "Life in prison for Steven Green.", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "As someone who is Pro-Life, I cannot support his execution - so I feel that the life sentence is appropriate. Of course, an even more appropriate sentence would be for him to serve that life sentence in an Iraqi prison, rather than an American prison...", 
        "intTime": 20090522, 
        "postID": 25, 
        "quote": "", 
        "reply": "As someone who is Pro-Life, I cannot support his execution - so I feel that the life sentence is appropriate. Of course, an even more appropriate sentence would be for him to serve that life sentence in an Iraqi prison, rather than an American prison...", 
        "threadID": "672198221_7940039322001", 
        "time": "2009-05-22 06:33:00", 
        "title": "Life in prison for Steven Green.", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "He should have been tried in Iraq, by Iraqis. Maybe, someday, he will. His buddies, too. This message has been edited. Last edited by: AliBubba, Sat 23 May 2009 02:42 AM", 
        "intTime": 20090522, 
        "postID": 26, 
        "quote": "", 
        "reply": "He should have been tried in Iraq, by Iraqis. Maybe, someday, he will. His buddies, too. This message has been edited. Last edited by: AliBubba, Sat 23 May 2009 02:42 AM", 
        "threadID": "672198221_7940039322001", 
        "time": "2009-05-22 09:00:00", 
        "title": "Life in prison for Steven Green.", 
        "userID": "AliBubba"
    }, 
    {
        "content": "This is a country of laws. The jury system may not always work to the public's satisfaction and the jury may not always be right in its verdict (or lack thereof) but it is the best system yet devised. The jury heard the facts, both condemning and mitigating, while we did not. Whether we like the jury's decision or not, the jury's decision is an informed one while ours is not. Accept it!", 
        "intTime": 20090522, 
        "postID": 27, 
        "quote": "", 
        "reply": "This is a country of laws. The jury system may not always work to the public's satisfaction and the jury may not always be right in its verdict (or lack thereof) but it is the best system yet devised. The jury heard the facts, both condemning and mitigating, while we did not. Whether we like the jury's decision or not, the jury's decision is an informed one while ours is not. Accept it!", 
        "threadID": "672198221_7940039322001", 
        "time": "2009-05-22 13:30:00", 
        "title": "Life in prison for Steven Green.", 
        "userID": "fnewt"
    }, 
    {
        "content": "I don't understand our justice system most of the time. Back in 95 my Son was shot by a sniper while in PT formation with the 82nd Abn. Div. at Fort Bragg. The sniper, a Sgt. in the Army also killed my Son's commanding officer. The loser got life in prison. This guy kills people and then rapes children and he gets life also. Do we or don't we believe in the death penalty anymore?", 
        "intTime": 20090522, 
        "postID": 28, 
        "quote": "", 
        "reply": "I don't understand our justice system most of the time. Back in 95 my Son was shot by a sniper while in PT formation with the 82nd Abn. Div. at Fort Bragg. The sniper, a Sgt. in the Army also killed my Son's commanding officer. The loser got life in prison. This guy kills people and then rapes children and he gets life also. Do we or don't we believe in the death penalty anymore?", 
        "threadID": "672198221_7940039322001", 
        "time": "2009-05-22 16:25:00", 
        "title": "Life in prison for Steven Green.", 
        "userID": "Duster6"
    }, 
    {
        "content": "Crap happens...war dehumanizes everyone, and it impacted this guy hard. What he did was horrible, but crap happens...", 
        "intTime": 20090522, 
        "postID": 29, 
        "quote": "", 
        "reply": "Crap happens...war dehumanizes everyone, and it impacted this guy hard. What he did was horrible, but crap happens...", 
        "threadID": "672198221_7940039322001", 
        "time": "2009-05-22 16:33:00", 
        "title": "Life in prison for Steven Green.", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by fnewt: This is a country of laws. The jury system may not always work to the public's satisfaction and the jury may not always be right in its verdict (or lack thereof) but it is the best system yet devised. The jury heard the facts, both condemning and mitigating, while we did not. Whether we like the jury's decision or not, the jury's decision is an informed one while ours is not. Accept it! The jury should have either been military, since the crime was committed while wearing the uniform and stationed overseas, or a jury of Iraqis in Iraq.", 
        "intTime": 20090522, 
        "postID": 30, 
        "quote": "Originally posted by fnewt: This is a country of laws. The jury system may not always work to the public's satisfaction and the jury may not always be right in its verdict (or lack thereof) but it is the best system yet devised. The jury heard the facts, both condemning and mitigating, while we did not. Whether we like the jury's decision or not, the jury's decision is an informed one while ours is not. Accept it!", 
        "reply": " The jury should have either been military, since the crime was committed while wearing the uniform and stationed overseas, or a jury of Iraqis in Iraq.", 
        "threadID": "672198221_7940039322001", 
        "time": "2009-05-22 17:34:00", 
        "title": "Life in prison for Steven Green.", 
        "userID": "iamgonzo"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: Crap happens...war dehumanizes everyone, and it impacted this guy hard. What he did was horrible, but crap happens... Rape and murder is \"crap happens\"? An accidental shooting of a civilian or an ally could be chalked up to \"it happens in war\", but premeditated rape and murder, get real.", 
        "intTime": 20090522, 
        "postID": 31, 
        "quote": "Originally posted by Irwin_R_Schyster: Crap happens...war dehumanizes everyone, and it impacted this guy hard. What he did was horrible, but crap happens...", 
        "reply": " Rape and murder is \"crap happens\"? An accidental shooting of a civilian or an ally could be chalked up to \"it happens in war\", but premeditated rape and murder, get real.", 
        "threadID": "672198221_7940039322001", 
        "time": "2009-05-22 17:36:00", 
        "title": "Life in prison for Steven Green.", 
        "userID": "iamgonzo"
    }, 
    {
        "content": "quote: Originally posted by iamgonzo: quote: Originally posted by Irwin_R_Schyster: Crap happens...war dehumanizes everyone, and it impacted this guy hard. What he did was horrible, but crap happens... Rape and murder is \"crap happens\"? An accidental shooting of a civilian or an ally could be chalked up to \"it happens in war\", but premeditated rape and murder, get real. I agree, but..... There is a well known and recognised legal doctrine called \"Mitigating factors.\" I believe that they came into play. Not for me to second guess the Jury. Dave", 
        "intTime": 20090522, 
        "postID": 32, 
        "quote": "Originally posted by iamgonzo: quote: Originally posted by Irwin_R_Schyster: Crap happens...war dehumanizes everyone, and it impacted this guy hard. What he did was horrible, but crap happens... Rape and murder is \"crap happens\"? An accidental shooting of a civilian or an ally could be chalked up to \"it happens in war\", but premeditated rape and murder, get real.", 
        "reply": " I agree, but..... There is a well known and recognised legal doctrine called \"Mitigating factors.\" I believe that they came into play. Not for me to second guess the Jury. Dave", 
        "threadID": "672198221_7940039322001", 
        "time": "2009-05-22 17:41:00", 
        "title": "Life in prison for Steven Green.", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by iamgonzo: quote: Originally posted by Irwin_R_Schyster: Crap happens...war dehumanizes everyone, and it impacted this guy hard. What he did was horrible, but crap happens... Rape and murder is \"crap happens\"? An accidental shooting of a civilian or an ally could be chalked up to \"it happens in war\", but premeditated rape and murder, get real. I agree, but..... There is a well known and recognised legal doctrine called \"Mitigating factors.\" I believe that they came into play. Not for me to second guess the Jury. Dave Yes, there can be mitigating factors, which is why we are to be tried by a jury of our peers. A bunch of civilians in Kentucky is not a jury of peers for events that happened in a combat zone.", 
        "intTime": 20090522, 
        "postID": 33, 
        "quote": "Originally posted by Grachus: quote: Originally posted by iamgonzo: quote: Originally posted by Irwin_R_Schyster: Crap happens...war dehumanizes everyone, and it impacted this guy hard. What he did was horrible, but crap happens... Rape and murder is \"crap happens\"? An accidental shooting of a civilian or an ally could be chalked up to \"it happens in war\", but premeditated rape and murder, get real. I agree, but..... There is a well known and recognised legal doctrine called \"Mitigating factors.\" I believe that they came into play. Not for me to second guess the Jury. Dave", 
        "reply": " Yes, there can be mitigating factors, which is why we are to be tried by a jury of our peers. A bunch of civilians in Kentucky is not a jury of peers for events that happened in a combat zone.", 
        "threadID": "672198221_7940039322001", 
        "time": "2009-05-22 19:10:00", 
        "title": "Life in prison for Steven Green.", 
        "userID": "iamgonzo"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: Crap happens...war dehumanizes everyone, and it impacted this guy hard. What he did was horrible, but crap happens... If that's the case, then any civilized nation should go to 'war' only at an extremity and shouldn't be 'preparing' for it. 'Military' training and discipline should be designed to mitigate againste such 'crap', the military knowing best how war can dehumanize everybody. 'Crap happens' naturally, but this 'crap' is prepared and perpetrated purely by people and, hence, should be avoidable, or severely punished by military law.", 
        "intTime": 20090523, 
        "postID": 34, 
        "quote": "Originally posted by Irwin_R_Schyster: Crap happens...war dehumanizes everyone, and it impacted this guy hard. What he did was horrible, but crap happens...", 
        "reply": " If that's the case, then any civilized nation should go to 'war' only at an extremity and shouldn't be 'preparing' for it. 'Military' training and discipline should be designed to mitigate againste such 'crap', the military knowing best how war can dehumanize everybody. 'Crap happens' naturally, but this 'crap' is prepared and perpetrated purely by people and, hence, should be avoidable, or severely punished by military law.", 
        "threadID": "672198221_7940039322001", 
        "time": "2009-05-23 02:49:00", 
        "title": "Life in prison for Steven Green.", 
        "userID": "AliBubba"
    }, 
    {
        "content": "quote: Originally posted by iamgonzo: quote: Originally posted by fnewt: This is a country of laws. The jury system may not always work to the public's satisfaction and the jury may not always be right in its verdict (or lack thereof) but it is the best system yet devised. The jury heard the facts, both condemning and mitigating, while we did not. Whether we like the jury's decision or not, the jury's decision is an informed one while ours is not. Accept it! The jury should have either been military, since the crime was committed while wearing the uniform and stationed overseas, or a jury of Iraqis in Iraq. YES! It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090523, 
        "postID": 35, 
        "quote": "Originally posted by iamgonzo: quote: Originally posted by fnewt: This is a country of laws. The jury system may not always work to the public's satisfaction and the jury may not always be right in its verdict (or lack thereof) but it is the best system yet devised. The jury heard the facts, both condemning and mitigating, while we did not. Whether we like the jury's decision or not, the jury's decision is an informed one while ours is not. Accept it! The jury should have either been military, since the crime was committed while wearing the uniform and stationed overseas, or a jury of Iraqis in Iraq.", 
        "reply": " YES! It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "672198221_7940039322001", 
        "time": "2009-05-23 03:30:00", 
        "title": "Life in prison for Steven Green.", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by iamgonzo: quote: Originally posted by Irwin_R_Schyster: Crap happens...war dehumanizes everyone, and it impacted this guy hard. What he did was horrible, but crap happens... Rape and murder is \"crap happens\"? An accidental shooting of a civilian or an ally could be chalked up to \"it happens in war\", but premeditated rape and murder, get real. I agree, but..... There is a well known and recognised legal doctrine called \"Mitigating factors.\" I believe that they came into play. Not for me to second guess the Jury. Dave Yes, mitigating factors often exist. But not always. Had he raped the girl and left it at that, I'd hear mitigation. But, instead: He raped a 14-year old girl. Then he killed her. Then he tried to cover it up by burning her body. Then he went even further and killed her ENTIRE FAMILY. Mom, dad, and little sister. Dead. Killed in cold blood so that they couldn't tell on him. He went back to his unit and soldiered on. When confronted, he denied EVERYTHING. There's no mitigating factors in that. At all. Period. It was rape, murder (times 4), obstruction of justice and just evil. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090523, 
        "postID": 36, 
        "quote": "Originally posted by Grachus: quote: Originally posted by iamgonzo: quote: Originally posted by Irwin_R_Schyster: Crap happens...war dehumanizes everyone, and it impacted this guy hard. What he did was horrible, but crap happens... Rape and murder is \"crap happens\"? An accidental shooting of a civilian or an ally could be chalked up to \"it happens in war\", but premeditated rape and murder, get real. I agree, but..... There is a well known and recognised legal doctrine called \"Mitigating factors.\" I believe that they came into play. Not for me to second guess the Jury. Dave", 
        "reply": " Yes, mitigating factors often exist. But not always. Had he raped the girl and left it at that, I'd hear mitigation. But, instead: He raped a 14-year old girl. Then he killed her. Then he tried to cover it up by burning her body. Then he went even further and killed her ENTIRE FAMILY. Mom, dad, and little sister. Dead. Killed in cold blood so that they couldn't tell on him. He went back to his unit and soldiered on. When confronted, he denied EVERYTHING. There's no mitigating factors in that. At all. Period. It was rape, murder (times 4), obstruction of justice and just evil. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "672198221_7940039322001", 
        "time": "2009-05-23 03:46:00", 
        "title": "Life in prison for Steven Green.", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "Iamgonzo said it right - he should have had a jury of his PEERS judge him; rather, instruct the judge on what they recommend (juries do not convict people). We're out there in these places HONORABLY, and some criminal in a uniform is tainting our name. Had he been tried FAIRLY, his sentence would have likely been death. \"Fairly\" doesn't mean just making certain he doesn't face a guilty-before-proven-innocent panel. It also means that he should be judged by a group who are similar to him. Too many people forget that little fact. What would have been true \"fairness\" is for the military to have rendered his verdict AND sentenced him. 12 civilians in KY know nothing about war, the military, or what transpired. But his command structure does and did. Military knows military. This life in prison stinks to high heaven. Let's look at some facts. It costs... $70k a year to put a man away for life when one accounts for all the associated costs? He'll live... what? Another 50-ish years? A .45 round costs 32 cents. Why are OUR tax dollars being abused to put this man -- I use that term ONLY in its most generic sense -- away for life when 32 cents will accomplish the same thing? Why not take all that saved money and better fund the military needs for mental health care so that incidents like this are cut off before they even happen? This moral superiority of professed narcissism that is life in prison instead of instant death is nonsensical, wasteful, and costly. Guess what? You're still killing him! You're just prolonging his own suffering and agony, as well as burdening taxpayers. You lock a man in a cage like an animal and he'll become... an animal. He's just as dead. Now he's just dying for your sick sense of retribution. That ain't justice. That's just twisted and perverted. A sentence of more than 20 years should be a bullet to the brain pan. Period. And before you scoffers lay into me about DNA and the few true innocents that have been falsely imprisoned - don't. Do you have any clue at all what it is like to be jailed for a crime you never committed? Well, I do. I'd prefer death. And so would you if they were going to lock you, an innocent, up for 20+ years. Just get it over, don't make me suffer for something I owe no penance to, and let me go meet my maker. 20-year sentence = instant and public execution. Stop locking up people for simple possession crimes. Stop making stupid laws that MAKE otherwise innocent people criminals. Get the church out of the justice system. We'd pay off our deficit in 2 years. Victims would have justice, and swiftly. Innocents wouldn't suffer false incarceration. Would-be criminals would think twice if they saw just ONE public shooting. Gang violence in jails would drop dramatically. America is thinking with her heart and not with her head. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090523, 
        "postID": 37, 
        "quote": "", 
        "reply": "Iamgonzo said it right - he should have had a jury of his PEERS judge him; rather, instruct the judge on what they recommend (juries do not convict people). We're out there in these places HONORABLY, and some criminal in a uniform is tainting our name. Had he been tried FAIRLY, his sentence would have likely been death. \"Fairly\" doesn't mean just making certain he doesn't face a guilty-before-proven-innocent panel. It also means that he should be judged by a group who are similar to him. Too many people forget that little fact. What would have been true \"fairness\" is for the military to have rendered his verdict AND sentenced him. 12 civilians in KY know nothing about war, the military, or what transpired. But his command structure does and did. Military knows military. This life in prison stinks to high heaven. Let's look at some facts. It costs... $70k a year to put a man away for life when one accounts for all the associated costs? He'll live... what? Another 50-ish years? A .45 round costs 32 cents. Why are OUR tax dollars being abused to put this man -- I use that term ONLY in its most generic sense -- away for life when 32 cents will accomplish the same thing? Why not take all that saved money and better fund the military needs for mental health care so that incidents like this are cut off before they even happen? This moral superiority of professed narcissism that is life in prison instead of instant death is nonsensical, wasteful, and costly. Guess what? You're still killing him! You're just prolonging his own suffering and agony, as well as burdening taxpayers. You lock a man in a cage like an animal and he'll become... an animal. He's just as dead. Now he's just dying for your sick sense of retribution. That ain't justice. That's just twisted and perverted. A sentence of more than 20 years should be a bullet to the brain pan. Period. And before you scoffers lay into me about DNA and the few true innocents that have been falsely imprisoned - don't. Do you have any clue at all what it is like to be jailed for a crime you never committed? Well, I do. I'd prefer death. And so would you if they were going to lock you, an innocent, up for 20+ years. Just get it over, don't make me suffer for something I owe no penance to, and let me go meet my maker. 20-year sentence = instant and public execution. Stop locking up people for simple possession crimes. Stop making stupid laws that MAKE otherwise innocent people criminals. Get the church out of the justice system. We'd pay off our deficit in 2 years. Victims would have justice, and swiftly. Innocents wouldn't suffer false incarceration. Would-be criminals would think twice if they saw just ONE public shooting. Gang violence in jails would drop dramatically. America is thinking with her heart and not with her head. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "672198221_7940039322001", 
        "time": "2009-05-23 04:07:00", 
        "title": "Life in prison for Steven Green.", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Originally posted by FollowMeInfantry: Yes, mitigating factors often exist. But not always. Had he raped the girl and left it at that, I'd hear mitigation. But, instead: He raped a 14-year old girl. Then he killed her. Then he tried to cover it up by burning her body. Then he went even further and killed her ENTIRE FAMILY. Mom, dad, and little sister. Dead. Killed in cold blood so that they couldn't tell on him. He went back to his unit and soldiered on. When confronted, he denied EVERYTHING. There's no mitigating factors in that. At all. Period. It was rape, murder (times 4), obstruction of justice and just evil. I make no claims to more knowledge than anyone else about this case. And as a civilian, I have defacto LESS knowledge about this case. Here are excerpts from two different stories on this incident. quote: In his defense, Wendelsdorf mentioned the testimony of psychiatric nurse practitioner Lt. Col. Karen Marrs. She interviewed Green in Iraq and said he exhibited characteristics that put him at risk for killing himself or others. Green was not pulled from combat but instead was given sleeping pills and returned to his checkpoint. Defense lawyers said the army knew Green was suffering psychologically and chose to ignore it rather than give him the mental health care he needed. *************** The prosecution claimed that Green committed a heinous, cold-blooded, premeditated crime and that the stresses of war -- including the deaths of many of his fellow soldiers -- were irrelevant. But the defense contended that the Army made the crimes more likely to happen by failing to evacuate Green after he was diagnosed with homicidal thoughts toward all Iraqis -- and by failing to provide adequate leadership for his platoon, which suffered the most casualties in the war. So apparently the Army KNEW that this guy was a loose canon waiting to explode. Are these not mitigating factors? Dave", 
        "intTime": 20090523, 
        "postID": 38, 
        "quote": "Originally posted by FollowMeInfantry: Yes, mitigating factors often exist. But not always. Had he raped the girl and left it at that, I'd hear mitigation. But, instead: He raped a 14-year old girl. Then he killed her. Then he tried to cover it up by burning her body. Then he went even further and killed her ENTIRE FAMILY. Mom, dad, and little sister. Dead. Killed in cold blood so that they couldn't tell on him. He went back to his unit and soldiered on. When confronted, he denied EVERYTHING. There's no mitigating factors in that. At all. Period. It was rape, murder (times 4), obstruction of justice and just evil.", 
        "reply": " I make no claims to more knowledge than anyone else about this case. And as a civilian, I have defacto LESS knowledge about this case. Here are excerpts from two different stories on this incident. quote: In his defense, Wendelsdorf mentioned the testimony of psychiatric nurse practitioner Lt. Col. Karen Marrs. She interviewed Green in Iraq and said he exhibited characteristics that put him at risk for killing himself or others. Green was not pulled from combat but instead was given sleeping pills and returned to his checkpoint. Defense lawyers said the army knew Green was suffering psychologically and chose to ignore it rather than give him the mental health care he needed. *************** The prosecution claimed that Green committed a heinous, cold-blooded, premeditated crime and that the stresses of war -- including the deaths of many of his fellow soldiers -- were irrelevant. But the defense contended that the Army made the crimes more likely to happen by failing to evacuate Green after he was diagnosed with homicidal thoughts toward all Iraqis -- and by failing to provide adequate leadership for his platoon, which suffered the most casualties in the war. So apparently the Army KNEW that this guy was a loose canon waiting to explode. Are these not mitigating factors? Dave", 
        "threadID": "672198221_7940039322001", 
        "time": "2009-05-23 08:58:00", 
        "title": "Life in prison for Steven Green.", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: <huge snip> So apparently the Army KNEW that this guy was a loose canon waiting to explode. Are these not mitigating factors? Dave C'mon, Dave, let's drop the political crap for a minute and focus on reality. He had friends die. Me too. Probably you too. I sit here today stressed over the death of a VERY good friend killed in Iraq [sometime in the past they're not telling us] that I heard about last week. His wife is suicidal. God only knows what his kids and parents are going through. He didn't rape, kill and burn a TEENAGER for Christ sake! And neither of us killed 3 other people, including another teenager to cover up our crime (had we committed one). Regardless, you're arguing against your own case. If he's that damn dirtbag nutty, then killing him is STILL appropriate. Why are you defending spending MY money to keep some lunatic locked in a 5 by 9 cell for 60 years? Put that poor kid out of his misery and our misery. Now, if you decide to debate the FACTS of life in prison versus capital punishment, I am gladly your huckleberry. But until then, NOTHING excuses what this boy did, mitigating or otherwise. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090523, 
        "postID": 39, 
        "quote": "Originally posted by Grachus: <huge snip> So apparently the Army KNEW that this guy was a loose canon waiting to explode. Are these not mitigating factors? Dave", 
        "reply": " C'mon, Dave, let's drop the political crap for a minute and focus on reality. He had friends die. Me too. Probably you too. I sit here today stressed over the death of a VERY good friend killed in Iraq [sometime in the past they're not telling us] that I heard about last week. His wife is suicidal. God only knows what his kids and parents are going through. He didn't rape, kill and burn a TEENAGER for Christ sake! And neither of us killed 3 other people, including another teenager to cover up our crime (had we committed one). Regardless, you're arguing against your own case. If he's that damn dirtbag nutty, then killing him is STILL appropriate. Why are you defending spending MY money to keep some lunatic locked in a 5 by 9 cell for 60 years? Put that poor kid out of his misery and our misery. Now, if you decide to debate the FACTS of life in prison versus capital punishment, I am gladly your huckleberry. But until then, NOTHING excuses what this boy did, mitigating or otherwise. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "672198221_7940039322001", 
        "time": "2009-05-23 09:29:00", 
        "title": "Life in prison for Steven Green.", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Originally posted by FollowMeInfantry: quote: Originally posted by Grachus: <huge snip> So apparently the Army KNEW that this guy was a loose canon waiting to explode. Are these not mitigating factors? Dave C'mon, Dave, let's drop the political crap for a minute and focus on reality. He had friends die. Me too. Probably you too. I sit here today stressed over the death of a VERY good friend killed in Iraq [sometime in the past they're not telling us] that I heard about last week. His wife is suicidal. God only knows what his kids and parents are going through. He didn't rape, kill and burn a TEENAGER for Christ sake! And neither of us killed 3 other people, including another teenager to cover up our crime (had we committed one). Regardless, you're arguing against your own case. If he's that damn dirtbag nutty, then killing him is STILL appropriate. Why are you defending spending MY money to keep some lunatic locked in a 5 by 9 cell for 60 years? Put that poor kid out of his misery and our misery. Now, if you decide to debate the FACTS of life in prison versus capital punishment, I am gladly your huckleberry. But until then, NOTHING excuses what this boy did, mitigating or otherwise. Mitigating factors is NOT an excuse for a crime. You don't go into Court and plead, \"Mitigating Factors.\" You don't use mitigating factors as your defense. They excuse nothing - They are an explanation, as to \"why\" a crime took place. They come into play AFTER a verdict. The man who just shot five of his comrades may wind up being tried for these killings. Maybe not, maybe the prosecution will agree that he was insane. I make no predictions. But that guy was thought abnormal enough to be sent to a facility where he could be treated. THIS guy was given some pills and put back on the job. Did I sit in the jury room and hear ALL the evidence? Have I lived through combat? While I can be an arrogant person, I am not being so in this case. I believe ONLY that I shouldn't second guess the Jury, who no doubt was just as troubled as I am. Nor am I making this incident \"political.\" I'm giving my opinion. Dave", 
        "intTime": 20090523, 
        "postID": 40, 
        "quote": "Originally posted by FollowMeInfantry: quote: Originally posted by Grachus: <huge snip> So apparently the Army KNEW that this guy was a loose canon waiting to explode. Are these not mitigating factors? Dave C'mon, Dave, let's drop the political crap for a minute and focus on reality. He had friends die. Me too. Probably you too. I sit here today stressed over the death of a VERY good friend killed in Iraq [sometime in the past they're not telling us] that I heard about last week. His wife is suicidal. God only knows what his kids and parents are going through. He didn't rape, kill and burn a TEENAGER for Christ sake! And neither of us killed 3 other people, including another teenager to cover up our crime (had we committed one). Regardless, you're arguing against your own case. If he's that damn dirtbag nutty, then killing him is STILL appropriate. Why are you defending spending MY money to keep some lunatic locked in a 5 by 9 cell for 60 years? Put that poor kid out of his misery and our misery. Now, if you decide to debate the FACTS of life in prison versus capital punishment, I am gladly your huckleberry. But until then, NOTHING excuses what this boy did, mitigating or otherwise.", 
        "reply": " Mitigating factors is NOT an excuse for a crime. You don't go into Court and plead, \"Mitigating Factors.\" You don't use mitigating factors as your defense. They excuse nothing - They are an explanation, as to \"why\" a crime took place. They come into play AFTER a verdict. The man who just shot five of his comrades may wind up being tried for these killings. Maybe not, maybe the prosecution will agree that he was insane. I make no predictions. But that guy was thought abnormal enough to be sent to a facility where he could be treated. THIS guy was given some pills and put back on the job. Did I sit in the jury room and hear ALL the evidence? Have I lived through combat? While I can be an arrogant person, I am not being so in this case. I believe ONLY that I shouldn't second guess the Jury, who no doubt was just as troubled as I am. Nor am I making this incident \"political.\" I'm giving my opinion. Dave", 
        "threadID": "672198221_7940039322001", 
        "time": "2009-05-23 09:40:00", 
        "title": "Life in prison for Steven Green.", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Jurors on Thursday told a judge they could not reach a decision on whether a former U.S. soldier should be sentenced to death for war crimes -- including rape and murder -- he committed in Iraq. The lack of a unanimous decision means Steven Green will be sentenced to life in prison without parole, according to instructions given to jurors as they began deliberations on the sentence Wednesday. Green was convicted earlier this month of murder, rape, conspiracy and obstruction of justice in connection with a 2006 incident near Yusufiya, about 20 miles south of Baghdad. Jurors decided he was guilty of raping a 14-year-old girl, then killing her and setting her body on fire to destroy evidence. He was also convicted of killing the girl's parents and 6-year-old sister. As jurors reported their inability to reach a decision, Green appeared to issue a sigh of relief and a small smile crossed his face. A member of his defense team, a paralegal, burst into sobs. When I first heard the sentence on the radio they said he could have been sentence to death. I thought \"You mispronounced that, it's not pronounced could, it's pronounced should.\" cnn.com/2009/CRIME/05/21/kentucky.soldier.iraq.murder/index.html This message has been edited. Last edited by: iamgonzo, Fri 22 May 2009 05:24 AM", 
        "intTime": 20090521, 
        "postID": 41, 
        "quote": "Jurors on Thursday told a judge they could not reach a decision on whether a former U.S. soldier should be sentenced to death for war crimes -- including rape and murder -- he committed in Iraq. The lack of a unanimous decision means Steven Green will be sentenced to life in prison without parole, according to instructions given to jurors as they began deliberations on the sentence Wednesday. Green was convicted earlier this month of murder, rape, conspiracy and obstruction of justice in connection with a 2006 incident near Yusufiya, about 20 miles south of Baghdad. Jurors decided he was guilty of raping a 14-year-old girl, then killing her and setting her body on fire to destroy evidence. He was also convicted of killing the girl's parents and 6-year-old sister. As jurors reported their inability to reach a decision, Green appeared to issue a sigh of relief and a small smile crossed his face. A member of his defense team, a paralegal, burst into sobs.", 
        "reply": " When I first heard the sentence on the radio they said he could have been sentence to death. I thought \"You mispronounced that, it's not pronounced could, it's pronounced should.\" cnn.com/2009/CRIME/05/21/kentucky.soldier.iraq.murder/index.html This message has been edited. Last edited by: iamgonzo, Fri 22 May 2009 05:24 AM", 
        "threadID": "672198221_7940039322001", 
        "time": "2009-05-21 21:08:00", 
        "title": "Life in prison for Steven Green.", 
        "userID": "iamgonzo"
    }, 
    {
        "content": "Bad Decision. This was Premeditated Murder and Rape of a Child & her family. Piece of Filth should be hanged right in the center of the Village the crime happened in.", 
        "intTime": 20090521, 
        "postID": 42, 
        "quote": "", 
        "reply": "Bad Decision. This was Premeditated Murder and Rape of a Child & her family. Piece of Filth should be hanged right in the center of the Village the crime happened in.", 
        "threadID": "672198221_7940039322001", 
        "time": "2009-05-21 21:42:00", 
        "title": "Life in prison for Steven Green.", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "quote: Originally posted by LineDoggie: Bad Decision. This was Premeditated Murder and Rape of a Child & her family. Piece of Filth should be hanged right in the center of the Village the crime happened in. naw that bring more Anti American from there. let him die a slow painful death at stake.", 
        "intTime": 20090522, 
        "postID": 43, 
        "quote": "Originally posted by LineDoggie: Bad Decision. This was Premeditated Murder and Rape of a Child & her family. Piece of Filth should be hanged right in the center of the Village the crime happened in.", 
        "reply": " naw that bring more Anti American from there. let him die a slow painful death at stake.", 
        "threadID": "672198221_7940039322001", 
        "time": "2009-05-22 00:41:00", 
        "title": "Life in prison for Steven Green.", 
        "userID": "world_king377"
    }, 
    {
        "content": "quote: Originally posted by LineDoggie: Bad Decision. This was Premeditated Murder and Rape of a Child & her family. Piece of Filth should be hanged right in the center of the Village the crime happened in. No kidding. This is the worst of worst crimes. I don't care if you saw the inside of your buddy's guts and then had to eat them. There is no event so traumatic that I'd repeatedly rape a 14 year old girl and then slaughter her whole family and then try to cover it up. That guy is a psycho and slimeball. Hope he gets raped repeatedly himself.", 
        "intTime": 20090522, 
        "postID": 44, 
        "quote": "Originally posted by LineDoggie: Bad Decision. This was Premeditated Murder and Rape of a Child & her family. Piece of Filth should be hanged right in the center of the Village the crime happened in.", 
        "reply": " No kidding. This is the worst of worst crimes. I don't care if you saw the inside of your buddy's guts and then had to eat them. There is no event so traumatic that I'd repeatedly rape a 14 year old girl and then slaughter her whole family and then try to cover it up. That guy is a psycho and slimeball. Hope he gets raped repeatedly himself.", 
        "threadID": "672198221_7940039322001", 
        "time": "2009-05-22 06:29:00", 
        "title": "Life in prison for Steven Green.", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "As someone who is Pro-Life, I cannot support his execution - so I feel that the life sentence is appropriate. Of course, an even more appropriate sentence would be for him to serve that life sentence in an Iraqi prison, rather than an American prison...", 
        "intTime": 20090522, 
        "postID": 45, 
        "quote": "", 
        "reply": "As someone who is Pro-Life, I cannot support his execution - so I feel that the life sentence is appropriate. Of course, an even more appropriate sentence would be for him to serve that life sentence in an Iraqi prison, rather than an American prison...", 
        "threadID": "672198221_7940039322001", 
        "time": "2009-05-22 06:33:00", 
        "title": "Life in prison for Steven Green.", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "He should have been tried in Iraq, by Iraqis. Maybe, someday, he will. His buddies, too. This message has been edited. Last edited by: AliBubba, Sat 23 May 2009 02:42 AM", 
        "intTime": 20090522, 
        "postID": 46, 
        "quote": "", 
        "reply": "He should have been tried in Iraq, by Iraqis. Maybe, someday, he will. His buddies, too. This message has been edited. Last edited by: AliBubba, Sat 23 May 2009 02:42 AM", 
        "threadID": "672198221_7940039322001", 
        "time": "2009-05-22 09:00:00", 
        "title": "Life in prison for Steven Green.", 
        "userID": "AliBubba"
    }, 
    {
        "content": "This is a country of laws. The jury system may not always work to the public's satisfaction and the jury may not always be right in its verdict (or lack thereof) but it is the best system yet devised. The jury heard the facts, both condemning and mitigating, while we did not. Whether we like the jury's decision or not, the jury's decision is an informed one while ours is not. Accept it!", 
        "intTime": 20090522, 
        "postID": 47, 
        "quote": "", 
        "reply": "This is a country of laws. The jury system may not always work to the public's satisfaction and the jury may not always be right in its verdict (or lack thereof) but it is the best system yet devised. The jury heard the facts, both condemning and mitigating, while we did not. Whether we like the jury's decision or not, the jury's decision is an informed one while ours is not. Accept it!", 
        "threadID": "672198221_7940039322001", 
        "time": "2009-05-22 13:30:00", 
        "title": "Life in prison for Steven Green.", 
        "userID": "fnewt"
    }, 
    {
        "content": "I don't understand our justice system most of the time. Back in 95 my Son was shot by a sniper while in PT formation with the 82nd Abn. Div. at Fort Bragg. The sniper, a Sgt. in the Army also killed my Son's commanding officer. The loser got life in prison. This guy kills people and then rapes children and he gets life also. Do we or don't we believe in the death penalty anymore?", 
        "intTime": 20090522, 
        "postID": 48, 
        "quote": "", 
        "reply": "I don't understand our justice system most of the time. Back in 95 my Son was shot by a sniper while in PT formation with the 82nd Abn. Div. at Fort Bragg. The sniper, a Sgt. in the Army also killed my Son's commanding officer. The loser got life in prison. This guy kills people and then rapes children and he gets life also. Do we or don't we believe in the death penalty anymore?", 
        "threadID": "672198221_7940039322001", 
        "time": "2009-05-22 16:25:00", 
        "title": "Life in prison for Steven Green.", 
        "userID": "Duster6"
    }, 
    {
        "content": "Crap happens...war dehumanizes everyone, and it impacted this guy hard. What he did was horrible, but crap happens...", 
        "intTime": 20090522, 
        "postID": 49, 
        "quote": "", 
        "reply": "Crap happens...war dehumanizes everyone, and it impacted this guy hard. What he did was horrible, but crap happens...", 
        "threadID": "672198221_7940039322001", 
        "time": "2009-05-22 16:33:00", 
        "title": "Life in prison for Steven Green.", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by fnewt: This is a country of laws. The jury system may not always work to the public's satisfaction and the jury may not always be right in its verdict (or lack thereof) but it is the best system yet devised. The jury heard the facts, both condemning and mitigating, while we did not. Whether we like the jury's decision or not, the jury's decision is an informed one while ours is not. Accept it! The jury should have either been military, since the crime was committed while wearing the uniform and stationed overseas, or a jury of Iraqis in Iraq.", 
        "intTime": 20090522, 
        "postID": 50, 
        "quote": "Originally posted by fnewt: This is a country of laws. The jury system may not always work to the public's satisfaction and the jury may not always be right in its verdict (or lack thereof) but it is the best system yet devised. The jury heard the facts, both condemning and mitigating, while we did not. Whether we like the jury's decision or not, the jury's decision is an informed one while ours is not. Accept it!", 
        "reply": " The jury should have either been military, since the crime was committed while wearing the uniform and stationed overseas, or a jury of Iraqis in Iraq.", 
        "threadID": "672198221_7940039322001", 
        "time": "2009-05-22 17:34:00", 
        "title": "Life in prison for Steven Green.", 
        "userID": "iamgonzo"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: Crap happens...war dehumanizes everyone, and it impacted this guy hard. What he did was horrible, but crap happens... Rape and murder is \"crap happens\"? An accidental shooting of a civilian or an ally could be chalked up to \"it happens in war\", but premeditated rape and murder, get real.", 
        "intTime": 20090522, 
        "postID": 51, 
        "quote": "Originally posted by Irwin_R_Schyster: Crap happens...war dehumanizes everyone, and it impacted this guy hard. What he did was horrible, but crap happens...", 
        "reply": " Rape and murder is \"crap happens\"? An accidental shooting of a civilian or an ally could be chalked up to \"it happens in war\", but premeditated rape and murder, get real.", 
        "threadID": "672198221_7940039322001", 
        "time": "2009-05-22 17:36:00", 
        "title": "Life in prison for Steven Green.", 
        "userID": "iamgonzo"
    }, 
    {
        "content": "quote: Originally posted by iamgonzo: quote: Originally posted by Irwin_R_Schyster: Crap happens...war dehumanizes everyone, and it impacted this guy hard. What he did was horrible, but crap happens... Rape and murder is \"crap happens\"? An accidental shooting of a civilian or an ally could be chalked up to \"it happens in war\", but premeditated rape and murder, get real. I agree, but..... There is a well known and recognised legal doctrine called \"Mitigating factors.\" I believe that they came into play. Not for me to second guess the Jury. Dave", 
        "intTime": 20090522, 
        "postID": 52, 
        "quote": "Originally posted by iamgonzo: quote: Originally posted by Irwin_R_Schyster: Crap happens...war dehumanizes everyone, and it impacted this guy hard. What he did was horrible, but crap happens... Rape and murder is \"crap happens\"? An accidental shooting of a civilian or an ally could be chalked up to \"it happens in war\", but premeditated rape and murder, get real.", 
        "reply": " I agree, but..... There is a well known and recognised legal doctrine called \"Mitigating factors.\" I believe that they came into play. Not for me to second guess the Jury. Dave", 
        "threadID": "672198221_7940039322001", 
        "time": "2009-05-22 17:41:00", 
        "title": "Life in prison for Steven Green.", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by iamgonzo: quote: Originally posted by Irwin_R_Schyster: Crap happens...war dehumanizes everyone, and it impacted this guy hard. What he did was horrible, but crap happens... Rape and murder is \"crap happens\"? An accidental shooting of a civilian or an ally could be chalked up to \"it happens in war\", but premeditated rape and murder, get real. I agree, but..... There is a well known and recognised legal doctrine called \"Mitigating factors.\" I believe that they came into play. Not for me to second guess the Jury. Dave Yes, there can be mitigating factors, which is why we are to be tried by a jury of our peers. A bunch of civilians in Kentucky is not a jury of peers for events that happened in a combat zone.", 
        "intTime": 20090522, 
        "postID": 53, 
        "quote": "Originally posted by Grachus: quote: Originally posted by iamgonzo: quote: Originally posted by Irwin_R_Schyster: Crap happens...war dehumanizes everyone, and it impacted this guy hard. What he did was horrible, but crap happens... Rape and murder is \"crap happens\"? An accidental shooting of a civilian or an ally could be chalked up to \"it happens in war\", but premeditated rape and murder, get real. I agree, but..... There is a well known and recognised legal doctrine called \"Mitigating factors.\" I believe that they came into play. Not for me to second guess the Jury. Dave", 
        "reply": " Yes, there can be mitigating factors, which is why we are to be tried by a jury of our peers. A bunch of civilians in Kentucky is not a jury of peers for events that happened in a combat zone.", 
        "threadID": "672198221_7940039322001", 
        "time": "2009-05-22 19:10:00", 
        "title": "Life in prison for Steven Green.", 
        "userID": "iamgonzo"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: Crap happens...war dehumanizes everyone, and it impacted this guy hard. What he did was horrible, but crap happens... If that's the case, then any civilized nation should go to 'war' only at an extremity and shouldn't be 'preparing' for it. 'Military' training and discipline should be designed to mitigate againste such 'crap', the military knowing best how war can dehumanize everybody. 'Crap happens' naturally, but this 'crap' is prepared and perpetrated purely by people and, hence, should be avoidable, or severely punished by military law.", 
        "intTime": 20090523, 
        "postID": 54, 
        "quote": "Originally posted by Irwin_R_Schyster: Crap happens...war dehumanizes everyone, and it impacted this guy hard. What he did was horrible, but crap happens...", 
        "reply": " If that's the case, then any civilized nation should go to 'war' only at an extremity and shouldn't be 'preparing' for it. 'Military' training and discipline should be designed to mitigate againste such 'crap', the military knowing best how war can dehumanize everybody. 'Crap happens' naturally, but this 'crap' is prepared and perpetrated purely by people and, hence, should be avoidable, or severely punished by military law.", 
        "threadID": "672198221_7940039322001", 
        "time": "2009-05-23 02:49:00", 
        "title": "Life in prison for Steven Green.", 
        "userID": "AliBubba"
    }, 
    {
        "content": "quote: Originally posted by iamgonzo: quote: Originally posted by fnewt: This is a country of laws. The jury system may not always work to the public's satisfaction and the jury may not always be right in its verdict (or lack thereof) but it is the best system yet devised. The jury heard the facts, both condemning and mitigating, while we did not. Whether we like the jury's decision or not, the jury's decision is an informed one while ours is not. Accept it! The jury should have either been military, since the crime was committed while wearing the uniform and stationed overseas, or a jury of Iraqis in Iraq. YES! It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090523, 
        "postID": 55, 
        "quote": "Originally posted by iamgonzo: quote: Originally posted by fnewt: This is a country of laws. The jury system may not always work to the public's satisfaction and the jury may not always be right in its verdict (or lack thereof) but it is the best system yet devised. The jury heard the facts, both condemning and mitigating, while we did not. Whether we like the jury's decision or not, the jury's decision is an informed one while ours is not. Accept it! The jury should have either been military, since the crime was committed while wearing the uniform and stationed overseas, or a jury of Iraqis in Iraq.", 
        "reply": " YES! It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "672198221_7940039322001", 
        "time": "2009-05-23 03:30:00", 
        "title": "Life in prison for Steven Green.", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by iamgonzo: quote: Originally posted by Irwin_R_Schyster: Crap happens...war dehumanizes everyone, and it impacted this guy hard. What he did was horrible, but crap happens... Rape and murder is \"crap happens\"? An accidental shooting of a civilian or an ally could be chalked up to \"it happens in war\", but premeditated rape and murder, get real. I agree, but..... There is a well known and recognised legal doctrine called \"Mitigating factors.\" I believe that they came into play. Not for me to second guess the Jury. Dave Yes, mitigating factors often exist. But not always. Had he raped the girl and left it at that, I'd hear mitigation. But, instead: He raped a 14-year old girl. Then he killed her. Then he tried to cover it up by burning her body. Then he went even further and killed her ENTIRE FAMILY. Mom, dad, and little sister. Dead. Killed in cold blood so that they couldn't tell on him. He went back to his unit and soldiered on. When confronted, he denied EVERYTHING. There's no mitigating factors in that. At all. Period. It was rape, murder (times 4), obstruction of justice and just evil. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090523, 
        "postID": 56, 
        "quote": "Originally posted by Grachus: quote: Originally posted by iamgonzo: quote: Originally posted by Irwin_R_Schyster: Crap happens...war dehumanizes everyone, and it impacted this guy hard. What he did was horrible, but crap happens... Rape and murder is \"crap happens\"? An accidental shooting of a civilian or an ally could be chalked up to \"it happens in war\", but premeditated rape and murder, get real. I agree, but..... There is a well known and recognised legal doctrine called \"Mitigating factors.\" I believe that they came into play. Not for me to second guess the Jury. Dave", 
        "reply": " Yes, mitigating factors often exist. But not always. Had he raped the girl and left it at that, I'd hear mitigation. But, instead: He raped a 14-year old girl. Then he killed her. Then he tried to cover it up by burning her body. Then he went even further and killed her ENTIRE FAMILY. Mom, dad, and little sister. Dead. Killed in cold blood so that they couldn't tell on him. He went back to his unit and soldiered on. When confronted, he denied EVERYTHING. There's no mitigating factors in that. At all. Period. It was rape, murder (times 4), obstruction of justice and just evil. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "672198221_7940039322001", 
        "time": "2009-05-23 03:46:00", 
        "title": "Life in prison for Steven Green.", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "Iamgonzo said it right - he should have had a jury of his PEERS judge him; rather, instruct the judge on what they recommend (juries do not convict people). We're out there in these places HONORABLY, and some criminal in a uniform is tainting our name. Had he been tried FAIRLY, his sentence would have likely been death. \"Fairly\" doesn't mean just making certain he doesn't face a guilty-before-proven-innocent panel. It also means that he should be judged by a group who are similar to him. Too many people forget that little fact. What would have been true \"fairness\" is for the military to have rendered his verdict AND sentenced him. 12 civilians in KY know nothing about war, the military, or what transpired. But his command structure does and did. Military knows military. This life in prison stinks to high heaven. Let's look at some facts. It costs... $70k a year to put a man away for life when one accounts for all the associated costs? He'll live... what? Another 50-ish years? A .45 round costs 32 cents. Why are OUR tax dollars being abused to put this man -- I use that term ONLY in its most generic sense -- away for life when 32 cents will accomplish the same thing? Why not take all that saved money and better fund the military needs for mental health care so that incidents like this are cut off before they even happen? This moral superiority of professed narcissism that is life in prison instead of instant death is nonsensical, wasteful, and costly. Guess what? You're still killing him! You're just prolonging his own suffering and agony, as well as burdening taxpayers. You lock a man in a cage like an animal and he'll become... an animal. He's just as dead. Now he's just dying for your sick sense of retribution. That ain't justice. That's just twisted and perverted. A sentence of more than 20 years should be a bullet to the brain pan. Period. And before you scoffers lay into me about DNA and the few true innocents that have been falsely imprisoned - don't. Do you have any clue at all what it is like to be jailed for a crime you never committed? Well, I do. I'd prefer death. And so would you if they were going to lock you, an innocent, up for 20+ years. Just get it over, don't make me suffer for something I owe no penance to, and let me go meet my maker. 20-year sentence = instant and public execution. Stop locking up people for simple possession crimes. Stop making stupid laws that MAKE otherwise innocent people criminals. Get the church out of the justice system. We'd pay off our deficit in 2 years. Victims would have justice, and swiftly. Innocents wouldn't suffer false incarceration. Would-be criminals would think twice if they saw just ONE public shooting. Gang violence in jails would drop dramatically. America is thinking with her heart and not with her head. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090523, 
        "postID": 57, 
        "quote": "", 
        "reply": "Iamgonzo said it right - he should have had a jury of his PEERS judge him; rather, instruct the judge on what they recommend (juries do not convict people). We're out there in these places HONORABLY, and some criminal in a uniform is tainting our name. Had he been tried FAIRLY, his sentence would have likely been death. \"Fairly\" doesn't mean just making certain he doesn't face a guilty-before-proven-innocent panel. It also means that he should be judged by a group who are similar to him. Too many people forget that little fact. What would have been true \"fairness\" is for the military to have rendered his verdict AND sentenced him. 12 civilians in KY know nothing about war, the military, or what transpired. But his command structure does and did. Military knows military. This life in prison stinks to high heaven. Let's look at some facts. It costs... $70k a year to put a man away for life when one accounts for all the associated costs? He'll live... what? Another 50-ish years? A .45 round costs 32 cents. Why are OUR tax dollars being abused to put this man -- I use that term ONLY in its most generic sense -- away for life when 32 cents will accomplish the same thing? Why not take all that saved money and better fund the military needs for mental health care so that incidents like this are cut off before they even happen? This moral superiority of professed narcissism that is life in prison instead of instant death is nonsensical, wasteful, and costly. Guess what? You're still killing him! You're just prolonging his own suffering and agony, as well as burdening taxpayers. You lock a man in a cage like an animal and he'll become... an animal. He's just as dead. Now he's just dying for your sick sense of retribution. That ain't justice. That's just twisted and perverted. A sentence of more than 20 years should be a bullet to the brain pan. Period. And before you scoffers lay into me about DNA and the few true innocents that have been falsely imprisoned - don't. Do you have any clue at all what it is like to be jailed for a crime you never committed? Well, I do. I'd prefer death. And so would you if they were going to lock you, an innocent, up for 20+ years. Just get it over, don't make me suffer for something I owe no penance to, and let me go meet my maker. 20-year sentence = instant and public execution. Stop locking up people for simple possession crimes. Stop making stupid laws that MAKE otherwise innocent people criminals. Get the church out of the justice system. We'd pay off our deficit in 2 years. Victims would have justice, and swiftly. Innocents wouldn't suffer false incarceration. Would-be criminals would think twice if they saw just ONE public shooting. Gang violence in jails would drop dramatically. America is thinking with her heart and not with her head. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "672198221_7940039322001", 
        "time": "2009-05-23 04:07:00", 
        "title": "Life in prison for Steven Green.", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Originally posted by FollowMeInfantry: Yes, mitigating factors often exist. But not always. Had he raped the girl and left it at that, I'd hear mitigation. But, instead: He raped a 14-year old girl. Then he killed her. Then he tried to cover it up by burning her body. Then he went even further and killed her ENTIRE FAMILY. Mom, dad, and little sister. Dead. Killed in cold blood so that they couldn't tell on him. He went back to his unit and soldiered on. When confronted, he denied EVERYTHING. There's no mitigating factors in that. At all. Period. It was rape, murder (times 4), obstruction of justice and just evil. I make no claims to more knowledge than anyone else about this case. And as a civilian, I have defacto LESS knowledge about this case. Here are excerpts from two different stories on this incident. quote: In his defense, Wendelsdorf mentioned the testimony of psychiatric nurse practitioner Lt. Col. Karen Marrs. She interviewed Green in Iraq and said he exhibited characteristics that put him at risk for killing himself or others. Green was not pulled from combat but instead was given sleeping pills and returned to his checkpoint. Defense lawyers said the army knew Green was suffering psychologically and chose to ignore it rather than give him the mental health care he needed. *************** The prosecution claimed that Green committed a heinous, cold-blooded, premeditated crime and that the stresses of war -- including the deaths of many of his fellow soldiers -- were irrelevant. But the defense contended that the Army made the crimes more likely to happen by failing to evacuate Green after he was diagnosed with homicidal thoughts toward all Iraqis -- and by failing to provide adequate leadership for his platoon, which suffered the most casualties in the war. So apparently the Army KNEW that this guy was a loose canon waiting to explode. Are these not mitigating factors? Dave", 
        "intTime": 20090523, 
        "postID": 58, 
        "quote": "Originally posted by FollowMeInfantry: Yes, mitigating factors often exist. But not always. Had he raped the girl and left it at that, I'd hear mitigation. But, instead: He raped a 14-year old girl. Then he killed her. Then he tried to cover it up by burning her body. Then he went even further and killed her ENTIRE FAMILY. Mom, dad, and little sister. Dead. Killed in cold blood so that they couldn't tell on him. He went back to his unit and soldiered on. When confronted, he denied EVERYTHING. There's no mitigating factors in that. At all. Period. It was rape, murder (times 4), obstruction of justice and just evil.", 
        "reply": " I make no claims to more knowledge than anyone else about this case. And as a civilian, I have defacto LESS knowledge about this case. Here are excerpts from two different stories on this incident. quote: In his defense, Wendelsdorf mentioned the testimony of psychiatric nurse practitioner Lt. Col. Karen Marrs. She interviewed Green in Iraq and said he exhibited characteristics that put him at risk for killing himself or others. Green was not pulled from combat but instead was given sleeping pills and returned to his checkpoint. Defense lawyers said the army knew Green was suffering psychologically and chose to ignore it rather than give him the mental health care he needed. *************** The prosecution claimed that Green committed a heinous, cold-blooded, premeditated crime and that the stresses of war -- including the deaths of many of his fellow soldiers -- were irrelevant. But the defense contended that the Army made the crimes more likely to happen by failing to evacuate Green after he was diagnosed with homicidal thoughts toward all Iraqis -- and by failing to provide adequate leadership for his platoon, which suffered the most casualties in the war. So apparently the Army KNEW that this guy was a loose canon waiting to explode. Are these not mitigating factors? Dave", 
        "threadID": "672198221_7940039322001", 
        "time": "2009-05-23 08:58:00", 
        "title": "Life in prison for Steven Green.", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: <huge snip> So apparently the Army KNEW that this guy was a loose canon waiting to explode. Are these not mitigating factors? Dave C'mon, Dave, let's drop the political crap for a minute and focus on reality. He had friends die. Me too. Probably you too. I sit here today stressed over the death of a VERY good friend killed in Iraq [sometime in the past they're not telling us] that I heard about last week. His wife is suicidal. God only knows what his kids and parents are going through. He didn't rape, kill and burn a TEENAGER for Christ sake! And neither of us killed 3 other people, including another teenager to cover up our crime (had we committed one). Regardless, you're arguing against your own case. If he's that damn dirtbag nutty, then killing him is STILL appropriate. Why are you defending spending MY money to keep some lunatic locked in a 5 by 9 cell for 60 years? Put that poor kid out of his misery and our misery. Now, if you decide to debate the FACTS of life in prison versus capital punishment, I am gladly your huckleberry. But until then, NOTHING excuses what this boy did, mitigating or otherwise. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090523, 
        "postID": 59, 
        "quote": "Originally posted by Grachus: <huge snip> So apparently the Army KNEW that this guy was a loose canon waiting to explode. Are these not mitigating factors? Dave", 
        "reply": " C'mon, Dave, let's drop the political crap for a minute and focus on reality. He had friends die. Me too. Probably you too. I sit here today stressed over the death of a VERY good friend killed in Iraq [sometime in the past they're not telling us] that I heard about last week. His wife is suicidal. God only knows what his kids and parents are going through. He didn't rape, kill and burn a TEENAGER for Christ sake! And neither of us killed 3 other people, including another teenager to cover up our crime (had we committed one). Regardless, you're arguing against your own case. If he's that damn dirtbag nutty, then killing him is STILL appropriate. Why are you defending spending MY money to keep some lunatic locked in a 5 by 9 cell for 60 years? Put that poor kid out of his misery and our misery. Now, if you decide to debate the FACTS of life in prison versus capital punishment, I am gladly your huckleberry. But until then, NOTHING excuses what this boy did, mitigating or otherwise. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "672198221_7940039322001", 
        "time": "2009-05-23 09:29:00", 
        "title": "Life in prison for Steven Green.", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Originally posted by FollowMeInfantry: quote: Originally posted by Grachus: <huge snip> So apparently the Army KNEW that this guy was a loose canon waiting to explode. Are these not mitigating factors? Dave C'mon, Dave, let's drop the political crap for a minute and focus on reality. He had friends die. Me too. Probably you too. I sit here today stressed over the death of a VERY good friend killed in Iraq [sometime in the past they're not telling us] that I heard about last week. His wife is suicidal. God only knows what his kids and parents are going through. He didn't rape, kill and burn a TEENAGER for Christ sake! And neither of us killed 3 other people, including another teenager to cover up our crime (had we committed one). Regardless, you're arguing against your own case. If he's that damn dirtbag nutty, then killing him is STILL appropriate. Why are you defending spending MY money to keep some lunatic locked in a 5 by 9 cell for 60 years? Put that poor kid out of his misery and our misery. Now, if you decide to debate the FACTS of life in prison versus capital punishment, I am gladly your huckleberry. But until then, NOTHING excuses what this boy did, mitigating or otherwise. Mitigating factors is NOT an excuse for a crime. You don't go into Court and plead, \"Mitigating Factors.\" You don't use mitigating factors as your defense. They excuse nothing - They are an explanation, as to \"why\" a crime took place. They come into play AFTER a verdict. The man who just shot five of his comrades may wind up being tried for these killings. Maybe not, maybe the prosecution will agree that he was insane. I make no predictions. But that guy was thought abnormal enough to be sent to a facility where he could be treated. THIS guy was given some pills and put back on the job. Did I sit in the jury room and hear ALL the evidence? Have I lived through combat? While I can be an arrogant person, I am not being so in this case. I believe ONLY that I shouldn't second guess the Jury, who no doubt was just as troubled as I am. Nor am I making this incident \"political.\" I'm giving my opinion. Dave", 
        "intTime": 20090523, 
        "postID": 60, 
        "quote": "Originally posted by FollowMeInfantry: quote: Originally posted by Grachus: <huge snip> So apparently the Army KNEW that this guy was a loose canon waiting to explode. Are these not mitigating factors? Dave C'mon, Dave, let's drop the political crap for a minute and focus on reality. He had friends die. Me too. Probably you too. I sit here today stressed over the death of a VERY good friend killed in Iraq [sometime in the past they're not telling us] that I heard about last week. His wife is suicidal. God only knows what his kids and parents are going through. He didn't rape, kill and burn a TEENAGER for Christ sake! And neither of us killed 3 other people, including another teenager to cover up our crime (had we committed one). Regardless, you're arguing against your own case. If he's that damn dirtbag nutty, then killing him is STILL appropriate. Why are you defending spending MY money to keep some lunatic locked in a 5 by 9 cell for 60 years? Put that poor kid out of his misery and our misery. Now, if you decide to debate the FACTS of life in prison versus capital punishment, I am gladly your huckleberry. But until then, NOTHING excuses what this boy did, mitigating or otherwise.", 
        "reply": " Mitigating factors is NOT an excuse for a crime. You don't go into Court and plead, \"Mitigating Factors.\" You don't use mitigating factors as your defense. They excuse nothing - They are an explanation, as to \"why\" a crime took place. They come into play AFTER a verdict. The man who just shot five of his comrades may wind up being tried for these killings. Maybe not, maybe the prosecution will agree that he was insane. I make no predictions. But that guy was thought abnormal enough to be sent to a facility where he could be treated. THIS guy was given some pills and put back on the job. Did I sit in the jury room and hear ALL the evidence? Have I lived through combat? While I can be an arrogant person, I am not being so in this case. I believe ONLY that I shouldn't second guess the Jury, who no doubt was just as troubled as I am. Nor am I making this incident \"political.\" I'm giving my opinion. Dave", 
        "threadID": "672198221_7940039322001", 
        "time": "2009-05-23 09:40:00", 
        "title": "Life in prison for Steven Green.", 
        "userID": "Grachus"
    }
]