[
    {
        "content": "Penn had made a hard decision: He was leaving House — a job he loved — to go to the White House as the new associate director of the Office of Public Liaison. It was, Penn told reporters during a phone conference Tuesday, a unique opportunity to engage in one of two lifelong passions. The first is acting; the second, public service. When Penn told his family and friends the news, some friends thought he was crazy to trade a successful actor's salary and fame for the tedium of government work. Penn has become a cult favorite for his role as half of a dope-smoking, hamburger-scarfing duo in the Harold and Kumar series and received critical acclaim in the lead role of Mira Nair's adaptation of Jhumpa Lahiri's bestseller The Namesake. He was going to leave Hollywood for a mid-level public servant's job? Really? His parents, he said, weren't so surprised. They had watched him deeply immerse himself in the Obama campaign and suspected he might make switch to politics at some point. Working at the Office of Public Liaison, Penn explained, would allow him to continue the work he had done as a member of candidate Obama's arts advisory council: reach out to Asian-American audiences, the arts community and young people. And he won't be a government drone forever: Penn said he intends to get back to acting at some point. A couple of years in D.C. might be the right prescription to cure him of Potomac Fever. And then, maybe we'll get Harold and Kumar Go To Washington. After all, he'll have done all the research. \"http://www.npr.org/templates/story/story.php?storyId=102859368\" \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090408, 
        "postID": 1, 
        "quote": "", 
        "reply": "Penn had made a hard decision: He was leaving House — a job he loved — to go to the White House as the new associate director of the Office of Public Liaison. It was, Penn told reporters during a phone conference Tuesday, a unique opportunity to engage in one of two lifelong passions. The first is acting; the second, public service. When Penn told his family and friends the news, some friends thought he was crazy to trade a successful actor's salary and fame for the tedium of government work. Penn has become a cult favorite for his role as half of a dope-smoking, hamburger-scarfing duo in the Harold and Kumar series and received critical acclaim in the lead role of Mira Nair's adaptation of Jhumpa Lahiri's bestseller The Namesake. He was going to leave Hollywood for a mid-level public servant's job? Really? His parents, he said, weren't so surprised. They had watched him deeply immerse himself in the Obama campaign and suspected he might make switch to politics at some point. Working at the Office of Public Liaison, Penn explained, would allow him to continue the work he had done as a member of candidate Obama's arts advisory council: reach out to Asian-American audiences, the arts community and young people. And he won't be a government drone forever: Penn said he intends to get back to acting at some point. A couple of years in D.C. might be the right prescription to cure him of Potomac Fever. And then, maybe we'll get Harold and Kumar Go To Washington. After all, he'll have done all the research. \"http://www.npr.org/templates/story/story.php?storyId=102859368\" \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_1690041022001", 
        "time": "2009-04-08 06:46:00", 
        "title": "Actor Kal Penn Trades 'House' For White House", 
        "userID": "Anbar7"
    }, 
    {
        "content": "So now we have actors going to the white house to do public relations. At least he probably paid his taxes though. That is a good first start. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090408, 
        "postID": 2, 
        "quote": "", 
        "reply": "So now we have actors going to the white house to do public relations. At least he probably paid his taxes though. That is a good first start. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_1690041022001", 
        "time": "2009-04-08 07:10:00", 
        "title": "Actor Kal Penn Trades 'House' For White House", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: So now we have actors going to the white house to do public relations. At least he probably paid his taxes though. That is a good first start. You will take any excuse to make a negative remark won't you. A man believes in something to give up a LOT of money and takes a chance of hurting his future chances in a career he is doing well in and all you do is use it to make a snide remark. Of course another actor (after his career was over) went to Washinington for an even more important position but that was Ok because he claimed to be a conservative.", 
        "intTime": 20090408, 
        "postID": 3, 
        "quote": "Originally posted by Anbar7: So now we have actors going to the white house to do public relations. At least he probably paid his taxes though. That is a good first start.", 
        "reply": " You will take any excuse to make a negative remark won't you. A man believes in something to give up a LOT of money and takes a chance of hurting his future chances in a career he is doing well in and all you do is use it to make a snide remark. Of course another actor (after his career was over) went to Washinington for an even more important position but that was Ok because he claimed to be a conservative.", 
        "threadID": "672198221_1690041022001", 
        "time": "2009-04-08 07:14:00", 
        "title": "Actor Kal Penn Trades 'House' For White House", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by Anbar7: So now we have actors going to the white house to do public relations. At least he probably paid his taxes though. That is a good first start. You will take any excuse to make a negative remark won't you. A man believes in something to give up a LOT of money and takes a chance of hurting his future chances in a career he is doing well in and all you do is use it to make a snide remark. Of course another actor (after his career was over) went to Washinington for an even more important position but that was Ok because he claimed to be a conservative. And that would be who? And I wasn't taking a shot at the actor I was taking a shot at Obama and his picks of cabinet members who haven't paid taxes and who have all sucked. So yeah I will take any excuse to take a shot at the dumb@ss \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090408, 
        "postID": 4, 
        "quote": "Originally posted by rayld2: quote: Originally posted by Anbar7: So now we have actors going to the white house to do public relations. At least he probably paid his taxes though. That is a good first start. You will take any excuse to make a negative remark won't you. A man believes in something to give up a LOT of money and takes a chance of hurting his future chances in a career he is doing well in and all you do is use it to make a snide remark. Of course another actor (after his career was over) went to Washinington for an even more important position but that was Ok because he claimed to be a conservative.", 
        "reply": " And that would be who? And I wasn't taking a shot at the actor I was taking a shot at Obama and his picks of cabinet members who haven't paid taxes and who have all sucked. So yeah I will take any excuse to take a shot at the dumb@ss \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_1690041022001", 
        "time": "2009-04-08 07:38:00", 
        "title": "Actor Kal Penn Trades 'House' For White House", 
        "userID": "Anbar7"
    }, 
    {
        "content": "I thought the story about the guy stealing the airplane in Canada was crazy...until I heard this one. Remember in \"Harold & Kumar\" when he had sex with a giant bag of weed?", 
        "intTime": 20090408, 
        "postID": 5, 
        "quote": "", 
        "reply": "I thought the story about the guy stealing the airplane in Canada was crazy...until I heard this one. Remember in \"Harold & Kumar\" when he had sex with a giant bag of weed?", 
        "threadID": "672198221_1690041022001", 
        "time": "2009-04-08 11:08:00", 
        "title": "Actor Kal Penn Trades 'House' For White House", 
        "userID": "foxred03"
    }, 
    {
        "content": "quote: Originally posted by foxred03: I thought the story about the guy stealing the airplane in Canada was crazy...until I heard this one. Remember in \"Harold & Kumar\" when he had sex with a giant bag of weed? Yeah, he tore it up. Don't forget he almost had a 4-way with the young girl and that nasty guy with the huge @ss boil on his neck. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090408, 
        "postID": 6, 
        "quote": "Originally posted by foxred03: I thought the story about the guy stealing the airplane in Canada was crazy...until I heard this one. Remember in \"Harold & Kumar\" when he had sex with a giant bag of weed?", 
        "reply": " Yeah, he tore it up. Don't forget he almost had a 4-way with the young girl and that nasty guy with the huge @ss boil on his neck. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_1690041022001", 
        "time": "2009-04-08 11:09:00", 
        "title": "Actor Kal Penn Trades 'House' For White House", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: So now we have actors going to the white house to do public relations. At least he probably paid his taxes though. That is a good first start. You mean like Reagan? Or Fred Thompson? Who was JUST a candidate? Please stop posting.", 
        "intTime": 20090408, 
        "postID": 7, 
        "quote": "Originally posted by Anbar7: So now we have actors going to the white house to do public relations. At least he probably paid his taxes though. That is a good first start.", 
        "reply": " You mean like Reagan? Or Fred Thompson? Who was JUST a candidate? Please stop posting.", 
        "threadID": "672198221_1690041022001", 
        "time": "2009-04-08 11:20:00", 
        "title": "Actor Kal Penn Trades 'House' For White House", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by Anbar7: So now we have actors going to the white house to do public relations. At least he probably paid his taxes though. That is a good first start. You mean like Reagan? Or Fred Thompson? Who was JUST a candidate? Please stop posting. I never supported Fred Thompson and didn't think he was a viable candidate. Reagan was before me and I probably would have thought the same. I'm not going to quit posting because it is my opinion. You don't like it go fly a kite. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090408, 
        "postID": 8, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by Anbar7: So now we have actors going to the white house to do public relations. At least he probably paid his taxes though. That is a good first start. You mean like Reagan? Or Fred Thompson? Who was JUST a candidate? Please stop posting.", 
        "reply": " I never supported Fred Thompson and didn't think he was a viable candidate. Reagan was before me and I probably would have thought the same. I'm not going to quit posting because it is my opinion. You don't like it go fly a kite. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_1690041022001", 
        "time": "2009-04-08 11:24:00", 
        "title": "Actor Kal Penn Trades 'House' For White House", 
        "userID": "Anbar7"
    }, 
    {
        "content": "On topic: Kal Penn's movies were pure garbage. EDIT: They made a THIRD Harold and Kumar movie?!?!?!", 
        "intTime": 20090408, 
        "postID": 9, 
        "quote": "", 
        "reply": "On topic: Kal Penn's movies were pure garbage. EDIT: They made a THIRD Harold and Kumar movie?!?!?!", 
        "threadID": "672198221_1690041022001", 
        "time": "2009-04-08 11:41:00", 
        "title": "Actor Kal Penn Trades 'House' For White House", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: On topic: Kal Penn's movies were pure garbage. I thought the Harold & Kumar movies were pretty funny. Also a flick he did about Indian heritage(can't remember the name), saw it on the Indie Movie Channel, was pretty good.", 
        "intTime": 20090408, 
        "postID": 10, 
        "quote": "Originally posted by mrmixitup: On topic: Kal Penn's movies were pure garbage.", 
        "reply": " I thought the Harold & Kumar movies were pretty funny. Also a flick he did about Indian heritage(can't remember the name), saw it on the Indie Movie Channel, was pretty good.", 
        "threadID": "672198221_1690041022001", 
        "time": "2009-04-08 12:33:00", 
        "title": "Actor Kal Penn Trades 'House' For White House", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: associate director of the Office of Public Liaison What is that?!?!", 
        "intTime": 20090411, 
        "postID": 11, 
        "quote": "associate director of the Office of Public Liaison", 
        "reply": " What is that?!?!", 
        "threadID": "672198221_1690041022001", 
        "time": "2009-04-11 11:41:00", 
        "title": "Actor Kal Penn Trades 'House' For White House", 
        "userID": "meyoumeyou07"
    }, 
    {
        "content": "quote: Originally posted by 67NOV: quote: Originally posted by mrmixitup: On topic: Kal Penn's movies were pure garbage. I thought the Harold & Kumar movies were pretty funny. Also a flick he did about Indian heritage(can't remember the name), saw it on the Indie Movie Channel, was pretty good. Yeah, the Harold & Kumar movies were hilarious. Sure, they were idiotic and childish, but still hilarious. It does take a certain degree of youth to get them, so many people over 45 will not really think much of them. I also thought Van Wilder was a pretty funny movie. Kal Penn had probably the funniest lines in that movie.", 
        "intTime": 20090411, 
        "postID": 12, 
        "quote": "Originally posted by 67NOV: quote: Originally posted by mrmixitup: On topic: Kal Penn's movies were pure garbage. I thought the Harold & Kumar movies were pretty funny. Also a flick he did about Indian heritage(can't remember the name), saw it on the Indie Movie Channel, was pretty good.", 
        "reply": " Yeah, the Harold & Kumar movies were hilarious. Sure, they were idiotic and childish, but still hilarious. It does take a certain degree of youth to get them, so many people over 45 will not really think much of them. I also thought Van Wilder was a pretty funny movie. Kal Penn had probably the funniest lines in that movie.", 
        "threadID": "672198221_1690041022001", 
        "time": "2009-04-11 12:01:00", 
        "title": "Actor Kal Penn Trades 'House' For White House", 
        "userID": "10Tenths"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by rayld2: quote: Originally posted by Anbar7: So now we have actors going to the white house to do public relations. At least he probably paid his taxes though. That is a good first start. You will take any excuse to make a negative remark won't you. A man believes in something to give up a LOT of money and takes a chance of hurting his future chances in a career he is doing well in and all you do is use it to make a snide remark. Of course another actor (after his career was over) went to Washinington for an even more important position but that was Ok because he claimed to be a conservative. And that would be who? And I wasn't taking a shot at the actor I was taking a shot at Obama and his picks of cabinet members who haven't paid taxes and who have all sucked. So yeah I will take any excuse to take a shot at the dumb@ss I guess the rules against personal attacks on the CinC only count if he's a Republican.", 
        "intTime": 20090411, 
        "postID": 13, 
        "quote": "Originally posted by Anbar7: quote: Originally posted by rayld2: quote: Originally posted by Anbar7: So now we have actors going to the white house to do public relations. At least he probably paid his taxes though. That is a good first start. You will take any excuse to make a negative remark won't you. A man believes in something to give up a LOT of money and takes a chance of hurting his future chances in a career he is doing well in and all you do is use it to make a snide remark. Of course another actor (after his career was over) went to Washinington for an even more important position but that was Ok because he claimed to be a conservative. And that would be who? And I wasn't taking a shot at the actor I was taking a shot at Obama and his picks of cabinet members who haven't paid taxes and who have all sucked. So yeah I will take any excuse to take a shot at the dumb@ss", 
        "reply": " I guess the rules against personal attacks on the CinC only count if he's a Republican.", 
        "threadID": "672198221_1690041022001", 
        "time": "2009-04-11 13:01:00", 
        "title": "Actor Kal Penn Trades 'House' For White House", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by Ol_Doc: quote: Originally posted by Anbar7: quote: Originally posted by rayld2: quote: Originally posted by Anbar7: So now we have actors going to the white house to do public relations. At least he probably paid his taxes though. That is a good first start. You will take any excuse to make a negative remark won't you. A man believes in something to give up a LOT of money and takes a chance of hurting his future chances in a career he is doing well in and all you do is use it to make a snide remark. Of course another actor (after his career was over) went to Washinington for an even more important position but that was Ok because he claimed to be a conservative. And that would be who? And I wasn't taking a shot at the actor I was taking a shot at Obama and his picks of cabinet members who haven't paid taxes and who have all sucked. So yeah I will take any excuse to take a shot at the dumb@ss I guess the rules against personal attacks on the CinC only count if he's a Republican.", 
        "intTime": 20090427, 
        "postID": 14, 
        "quote": "Originally posted by Ol_Doc: quote: Originally posted by Anbar7: quote: Originally posted by rayld2: quote: Originally posted by Anbar7: So now we have actors going to the white house to do public relations. At least he probably paid his taxes though. That is a good first start. You will take any excuse to make a negative remark won't you. A man believes in something to give up a LOT of money and takes a chance of hurting his future chances in a career he is doing well in and all you do is use it to make a snide remark. Of course another actor (after his career was over) went to Washinington for an even more important position but that was Ok because he claimed to be a conservative. And that would be who? And I wasn't taking a shot at the actor I was taking a shot at Obama and his picks of cabinet members who haven't paid taxes and who have all sucked. So yeah I will take any excuse to take a shot at the dumb@ss I guess the rules against personal attacks on the CinC only count if he's a Republican.", 
        "reply": "", 
        "threadID": "672198221_1690041022001", 
        "time": "2009-04-27 08:50:00", 
        "title": "Actor Kal Penn Trades 'House' For White House", 
        "userID": "meyoumeyou07"
    }, 
    {
        "content": "quote: Originally posted by meyoumeyou07: quote: Originally posted by Ol_Doc: quote: Originally posted by Anbar7: quote: Originally posted by rayld2: quote: Originally posted by Anbar7: So now we have actors going to the white house to do public relations. At least he probably paid his taxes though. That is a good first start. You will take any excuse to make a negative remark won't you. A man believes in something to give up a LOT of money and takes a chance of hurting his future chances in a career he is doing well in and all you do is use it to make a snide remark. Of course another actor (after his career was over) went to Washinington for an even more important position but that was Ok because he claimed to be a conservative. And that would be who? And I wasn't taking a shot at the actor I was taking a shot at Obama and his picks of cabinet members who haven't paid taxes and who have all sucked. So yeah I will take any excuse to take a shot at the dumb@ss I guess the rules against personal attacks on the CinC only count if he's a Republican. I agree, I am in no way liberal, but personal attacks against the CinC should not be allowed. Read the terms of service!", 
        "intTime": 20090427, 
        "postID": 15, 
        "quote": "Originally posted by meyoumeyou07: quote: Originally posted by Ol_Doc: quote: Originally posted by Anbar7: quote: Originally posted by rayld2: quote: Originally posted by Anbar7: So now we have actors going to the white house to do public relations. At least he probably paid his taxes though. That is a good first start. You will take any excuse to make a negative remark won't you. A man believes in something to give up a LOT of money and takes a chance of hurting his future chances in a career he is doing well in and all you do is use it to make a snide remark. Of course another actor (after his career was over) went to Washinington for an even more important position but that was Ok because he claimed to be a conservative. And that would be who? And I wasn't taking a shot at the actor I was taking a shot at Obama and his picks of cabinet members who haven't paid taxes and who have all sucked. So yeah I will take any excuse to take a shot at the dumb@ss I guess the rules against personal attacks on the CinC only count if he's a Republican.", 
        "reply": " I agree, I am in no way liberal, but personal attacks against the CinC should not be allowed. Read the terms of service!", 
        "threadID": "672198221_1690041022001", 
        "time": "2009-04-27 09:09:00", 
        "title": "Actor Kal Penn Trades 'House' For White House", 
        "userID": "FIST101CAV"
    }, 
    {
        "content": "quote: Yeah, the Harold & Kumar movies were hilarious. Sure, they were idiotic and childish, but still hilarious. It does take a certain degree of youth to get them, so many people over 45 will not really think much of them. I also thought Van Wilder was a pretty funny movie. Kal Penn had probably the funniest lines in that movie. I'm out of the loop, never heard of them, guess I am old.", 
        "intTime": 20090427, 
        "postID": 16, 
        "quote": "Yeah, the Harold & Kumar movies were hilarious. Sure, they were idiotic and childish, but still hilarious. It does take a certain degree of youth to get them, so many people over 45 will not really think much of them. I also thought Van Wilder was a pretty funny movie. Kal Penn had probably the funniest lines in that movie.", 
        "reply": " I'm out of the loop, never heard of them, guess I am old.", 
        "threadID": "672198221_1690041022001", 
        "time": "2009-04-27 11:34:00", 
        "title": "Actor Kal Penn Trades 'House' For White House", 
        "userID": "BAGodbehere"
    }, 
    {
        "content": "quote: Originally posted by BAGodbehere: quote: Yeah, the Harold & Kumar movies were hilarious. Sure, they were idiotic and childish, but still hilarious. It does take a certain degree of youth to get them, so many people over 45 will not really think much of them. I also thought Van Wilder was a pretty funny movie. Kal Penn had probably the funniest lines in that movie. I'm out of the loop, never heard of them, guess I am old. You are not old just smart.. I've seen their movies on the video shelf and that's where they stay.", 
        "intTime": 20090427, 
        "postID": 17, 
        "quote": "Originally posted by BAGodbehere: quote: Yeah, the Harold & Kumar movies were hilarious. Sure, they were idiotic and childish, but still hilarious. It does take a certain degree of youth to get them, so many people over 45 will not really think much of them. I also thought Van Wilder was a pretty funny movie. Kal Penn had probably the funniest lines in that movie. I'm out of the loop, never heard of them, guess I am old.", 
        "reply": " You are not old just smart.. I've seen their movies on the video shelf and that's where they stay.", 
        "threadID": "672198221_1690041022001", 
        "time": "2009-04-27 17:28:00", 
        "title": "Actor Kal Penn Trades 'House' For White House", 
        "userID": "meyoumeyou07"
    }, 
    {
        "content": "quote: Originally posted by FIST101CAV: quote: Originally posted by meyoumeyou07: quote: Originally posted by Ol_Doc: quote: Originally posted by Anbar7: quote: Originally posted by rayld2: quote: Originally posted by Anbar7: So now we have actors going to the white house to do public relations. At least he probably paid his taxes though. That is a good first start. You will take any excuse to make a negative remark won't you. A man believes in something to give up a LOT of money and takes a chance of hurting his future chances in a career he is doing well in and all you do is use it to make a snide remark. Of course another actor (after his career was over) went to Washinington for an even more important position but that was Ok because he claimed to be a conservative. And that would be who? And I wasn't taking a shot at the actor I was taking a shot at Obama and his picks of cabinet members who haven't paid taxes and who have all sucked. So yeah I will take any excuse to take a shot at the dumb@ss I guess the rules against personal attacks on the CinC only count if he's a Republican. I agree, I am in no way liberal, but personal attacks against the CinC should not be allowed. Read the terms of service! Well thanks to the Libs crying to have it their way so they could bash Bush at every moment, that TOS has been removed. But now that a Lib is in office they want it re-applied. I guess Libs can't have their cake and eat it too. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090428, 
        "postID": 18, 
        "quote": "Originally posted by FIST101CAV: quote: Originally posted by meyoumeyou07: quote: Originally posted by Ol_Doc: quote: Originally posted by Anbar7: quote: Originally posted by rayld2: quote: Originally posted by Anbar7: So now we have actors going to the white house to do public relations. At least he probably paid his taxes though. That is a good first start. You will take any excuse to make a negative remark won't you. A man believes in something to give up a LOT of money and takes a chance of hurting his future chances in a career he is doing well in and all you do is use it to make a snide remark. Of course another actor (after his career was over) went to Washinington for an even more important position but that was Ok because he claimed to be a conservative. And that would be who? And I wasn't taking a shot at the actor I was taking a shot at Obama and his picks of cabinet members who haven't paid taxes and who have all sucked. So yeah I will take any excuse to take a shot at the dumb@ss I guess the rules against personal attacks on the CinC only count if he's a Republican. I agree, I am in no way liberal, but personal attacks against the CinC should not be allowed. Read the terms of service!", 
        "reply": " Well thanks to the Libs crying to have it their way so they could bash Bush at every moment, that TOS has been removed. But now that a Lib is in office they want it re-applied. I guess Libs can't have their cake and eat it too. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_1690041022001", 
        "time": "2009-04-28 08:39:00", 
        "title": "Actor Kal Penn Trades 'House' For White House", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by FIST101CAV: quote: Originally posted by meyoumeyou07: quote: Originally posted by Ol_Doc: quote: Originally posted by Anbar7: quote: Originally posted by rayld2: quote: Originally posted by Anbar7: So now we have actors going to the white house to do public relations. At least he probably paid his taxes though. That is a good first start. You will take any excuse to make a negative remark won't you. A man believes in something to give up a LOT of money and takes a chance of hurting his future chances in a career he is doing well in and all you do is use it to make a snide remark. Of course another actor (after his career was over) went to Washinington for an even more important position but that was Ok because he claimed to be a conservative. And that would be who? And I wasn't taking a shot at the actor I was taking a shot at Obama and his picks of cabinet members who haven't paid taxes and who have all sucked. So yeah I will take any excuse to take a shot at the dumb@ss I guess the rules against personal attacks on the CinC only count if he's a Republican. I agree, I am in no way liberal, but personal attacks against the CinC should not be allowed. Read the terms of service! Well thanks to the Libs crying to have it their way so they could bash Bush at every moment, that TOS has been removed. But now that a Lib is in office they want it re-applied. I guess Libs can't have their cake and eat it too. I had no idea it was removed. Figures. I guess it's up to personal prefrence.", 
        "intTime": 20090501, 
        "postID": 19, 
        "quote": "Originally posted by Anbar7: quote: Originally posted by FIST101CAV: quote: Originally posted by meyoumeyou07: quote: Originally posted by Ol_Doc: quote: Originally posted by Anbar7: quote: Originally posted by rayld2: quote: Originally posted by Anbar7: So now we have actors going to the white house to do public relations. At least he probably paid his taxes though. That is a good first start. You will take any excuse to make a negative remark won't you. A man believes in something to give up a LOT of money and takes a chance of hurting his future chances in a career he is doing well in and all you do is use it to make a snide remark. Of course another actor (after his career was over) went to Washinington for an even more important position but that was Ok because he claimed to be a conservative. And that would be who? And I wasn't taking a shot at the actor I was taking a shot at Obama and his picks of cabinet members who haven't paid taxes and who have all sucked. So yeah I will take any excuse to take a shot at the dumb@ss I guess the rules against personal attacks on the CinC only count if he's a Republican. I agree, I am in no way liberal, but personal attacks against the CinC should not be allowed. Read the terms of service! Well thanks to the Libs crying to have it their way so they could bash Bush at every moment, that TOS has been removed. But now that a Lib is in office they want it re-applied. I guess Libs can't have their cake and eat it too.", 
        "reply": " I had no idea it was removed. Figures. I guess it's up to personal prefrence.", 
        "threadID": "672198221_1690041022001", 
        "time": "2009-05-01 11:09:00", 
        "title": "Actor Kal Penn Trades 'House' For White House", 
        "userID": "FIST101CAV"
    }
]