[
    {
        "content": "\"http://www.washingtontimes.com/news/2009/mar/15/state-law-gives-palin-no-choice-but-pro-choice/\" I'm not here to debate abortion...thought I would relay the story.", 
        "intTime": 20090316, 
        "postID": 1, 
        "quote": "", 
        "reply": "\"http://www.washingtontimes.com/news/2009/mar/15/state-law-gives-palin-no-choice-but-pro-choice/\" I'm not here to debate abortion...thought I would relay the story.", 
        "threadID": "672198221_4250040812001", 
        "time": "2009-03-16 16:09:00", 
        "title": "Sarah Palin Appoints Pro-Choicer To Alaska Supreme Court", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: I'm not here to debate abortion...thought I would relay the story. Why? Are we supposed to be shocked by this turn of events? I hate to tell you this but not all Republicans march lock step on this issue. There actually are members of the GOP who are pro choice!", 
        "intTime": 20090316, 
        "postID": 2, 
        "quote": "I'm not here to debate abortion...thought I would relay the story.", 
        "reply": " Why? Are we supposed to be shocked by this turn of events? I hate to tell you this but not all Republicans march lock step on this issue. There actually are members of the GOP who are pro choice!", 
        "threadID": "672198221_4250040812001", 
        "time": "2009-03-16 16:19:00", 
        "title": "Sarah Palin Appoints Pro-Choicer To Alaska Supreme Court", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: \"http://www.washingtontimes.com/news/2009/mar/15/state-law-gives-palin-no-choice-but-pro-choice/\" I'm not here to debate abortion...thought I would relay the story. After reading the story apparently she had no real choice in the matter. Alaska law forced her to choose between this woman who is pro-choice, and an environmentalist who is pro-choice. Maybe she figured that the woman she choose will be easier to deal with on envionmental issues - Like blowing away wolves from airplanes. Dave", 
        "intTime": 20090316, 
        "postID": 3, 
        "quote": "Originally posted by crackerjacks61: \"http://www.washingtontimes.com/news/2009/mar/15/state-law-gives-palin-no-choice-but-pro-choice/\" I'm not here to debate abortion...thought I would relay the story.", 
        "reply": " After reading the story apparently she had no real choice in the matter. Alaska law forced her to choose between this woman who is pro-choice, and an environmentalist who is pro-choice. Maybe she figured that the woman she choose will be easier to deal with on envionmental issues - Like blowing away wolves from airplanes. Dave", 
        "threadID": "672198221_4250040812001", 
        "time": "2009-03-16 17:24:00", 
        "title": "Sarah Palin Appoints Pro-Choicer To Alaska Supreme Court", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by crackerjacks61: \"http://www.washingtontimes.com/news/2009/mar/15/state-law-gives-palin-no-choice-but-pro-choice/\" I'm not here to debate abortion...thought I would relay the story. After reading the story apparently she had no real choice in the matter. Alaska law forced her to choose between this woman who is pro-choice, and an environmentalist who is pro-choice. Maybe she figured that the woman she choose will be easier to deal with on envionmental issues - Like blowing away wolves from airplanes. Dave In the link it even says Alaska law gives palin no choice. LOL Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090316, 
        "postID": 4, 
        "quote": "Originally posted by Grachus: quote: Originally posted by crackerjacks61: \"http://www.washingtontimes.com/news/2009/mar/15/state-law-gives-palin-no-choice-but-pro-choice/\" I'm not here to debate abortion...thought I would relay the story. After reading the story apparently she had no real choice in the matter. Alaska law forced her to choose between this woman who is pro-choice, and an environmentalist who is pro-choice. Maybe she figured that the woman she choose will be easier to deal with on envionmental issues - Like blowing away wolves from airplanes. Dave", 
        "reply": " In the link it even says Alaska law gives palin no choice. LOL Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_4250040812001", 
        "time": "2009-03-16 17:55:00", 
        "title": "Sarah Palin Appoints Pro-Choicer To Alaska Supreme Court", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by Grachus: quote: Originally posted by crackerjacks61: \"http://www.washingtontimes.com/news/2009/mar/15/state-law-gives-palin-no-choice-but-pro-choice/\" I'm not here to debate abortion...thought I would relay the story. After reading the story apparently she had no real choice in the matter. Alaska law forced her to choose between this woman who is pro-choice, and an environmentalist who is pro-choice. Maybe she figured that the woman she choose will be easier to deal with on envionmental issues - Like blowing away wolves from airplanes. Dave In the link it even says Alaska law gives palin no choice. LOL LMAO I was waiting for someone to point that out that...yeah see the look on her face? The headline sounded better though like it was her decision only lol...", 
        "intTime": 20090316, 
        "postID": 5, 
        "quote": "Originally posted by L0A1: quote: Originally posted by Grachus: quote: Originally posted by crackerjacks61: \"http://www.washingtontimes.com/news/2009/mar/15/state-law-gives-palin-no-choice-but-pro-choice/\" I'm not here to debate abortion...thought I would relay the story. After reading the story apparently she had no real choice in the matter. Alaska law forced her to choose between this woman who is pro-choice, and an environmentalist who is pro-choice. Maybe she figured that the woman she choose will be easier to deal with on envionmental issues - Like blowing away wolves from airplanes. Dave In the link it even says Alaska law gives palin no choice. LOL", 
        "reply": " LMAO I was waiting for someone to point that out that...yeah see the look on her face? The headline sounded better though like it was her decision only lol...", 
        "threadID": "672198221_4250040812001", 
        "time": "2009-03-16 18:42:00", 
        "title": "Sarah Palin Appoints Pro-Choicer To Alaska Supreme Court", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Like blowing away wolves from airplanes. Now dave that's a fair sport if I ever heard of one....lol ...ack", 
        "intTime": 20090316, 
        "postID": 6, 
        "quote": "Like blowing away wolves from airplanes.", 
        "reply": " Now dave that's a fair sport if I ever heard of one....lol ...ack", 
        "threadID": "672198221_4250040812001", 
        "time": "2009-03-16 18:45:00", 
        "title": "Sarah Palin Appoints Pro-Choicer To Alaska Supreme Court", 
        "userID": "crackerjacks61"
    }
]