[
    {
        "content": "quote: Sergio Marchionne's first days as Fiat CEO were marked by fear at the company's headquarters, as some top managers saw their careers abruptly end in a 20-minute chat. The new chief executive quickly determined whether each manager had the skills to help transform tradition-bound, family-run Fiat -- namely \"speed, simplicity and self-confidence.\" \"Many did not make the cut,\" Marchionne recalled later. Marchionne then dismantled Fiat's old hierarchy in favor of what he calls a \"flat management structure\" -- fewer managers for quicker decisions. He has already said similar changes also are needed at Chrysler, the limping U.S. automaker that he may soon be running. The 56-year-old Marchionne's bold conquest -- a deal finalized Thursday for 20 percent of Chrysler, with not a penny down but in exchange for Fiat technology valued at some $8 billion -- was made possible by the deepening financial crisis that has crippled the automotive industry. Chrysler is just the kind of train wreck the dual Canadian-Italian citizen, who solidified his reputation as a turnaround expert in Switzerland, has shown he can fix, employing an outsider's detachment and a willingness to shake things up. \"He has one method, one genetic impulse,\" said Klaus Stoehlker, a leading Swiss management consultant who observed Marchionne's rise from a controller to the head of Swiss industrial concern Alusuisse Lonza Group, then to the helm of goods inspections firm SGS SA and onward to Fiat in the space of 12 years. In each of those cases, Marchionne walked into situations of weak management and cleaned house, unfettered by local loyalties. (....) Sound like a perfect man for the job. +http://www.businessweek.com/ap/financialnews/D97TD5UG0.htm \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090501, 
        "postID": 1, 
        "quote": "Sergio Marchionne's first days as Fiat CEO were marked by fear at the company's headquarters, as some top managers saw their careers abruptly end in a 20-minute chat. The new chief executive quickly determined whether each manager had the skills to help transform tradition-bound, family-run Fiat -- namely \"speed, simplicity and self-confidence.\" \"Many did not make the cut,\" Marchionne recalled later. Marchionne then dismantled Fiat's old hierarchy in favor of what he calls a \"flat management structure\" -- fewer managers for quicker decisions. He has already said similar changes also are needed at Chrysler, the limping U.S. automaker that he may soon be running. The 56-year-old Marchionne's bold conquest -- a deal finalized Thursday for 20 percent of Chrysler, with not a penny down but in exchange for Fiat technology valued at some $8 billion -- was made possible by the deepening financial crisis that has crippled the automotive industry. Chrysler is just the kind of train wreck the dual Canadian-Italian citizen, who solidified his reputation as a turnaround expert in Switzerland, has shown he can fix, employing an outsider's detachment and a willingness to shake things up. \"He has one method, one genetic impulse,\" said Klaus Stoehlker, a leading Swiss management consultant who observed Marchionne's rise from a controller to the head of Swiss industrial concern Alusuisse Lonza Group, then to the helm of goods inspections firm SGS SA and onward to Fiat in the space of 12 years. In each of those cases, Marchionne walked into situations of weak management and cleaned house, unfettered by local loyalties. (....)", 
        "reply": " Sound like a perfect man for the job. +http://www.businessweek.com/ap/financialnews/D97TD5UG0.htm \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_5390022222001", 
        "time": "2009-05-01 06:08:00", 
        "title": "Fiat's Marchionne willing to shake up tradition", 
        "userID": "NSNN"
    }, 
    {
        "content": "Well \"DR. Z\" was and I guess still is doing a good job running Daimler-Benz and he couldn't get Chrysler turned around and he/they decided to quit beating there heads against that wall and said to he77 with it and sold it off to Serberis at a huge loss. So who is to say that \"Mr. M\" is going to?", 
        "intTime": 20090501, 
        "postID": 2, 
        "quote": "", 
        "reply": "Well \"DR. Z\" was and I guess still is doing a good job running Daimler-Benz and he couldn't get Chrysler turned around and he/they decided to quit beating there heads against that wall and said to he77 with it and sold it off to Serberis at a huge loss. So who is to say that \"Mr. M\" is going to?", 
        "threadID": "672198221_5390022222001", 
        "time": "2009-05-01 06:30:00", 
        "title": "Fiat's Marchionne willing to shake up tradition", 
        "userID": "ETCPJ"
    }, 
    {
        "content": "quote: Originally posted by ETCPJ: Well \"DR. Z\" was and I guess still is doing a good job running Daimler-Benz and he couldn't get Chrysler turned around and he/they decided to quit beating there heads against that wall and said to he77 with it and sold it off to Serberis at a huge loss. So who is to say that \"Mr. M\" is going to? Dr. Z, for whatever reason, didn’t truly restructure. Misguidedly he believed the same people at Chrysler would carry out his vision from top down.....obviously that didn’t happen. Also, although some would like to think so, Chrysler is in no shape or form on par with Mercedes; hence cannot be run in the same way. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090501, 
        "postID": 3, 
        "quote": "Originally posted by ETCPJ: Well \"DR. Z\" was and I guess still is doing a good job running Daimler-Benz and he couldn't get Chrysler turned around and he/they decided to quit beating there heads against that wall and said to he77 with it and sold it off to Serberis at a huge loss. So who is to say that \"Mr. M\" is going to?", 
        "reply": " Dr. Z, for whatever reason, didn’t truly restructure. Misguidedly he believed the same people at Chrysler would carry out his vision from top down.....obviously that didn’t happen. Also, although some would like to think so, Chrysler is in no shape or form on par with Mercedes; hence cannot be run in the same way. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_5390022222001", 
        "time": "2009-05-01 07:15:00", 
        "title": "Fiat's Marchionne willing to shake up tradition", 
        "userID": "NSNN"
    }
]