[
    {
        "content": "Yep, Want to hide news, release it on a Friday afternoon. XXXhttp://www.nydailynews.com/news/politics/2009/05/08/2009-05-08_white_house_aide_loses_job_over_manhattan_flyover_fiasco.htmlXXX White House aide Louis Caldera loses job over Manhattan flyover fiasco involving Air Force One WASHINGTON - The White House aide who authorized the controversial Air Force One photo-op flight last week around the Statue of Liberty is out of a job. President Obama has accepted the resignation of Louis Caldera, the director of the White House Military Office, the Daily News learned Friday By the way, the F-16D escort for Scare Force One was a RedTail, anyone know the significance of that?",
        "intTime": 20090508,
        "postID": 1,
        "quote": "",
        "reply": "Yep, Want to hide news, release it on a Friday afternoon. XXXhttp://www.nydailynews.com/news/politics/2009/05/08/2009-05-08_white_house_aide_loses_job_over_manhattan_flyover_fiasco.htmlXXX White House aide Louis Caldera loses job over Manhattan flyover fiasco involving Air Force One WASHINGTON - The White House aide who authorized the controversial Air Force One photo-op flight last week around the Statue of Liberty is out of a job. President Obama has accepted the resignation of Louis Caldera, the director of the White House Military Office, the Daily News learned Friday By the way, the F-16D escort for Scare Force One was a RedTail, anyone know the significance of that?",
        "threadID": "672198221_8850038222001",
        "time": "2009-05-08 14:09:00",
        "title": "0bama personnel dump, it must be friday...",
        "userID": "LineDoggie"
    },
    {
        "content": "Wonder if there will be a book out about it. What does the RED mean?",
        "intTime": 20090508,
        "postID": 2,
        "quote": "",
        "reply": "Wonder if there will be a book out about it. What does the RED mean?",
        "threadID": "672198221_8850038222001",
        "time": "2009-05-08 14:13:00",
        "title": "0bama personnel dump, it must be friday...",
        "userID": "ACR26"
    },
    {
        "content": "So your complaining that when some one messes up they get the sack instead of a pat on the back with A \"good job brownie\"? Desperation, Just out and out Desperation?",
        "intTime": 20090508,
        "postID": 3,
        "quote": "",
        "reply": "So your complaining that when some one messes up they get the sack instead of a pat on the back with A \"good job brownie\"? Desperation, Just out and out Desperation?",
        "threadID": "672198221_8850038222001",
        "time": "2009-05-08 14:23:00",
        "title": "0bama personnel dump, it must be friday...",
        "userID": "A_Savage"
    },
    {
        "content": "typical politics as always, if it had gone over well there would have been \"ku-do's\" all around.. as it came out someone had to pay and it twernt gonna be PO. I wonder if Patooie was briefed on this flight. Hmmmmm, vlery-in-ter-est-ting. One Flag......One Heart......One Nation............EVERMORE",
        "intTime": 20090508,
        "postID": 4,
        "quote": "",
        "reply": "typical politics as always, if it had gone over well there would have been \"ku-do's\" all around.. as it came out someone had to pay and it twernt gonna be PO. I wonder if Patooie was briefed on this flight. Hmmmmm, vlery-in-ter-est-ting. One Flag......One Heart......One Nation............EVERMORE",
        "threadID": "672198221_8850038222001",
        "time": "2009-05-08 14:30:00",
        "title": "0bama personnel dump, it must be friday...",
        "userID": "m551sheridan"
    },
    {
        "content": "quote: Originally posted by A_Savage: So your complaining that when some one messes up they get the sack instead of a pat on the back with A \"good job brownie\"? Desperation, Just out and out Desperation? Almost grotesque that he's being criticised for doing what Mr. Bush would never dream of doing. How novel? Someone being held accountable. Why, why, it's almost unAmerican... Dave",
        "intTime": 20090508,
        "postID": 5,
        "quote": "Originally posted by A_Savage: So your complaining that when some one messes up they get the sack instead of a pat on the back with A \"good job brownie\"? Desperation, Just out and out Desperation?",
        "reply": " Almost grotesque that he's being criticised for doing what Mr. Bush would never dream of doing. How novel? Someone being held accountable. Why, why, it's almost unAmerican... Dave",
        "threadID": "672198221_8850038222001",
        "time": "2009-05-08 14:36:00",
        "title": "0bama personnel dump, it must be friday...",
        "userID": "Grachus"
    },
    {
        "content": "President Obama fired a guy for not communicating properly about a publicity photo and causing a panic in New York City where people are still traumatized by 9/11. Obviously the guy is not up to the job. Firing him is what any good leader would do. Do you think he should have got a medal like George “slam dunk” Tenet?",
        "intTime": 20090508,
        "postID": 6,
        "quote": "",
        "reply": "President Obama fired a guy for not communicating properly about a publicity photo and causing a panic in New York City where people are still traumatized by 9/11. Obviously the guy is not up to the job. Firing him is what any good leader would do. Do you think he should have got a medal like George “slam dunk” Tenet?",
        "threadID": "672198221_8850038222001",
        "time": "2009-05-08 14:39:00",
        "title": "0bama personnel dump, it must be friday...",
        "userID": "xerello"
    },
    {
        "content": "quote: Originally posted by xerello: President Obama fired a guy for not communicating properly about a publicity photo and causing a panic in New York City where people are still traumatized by 9/11. Obviously the guy is not up to the job. Firing him is what any good leader would do. Do you think he should have got a medal like George “slam dunk” Tenet? Dagnabit -- I just spent 10 minutes hunting that picture of it will be a slam dunk trent up myself. Is really a shame when folks are damning Obama for holding the people under him as responsible for the mistakes they make. -- Savage",
        "intTime": 20090508,
        "postID": 7,
        "quote": "Originally posted by xerello: President Obama fired a guy for not communicating properly about a publicity photo and causing a panic in New York City where people are still traumatized by 9/11. Obviously the guy is not up to the job. Firing him is what any good leader would do. Do you think he should have got a medal like George “slam dunk” Tenet?",
        "reply": " Dagnabit -- I just spent 10 minutes hunting that picture of it will be a slam dunk trent up myself. Is really a shame when folks are damning Obama for holding the people under him as responsible for the mistakes they make. -- Savage",
        "threadID": "672198221_8850038222001",
        "time": "2009-05-08 14:46:00",
        "title": "0bama personnel dump, it must be friday...",
        "userID": "A_Savage"
    },
    {
        "content": "quote: Originally posted by LineDoggie: Yep, Want to hide news, release it on a Friday afternoon. XXXhttp://www.nydailynews.com/news/politics/2009/05/08/2009-05-08_white_house_aide_loses_job_over_manhattan_flyover_fiasco.htmlXXX White House aide Louis Caldera loses job over Manhattan flyover fiasco involving Air Force One WASHINGTON - The White House aide who authorized the controversial Air Force One photo-op flight last week around the Statue of Liberty is out of a job. President Obama has accepted the resignation of Louis Caldera, the director of the White House Military Office, the Daily News learned Friday So ... what's your point? Obviously this news wasn't very well hidden if YOU found it. And seriously -- would you rather Pres. Obama keep this bonehead on the payroll?",
        "intTime": 20090508,
        "postID": 8,
        "quote": "Originally posted by LineDoggie: Yep, Want to hide news, release it on a Friday afternoon. XXXhttp://www.nydailynews.com/news/politics/2009/05/08/2009-05-08_white_house_aide_loses_job_over_manhattan_flyover_fiasco.htmlXXX White House aide Louis Caldera loses job over Manhattan flyover fiasco involving Air Force One WASHINGTON - The White House aide who authorized the controversial Air Force One photo-op flight last week around the Statue of Liberty is out of a job. President Obama has accepted the resignation of Louis Caldera, the director of the White House Military Office, the Daily News learned Friday",
        "reply": " So ... what's your point? Obviously this news wasn't very well hidden if YOU found it. And seriously -- would you rather Pres. Obama keep this bonehead on the payroll?",
        "threadID": "672198221_8850038222001",
        "time": "2009-05-08 14:51:00",
        "title": "0bama personnel dump, it must be friday...",
        "userID": "1WW"
    },
    {
        "content": "quote: Originally posted by klassylady25: Amidst the racial naysayers during WWII, the first African-American fighter pilots were commissioned in 1941 to help defend distressed bombers in the European theater. Known as the Tuskegee Airmen, these forgotten pilots fought with bravery and skill to save lives and prevent the loss of bombers to enemy fighters. Tuskegee Airmen of World War II The Fifteenth's Red Tail Angels 'http://www.tuskegeeairmen.org/' 'http://www.globalindex.com/kwanzaa/tuskegee/red_tail_angels.htm' You got it, Redtails were the Tuskeegee Airman of WWII Fame. The F-16D escort came from Alabama's 187th Fighter Wing. http://www.almont.ang.af.mil/default.htm Now why would you need an escort fighter from Alabama for a New York City Flight, when Macguire AFB in New Jersey is 30 Minutes away as the crow flies,and the 177th Fighter Wing NJ ANG is based out of Atlantic City, NJ? Odd, Aint it?",
        "intTime": 20090508,
        "postID": 9,
        "quote": "Originally posted by klassylady25: Amidst the racial naysayers during WWII, the first African-American fighter pilots were commissioned in 1941 to help defend distressed bombers in the European theater. Known as the Tuskegee Airmen, these forgotten pilots fought with bravery and skill to save lives and prevent the loss of bombers to enemy fighters. Tuskegee Airmen of World War II The Fifteenth's Red Tail Angels 'http://www.tuskegeeairmen.org/' 'http://www.globalindex.com/kwanzaa/tuskegee/red_tail_angels.htm'",
        "reply": " You got it, Redtails were the Tuskeegee Airman of WWII Fame. The F-16D escort came from Alabama's 187th Fighter Wing. http://www.almont.ang.af.mil/default.htm Now why would you need an escort fighter from Alabama for a New York City Flight, when Macguire AFB in New Jersey is 30 Minutes away as the crow flies,and the 177th Fighter Wing NJ ANG is based out of Atlantic City, NJ? Odd, Aint it?",
        "threadID": "672198221_8850038222001",
        "time": "2009-05-08 15:22:00",
        "title": "0bama personnel dump, it must be friday...",
        "userID": "LineDoggie"
    },
    {
        "content": "quote: Originally posted by A_Savage: So your complaining that when some one messes up they get the sack instead of a pat on the back with A \"good job brownie\"? Desperation, Just out and out Desperation? Sadly, your projecting your thoughts to this thread. Please try reading comprehension next time instead of Knee Jerking if you wish to have an intelligent discussion on this topic.",
        "intTime": 20090508,
        "postID": 10,
        "quote": "Originally posted by A_Savage: So your complaining that when some one messes up they get the sack instead of a pat on the back with A \"good job brownie\"? Desperation, Just out and out Desperation?",
        "reply": " Sadly, your projecting your thoughts to this thread. Please try reading comprehension next time instead of Knee Jerking if you wish to have an intelligent discussion on this topic.",
        "threadID": "672198221_8850038222001",
        "time": "2009-05-08 15:28:00",
        "title": "0bama personnel dump, it must be friday...",
        "userID": "LineDoggie"
    },
    {
        "content": "quote: Originally posted by A_Savage: So your complaining that when some one messes up they get the sack instead of a pat on the back with A \"good job brownie\"? Desperation, Just out and out Desperation? Use the dictionary next time. Look up the word \"resignation\" and compare it to \"fired\". He resigned. A bit of a difference there.",
        "intTime": 20090508,
        "postID": 11,
        "quote": "Originally posted by A_Savage: So your complaining that when some one messes up they get the sack instead of a pat on the back with A \"good job brownie\"? Desperation, Just out and out Desperation?",
        "reply": " Use the dictionary next time. Look up the word \"resignation\" and compare it to \"fired\". He resigned. A bit of a difference there.",
        "threadID": "672198221_8850038222001",
        "time": "2009-05-08 15:32:00",
        "title": "0bama personnel dump, it must be friday...",
        "userID": "crackerjacks61"
    },
    {
        "content": "If he fired this guy for being dumb - shouldn't he fire Nancy for not knowing that water-boarding is not something her servants do with her clothes – ya know the illegal immigrants she hires and pays 3-bucks per hr… Oh wait, they didn’t actually tell her they were torturing it was something about enhancements – probably breast implants or something – so she figured those nice terrorist fellas didn’t want enhancements so she turned off her hearing aid… So, does that mean we can get a REFUND for the 300-thousand dollars WASTED… can we deduct that from Obama’s check…?",
        "intTime": 20090508,
        "postID": 12,
        "quote": "",
        "reply": "If he fired this guy for being dumb - shouldn't he fire Nancy for not knowing that water-boarding is not something her servants do with her clothes – ya know the illegal immigrants she hires and pays 3-bucks per hr… Oh wait, they didn’t actually tell her they were torturing it was something about enhancements – probably breast implants or something – so she figured those nice terrorist fellas didn’t want enhancements so she turned off her hearing aid… So, does that mean we can get a REFUND for the 300-thousand dollars WASTED… can we deduct that from Obama’s check…?",
        "threadID": "672198221_8850038222001",
        "time": "2009-05-08 15:40:00",
        "title": "0bama personnel dump, it must be friday...",
        "userID": "GlassOnion"
    },
    {
        "content": "quote: Originally posted by crackerjacks61: quote: Originally posted by A_Savage: So your complaining that when some one messes up they get the sack instead of a pat on the back with A \"good job brownie\"? Desperation, Just out and out Desperation? Use the dictionary next time. Look up the word \"resignation\" and compare it to \"fired\". He resigned. A bit of a difference there. Say what? You can count on one hand the number of people who were \"fired\" from government over the last 200 years. They get a chance to \"resign.\" Dave",
        "intTime": 20090508,
        "postID": 13,
        "quote": "Originally posted by crackerjacks61: quote: Originally posted by A_Savage: So your complaining that when some one messes up they get the sack instead of a pat on the back with A \"good job brownie\"? Desperation, Just out and out Desperation? Use the dictionary next time. Look up the word \"resignation\" and compare it to \"fired\". He resigned. A bit of a difference there.",
        "reply": " Say what? You can count on one hand the number of people who were \"fired\" from government over the last 200 years. They get a chance to \"resign.\" Dave",
        "threadID": "672198221_8850038222001",
        "time": "2009-05-08 16:39:00",
        "title": "0bama personnel dump, it must be friday...",
        "userID": "Grachus"
    },
    {
        "content": "quote: Originally posted by GlassOnion: If he fired this guy for being dumb - shouldn't he fire Nancy for not knowing that water-boarding is not something her servants do with her clothes – ya know the illegal immigrants she hires and pays 3-bucks per hr… Oh wait, they didn’t actually tell her they were torturing it was something about enhancements – probably breast implants or something – so she figured those nice terrorist fellas didn’t want enhancements so she turned off her hearing aid… Without going into the merits of Ms. Pelossi, there is only one group of people who can \"fire\" her. Those are the voters of her Congressional District. If you think I'm making this up, you can read the Constitution. quote: Originally posted by GlassOnion: So, does that mean we can get a REFUND for the 300-thousand dollars WASTED… can we deduct that from Obama’s check…? Just as soon as Mr. Bush forks over a couple of trillions of dollars for getting us into Iraq. Dave",
        "intTime": 20090508,
        "postID": 14,
        "quote": "Originally posted by GlassOnion: If he fired this guy for being dumb - shouldn't he fire Nancy for not knowing that water-boarding is not something her servants do with her clothes – ya know the illegal immigrants she hires and pays 3-bucks per hr… Oh wait, they didn’t actually tell her they were torturing it was something about enhancements – probably breast implants or something – so she figured those nice terrorist fellas didn’t want enhancements so she turned off her hearing aid…",
        "reply": " Without going into the merits of Ms. Pelossi, there is only one group of people who can \"fire\" her. Those are the voters of her Congressional District. If you think I'm making this up, you can read the Constitution. quote: Originally posted by GlassOnion: So, does that mean we can get a REFUND for the 300-thousand dollars WASTED… can we deduct that from Obama’s check…? Just as soon as Mr. Bush forks over a couple of trillions of dollars for getting us into Iraq. Dave",
        "threadID": "672198221_8850038222001",
        "time": "2009-05-08 16:41:00",
        "title": "0bama personnel dump, it must be friday...",
        "userID": "Grachus"
    },
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by GlassOnion: If he fired this guy for being dumb - shouldn't he fire Nancy for not knowing that water-boarding is not something her servants do with her clothes – ya know the illegal immigrants she hires and pays 3-bucks per hr… Oh wait, they didn’t actually tell her they were torturing it was something about enhancements – probably breast implants or something – so she figured those nice terrorist fellas didn’t want enhancements so she turned off her hearing aid… Without going into the merits of Ms. Pelossi, there is only one group of people who can \"fire\" her. Those are the voters of her Congressional District. If you think I'm making this up, you can read the Constitution. quote: Originally posted by GlassOnion: So, does that mean we can get a REFUND for the 300-thousand dollars WASTED… can we deduct that from Obama’s check…? Just as soon as Mr. Bush forks over a couple of trillions of dollars for getting us into Iraq. Dave They're spending more money in Afghanistan and Iraq this fiscal year (2010) than any year previous. Never got close to one trillion under Bush let alone two. 2007 was $78.1 billion, this appropriation is over $90 billion. (With ear marks) The total cost into the future was thought to run $2.4 trillion but now, is on someone else's ticket. And, the United State Congress approved every one of the nine special appropriations.",
        "intTime": 20090508,
        "postID": 15,
        "quote": "Originally posted by Grachus: quote: Originally posted by GlassOnion: If he fired this guy for being dumb - shouldn't he fire Nancy for not knowing that water-boarding is not something her servants do with her clothes – ya know the illegal immigrants she hires and pays 3-bucks per hr… Oh wait, they didn’t actually tell her they were torturing it was something about enhancements – probably breast implants or something – so she figured those nice terrorist fellas didn’t want enhancements so she turned off her hearing aid… Without going into the merits of Ms. Pelossi, there is only one group of people who can \"fire\" her. Those are the voters of her Congressional District. If you think I'm making this up, you can read the Constitution. quote: Originally posted by GlassOnion: So, does that mean we can get a REFUND for the 300-thousand dollars WASTED… can we deduct that from Obama’s check…? Just as soon as Mr. Bush forks over a couple of trillions of dollars for getting us into Iraq. Dave",
        "reply": " They're spending more money in Afghanistan and Iraq this fiscal year (2010) than any year previous. Never got close to one trillion under Bush let alone two. 2007 was $78.1 billion, this appropriation is over $90 billion. (With ear marks) The total cost into the future was thought to run $2.4 trillion but now, is on someone else's ticket. And, the United State Congress approved every one of the nine special appropriations.",
        "threadID": "672198221_8850038222001",
        "time": "2009-05-08 17:22:00",
        "title": "0bama personnel dump, it must be friday...",
        "userID": "rayevinsonsr"
    },
    {
        "content": "quote: Originally posted by rayevinsonsr: quote: Originally posted by Grachus: quote: Originally posted by GlassOnion: If he fired this guy for being dumb - shouldn't he fire Nancy for not knowing that water-boarding is not something her servants do with her clothes – ya know the illegal immigrants she hires and pays 3-bucks per hr… Oh wait, they didn’t actually tell her they were torturing it was something about enhancements – probably breast implants or something – so she figured those nice terrorist fellas didn’t want enhancements so she turned off her hearing aid… Without going into the merits of Ms. Pelossi, there is only one group of people who can \"fire\" her. Those are the voters of her Congressional District. If you think I'm making this up, you can read the Constitution. quote: Originally posted by GlassOnion: So, does that mean we can get a REFUND for the 300-thousand dollars WASTED… can we deduct that from Obama’s check…? Just as soon as Mr. Bush forks over a couple of trillions of dollars for getting us into Iraq. Dave They're spending more money in Afghanistan and Iraq this fiscal year (2010) than any year previous. Never got close to one trillion under Bush let alone two. 2007 was $78.1 billion, this appropriation is over $90 billion. (With ear marks) The total cost into the future was thought to run $2.4 trillion but now, is on someone else's ticket. And, the United State Congress approved every one of the nine special appropriations. Ray, Ray, Ray, I wont quibble over a trillion here or a trillion there... (And I didn't mention Afghanistan) Dave",
        "intTime": 20090508,
        "postID": 16,
        "quote": "Originally posted by rayevinsonsr: quote: Originally posted by Grachus: quote: Originally posted by GlassOnion: If he fired this guy for being dumb - shouldn't he fire Nancy for not knowing that water-boarding is not something her servants do with her clothes – ya know the illegal immigrants she hires and pays 3-bucks per hr… Oh wait, they didn’t actually tell her they were torturing it was something about enhancements – probably breast implants or something – so she figured those nice terrorist fellas didn’t want enhancements so she turned off her hearing aid… Without going into the merits of Ms. Pelossi, there is only one group of people who can \"fire\" her. Those are the voters of her Congressional District. If you think I'm making this up, you can read the Constitution. quote: Originally posted by GlassOnion: So, does that mean we can get a REFUND for the 300-thousand dollars WASTED… can we deduct that from Obama’s check…? Just as soon as Mr. Bush forks over a couple of trillions of dollars for getting us into Iraq. Dave They're spending more money in Afghanistan and Iraq this fiscal year (2010) than any year previous. Never got close to one trillion under Bush let alone two. 2007 was $78.1 billion, this appropriation is over $90 billion. (With ear marks) The total cost into the future was thought to run $2.4 trillion but now, is on someone else's ticket. And, the United State Congress approved every one of the nine special appropriations.",
        "reply": " Ray, Ray, Ray, I wont quibble over a trillion here or a trillion there... (And I didn't mention Afghanistan) Dave",
        "threadID": "672198221_8850038222001",
        "time": "2009-05-08 17:25:00",
        "title": "0bama personnel dump, it must be friday...",
        "userID": "Grachus"
    },
    {
        "content": "The guy being blamed for this is just a scapegoat. That is obvious. Ya'll are fooling yourselves if you think BO didn't know about it before it happened. It was his damn plane. Now he is letting someone else hang for it. What a guy.",
        "intTime": 20090508,
        "postID": 17,
        "quote": "",
        "reply": "The guy being blamed for this is just a scapegoat. That is obvious. Ya'll are fooling yourselves if you think BO didn't know about it before it happened. It was his damn plane. Now he is letting someone else hang for it. What a guy.",
        "threadID": "672198221_8850038222001",
        "time": "2009-05-08 17:44:00",
        "title": "0bama personnel dump, it must be friday...",
        "userID": "AngelHeart"
    },
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by GlassOnion: If he fired this guy for being dumb - shouldn't he fire Nancy for not knowing that water-boarding is not something her servants do with her clothes – ya know the illegal immigrants she hires and pays 3-bucks per hr… Oh wait, they didn’t actually tell her they were torturing it was something about enhancements – probably breast implants or something – so she figured those nice terrorist fellas didn’t want enhancements so she turned off her hearing aid… Without going into the merits of Ms. Pelossi, there is only one group of people who can \"fire\" her. Those are the voters of her Congressional District. If you think I'm making this up, you can read the Constitution. quote: Originally posted by GlassOnion: So, does that mean we can get a REFUND for the 300-thousand dollars WASTED… can we deduct that from Obama’s check…? Just as soon as Mr. Bush forks over a couple of trillions of dollars for getting us into Iraq. Dave gee, and I thought the senate voted on it too... and just remember Obama has SPENT more money in his first 100 DAYS than BUSH during his ENTIRE presidency... He has spent more than both Iraq & A-stan COMBINED... ...but dont' worry, of the 3.4 trillion dollar deficit Obama created - he was able to save us all 17-billion in cuts... BORDER CONTROL cuts and reduced spending on the high-tec equipment used to detect Nukes and Bio weapons at our ports... I gotta give to Obama - he is a true democrat holding to his socialist liberation views...",
        "intTime": 20090508,
        "postID": 18,
        "quote": "Originally posted by Grachus: quote: Originally posted by GlassOnion: If he fired this guy for being dumb - shouldn't he fire Nancy for not knowing that water-boarding is not something her servants do with her clothes – ya know the illegal immigrants she hires and pays 3-bucks per hr… Oh wait, they didn’t actually tell her they were torturing it was something about enhancements – probably breast implants or something – so she figured those nice terrorist fellas didn’t want enhancements so she turned off her hearing aid… Without going into the merits of Ms. Pelossi, there is only one group of people who can \"fire\" her. Those are the voters of her Congressional District. If you think I'm making this up, you can read the Constitution. quote: Originally posted by GlassOnion: So, does that mean we can get a REFUND for the 300-thousand dollars WASTED… can we deduct that from Obama’s check…? Just as soon as Mr. Bush forks over a couple of trillions of dollars for getting us into Iraq. Dave",
        "reply": " gee, and I thought the senate voted on it too... and just remember Obama has SPENT more money in his first 100 DAYS than BUSH during his ENTIRE presidency... He has spent more than both Iraq & A-stan COMBINED... ...but dont' worry, of the 3.4 trillion dollar deficit Obama created - he was able to save us all 17-billion in cuts... BORDER CONTROL cuts and reduced spending on the high-tec equipment used to detect Nukes and Bio weapons at our ports... I gotta give to Obama - he is a true democrat holding to his socialist liberation views...",
        "threadID": "672198221_8850038222001",
        "time": "2009-05-08 17:47:00",
        "title": "0bama personnel dump, it must be friday...",
        "userID": "GlassOnion"
    },
    {
        "content": "quote: Originally posted by AngelHeart: The guy being blamed for this is just a scapegoat. That is obvious. Ya'll are fooling yourselves if you think BO didn't know about it before it happened. It was his damn plane. Now he is letting someone else hang for it. What a guy. ...and that means he is consistent... he dumped his pastor and pulled a Pelosi all in one big hypocritical seizure... go-figure... ...another one under the bus...",
        "intTime": 20090508,
        "postID": 19,
        "quote": "Originally posted by AngelHeart: The guy being blamed for this is just a scapegoat. That is obvious. Ya'll are fooling yourselves if you think BO didn't know about it before it happened. It was his damn plane. Now he is letting someone else hang for it. What a guy.",
        "reply": " ...and that means he is consistent... he dumped his pastor and pulled a Pelosi all in one big hypocritical seizure... go-figure... ...another one under the bus...",
        "threadID": "672198221_8850038222001",
        "time": "2009-05-08 17:51:00",
        "title": "0bama personnel dump, it must be friday...",
        "userID": "GlassOnion"
    },
    {
        "content": "Yep, Want to hide news, release it on a Friday afternoon. XXXhttp://www.nydailynews.com/news/politics/2009/05/08/2009-05-08_white_house_aide_loses_job_over_manhattan_flyover_fiasco.htmlXXX White House aide Louis Caldera loses job over Manhattan flyover fiasco involving Air Force One WASHINGTON - The White House aide who authorized the controversial Air Force One photo-op flight last week around the Statue of Liberty is out of a job. President Obama has accepted the resignation of Louis Caldera, the director of the White House Military Office, the Daily News learned Friday By the way, the F-16D escort for Scare Force One was a RedTail, anyone know the significance of that?",
        "intTime": 20090508,
        "postID": 20,
        "quote": "",
        "reply": "Yep, Want to hide news, release it on a Friday afternoon. XXXhttp://www.nydailynews.com/news/politics/2009/05/08/2009-05-08_white_house_aide_loses_job_over_manhattan_flyover_fiasco.htmlXXX White House aide Louis Caldera loses job over Manhattan flyover fiasco involving Air Force One WASHINGTON - The White House aide who authorized the controversial Air Force One photo-op flight last week around the Statue of Liberty is out of a job. President Obama has accepted the resignation of Louis Caldera, the director of the White House Military Office, the Daily News learned Friday By the way, the F-16D escort for Scare Force One was a RedTail, anyone know the significance of that?",
        "threadID": "672198221_8850038222001",
        "time": "2009-05-08 14:09:00",
        "title": "0bama personnel dump, it must be friday...",
        "userID": "LineDoggie"
    },
    {
        "content": "Wonder if there will be a book out about it. What does the RED mean?",
        "intTime": 20090508,
        "postID": 21,
        "quote": "",
        "reply": "Wonder if there will be a book out about it. What does the RED mean?",
        "threadID": "672198221_8850038222001",
        "time": "2009-05-08 14:13:00",
        "title": "0bama personnel dump, it must be friday...",
        "userID": "ACR26"
    },
    {
        "content": "So your complaining that when some one messes up they get the sack instead of a pat on the back with A \"good job brownie\"? Desperation, Just out and out Desperation?",
        "intTime": 20090508,
        "postID": 22,
        "quote": "",
        "reply": "So your complaining that when some one messes up they get the sack instead of a pat on the back with A \"good job brownie\"? Desperation, Just out and out Desperation?",
        "threadID": "672198221_8850038222001",
        "time": "2009-05-08 14:23:00",
        "title": "0bama personnel dump, it must be friday...",
        "userID": "A_Savage"
    },
    {
        "content": "typical politics as always, if it had gone over well there would have been \"ku-do's\" all around.. as it came out someone had to pay and it twernt gonna be PO. I wonder if Patooie was briefed on this flight. Hmmmmm, vlery-in-ter-est-ting. One Flag......One Heart......One Nation............EVERMORE",
        "intTime": 20090508,
        "postID": 23,
        "quote": "",
        "reply": "typical politics as always, if it had gone over well there would have been \"ku-do's\" all around.. as it came out someone had to pay and it twernt gonna be PO. I wonder if Patooie was briefed on this flight. Hmmmmm, vlery-in-ter-est-ting. One Flag......One Heart......One Nation............EVERMORE",
        "threadID": "672198221_8850038222001",
        "time": "2009-05-08 14:30:00",
        "title": "0bama personnel dump, it must be friday...",
        "userID": "m551sheridan"
    },
    {
        "content": "quote: Originally posted by A_Savage: So your complaining that when some one messes up they get the sack instead of a pat on the back with A \"good job brownie\"? Desperation, Just out and out Desperation? Almost grotesque that he's being criticised for doing what Mr. Bush would never dream of doing. How novel? Someone being held accountable. Why, why, it's almost unAmerican... Dave",
        "intTime": 20090508,
        "postID": 24,
        "quote": "Originally posted by A_Savage: So your complaining that when some one messes up they get the sack instead of a pat on the back with A \"good job brownie\"? Desperation, Just out and out Desperation?",
        "reply": " Almost grotesque that he's being criticised for doing what Mr. Bush would never dream of doing. How novel? Someone being held accountable. Why, why, it's almost unAmerican... Dave",
        "threadID": "672198221_8850038222001",
        "time": "2009-05-08 14:36:00",
        "title": "0bama personnel dump, it must be friday...",
        "userID": "Grachus"
    },
    {
        "content": "President Obama fired a guy for not communicating properly about a publicity photo and causing a panic in New York City where people are still traumatized by 9/11. Obviously the guy is not up to the job. Firing him is what any good leader would do. Do you think he should have got a medal like George “slam dunk” Tenet?",
        "intTime": 20090508,
        "postID": 25,
        "quote": "",
        "reply": "President Obama fired a guy for not communicating properly about a publicity photo and causing a panic in New York City where people are still traumatized by 9/11. Obviously the guy is not up to the job. Firing him is what any good leader would do. Do you think he should have got a medal like George “slam dunk” Tenet?",
        "threadID": "672198221_8850038222001",
        "time": "2009-05-08 14:39:00",
        "title": "0bama personnel dump, it must be friday...",
        "userID": "xerello"
    },
    {
        "content": "quote: Originally posted by xerello: President Obama fired a guy for not communicating properly about a publicity photo and causing a panic in New York City where people are still traumatized by 9/11. Obviously the guy is not up to the job. Firing him is what any good leader would do. Do you think he should have got a medal like George “slam dunk” Tenet? Dagnabit -- I just spent 10 minutes hunting that picture of it will be a slam dunk trent up myself. Is really a shame when folks are damning Obama for holding the people under him as responsible for the mistakes they make. -- Savage",
        "intTime": 20090508,
        "postID": 26,
        "quote": "Originally posted by xerello: President Obama fired a guy for not communicating properly about a publicity photo and causing a panic in New York City where people are still traumatized by 9/11. Obviously the guy is not up to the job. Firing him is what any good leader would do. Do you think he should have got a medal like George “slam dunk” Tenet?",
        "reply": " Dagnabit -- I just spent 10 minutes hunting that picture of it will be a slam dunk trent up myself. Is really a shame when folks are damning Obama for holding the people under him as responsible for the mistakes they make. -- Savage",
        "threadID": "672198221_8850038222001",
        "time": "2009-05-08 14:46:00",
        "title": "0bama personnel dump, it must be friday...",
        "userID": "A_Savage"
    },
    {
        "content": "quote: Originally posted by LineDoggie: Yep, Want to hide news, release it on a Friday afternoon. XXXhttp://www.nydailynews.com/news/politics/2009/05/08/2009-05-08_white_house_aide_loses_job_over_manhattan_flyover_fiasco.htmlXXX White House aide Louis Caldera loses job over Manhattan flyover fiasco involving Air Force One WASHINGTON - The White House aide who authorized the controversial Air Force One photo-op flight last week around the Statue of Liberty is out of a job. President Obama has accepted the resignation of Louis Caldera, the director of the White House Military Office, the Daily News learned Friday So ... what's your point? Obviously this news wasn't very well hidden if YOU found it. And seriously -- would you rather Pres. Obama keep this bonehead on the payroll?",
        "intTime": 20090508,
        "postID": 27,
        "quote": "Originally posted by LineDoggie: Yep, Want to hide news, release it on a Friday afternoon. XXXhttp://www.nydailynews.com/news/politics/2009/05/08/2009-05-08_white_house_aide_loses_job_over_manhattan_flyover_fiasco.htmlXXX White House aide Louis Caldera loses job over Manhattan flyover fiasco involving Air Force One WASHINGTON - The White House aide who authorized the controversial Air Force One photo-op flight last week around the Statue of Liberty is out of a job. President Obama has accepted the resignation of Louis Caldera, the director of the White House Military Office, the Daily News learned Friday",
        "reply": " So ... what's your point? Obviously this news wasn't very well hidden if YOU found it. And seriously -- would you rather Pres. Obama keep this bonehead on the payroll?",
        "threadID": "672198221_8850038222001",
        "time": "2009-05-08 14:51:00",
        "title": "0bama personnel dump, it must be friday...",
        "userID": "1WW"
    },
    {
        "content": "quote: Originally posted by klassylady25: Amidst the racial naysayers during WWII, the first African-American fighter pilots were commissioned in 1941 to help defend distressed bombers in the European theater. Known as the Tuskegee Airmen, these forgotten pilots fought with bravery and skill to save lives and prevent the loss of bombers to enemy fighters. Tuskegee Airmen of World War II The Fifteenth's Red Tail Angels 'http://www.tuskegeeairmen.org/' 'http://www.globalindex.com/kwanzaa/tuskegee/red_tail_angels.htm' You got it, Redtails were the Tuskeegee Airman of WWII Fame. The F-16D escort came from Alabama's 187th Fighter Wing. http://www.almont.ang.af.mil/default.htm Now why would you need an escort fighter from Alabama for a New York City Flight, when Macguire AFB in New Jersey is 30 Minutes away as the crow flies,and the 177th Fighter Wing NJ ANG is based out of Atlantic City, NJ? Odd, Aint it?",
        "intTime": 20090508,
        "postID": 28,
        "quote": "Originally posted by klassylady25: Amidst the racial naysayers during WWII, the first African-American fighter pilots were commissioned in 1941 to help defend distressed bombers in the European theater. Known as the Tuskegee Airmen, these forgotten pilots fought with bravery and skill to save lives and prevent the loss of bombers to enemy fighters. Tuskegee Airmen of World War II The Fifteenth's Red Tail Angels 'http://www.tuskegeeairmen.org/' 'http://www.globalindex.com/kwanzaa/tuskegee/red_tail_angels.htm'",
        "reply": " You got it, Redtails were the Tuskeegee Airman of WWII Fame. The F-16D escort came from Alabama's 187th Fighter Wing. http://www.almont.ang.af.mil/default.htm Now why would you need an escort fighter from Alabama for a New York City Flight, when Macguire AFB in New Jersey is 30 Minutes away as the crow flies,and the 177th Fighter Wing NJ ANG is based out of Atlantic City, NJ? Odd, Aint it?",
        "threadID": "672198221_8850038222001",
        "time": "2009-05-08 15:22:00",
        "title": "0bama personnel dump, it must be friday...",
        "userID": "LineDoggie"
    },
    {
        "content": "quote: Originally posted by A_Savage: So your complaining that when some one messes up they get the sack instead of a pat on the back with A \"good job brownie\"? Desperation, Just out and out Desperation? Sadly, your projecting your thoughts to this thread. Please try reading comprehension next time instead of Knee Jerking if you wish to have an intelligent discussion on this topic.",
        "intTime": 20090508,
        "postID": 29,
        "quote": "Originally posted by A_Savage: So your complaining that when some one messes up they get the sack instead of a pat on the back with A \"good job brownie\"? Desperation, Just out and out Desperation?",
        "reply": " Sadly, your projecting your thoughts to this thread. Please try reading comprehension next time instead of Knee Jerking if you wish to have an intelligent discussion on this topic.",
        "threadID": "672198221_8850038222001",
        "time": "2009-05-08 15:28:00",
        "title": "0bama personnel dump, it must be friday...",
        "userID": "LineDoggie"
    },
    {
        "content": "quote: Originally posted by A_Savage: So your complaining that when some one messes up they get the sack instead of a pat on the back with A \"good job brownie\"? Desperation, Just out and out Desperation? Use the dictionary next time. Look up the word \"resignation\" and compare it to \"fired\". He resigned. A bit of a difference there.",
        "intTime": 20090508,
        "postID": 30,
        "quote": "Originally posted by A_Savage: So your complaining that when some one messes up they get the sack instead of a pat on the back with A \"good job brownie\"? Desperation, Just out and out Desperation?",
        "reply": " Use the dictionary next time. Look up the word \"resignation\" and compare it to \"fired\". He resigned. A bit of a difference there.",
        "threadID": "672198221_8850038222001",
        "time": "2009-05-08 15:32:00",
        "title": "0bama personnel dump, it must be friday...",
        "userID": "crackerjacks61"
    },
    {
        "content": "If he fired this guy for being dumb - shouldn't he fire Nancy for not knowing that water-boarding is not something her servants do with her clothes – ya know the illegal immigrants she hires and pays 3-bucks per hr… Oh wait, they didn’t actually tell her they were torturing it was something about enhancements – probably breast implants or something – so she figured those nice terrorist fellas didn’t want enhancements so she turned off her hearing aid… So, does that mean we can get a REFUND for the 300-thousand dollars WASTED… can we deduct that from Obama’s check…?",
        "intTime": 20090508,
        "postID": 31,
        "quote": "",
        "reply": "If he fired this guy for being dumb - shouldn't he fire Nancy for not knowing that water-boarding is not something her servants do with her clothes – ya know the illegal immigrants she hires and pays 3-bucks per hr… Oh wait, they didn’t actually tell her they were torturing it was something about enhancements – probably breast implants or something – so she figured those nice terrorist fellas didn’t want enhancements so she turned off her hearing aid… So, does that mean we can get a REFUND for the 300-thousand dollars WASTED… can we deduct that from Obama’s check…?",
        "threadID": "672198221_8850038222001",
        "time": "2009-05-08 15:40:00",
        "title": "0bama personnel dump, it must be friday...",
        "userID": "GlassOnion"
    },
    {
        "content": "quote: Originally posted by crackerjacks61: quote: Originally posted by A_Savage: So your complaining that when some one messes up they get the sack instead of a pat on the back with A \"good job brownie\"? Desperation, Just out and out Desperation? Use the dictionary next time. Look up the word \"resignation\" and compare it to \"fired\". He resigned. A bit of a difference there. Say what? You can count on one hand the number of people who were \"fired\" from government over the last 200 years. They get a chance to \"resign.\" Dave",
        "intTime": 20090508,
        "postID": 32,
        "quote": "Originally posted by crackerjacks61: quote: Originally posted by A_Savage: So your complaining that when some one messes up they get the sack instead of a pat on the back with A \"good job brownie\"? Desperation, Just out and out Desperation? Use the dictionary next time. Look up the word \"resignation\" and compare it to \"fired\". He resigned. A bit of a difference there.",
        "reply": " Say what? You can count on one hand the number of people who were \"fired\" from government over the last 200 years. They get a chance to \"resign.\" Dave",
        "threadID": "672198221_8850038222001",
        "time": "2009-05-08 16:39:00",
        "title": "0bama personnel dump, it must be friday...",
        "userID": "Grachus"
    },
    {
        "content": "quote: Originally posted by GlassOnion: If he fired this guy for being dumb - shouldn't he fire Nancy for not knowing that water-boarding is not something her servants do with her clothes – ya know the illegal immigrants she hires and pays 3-bucks per hr… Oh wait, they didn’t actually tell her they were torturing it was something about enhancements – probably breast implants or something – so she figured those nice terrorist fellas didn’t want enhancements so she turned off her hearing aid… Without going into the merits of Ms. Pelossi, there is only one group of people who can \"fire\" her. Those are the voters of her Congressional District. If you think I'm making this up, you can read the Constitution. quote: Originally posted by GlassOnion: So, does that mean we can get a REFUND for the 300-thousand dollars WASTED… can we deduct that from Obama’s check…? Just as soon as Mr. Bush forks over a couple of trillions of dollars for getting us into Iraq. Dave",
        "intTime": 20090508,
        "postID": 33,
        "quote": "Originally posted by GlassOnion: If he fired this guy for being dumb - shouldn't he fire Nancy for not knowing that water-boarding is not something her servants do with her clothes – ya know the illegal immigrants she hires and pays 3-bucks per hr… Oh wait, they didn’t actually tell her they were torturing it was something about enhancements – probably breast implants or something – so she figured those nice terrorist fellas didn’t want enhancements so she turned off her hearing aid…",
        "reply": " Without going into the merits of Ms. Pelossi, there is only one group of people who can \"fire\" her. Those are the voters of her Congressional District. If you think I'm making this up, you can read the Constitution. quote: Originally posted by GlassOnion: So, does that mean we can get a REFUND for the 300-thousand dollars WASTED… can we deduct that from Obama’s check…? Just as soon as Mr. Bush forks over a couple of trillions of dollars for getting us into Iraq. Dave",
        "threadID": "672198221_8850038222001",
        "time": "2009-05-08 16:41:00",
        "title": "0bama personnel dump, it must be friday...",
        "userID": "Grachus"
    },
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by GlassOnion: If he fired this guy for being dumb - shouldn't he fire Nancy for not knowing that water-boarding is not something her servants do with her clothes – ya know the illegal immigrants she hires and pays 3-bucks per hr… Oh wait, they didn’t actually tell her they were torturing it was something about enhancements – probably breast implants or something – so she figured those nice terrorist fellas didn’t want enhancements so she turned off her hearing aid… Without going into the merits of Ms. Pelossi, there is only one group of people who can \"fire\" her. Those are the voters of her Congressional District. If you think I'm making this up, you can read the Constitution. quote: Originally posted by GlassOnion: So, does that mean we can get a REFUND for the 300-thousand dollars WASTED… can we deduct that from Obama’s check…? Just as soon as Mr. Bush forks over a couple of trillions of dollars for getting us into Iraq. Dave They're spending more money in Afghanistan and Iraq this fiscal year (2010) than any year previous. Never got close to one trillion under Bush let alone two. 2007 was $78.1 billion, this appropriation is over $90 billion. (With ear marks) The total cost into the future was thought to run $2.4 trillion but now, is on someone else's ticket. And, the United State Congress approved every one of the nine special appropriations.",
        "intTime": 20090508,
        "postID": 34,
        "quote": "Originally posted by Grachus: quote: Originally posted by GlassOnion: If he fired this guy for being dumb - shouldn't he fire Nancy for not knowing that water-boarding is not something her servants do with her clothes – ya know the illegal immigrants she hires and pays 3-bucks per hr… Oh wait, they didn’t actually tell her they were torturing it was something about enhancements – probably breast implants or something – so she figured those nice terrorist fellas didn’t want enhancements so she turned off her hearing aid… Without going into the merits of Ms. Pelossi, there is only one group of people who can \"fire\" her. Those are the voters of her Congressional District. If you think I'm making this up, you can read the Constitution. quote: Originally posted by GlassOnion: So, does that mean we can get a REFUND for the 300-thousand dollars WASTED… can we deduct that from Obama’s check…? Just as soon as Mr. Bush forks over a couple of trillions of dollars for getting us into Iraq. Dave",
        "reply": " They're spending more money in Afghanistan and Iraq this fiscal year (2010) than any year previous. Never got close to one trillion under Bush let alone two. 2007 was $78.1 billion, this appropriation is over $90 billion. (With ear marks) The total cost into the future was thought to run $2.4 trillion but now, is on someone else's ticket. And, the United State Congress approved every one of the nine special appropriations.",
        "threadID": "672198221_8850038222001",
        "time": "2009-05-08 17:22:00",
        "title": "0bama personnel dump, it must be friday...",
        "userID": "rayevinsonsr"
    },
    {
        "content": "quote: Originally posted by rayevinsonsr: quote: Originally posted by Grachus: quote: Originally posted by GlassOnion: If he fired this guy for being dumb - shouldn't he fire Nancy for not knowing that water-boarding is not something her servants do with her clothes – ya know the illegal immigrants she hires and pays 3-bucks per hr… Oh wait, they didn’t actually tell her they were torturing it was something about enhancements – probably breast implants or something – so she figured those nice terrorist fellas didn’t want enhancements so she turned off her hearing aid… Without going into the merits of Ms. Pelossi, there is only one group of people who can \"fire\" her. Those are the voters of her Congressional District. If you think I'm making this up, you can read the Constitution. quote: Originally posted by GlassOnion: So, does that mean we can get a REFUND for the 300-thousand dollars WASTED… can we deduct that from Obama’s check…? Just as soon as Mr. Bush forks over a couple of trillions of dollars for getting us into Iraq. Dave They're spending more money in Afghanistan and Iraq this fiscal year (2010) than any year previous. Never got close to one trillion under Bush let alone two. 2007 was $78.1 billion, this appropriation is over $90 billion. (With ear marks) The total cost into the future was thought to run $2.4 trillion but now, is on someone else's ticket. And, the United State Congress approved every one of the nine special appropriations. Ray, Ray, Ray, I wont quibble over a trillion here or a trillion there... (And I didn't mention Afghanistan) Dave",
        "intTime": 20090508,
        "postID": 35,
        "quote": "Originally posted by rayevinsonsr: quote: Originally posted by Grachus: quote: Originally posted by GlassOnion: If he fired this guy for being dumb - shouldn't he fire Nancy for not knowing that water-boarding is not something her servants do with her clothes – ya know the illegal immigrants she hires and pays 3-bucks per hr… Oh wait, they didn’t actually tell her they were torturing it was something about enhancements – probably breast implants or something – so she figured those nice terrorist fellas didn’t want enhancements so she turned off her hearing aid… Without going into the merits of Ms. Pelossi, there is only one group of people who can \"fire\" her. Those are the voters of her Congressional District. If you think I'm making this up, you can read the Constitution. quote: Originally posted by GlassOnion: So, does that mean we can get a REFUND for the 300-thousand dollars WASTED… can we deduct that from Obama’s check…? Just as soon as Mr. Bush forks over a couple of trillions of dollars for getting us into Iraq. Dave They're spending more money in Afghanistan and Iraq this fiscal year (2010) than any year previous. Never got close to one trillion under Bush let alone two. 2007 was $78.1 billion, this appropriation is over $90 billion. (With ear marks) The total cost into the future was thought to run $2.4 trillion but now, is on someone else's ticket. And, the United State Congress approved every one of the nine special appropriations.",
        "reply": " Ray, Ray, Ray, I wont quibble over a trillion here or a trillion there... (And I didn't mention Afghanistan) Dave",
        "threadID": "672198221_8850038222001",
        "time": "2009-05-08 17:25:00",
        "title": "0bama personnel dump, it must be friday...",
        "userID": "Grachus"
    },
    {
        "content": "The guy being blamed for this is just a scapegoat. That is obvious. Ya'll are fooling yourselves if you think BO didn't know about it before it happened. It was his damn plane. Now he is letting someone else hang for it. What a guy.",
        "intTime": 20090508,
        "postID": 36,
        "quote": "",
        "reply": "The guy being blamed for this is just a scapegoat. That is obvious. Ya'll are fooling yourselves if you think BO didn't know about it before it happened. It was his damn plane. Now he is letting someone else hang for it. What a guy.",
        "threadID": "672198221_8850038222001",
        "time": "2009-05-08 17:44:00",
        "title": "0bama personnel dump, it must be friday...",
        "userID": "AngelHeart"
    },
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by GlassOnion: If he fired this guy for being dumb - shouldn't he fire Nancy for not knowing that water-boarding is not something her servants do with her clothes – ya know the illegal immigrants she hires and pays 3-bucks per hr… Oh wait, they didn’t actually tell her they were torturing it was something about enhancements – probably breast implants or something – so she figured those nice terrorist fellas didn’t want enhancements so she turned off her hearing aid… Without going into the merits of Ms. Pelossi, there is only one group of people who can \"fire\" her. Those are the voters of her Congressional District. If you think I'm making this up, you can read the Constitution. quote: Originally posted by GlassOnion: So, does that mean we can get a REFUND for the 300-thousand dollars WASTED… can we deduct that from Obama’s check…? Just as soon as Mr. Bush forks over a couple of trillions of dollars for getting us into Iraq. Dave gee, and I thought the senate voted on it too... and just remember Obama has SPENT more money in his first 100 DAYS than BUSH during his ENTIRE presidency... He has spent more than both Iraq & A-stan COMBINED... ...but dont' worry, of the 3.4 trillion dollar deficit Obama created - he was able to save us all 17-billion in cuts... BORDER CONTROL cuts and reduced spending on the high-tec equipment used to detect Nukes and Bio weapons at our ports... I gotta give to Obama - he is a true democrat holding to his socialist liberation views...",
        "intTime": 20090508,
        "postID": 37,
        "quote": "Originally posted by Grachus: quote: Originally posted by GlassOnion: If he fired this guy for being dumb - shouldn't he fire Nancy for not knowing that water-boarding is not something her servants do with her clothes – ya know the illegal immigrants she hires and pays 3-bucks per hr… Oh wait, they didn’t actually tell her they were torturing it was something about enhancements – probably breast implants or something – so she figured those nice terrorist fellas didn’t want enhancements so she turned off her hearing aid… Without going into the merits of Ms. Pelossi, there is only one group of people who can \"fire\" her. Those are the voters of her Congressional District. If you think I'm making this up, you can read the Constitution. quote: Originally posted by GlassOnion: So, does that mean we can get a REFUND for the 300-thousand dollars WASTED… can we deduct that from Obama’s check…? Just as soon as Mr. Bush forks over a couple of trillions of dollars for getting us into Iraq. Dave",
        "reply": " gee, and I thought the senate voted on it too... and just remember Obama has SPENT more money in his first 100 DAYS than BUSH during his ENTIRE presidency... He has spent more than both Iraq & A-stan COMBINED... ...but dont' worry, of the 3.4 trillion dollar deficit Obama created - he was able to save us all 17-billion in cuts... BORDER CONTROL cuts and reduced spending on the high-tec equipment used to detect Nukes and Bio weapons at our ports... I gotta give to Obama - he is a true democrat holding to his socialist liberation views...",
        "threadID": "672198221_8850038222001",
        "time": "2009-05-08 17:47:00",
        "title": "0bama personnel dump, it must be friday...",
        "userID": "GlassOnion"
    },
    {
        "content": "quote: Originally posted by AngelHeart: The guy being blamed for this is just a scapegoat. That is obvious. Ya'll are fooling yourselves if you think BO didn't know about it before it happened. It was his damn plane. Now he is letting someone else hang for it. What a guy. ...and that means he is consistent... he dumped his pastor and pulled a Pelosi all in one big hypocritical seizure... go-figure... ...another one under the bus...",
        "intTime": 20090508,
        "postID": 38,
        "quote": "Originally posted by AngelHeart: The guy being blamed for this is just a scapegoat. That is obvious. Ya'll are fooling yourselves if you think BO didn't know about it before it happened. It was his damn plane. Now he is letting someone else hang for it. What a guy.",
        "reply": " ...and that means he is consistent... he dumped his pastor and pulled a Pelosi all in one big hypocritical seizure... go-figure... ...another one under the bus...",
        "threadID": "672198221_8850038222001",
        "time": "2009-05-08 17:51:00",
        "title": "0bama personnel dump, it must be friday...",
        "userID": "GlassOnion"
    },
    {
        "content": "Yep, Want to hide news, release it on a Friday afternoon. XXXhttp://www.nydailynews.com/news/politics/2009/05/08/2009-05-08_white_house_aide_loses_job_over_manhattan_flyover_fiasco.htmlXXX White House aide Louis Caldera loses job over Manhattan flyover fiasco involving Air Force One WASHINGTON - The White House aide who authorized the controversial Air Force One photo-op flight last week around the Statue of Liberty is out of a job. President Obama has accepted the resignation of Louis Caldera, the director of the White House Military Office, the Daily News learned Friday By the way, the F-16D escort for Scare Force One was a RedTail, anyone know the significance of that?",
        "intTime": 20090508,
        "postID": 39,
        "quote": "",
        "reply": "Yep, Want to hide news, release it on a Friday afternoon. XXXhttp://www.nydailynews.com/news/politics/2009/05/08/2009-05-08_white_house_aide_loses_job_over_manhattan_flyover_fiasco.htmlXXX White House aide Louis Caldera loses job over Manhattan flyover fiasco involving Air Force One WASHINGTON - The White House aide who authorized the controversial Air Force One photo-op flight last week around the Statue of Liberty is out of a job. President Obama has accepted the resignation of Louis Caldera, the director of the White House Military Office, the Daily News learned Friday By the way, the F-16D escort for Scare Force One was a RedTail, anyone know the significance of that?",
        "threadID": "672198221_8850038222001",
        "time": "2009-05-08 14:09:00",
        "title": "0bama personnel dump, it must be friday...",
        "userID": "LineDoggie"
    },
    {
        "content": "Wonder if there will be a book out about it. What does the RED mean?",
        "intTime": 20090508,
        "postID": 40,
        "quote": "",
        "reply": "Wonder if there will be a book out about it. What does the RED mean?",
        "threadID": "672198221_8850038222001",
        "time": "2009-05-08 14:13:00",
        "title": "0bama personnel dump, it must be friday...",
        "userID": "ACR26"
    },
    {
        "content": "So your complaining that when some one messes up they get the sack instead of a pat on the back with A \"good job brownie\"? Desperation, Just out and out Desperation?",
        "intTime": 20090508,
        "postID": 41,
        "quote": "",
        "reply": "So your complaining that when some one messes up they get the sack instead of a pat on the back with A \"good job brownie\"? Desperation, Just out and out Desperation?",
        "threadID": "672198221_8850038222001",
        "time": "2009-05-08 14:23:00",
        "title": "0bama personnel dump, it must be friday...",
        "userID": "A_Savage"
    },
    {
        "content": "typical politics as always, if it had gone over well there would have been \"ku-do's\" all around.. as it came out someone had to pay and it twernt gonna be PO. I wonder if Patooie was briefed on this flight. Hmmmmm, vlery-in-ter-est-ting. One Flag......One Heart......One Nation............EVERMORE",
        "intTime": 20090508,
        "postID": 42,
        "quote": "",
        "reply": "typical politics as always, if it had gone over well there would have been \"ku-do's\" all around.. as it came out someone had to pay and it twernt gonna be PO. I wonder if Patooie was briefed on this flight. Hmmmmm, vlery-in-ter-est-ting. One Flag......One Heart......One Nation............EVERMORE",
        "threadID": "672198221_8850038222001",
        "time": "2009-05-08 14:30:00",
        "title": "0bama personnel dump, it must be friday...",
        "userID": "m551sheridan"
    },
    {
        "content": "quote: Originally posted by A_Savage: So your complaining that when some one messes up they get the sack instead of a pat on the back with A \"good job brownie\"? Desperation, Just out and out Desperation? Almost grotesque that he's being criticised for doing what Mr. Bush would never dream of doing. How novel? Someone being held accountable. Why, why, it's almost unAmerican... Dave",
        "intTime": 20090508,
        "postID": 43,
        "quote": "Originally posted by A_Savage: So your complaining that when some one messes up they get the sack instead of a pat on the back with A \"good job brownie\"? Desperation, Just out and out Desperation?",
        "reply": " Almost grotesque that he's being criticised for doing what Mr. Bush would never dream of doing. How novel? Someone being held accountable. Why, why, it's almost unAmerican... Dave",
        "threadID": "672198221_8850038222001",
        "time": "2009-05-08 14:36:00",
        "title": "0bama personnel dump, it must be friday...",
        "userID": "Grachus"
    },
    {
        "content": "President Obama fired a guy for not communicating properly about a publicity photo and causing a panic in New York City where people are still traumatized by 9/11. Obviously the guy is not up to the job. Firing him is what any good leader would do. Do you think he should have got a medal like George “slam dunk” Tenet?",
        "intTime": 20090508,
        "postID": 44,
        "quote": "",
        "reply": "President Obama fired a guy for not communicating properly about a publicity photo and causing a panic in New York City where people are still traumatized by 9/11. Obviously the guy is not up to the job. Firing him is what any good leader would do. Do you think he should have got a medal like George “slam dunk” Tenet?",
        "threadID": "672198221_8850038222001",
        "time": "2009-05-08 14:39:00",
        "title": "0bama personnel dump, it must be friday...",
        "userID": "xerello"
    },
    {
        "content": "quote: Originally posted by xerello: President Obama fired a guy for not communicating properly about a publicity photo and causing a panic in New York City where people are still traumatized by 9/11. Obviously the guy is not up to the job. Firing him is what any good leader would do. Do you think he should have got a medal like George “slam dunk” Tenet? Dagnabit -- I just spent 10 minutes hunting that picture of it will be a slam dunk trent up myself. Is really a shame when folks are damning Obama for holding the people under him as responsible for the mistakes they make. -- Savage",
        "intTime": 20090508,
        "postID": 45,
        "quote": "Originally posted by xerello: President Obama fired a guy for not communicating properly about a publicity photo and causing a panic in New York City where people are still traumatized by 9/11. Obviously the guy is not up to the job. Firing him is what any good leader would do. Do you think he should have got a medal like George “slam dunk” Tenet?",
        "reply": " Dagnabit -- I just spent 10 minutes hunting that picture of it will be a slam dunk trent up myself. Is really a shame when folks are damning Obama for holding the people under him as responsible for the mistakes they make. -- Savage",
        "threadID": "672198221_8850038222001",
        "time": "2009-05-08 14:46:00",
        "title": "0bama personnel dump, it must be friday...",
        "userID": "A_Savage"
    },
    {
        "content": "quote: Originally posted by LineDoggie: Yep, Want to hide news, release it on a Friday afternoon. XXXhttp://www.nydailynews.com/news/politics/2009/05/08/2009-05-08_white_house_aide_loses_job_over_manhattan_flyover_fiasco.htmlXXX White House aide Louis Caldera loses job over Manhattan flyover fiasco involving Air Force One WASHINGTON - The White House aide who authorized the controversial Air Force One photo-op flight last week around the Statue of Liberty is out of a job. President Obama has accepted the resignation of Louis Caldera, the director of the White House Military Office, the Daily News learned Friday So ... what's your point? Obviously this news wasn't very well hidden if YOU found it. And seriously -- would you rather Pres. Obama keep this bonehead on the payroll?",
        "intTime": 20090508,
        "postID": 46,
        "quote": "Originally posted by LineDoggie: Yep, Want to hide news, release it on a Friday afternoon. XXXhttp://www.nydailynews.com/news/politics/2009/05/08/2009-05-08_white_house_aide_loses_job_over_manhattan_flyover_fiasco.htmlXXX White House aide Louis Caldera loses job over Manhattan flyover fiasco involving Air Force One WASHINGTON - The White House aide who authorized the controversial Air Force One photo-op flight last week around the Statue of Liberty is out of a job. President Obama has accepted the resignation of Louis Caldera, the director of the White House Military Office, the Daily News learned Friday",
        "reply": " So ... what's your point? Obviously this news wasn't very well hidden if YOU found it. And seriously -- would you rather Pres. Obama keep this bonehead on the payroll?",
        "threadID": "672198221_8850038222001",
        "time": "2009-05-08 14:51:00",
        "title": "0bama personnel dump, it must be friday...",
        "userID": "1WW"
    },
    {
        "content": "quote: Originally posted by klassylady25: Amidst the racial naysayers during WWII, the first African-American fighter pilots were commissioned in 1941 to help defend distressed bombers in the European theater. Known as the Tuskegee Airmen, these forgotten pilots fought with bravery and skill to save lives and prevent the loss of bombers to enemy fighters. Tuskegee Airmen of World War II The Fifteenth's Red Tail Angels 'http://www.tuskegeeairmen.org/' 'http://www.globalindex.com/kwanzaa/tuskegee/red_tail_angels.htm' You got it, Redtails were the Tuskeegee Airman of WWII Fame. The F-16D escort came from Alabama's 187th Fighter Wing. http://www.almont.ang.af.mil/default.htm Now why would you need an escort fighter from Alabama for a New York City Flight, when Macguire AFB in New Jersey is 30 Minutes away as the crow flies,and the 177th Fighter Wing NJ ANG is based out of Atlantic City, NJ? Odd, Aint it?",
        "intTime": 20090508,
        "postID": 47,
        "quote": "Originally posted by klassylady25: Amidst the racial naysayers during WWII, the first African-American fighter pilots were commissioned in 1941 to help defend distressed bombers in the European theater. Known as the Tuskegee Airmen, these forgotten pilots fought with bravery and skill to save lives and prevent the loss of bombers to enemy fighters. Tuskegee Airmen of World War II The Fifteenth's Red Tail Angels 'http://www.tuskegeeairmen.org/' 'http://www.globalindex.com/kwanzaa/tuskegee/red_tail_angels.htm'",
        "reply": " You got it, Redtails were the Tuskeegee Airman of WWII Fame. The F-16D escort came from Alabama's 187th Fighter Wing. http://www.almont.ang.af.mil/default.htm Now why would you need an escort fighter from Alabama for a New York City Flight, when Macguire AFB in New Jersey is 30 Minutes away as the crow flies,and the 177th Fighter Wing NJ ANG is based out of Atlantic City, NJ? Odd, Aint it?",
        "threadID": "672198221_8850038222001",
        "time": "2009-05-08 15:22:00",
        "title": "0bama personnel dump, it must be friday...",
        "userID": "LineDoggie"
    },
    {
        "content": "quote: Originally posted by A_Savage: So your complaining that when some one messes up they get the sack instead of a pat on the back with A \"good job brownie\"? Desperation, Just out and out Desperation? Sadly, your projecting your thoughts to this thread. Please try reading comprehension next time instead of Knee Jerking if you wish to have an intelligent discussion on this topic.",
        "intTime": 20090508,
        "postID": 48,
        "quote": "Originally posted by A_Savage: So your complaining that when some one messes up they get the sack instead of a pat on the back with A \"good job brownie\"? Desperation, Just out and out Desperation?",
        "reply": " Sadly, your projecting your thoughts to this thread. Please try reading comprehension next time instead of Knee Jerking if you wish to have an intelligent discussion on this topic.",
        "threadID": "672198221_8850038222001",
        "time": "2009-05-08 15:28:00",
        "title": "0bama personnel dump, it must be friday...",
        "userID": "LineDoggie"
    },
    {
        "content": "quote: Originally posted by A_Savage: So your complaining that when some one messes up they get the sack instead of a pat on the back with A \"good job brownie\"? Desperation, Just out and out Desperation? Use the dictionary next time. Look up the word \"resignation\" and compare it to \"fired\". He resigned. A bit of a difference there.",
        "intTime": 20090508,
        "postID": 49,
        "quote": "Originally posted by A_Savage: So your complaining that when some one messes up they get the sack instead of a pat on the back with A \"good job brownie\"? Desperation, Just out and out Desperation?",
        "reply": " Use the dictionary next time. Look up the word \"resignation\" and compare it to \"fired\". He resigned. A bit of a difference there.",
        "threadID": "672198221_8850038222001",
        "time": "2009-05-08 15:32:00",
        "title": "0bama personnel dump, it must be friday...",
        "userID": "crackerjacks61"
    },
    {
        "content": "If he fired this guy for being dumb - shouldn't he fire Nancy for not knowing that water-boarding is not something her servants do with her clothes – ya know the illegal immigrants she hires and pays 3-bucks per hr… Oh wait, they didn’t actually tell her they were torturing it was something about enhancements – probably breast implants or something – so she figured those nice terrorist fellas didn’t want enhancements so she turned off her hearing aid… So, does that mean we can get a REFUND for the 300-thousand dollars WASTED… can we deduct that from Obama’s check…?",
        "intTime": 20090508,
        "postID": 50,
        "quote": "",
        "reply": "If he fired this guy for being dumb - shouldn't he fire Nancy for not knowing that water-boarding is not something her servants do with her clothes – ya know the illegal immigrants she hires and pays 3-bucks per hr… Oh wait, they didn’t actually tell her they were torturing it was something about enhancements – probably breast implants or something – so she figured those nice terrorist fellas didn’t want enhancements so she turned off her hearing aid… So, does that mean we can get a REFUND for the 300-thousand dollars WASTED… can we deduct that from Obama’s check…?",
        "threadID": "672198221_8850038222001",
        "time": "2009-05-08 15:40:00",
        "title": "0bama personnel dump, it must be friday...",
        "userID": "GlassOnion"
    },
    {
        "content": "quote: Originally posted by crackerjacks61: quote: Originally posted by A_Savage: So your complaining that when some one messes up they get the sack instead of a pat on the back with A \"good job brownie\"? Desperation, Just out and out Desperation? Use the dictionary next time. Look up the word \"resignation\" and compare it to \"fired\". He resigned. A bit of a difference there. Say what? You can count on one hand the number of people who were \"fired\" from government over the last 200 years. They get a chance to \"resign.\" Dave",
        "intTime": 20090508,
        "postID": 51,
        "quote": "Originally posted by crackerjacks61: quote: Originally posted by A_Savage: So your complaining that when some one messes up they get the sack instead of a pat on the back with A \"good job brownie\"? Desperation, Just out and out Desperation? Use the dictionary next time. Look up the word \"resignation\" and compare it to \"fired\". He resigned. A bit of a difference there.",
        "reply": " Say what? You can count on one hand the number of people who were \"fired\" from government over the last 200 years. They get a chance to \"resign.\" Dave",
        "threadID": "672198221_8850038222001",
        "time": "2009-05-08 16:39:00",
        "title": "0bama personnel dump, it must be friday...",
        "userID": "Grachus"
    },
    {
        "content": "quote: Originally posted by GlassOnion: If he fired this guy for being dumb - shouldn't he fire Nancy for not knowing that water-boarding is not something her servants do with her clothes – ya know the illegal immigrants she hires and pays 3-bucks per hr… Oh wait, they didn’t actually tell her they were torturing it was something about enhancements – probably breast implants or something – so she figured those nice terrorist fellas didn’t want enhancements so she turned off her hearing aid… Without going into the merits of Ms. Pelossi, there is only one group of people who can \"fire\" her. Those are the voters of her Congressional District. If you think I'm making this up, you can read the Constitution. quote: Originally posted by GlassOnion: So, does that mean we can get a REFUND for the 300-thousand dollars WASTED… can we deduct that from Obama’s check…? Just as soon as Mr. Bush forks over a couple of trillions of dollars for getting us into Iraq. Dave",
        "intTime": 20090508,
        "postID": 52,
        "quote": "Originally posted by GlassOnion: If he fired this guy for being dumb - shouldn't he fire Nancy for not knowing that water-boarding is not something her servants do with her clothes – ya know the illegal immigrants she hires and pays 3-bucks per hr… Oh wait, they didn’t actually tell her they were torturing it was something about enhancements – probably breast implants or something – so she figured those nice terrorist fellas didn’t want enhancements so she turned off her hearing aid…",
        "reply": " Without going into the merits of Ms. Pelossi, there is only one group of people who can \"fire\" her. Those are the voters of her Congressional District. If you think I'm making this up, you can read the Constitution. quote: Originally posted by GlassOnion: So, does that mean we can get a REFUND for the 300-thousand dollars WASTED… can we deduct that from Obama’s check…? Just as soon as Mr. Bush forks over a couple of trillions of dollars for getting us into Iraq. Dave",
        "threadID": "672198221_8850038222001",
        "time": "2009-05-08 16:41:00",
        "title": "0bama personnel dump, it must be friday...",
        "userID": "Grachus"
    },
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by GlassOnion: If he fired this guy for being dumb - shouldn't he fire Nancy for not knowing that water-boarding is not something her servants do with her clothes – ya know the illegal immigrants she hires and pays 3-bucks per hr… Oh wait, they didn’t actually tell her they were torturing it was something about enhancements – probably breast implants or something – so she figured those nice terrorist fellas didn’t want enhancements so she turned off her hearing aid… Without going into the merits of Ms. Pelossi, there is only one group of people who can \"fire\" her. Those are the voters of her Congressional District. If you think I'm making this up, you can read the Constitution. quote: Originally posted by GlassOnion: So, does that mean we can get a REFUND for the 300-thousand dollars WASTED… can we deduct that from Obama’s check…? Just as soon as Mr. Bush forks over a couple of trillions of dollars for getting us into Iraq. Dave They're spending more money in Afghanistan and Iraq this fiscal year (2010) than any year previous. Never got close to one trillion under Bush let alone two. 2007 was $78.1 billion, this appropriation is over $90 billion. (With ear marks) The total cost into the future was thought to run $2.4 trillion but now, is on someone else's ticket. And, the United State Congress approved every one of the nine special appropriations.",
        "intTime": 20090508,
        "postID": 53,
        "quote": "Originally posted by Grachus: quote: Originally posted by GlassOnion: If he fired this guy for being dumb - shouldn't he fire Nancy for not knowing that water-boarding is not something her servants do with her clothes – ya know the illegal immigrants she hires and pays 3-bucks per hr… Oh wait, they didn’t actually tell her they were torturing it was something about enhancements – probably breast implants or something – so she figured those nice terrorist fellas didn’t want enhancements so she turned off her hearing aid… Without going into the merits of Ms. Pelossi, there is only one group of people who can \"fire\" her. Those are the voters of her Congressional District. If you think I'm making this up, you can read the Constitution. quote: Originally posted by GlassOnion: So, does that mean we can get a REFUND for the 300-thousand dollars WASTED… can we deduct that from Obama’s check…? Just as soon as Mr. Bush forks over a couple of trillions of dollars for getting us into Iraq. Dave",
        "reply": " They're spending more money in Afghanistan and Iraq this fiscal year (2010) than any year previous. Never got close to one trillion under Bush let alone two. 2007 was $78.1 billion, this appropriation is over $90 billion. (With ear marks) The total cost into the future was thought to run $2.4 trillion but now, is on someone else's ticket. And, the United State Congress approved every one of the nine special appropriations.",
        "threadID": "672198221_8850038222001",
        "time": "2009-05-08 17:22:00",
        "title": "0bama personnel dump, it must be friday...",
        "userID": "rayevinsonsr"
    },
    {
        "content": "quote: Originally posted by rayevinsonsr: quote: Originally posted by Grachus: quote: Originally posted by GlassOnion: If he fired this guy for being dumb - shouldn't he fire Nancy for not knowing that water-boarding is not something her servants do with her clothes – ya know the illegal immigrants she hires and pays 3-bucks per hr… Oh wait, they didn’t actually tell her they were torturing it was something about enhancements – probably breast implants or something – so she figured those nice terrorist fellas didn’t want enhancements so she turned off her hearing aid… Without going into the merits of Ms. Pelossi, there is only one group of people who can \"fire\" her. Those are the voters of her Congressional District. If you think I'm making this up, you can read the Constitution. quote: Originally posted by GlassOnion: So, does that mean we can get a REFUND for the 300-thousand dollars WASTED… can we deduct that from Obama’s check…? Just as soon as Mr. Bush forks over a couple of trillions of dollars for getting us into Iraq. Dave They're spending more money in Afghanistan and Iraq this fiscal year (2010) than any year previous. Never got close to one trillion under Bush let alone two. 2007 was $78.1 billion, this appropriation is over $90 billion. (With ear marks) The total cost into the future was thought to run $2.4 trillion but now, is on someone else's ticket. And, the United State Congress approved every one of the nine special appropriations. Ray, Ray, Ray, I wont quibble over a trillion here or a trillion there... (And I didn't mention Afghanistan) Dave",
        "intTime": 20090508,
        "postID": 54,
        "quote": "Originally posted by rayevinsonsr: quote: Originally posted by Grachus: quote: Originally posted by GlassOnion: If he fired this guy for being dumb - shouldn't he fire Nancy for not knowing that water-boarding is not something her servants do with her clothes – ya know the illegal immigrants she hires and pays 3-bucks per hr… Oh wait, they didn’t actually tell her they were torturing it was something about enhancements – probably breast implants or something – so she figured those nice terrorist fellas didn’t want enhancements so she turned off her hearing aid… Without going into the merits of Ms. Pelossi, there is only one group of people who can \"fire\" her. Those are the voters of her Congressional District. If you think I'm making this up, you can read the Constitution. quote: Originally posted by GlassOnion: So, does that mean we can get a REFUND for the 300-thousand dollars WASTED… can we deduct that from Obama’s check…? Just as soon as Mr. Bush forks over a couple of trillions of dollars for getting us into Iraq. Dave They're spending more money in Afghanistan and Iraq this fiscal year (2010) than any year previous. Never got close to one trillion under Bush let alone two. 2007 was $78.1 billion, this appropriation is over $90 billion. (With ear marks) The total cost into the future was thought to run $2.4 trillion but now, is on someone else's ticket. And, the United State Congress approved every one of the nine special appropriations.",
        "reply": " Ray, Ray, Ray, I wont quibble over a trillion here or a trillion there... (And I didn't mention Afghanistan) Dave",
        "threadID": "672198221_8850038222001",
        "time": "2009-05-08 17:25:00",
        "title": "0bama personnel dump, it must be friday...",
        "userID": "Grachus"
    },
    {
        "content": "The guy being blamed for this is just a scapegoat. That is obvious. Ya'll are fooling yourselves if you think BO didn't know about it before it happened. It was his damn plane. Now he is letting someone else hang for it. What a guy.",
        "intTime": 20090508,
        "postID": 55,
        "quote": "",
        "reply": "The guy being blamed for this is just a scapegoat. That is obvious. Ya'll are fooling yourselves if you think BO didn't know about it before it happened. It was his damn plane. Now he is letting someone else hang for it. What a guy.",
        "threadID": "672198221_8850038222001",
        "time": "2009-05-08 17:44:00",
        "title": "0bama personnel dump, it must be friday...",
        "userID": "AngelHeart"
    },
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by GlassOnion: If he fired this guy for being dumb - shouldn't he fire Nancy for not knowing that water-boarding is not something her servants do with her clothes – ya know the illegal immigrants she hires and pays 3-bucks per hr… Oh wait, they didn’t actually tell her they were torturing it was something about enhancements – probably breast implants or something – so she figured those nice terrorist fellas didn’t want enhancements so she turned off her hearing aid… Without going into the merits of Ms. Pelossi, there is only one group of people who can \"fire\" her. Those are the voters of her Congressional District. If you think I'm making this up, you can read the Constitution. quote: Originally posted by GlassOnion: So, does that mean we can get a REFUND for the 300-thousand dollars WASTED… can we deduct that from Obama’s check…? Just as soon as Mr. Bush forks over a couple of trillions of dollars for getting us into Iraq. Dave gee, and I thought the senate voted on it too... and just remember Obama has SPENT more money in his first 100 DAYS than BUSH during his ENTIRE presidency... He has spent more than both Iraq & A-stan COMBINED... ...but dont' worry, of the 3.4 trillion dollar deficit Obama created - he was able to save us all 17-billion in cuts... BORDER CONTROL cuts and reduced spending on the high-tec equipment used to detect Nukes and Bio weapons at our ports... I gotta give to Obama - he is a true democrat holding to his socialist liberation views...",
        "intTime": 20090508,
        "postID": 56,
        "quote": "Originally posted by Grachus: quote: Originally posted by GlassOnion: If he fired this guy for being dumb - shouldn't he fire Nancy for not knowing that water-boarding is not something her servants do with her clothes – ya know the illegal immigrants she hires and pays 3-bucks per hr… Oh wait, they didn’t actually tell her they were torturing it was something about enhancements – probably breast implants or something – so she figured those nice terrorist fellas didn’t want enhancements so she turned off her hearing aid… Without going into the merits of Ms. Pelossi, there is only one group of people who can \"fire\" her. Those are the voters of her Congressional District. If you think I'm making this up, you can read the Constitution. quote: Originally posted by GlassOnion: So, does that mean we can get a REFUND for the 300-thousand dollars WASTED… can we deduct that from Obama’s check…? Just as soon as Mr. Bush forks over a couple of trillions of dollars for getting us into Iraq. Dave",
        "reply": " gee, and I thought the senate voted on it too... and just remember Obama has SPENT more money in his first 100 DAYS than BUSH during his ENTIRE presidency... He has spent more than both Iraq & A-stan COMBINED... ...but dont' worry, of the 3.4 trillion dollar deficit Obama created - he was able to save us all 17-billion in cuts... BORDER CONTROL cuts and reduced spending on the high-tec equipment used to detect Nukes and Bio weapons at our ports... I gotta give to Obama - he is a true democrat holding to his socialist liberation views...",
        "threadID": "672198221_8850038222001",
        "time": "2009-05-08 17:47:00",
        "title": "0bama personnel dump, it must be friday...",
        "userID": "GlassOnion"
    },
    {
        "content": "quote: Originally posted by AngelHeart: The guy being blamed for this is just a scapegoat. That is obvious. Ya'll are fooling yourselves if you think BO didn't know about it before it happened. It was his damn plane. Now he is letting someone else hang for it. What a guy. ...and that means he is consistent... he dumped his pastor and pulled a Pelosi all in one big hypocritical seizure... go-figure... ...another one under the bus...",
        "intTime": 20090508,
        "postID": 57,
        "quote": "Originally posted by AngelHeart: The guy being blamed for this is just a scapegoat. That is obvious. Ya'll are fooling yourselves if you think BO didn't know about it before it happened. It was his damn plane. Now he is letting someone else hang for it. What a guy.",
        "reply": " ...and that means he is consistent... he dumped his pastor and pulled a Pelosi all in one big hypocritical seizure... go-figure... ...another one under the bus...",
        "threadID": "672198221_8850038222001",
        "time": "2009-05-08 17:51:00",
        "title": "0bama personnel dump, it must be friday...",
        "userID": "GlassOnion"
    },
    {
        "content": "Yep, Want to hide news, release it on a Friday afternoon. XXXhttp://www.nydailynews.com/news/politics/2009/05/08/2009-05-08_white_house_aide_loses_job_over_manhattan_flyover_fiasco.htmlXXX White House aide Louis Caldera loses job over Manhattan flyover fiasco involving Air Force One WASHINGTON - The White House aide who authorized the controversial Air Force One photo-op flight last week around the Statue of Liberty is out of a job. President Obama has accepted the resignation of Louis Caldera, the director of the White House Military Office, the Daily News learned Friday By the way, the F-16D escort for Scare Force One was a RedTail, anyone know the significance of that?",
        "intTime": 20090508,
        "postID": 58,
        "quote": "",
        "reply": "Yep, Want to hide news, release it on a Friday afternoon. XXXhttp://www.nydailynews.com/news/politics/2009/05/08/2009-05-08_white_house_aide_loses_job_over_manhattan_flyover_fiasco.htmlXXX White House aide Louis Caldera loses job over Manhattan flyover fiasco involving Air Force One WASHINGTON - The White House aide who authorized the controversial Air Force One photo-op flight last week around the Statue of Liberty is out of a job. President Obama has accepted the resignation of Louis Caldera, the director of the White House Military Office, the Daily News learned Friday By the way, the F-16D escort for Scare Force One was a RedTail, anyone know the significance of that?",
        "threadID": "672198221_8850038222001",
        "time": "2009-05-08 14:09:00",
        "title": "0bama personnel dump, it must be friday...",
        "userID": "LineDoggie"
    },
    {
        "content": "Wonder if there will be a book out about it. What does the RED mean?",
        "intTime": 20090508,
        "postID": 59,
        "quote": "",
        "reply": "Wonder if there will be a book out about it. What does the RED mean?",
        "threadID": "672198221_8850038222001",
        "time": "2009-05-08 14:13:00",
        "title": "0bama personnel dump, it must be friday...",
        "userID": "ACR26"
    },
    {
        "content": "So your complaining that when some one messes up they get the sack instead of a pat on the back with A \"good job brownie\"? Desperation, Just out and out Desperation?",
        "intTime": 20090508,
        "postID": 60,
        "quote": "",
        "reply": "So your complaining that when some one messes up they get the sack instead of a pat on the back with A \"good job brownie\"? Desperation, Just out and out Desperation?",
        "threadID": "672198221_8850038222001",
        "time": "2009-05-08 14:23:00",
        "title": "0bama personnel dump, it must be friday...",
        "userID": "A_Savage"
    },
    {
        "content": "typical politics as always, if it had gone over well there would have been \"ku-do's\" all around.. as it came out someone had to pay and it twernt gonna be PO. I wonder if Patooie was briefed on this flight. Hmmmmm, vlery-in-ter-est-ting. One Flag......One Heart......One Nation............EVERMORE",
        "intTime": 20090508,
        "postID": 61,
        "quote": "",
        "reply": "typical politics as always, if it had gone over well there would have been \"ku-do's\" all around.. as it came out someone had to pay and it twernt gonna be PO. I wonder if Patooie was briefed on this flight. Hmmmmm, vlery-in-ter-est-ting. One Flag......One Heart......One Nation............EVERMORE",
        "threadID": "672198221_8850038222001",
        "time": "2009-05-08 14:30:00",
        "title": "0bama personnel dump, it must be friday...",
        "userID": "m551sheridan"
    },
    {
        "content": "quote: Originally posted by A_Savage: So your complaining that when some one messes up they get the sack instead of a pat on the back with A \"good job brownie\"? Desperation, Just out and out Desperation? Almost grotesque that he's being criticised for doing what Mr. Bush would never dream of doing. How novel? Someone being held accountable. Why, why, it's almost unAmerican... Dave",
        "intTime": 20090508,
        "postID": 62,
        "quote": "Originally posted by A_Savage: So your complaining that when some one messes up they get the sack instead of a pat on the back with A \"good job brownie\"? Desperation, Just out and out Desperation?",
        "reply": " Almost grotesque that he's being criticised for doing what Mr. Bush would never dream of doing. How novel? Someone being held accountable. Why, why, it's almost unAmerican... Dave",
        "threadID": "672198221_8850038222001",
        "time": "2009-05-08 14:36:00",
        "title": "0bama personnel dump, it must be friday...",
        "userID": "Grachus"
    },
    {
        "content": "President Obama fired a guy for not communicating properly about a publicity photo and causing a panic in New York City where people are still traumatized by 9/11. Obviously the guy is not up to the job. Firing him is what any good leader would do. Do you think he should have got a medal like George “slam dunk” Tenet?",
        "intTime": 20090508,
        "postID": 63,
        "quote": "",
        "reply": "President Obama fired a guy for not communicating properly about a publicity photo and causing a panic in New York City where people are still traumatized by 9/11. Obviously the guy is not up to the job. Firing him is what any good leader would do. Do you think he should have got a medal like George “slam dunk” Tenet?",
        "threadID": "672198221_8850038222001",
        "time": "2009-05-08 14:39:00",
        "title": "0bama personnel dump, it must be friday...",
        "userID": "xerello"
    },
    {
        "content": "quote: Originally posted by xerello: President Obama fired a guy for not communicating properly about a publicity photo and causing a panic in New York City where people are still traumatized by 9/11. Obviously the guy is not up to the job. Firing him is what any good leader would do. Do you think he should have got a medal like George “slam dunk” Tenet? Dagnabit -- I just spent 10 minutes hunting that picture of it will be a slam dunk trent up myself. Is really a shame when folks are damning Obama for holding the people under him as responsible for the mistakes they make. -- Savage",
        "intTime": 20090508,
        "postID": 64,
        "quote": "Originally posted by xerello: President Obama fired a guy for not communicating properly about a publicity photo and causing a panic in New York City where people are still traumatized by 9/11. Obviously the guy is not up to the job. Firing him is what any good leader would do. Do you think he should have got a medal like George “slam dunk” Tenet?",
        "reply": " Dagnabit -- I just spent 10 minutes hunting that picture of it will be a slam dunk trent up myself. Is really a shame when folks are damning Obama for holding the people under him as responsible for the mistakes they make. -- Savage",
        "threadID": "672198221_8850038222001",
        "time": "2009-05-08 14:46:00",
        "title": "0bama personnel dump, it must be friday...",
        "userID": "A_Savage"
    },
    {
        "content": "quote: Originally posted by LineDoggie: Yep, Want to hide news, release it on a Friday afternoon. XXXhttp://www.nydailynews.com/news/politics/2009/05/08/2009-05-08_white_house_aide_loses_job_over_manhattan_flyover_fiasco.htmlXXX White House aide Louis Caldera loses job over Manhattan flyover fiasco involving Air Force One WASHINGTON - The White House aide who authorized the controversial Air Force One photo-op flight last week around the Statue of Liberty is out of a job. President Obama has accepted the resignation of Louis Caldera, the director of the White House Military Office, the Daily News learned Friday So ... what's your point? Obviously this news wasn't very well hidden if YOU found it. And seriously -- would you rather Pres. Obama keep this bonehead on the payroll?",
        "intTime": 20090508,
        "postID": 65,
        "quote": "Originally posted by LineDoggie: Yep, Want to hide news, release it on a Friday afternoon. XXXhttp://www.nydailynews.com/news/politics/2009/05/08/2009-05-08_white_house_aide_loses_job_over_manhattan_flyover_fiasco.htmlXXX White House aide Louis Caldera loses job over Manhattan flyover fiasco involving Air Force One WASHINGTON - The White House aide who authorized the controversial Air Force One photo-op flight last week around the Statue of Liberty is out of a job. President Obama has accepted the resignation of Louis Caldera, the director of the White House Military Office, the Daily News learned Friday",
        "reply": " So ... what's your point? Obviously this news wasn't very well hidden if YOU found it. And seriously -- would you rather Pres. Obama keep this bonehead on the payroll?",
        "threadID": "672198221_8850038222001",
        "time": "2009-05-08 14:51:00",
        "title": "0bama personnel dump, it must be friday...",
        "userID": "1WW"
    },
    {
        "content": "quote: Originally posted by klassylady25: Amidst the racial naysayers during WWII, the first African-American fighter pilots were commissioned in 1941 to help defend distressed bombers in the European theater. Known as the Tuskegee Airmen, these forgotten pilots fought with bravery and skill to save lives and prevent the loss of bombers to enemy fighters. Tuskegee Airmen of World War II The Fifteenth's Red Tail Angels 'http://www.tuskegeeairmen.org/' 'http://www.globalindex.com/kwanzaa/tuskegee/red_tail_angels.htm' You got it, Redtails were the Tuskeegee Airman of WWII Fame. The F-16D escort came from Alabama's 187th Fighter Wing. http://www.almont.ang.af.mil/default.htm Now why would you need an escort fighter from Alabama for a New York City Flight, when Macguire AFB in New Jersey is 30 Minutes away as the crow flies,and the 177th Fighter Wing NJ ANG is based out of Atlantic City, NJ? Odd, Aint it?",
        "intTime": 20090508,
        "postID": 66,
        "quote": "Originally posted by klassylady25: Amidst the racial naysayers during WWII, the first African-American fighter pilots were commissioned in 1941 to help defend distressed bombers in the European theater. Known as the Tuskegee Airmen, these forgotten pilots fought with bravery and skill to save lives and prevent the loss of bombers to enemy fighters. Tuskegee Airmen of World War II The Fifteenth's Red Tail Angels 'http://www.tuskegeeairmen.org/' 'http://www.globalindex.com/kwanzaa/tuskegee/red_tail_angels.htm'",
        "reply": " You got it, Redtails were the Tuskeegee Airman of WWII Fame. The F-16D escort came from Alabama's 187th Fighter Wing. http://www.almont.ang.af.mil/default.htm Now why would you need an escort fighter from Alabama for a New York City Flight, when Macguire AFB in New Jersey is 30 Minutes away as the crow flies,and the 177th Fighter Wing NJ ANG is based out of Atlantic City, NJ? Odd, Aint it?",
        "threadID": "672198221_8850038222001",
        "time": "2009-05-08 15:22:00",
        "title": "0bama personnel dump, it must be friday...",
        "userID": "LineDoggie"
    },
    {
        "content": "quote: Originally posted by A_Savage: So your complaining that when some one messes up they get the sack instead of a pat on the back with A \"good job brownie\"? Desperation, Just out and out Desperation? Sadly, your projecting your thoughts to this thread. Please try reading comprehension next time instead of Knee Jerking if you wish to have an intelligent discussion on this topic.",
        "intTime": 20090508,
        "postID": 67,
        "quote": "Originally posted by A_Savage: So your complaining that when some one messes up they get the sack instead of a pat on the back with A \"good job brownie\"? Desperation, Just out and out Desperation?",
        "reply": " Sadly, your projecting your thoughts to this thread. Please try reading comprehension next time instead of Knee Jerking if you wish to have an intelligent discussion on this topic.",
        "threadID": "672198221_8850038222001",
        "time": "2009-05-08 15:28:00",
        "title": "0bama personnel dump, it must be friday...",
        "userID": "LineDoggie"
    },
    {
        "content": "quote: Originally posted by A_Savage: So your complaining that when some one messes up they get the sack instead of a pat on the back with A \"good job brownie\"? Desperation, Just out and out Desperation? Use the dictionary next time. Look up the word \"resignation\" and compare it to \"fired\". He resigned. A bit of a difference there.",
        "intTime": 20090508,
        "postID": 68,
        "quote": "Originally posted by A_Savage: So your complaining that when some one messes up they get the sack instead of a pat on the back with A \"good job brownie\"? Desperation, Just out and out Desperation?",
        "reply": " Use the dictionary next time. Look up the word \"resignation\" and compare it to \"fired\". He resigned. A bit of a difference there.",
        "threadID": "672198221_8850038222001",
        "time": "2009-05-08 15:32:00",
        "title": "0bama personnel dump, it must be friday...",
        "userID": "crackerjacks61"
    },
    {
        "content": "If he fired this guy for being dumb - shouldn't he fire Nancy for not knowing that water-boarding is not something her servants do with her clothes – ya know the illegal immigrants she hires and pays 3-bucks per hr… Oh wait, they didn’t actually tell her they were torturing it was something about enhancements – probably breast implants or something – so she figured those nice terrorist fellas didn’t want enhancements so she turned off her hearing aid… So, does that mean we can get a REFUND for the 300-thousand dollars WASTED… can we deduct that from Obama’s check…?",
        "intTime": 20090508,
        "postID": 69,
        "quote": "",
        "reply": "If he fired this guy for being dumb - shouldn't he fire Nancy for not knowing that water-boarding is not something her servants do with her clothes – ya know the illegal immigrants she hires and pays 3-bucks per hr… Oh wait, they didn’t actually tell her they were torturing it was something about enhancements – probably breast implants or something – so she figured those nice terrorist fellas didn’t want enhancements so she turned off her hearing aid… So, does that mean we can get a REFUND for the 300-thousand dollars WASTED… can we deduct that from Obama’s check…?",
        "threadID": "672198221_8850038222001",
        "time": "2009-05-08 15:40:00",
        "title": "0bama personnel dump, it must be friday...",
        "userID": "GlassOnion"
    },
    {
        "content": "quote: Originally posted by crackerjacks61: quote: Originally posted by A_Savage: So your complaining that when some one messes up they get the sack instead of a pat on the back with A \"good job brownie\"? Desperation, Just out and out Desperation? Use the dictionary next time. Look up the word \"resignation\" and compare it to \"fired\". He resigned. A bit of a difference there. Say what? You can count on one hand the number of people who were \"fired\" from government over the last 200 years. They get a chance to \"resign.\" Dave",
        "intTime": 20090508,
        "postID": 70,
        "quote": "Originally posted by crackerjacks61: quote: Originally posted by A_Savage: So your complaining that when some one messes up they get the sack instead of a pat on the back with A \"good job brownie\"? Desperation, Just out and out Desperation? Use the dictionary next time. Look up the word \"resignation\" and compare it to \"fired\". He resigned. A bit of a difference there.",
        "reply": " Say what? You can count on one hand the number of people who were \"fired\" from government over the last 200 years. They get a chance to \"resign.\" Dave",
        "threadID": "672198221_8850038222001",
        "time": "2009-05-08 16:39:00",
        "title": "0bama personnel dump, it must be friday...",
        "userID": "Grachus"
    },
    {
        "content": "quote: Originally posted by GlassOnion: If he fired this guy for being dumb - shouldn't he fire Nancy for not knowing that water-boarding is not something her servants do with her clothes – ya know the illegal immigrants she hires and pays 3-bucks per hr… Oh wait, they didn’t actually tell her they were torturing it was something about enhancements – probably breast implants or something – so she figured those nice terrorist fellas didn’t want enhancements so she turned off her hearing aid… Without going into the merits of Ms. Pelossi, there is only one group of people who can \"fire\" her. Those are the voters of her Congressional District. If you think I'm making this up, you can read the Constitution. quote: Originally posted by GlassOnion: So, does that mean we can get a REFUND for the 300-thousand dollars WASTED… can we deduct that from Obama’s check…? Just as soon as Mr. Bush forks over a couple of trillions of dollars for getting us into Iraq. Dave",
        "intTime": 20090508,
        "postID": 71,
        "quote": "Originally posted by GlassOnion: If he fired this guy for being dumb - shouldn't he fire Nancy for not knowing that water-boarding is not something her servants do with her clothes – ya know the illegal immigrants she hires and pays 3-bucks per hr… Oh wait, they didn’t actually tell her they were torturing it was something about enhancements – probably breast implants or something – so she figured those nice terrorist fellas didn’t want enhancements so she turned off her hearing aid…",
        "reply": " Without going into the merits of Ms. Pelossi, there is only one group of people who can \"fire\" her. Those are the voters of her Congressional District. If you think I'm making this up, you can read the Constitution. quote: Originally posted by GlassOnion: So, does that mean we can get a REFUND for the 300-thousand dollars WASTED… can we deduct that from Obama’s check…? Just as soon as Mr. Bush forks over a couple of trillions of dollars for getting us into Iraq. Dave",
        "threadID": "672198221_8850038222001",
        "time": "2009-05-08 16:41:00",
        "title": "0bama personnel dump, it must be friday...",
        "userID": "Grachus"
    },
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by GlassOnion: If he fired this guy for being dumb - shouldn't he fire Nancy for not knowing that water-boarding is not something her servants do with her clothes – ya know the illegal immigrants she hires and pays 3-bucks per hr… Oh wait, they didn’t actually tell her they were torturing it was something about enhancements – probably breast implants or something – so she figured those nice terrorist fellas didn’t want enhancements so she turned off her hearing aid… Without going into the merits of Ms. Pelossi, there is only one group of people who can \"fire\" her. Those are the voters of her Congressional District. If you think I'm making this up, you can read the Constitution. quote: Originally posted by GlassOnion: So, does that mean we can get a REFUND for the 300-thousand dollars WASTED… can we deduct that from Obama’s check…? Just as soon as Mr. Bush forks over a couple of trillions of dollars for getting us into Iraq. Dave They're spending more money in Afghanistan and Iraq this fiscal year (2010) than any year previous. Never got close to one trillion under Bush let alone two. 2007 was $78.1 billion, this appropriation is over $90 billion. (With ear marks) The total cost into the future was thought to run $2.4 trillion but now, is on someone else's ticket. And, the United State Congress approved every one of the nine special appropriations.",
        "intTime": 20090508,
        "postID": 72,
        "quote": "Originally posted by Grachus: quote: Originally posted by GlassOnion: If he fired this guy for being dumb - shouldn't he fire Nancy for not knowing that water-boarding is not something her servants do with her clothes – ya know the illegal immigrants she hires and pays 3-bucks per hr… Oh wait, they didn’t actually tell her they were torturing it was something about enhancements – probably breast implants or something – so she figured those nice terrorist fellas didn’t want enhancements so she turned off her hearing aid… Without going into the merits of Ms. Pelossi, there is only one group of people who can \"fire\" her. Those are the voters of her Congressional District. If you think I'm making this up, you can read the Constitution. quote: Originally posted by GlassOnion: So, does that mean we can get a REFUND for the 300-thousand dollars WASTED… can we deduct that from Obama’s check…? Just as soon as Mr. Bush forks over a couple of trillions of dollars for getting us into Iraq. Dave",
        "reply": " They're spending more money in Afghanistan and Iraq this fiscal year (2010) than any year previous. Never got close to one trillion under Bush let alone two. 2007 was $78.1 billion, this appropriation is over $90 billion. (With ear marks) The total cost into the future was thought to run $2.4 trillion but now, is on someone else's ticket. And, the United State Congress approved every one of the nine special appropriations.",
        "threadID": "672198221_8850038222001",
        "time": "2009-05-08 17:22:00",
        "title": "0bama personnel dump, it must be friday...",
        "userID": "rayevinsonsr"
    },
    {
        "content": "quote: Originally posted by rayevinsonsr: quote: Originally posted by Grachus: quote: Originally posted by GlassOnion: If he fired this guy for being dumb - shouldn't he fire Nancy for not knowing that water-boarding is not something her servants do with her clothes – ya know the illegal immigrants she hires and pays 3-bucks per hr… Oh wait, they didn’t actually tell her they were torturing it was something about enhancements – probably breast implants or something – so she figured those nice terrorist fellas didn’t want enhancements so she turned off her hearing aid… Without going into the merits of Ms. Pelossi, there is only one group of people who can \"fire\" her. Those are the voters of her Congressional District. If you think I'm making this up, you can read the Constitution. quote: Originally posted by GlassOnion: So, does that mean we can get a REFUND for the 300-thousand dollars WASTED… can we deduct that from Obama’s check…? Just as soon as Mr. Bush forks over a couple of trillions of dollars for getting us into Iraq. Dave They're spending more money in Afghanistan and Iraq this fiscal year (2010) than any year previous. Never got close to one trillion under Bush let alone two. 2007 was $78.1 billion, this appropriation is over $90 billion. (With ear marks) The total cost into the future was thought to run $2.4 trillion but now, is on someone else's ticket. And, the United State Congress approved every one of the nine special appropriations. Ray, Ray, Ray, I wont quibble over a trillion here or a trillion there... (And I didn't mention Afghanistan) Dave",
        "intTime": 20090508,
        "postID": 73,
        "quote": "Originally posted by rayevinsonsr: quote: Originally posted by Grachus: quote: Originally posted by GlassOnion: If he fired this guy for being dumb - shouldn't he fire Nancy for not knowing that water-boarding is not something her servants do with her clothes – ya know the illegal immigrants she hires and pays 3-bucks per hr… Oh wait, they didn’t actually tell her they were torturing it was something about enhancements – probably breast implants or something – so she figured those nice terrorist fellas didn’t want enhancements so she turned off her hearing aid… Without going into the merits of Ms. Pelossi, there is only one group of people who can \"fire\" her. Those are the voters of her Congressional District. If you think I'm making this up, you can read the Constitution. quote: Originally posted by GlassOnion: So, does that mean we can get a REFUND for the 300-thousand dollars WASTED… can we deduct that from Obama’s check…? Just as soon as Mr. Bush forks over a couple of trillions of dollars for getting us into Iraq. Dave They're spending more money in Afghanistan and Iraq this fiscal year (2010) than any year previous. Never got close to one trillion under Bush let alone two. 2007 was $78.1 billion, this appropriation is over $90 billion. (With ear marks) The total cost into the future was thought to run $2.4 trillion but now, is on someone else's ticket. And, the United State Congress approved every one of the nine special appropriations.",
        "reply": " Ray, Ray, Ray, I wont quibble over a trillion here or a trillion there... (And I didn't mention Afghanistan) Dave",
        "threadID": "672198221_8850038222001",
        "time": "2009-05-08 17:25:00",
        "title": "0bama personnel dump, it must be friday...",
        "userID": "Grachus"
    },
    {
        "content": "The guy being blamed for this is just a scapegoat. That is obvious. Ya'll are fooling yourselves if you think BO didn't know about it before it happened. It was his damn plane. Now he is letting someone else hang for it. What a guy.",
        "intTime": 20090508,
        "postID": 74,
        "quote": "",
        "reply": "The guy being blamed for this is just a scapegoat. That is obvious. Ya'll are fooling yourselves if you think BO didn't know about it before it happened. It was his damn plane. Now he is letting someone else hang for it. What a guy.",
        "threadID": "672198221_8850038222001",
        "time": "2009-05-08 17:44:00",
        "title": "0bama personnel dump, it must be friday...",
        "userID": "AngelHeart"
    },
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by GlassOnion: If he fired this guy for being dumb - shouldn't he fire Nancy for not knowing that water-boarding is not something her servants do with her clothes – ya know the illegal immigrants she hires and pays 3-bucks per hr… Oh wait, they didn’t actually tell her they were torturing it was something about enhancements – probably breast implants or something – so she figured those nice terrorist fellas didn’t want enhancements so she turned off her hearing aid… Without going into the merits of Ms. Pelossi, there is only one group of people who can \"fire\" her. Those are the voters of her Congressional District. If you think I'm making this up, you can read the Constitution. quote: Originally posted by GlassOnion: So, does that mean we can get a REFUND for the 300-thousand dollars WASTED… can we deduct that from Obama’s check…? Just as soon as Mr. Bush forks over a couple of trillions of dollars for getting us into Iraq. Dave gee, and I thought the senate voted on it too... and just remember Obama has SPENT more money in his first 100 DAYS than BUSH during his ENTIRE presidency... He has spent more than both Iraq & A-stan COMBINED... ...but dont' worry, of the 3.4 trillion dollar deficit Obama created - he was able to save us all 17-billion in cuts... BORDER CONTROL cuts and reduced spending on the high-tec equipment used to detect Nukes and Bio weapons at our ports... I gotta give to Obama - he is a true democrat holding to his socialist liberation views...",
        "intTime": 20090508,
        "postID": 75,
        "quote": "Originally posted by Grachus: quote: Originally posted by GlassOnion: If he fired this guy for being dumb - shouldn't he fire Nancy for not knowing that water-boarding is not something her servants do with her clothes – ya know the illegal immigrants she hires and pays 3-bucks per hr… Oh wait, they didn’t actually tell her they were torturing it was something about enhancements – probably breast implants or something – so she figured those nice terrorist fellas didn’t want enhancements so she turned off her hearing aid… Without going into the merits of Ms. Pelossi, there is only one group of people who can \"fire\" her. Those are the voters of her Congressional District. If you think I'm making this up, you can read the Constitution. quote: Originally posted by GlassOnion: So, does that mean we can get a REFUND for the 300-thousand dollars WASTED… can we deduct that from Obama’s check…? Just as soon as Mr. Bush forks over a couple of trillions of dollars for getting us into Iraq. Dave",
        "reply": " gee, and I thought the senate voted on it too... and just remember Obama has SPENT more money in his first 100 DAYS than BUSH during his ENTIRE presidency... He has spent more than both Iraq & A-stan COMBINED... ...but dont' worry, of the 3.4 trillion dollar deficit Obama created - he was able to save us all 17-billion in cuts... BORDER CONTROL cuts and reduced spending on the high-tec equipment used to detect Nukes and Bio weapons at our ports... I gotta give to Obama - he is a true democrat holding to his socialist liberation views...",
        "threadID": "672198221_8850038222001",
        "time": "2009-05-08 17:47:00",
        "title": "0bama personnel dump, it must be friday...",
        "userID": "GlassOnion"
    },
    {
        "content": "quote: Originally posted by AngelHeart: The guy being blamed for this is just a scapegoat. That is obvious. Ya'll are fooling yourselves if you think BO didn't know about it before it happened. It was his damn plane. Now he is letting someone else hang for it. What a guy. ...and that means he is consistent... he dumped his pastor and pulled a Pelosi all in one big hypocritical seizure... go-figure... ...another one under the bus...",
        "intTime": 20090508,
        "postID": 76,
        "quote": "Originally posted by AngelHeart: The guy being blamed for this is just a scapegoat. That is obvious. Ya'll are fooling yourselves if you think BO didn't know about it before it happened. It was his damn plane. Now he is letting someone else hang for it. What a guy.",
        "reply": " ...and that means he is consistent... he dumped his pastor and pulled a Pelosi all in one big hypocritical seizure... go-figure... ...another one under the bus...",
        "threadID": "672198221_8850038222001",
        "time": "2009-05-08 17:51:00",
        "title": "0bama personnel dump, it must be friday...",
        "userID": "GlassOnion"
    }
]