[
    {
        "content": "\"Petraeus: Israel Might Attack Iran\" \"http://www.huffingtonpost.com/2009/04/01/petraeus-israel-might-att_n_181867.html\" Crackerjacks61: \"Israel Will Attack Iran\" Yet all I have been hearing is \"Israel will never attack Iran\". Wanna bet your pension checks on that boyz? Israel will not screw around if they feel they are in danger they will act.", 
        "intTime": 20090401, 
        "postID": 1, 
        "quote": "", 
        "reply": "\"Petraeus: Israel Might Attack Iran\" \"http://www.huffingtonpost.com/2009/04/01/petraeus-israel-might-att_n_181867.html\" Crackerjacks61: \"Israel Will Attack Iran\" Yet all I have been hearing is \"Israel will never attack Iran\". Wanna bet your pension checks on that boyz? Israel will not screw around if they feel they are in danger they will act.", 
        "threadID": "672198221_3650065912001", 
        "time": "2009-04-01 14:53:00", 
        "title": "Petraeus: Israel Might Attack Iran", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "Yep. The new leadership is very extreme and seem more likely to do exactly that. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090401, 
        "postID": 2, 
        "quote": "", 
        "reply": "Yep. The new leadership is very extreme and seem more likely to do exactly that. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_3650065912001", 
        "time": "2009-04-01 15:01:00", 
        "title": "Petraeus: Israel Might Attack Iran", 
        "userID": "L0A1"
    }, 
    {
        "content": "Good, and I hope they nuke that little bearded POS until he glows in the dark.", 
        "intTime": 20090401, 
        "postID": 3, 
        "quote": "", 
        "reply": "Good, and I hope they nuke that little bearded POS until he glows in the dark.", 
        "threadID": "672198221_3650065912001", 
        "time": "2009-04-01 16:38:00", 
        "title": "Petraeus: Israel Might Attack Iran", 
        "userID": "shuman14"
    }, 
    {
        "content": "I'm surprised they haven't already. But the pre-election buzz was that if Berry won, the Jews would light up Iran within six months. So they still have plenty of time. \"Thank you, for your support.\" - Bartles & Jaymes", 
        "intTime": 20090401, 
        "postID": 4, 
        "quote": "", 
        "reply": "I'm surprised they haven't already. But the pre-election buzz was that if Berry won, the Jews would light up Iran within six months. So they still have plenty of time. \"Thank you, for your support.\" - Bartles & Jaymes", 
        "threadID": "672198221_3650065912001", 
        "time": "2009-04-01 16:42:00", 
        "title": "Petraeus: Israel Might Attack Iran", 
        "userID": "rm444"
    }, 
    {
        "content": "Git er done!", 
        "intTime": 20090401, 
        "postID": 5, 
        "quote": "", 
        "reply": "Git er done!", 
        "threadID": "672198221_3650065912001", 
        "time": "2009-04-01 16:45:00", 
        "title": "Petraeus: Israel Might Attack Iran", 
        "userID": "MSGCAVALRY"
    }, 
    {
        "content": "quote: Originally posted by shuman14: Good, and I hope they nuke that little bearded POS until he glows in the dark. It will eventualy come to this: We will have to blast a hole the size of Texas somewhere in the Middle east. Civilians will die unfortunetly, but it will not stop until we send a strong message to the arab world. Don't screw with us. Anything less from either the right or the left is PURE BS. The right (rep party) pretend to be the protectors of this nation in words only that is why I am down on them more than the dems. At least the dems don't pretend to be idiotic and libral. When you fight a war, you fight a war and all of this is still a MESS from the Bush Presidency that should have been cleaned up many years ago. So lets keep pretending RIGHTIES.", 
        "intTime": 20090401, 
        "postID": 6, 
        "quote": "Originally posted by shuman14: Good, and I hope they nuke that little bearded POS until he glows in the dark.", 
        "reply": " It will eventualy come to this: We will have to blast a hole the size of Texas somewhere in the Middle east. Civilians will die unfortunetly, but it will not stop until we send a strong message to the arab world. Don't screw with us. Anything less from either the right or the left is PURE BS. The right (rep party) pretend to be the protectors of this nation in words only that is why I am down on them more than the dems. At least the dems don't pretend to be idiotic and libral. When you fight a war, you fight a war and all of this is still a MESS from the Bush Presidency that should have been cleaned up many years ago. So lets keep pretending RIGHTIES.", 
        "threadID": "672198221_3650065912001", 
        "time": "2009-04-01 16:51:00", 
        "title": "Petraeus: Israel Might Attack Iran", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "Been Hearing this for Years, still no IAF F15's over Teheran yet. However Israel is to just be a good little boy and be a Hostage to Iranian Threats? or maybe it should let itself get nuked to satisfy lefties? Really the Iranian government isnt exactly the most stable when it comes to Threats of Annihilation.", 
        "intTime": 20090401, 
        "postID": 7, 
        "quote": "", 
        "reply": "Been Hearing this for Years, still no IAF F15's over Teheran yet. However Israel is to just be a good little boy and be a Hostage to Iranian Threats? or maybe it should let itself get nuked to satisfy lefties? Really the Iranian government isnt exactly the most stable when it comes to Threats of Annihilation.", 
        "threadID": "672198221_3650065912001", 
        "time": "2009-04-01 16:56:00", 
        "title": "Petraeus: Israel Might Attack Iran", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "We have sure shown them the way with our preemptive strike on Iraq. Heck! you don't even need a real reason to attack someone just make one up. Wouldn't it be easier to just move Israel to Central America and let them take over some of the non-productive countries to our south. It would take the thorn out of the middle east and provide us protection on the southern tip of north America.", 
        "intTime": 20090401, 
        "postID": 8, 
        "quote": "", 
        "reply": "We have sure shown them the way with our preemptive strike on Iraq. Heck! you don't even need a real reason to attack someone just make one up. Wouldn't it be easier to just move Israel to Central America and let them take over some of the non-productive countries to our south. It would take the thorn out of the middle east and provide us protection on the southern tip of north America.", 
        "threadID": "672198221_3650065912001", 
        "time": "2009-04-01 17:07:00", 
        "title": "Petraeus: Israel Might Attack Iran", 
        "userID": "Another4Truth"
    }, 
    {
        "content": "If Israel attacks Iran, Iran will hit them with a Nuke. If that happens every Muslim in the world will rejoice and dance in the streets. Even those here in the US. The US will not be able to do anything about it since the War on Terror is no more. The best thing for Obama to do now IMO is to give Iran 3 Trillion dollars as a stimulus gift and ask them not to carry out any attacks for at least 5 or 6 years.", 
        "intTime": 20090401, 
        "postID": 9, 
        "quote": "", 
        "reply": "If Israel attacks Iran, Iran will hit them with a Nuke. If that happens every Muslim in the world will rejoice and dance in the streets. Even those here in the US. The US will not be able to do anything about it since the War on Terror is no more. The best thing for Obama to do now IMO is to give Iran 3 Trillion dollars as a stimulus gift and ask them not to carry out any attacks for at least 5 or 6 years.", 
        "threadID": "672198221_3650065912001", 
        "time": "2009-04-01 17:17:00", 
        "title": "Petraeus: Israel Might Attack Iran", 
        "userID": "Duster6"
    }, 
    {
        "content": "Yes General Patreaus, uh-huh, and Russia is going to attack India. Hows your Surge going? GI's and Iraqi People still dying there aren't they? \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090401, 
        "postID": 10, 
        "quote": "", 
        "reply": "Yes General Patreaus, uh-huh, and Russia is going to attack India. Hows your Surge going? GI's and Iraqi People still dying there aren't they? \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_3650065912001", 
        "time": "2009-04-01 17:28:00", 
        "title": "Petraeus: Israel Might Attack Iran", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by Duster6: If Israel attacks Iran, Iran will hit them with a Nuke. If that happens every Muslim in the world will rejoice and dance in the streets. Even those here in the US. The US will not be able to do anything about it since the War on Terror is no more. The best thing for Obama to do now IMO is to give Iran 3 Trillion dollars as a stimulus gift and ask them not to carry out any attacks for at least 5 or 6 years. Interesting point and I wonder how much money we have given Saudi, Dubai, Iraq, Iran, Kuwait, Oman, Qatar and other with our purchase of middle eastern oil. How many trillions would you guess? Do you think it has destabilized the middle east? How many weapons do you think we sold them to get the cash back?", 
        "intTime": 20090401, 
        "postID": 11, 
        "quote": "Originally posted by Duster6: If Israel attacks Iran, Iran will hit them with a Nuke. If that happens every Muslim in the world will rejoice and dance in the streets. Even those here in the US. The US will not be able to do anything about it since the War on Terror is no more. The best thing for Obama to do now IMO is to give Iran 3 Trillion dollars as a stimulus gift and ask them not to carry out any attacks for at least 5 or 6 years.", 
        "reply": " Interesting point and I wonder how much money we have given Saudi, Dubai, Iraq, Iran, Kuwait, Oman, Qatar and other with our purchase of middle eastern oil. How many trillions would you guess? Do you think it has destabilized the middle east? How many weapons do you think we sold them to get the cash back?", 
        "threadID": "672198221_3650065912001", 
        "time": "2009-04-01 17:30:00", 
        "title": "Petraeus: Israel Might Attack Iran", 
        "userID": "Another4Truth"
    }, 
    {
        "content": "Israel is hamstrung by relations with the US their ONLY ally. They don't want us to withdraw our support under UN pressure. First Israel should finish what it started in the Gaza strip and carpet-bomb from end to end. Iran is another hole made by Moslem extremists. Clearly Moslems give the words \"religious fundamentalist\" a bad name.", 
        "intTime": 20090401, 
        "postID": 12, 
        "quote": "", 
        "reply": "Israel is hamstrung by relations with the US their ONLY ally. They don't want us to withdraw our support under UN pressure. First Israel should finish what it started in the Gaza strip and carpet-bomb from end to end. Iran is another hole made by Moslem extremists. Clearly Moslems give the words \"religious fundamentalist\" a bad name.", 
        "threadID": "672198221_3650065912001", 
        "time": "2009-04-01 17:37:00", 
        "title": "Petraeus: Israel Might Attack Iran", 
        "userID": "StaffSgtGraham"
    }, 
    {
        "content": "\"Any such launch would violate U.N. Security Council resolution\" Yeah ok and the UN isn't gona do crap.", 
        "intTime": 20090401, 
        "postID": 13, 
        "quote": "", 
        "reply": "\"Any such launch would violate U.N. Security Council resolution\" Yeah ok and the UN isn't gona do crap.", 
        "threadID": "672198221_3650065912001", 
        "time": "2009-04-01 18:07:00", 
        "title": "Petraeus: Israel Might Attack Iran", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by L0A1: Yep. The new leadership is very extreme and seem more likely to do exactly that. Very extreme? No, that would be the leadership of Iran. Thank God Netanyahu is the new leader of Israel. Now that gives the Iranians some sleepless nights! Obama & Hillary? They might kill off the Iranian leadership by making them laugh themselves to death.", 
        "intTime": 20090401, 
        "postID": 14, 
        "quote": "Originally posted by L0A1: Yep. The new leadership is very extreme and seem more likely to do exactly that.", 
        "reply": " Very extreme? No, that would be the leadership of Iran. Thank God Netanyahu is the new leader of Israel. Now that gives the Iranians some sleepless nights! Obama & Hillary? They might kill off the Iranian leadership by making them laugh themselves to death.", 
        "threadID": "672198221_3650065912001", 
        "time": "2009-04-01 19:06:00", 
        "title": "Petraeus: Israel Might Attack Iran", 
        "userID": "frontsight59"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: Yes General Patreaus, uh-huh, and Russia is going to attack India. Hows your Surge going? GI's and Iraqi People still dying there aren't they? Surge is going great Eisenhower, what is the deathrate for US troops since jan 20th in Iraq? compared to 2004/2005/2006/2007/2008? But then as someone who's never seen the elephant, you'd hardly be in a position to opine in an informed manner.", 
        "intTime": 20090401, 
        "postID": 15, 
        "quote": "Originally posted by jack_flats: Yes General Patreaus, uh-huh, and Russia is going to attack India. Hows your Surge going? GI's and Iraqi People still dying there aren't they?", 
        "reply": " Surge is going great Eisenhower, what is the deathrate for US troops since jan 20th in Iraq? compared to 2004/2005/2006/2007/2008? But then as someone who's never seen the elephant, you'd hardly be in a position to opine in an informed manner.", 
        "threadID": "672198221_3650065912001", 
        "time": "2009-04-01 21:23:00", 
        "title": "Petraeus: Israel Might Attack Iran", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "quote: Originally posted by Another4Truth: quote: Originally posted by Duster6: If Israel attacks Iran, Iran will hit them with a Nuke. If that happens every Muslim in the world will rejoice and dance in the streets. Even those here in the US. The US will not be able to do anything about it since the War on Terror is no more. The best thing for Obama to do now IMO is to give Iran 3 Trillion dollars as a stimulus gift and ask them not to carry out any attacks for at least 5 or 6 years. Interesting point and I wonder how much money we have given Saudi, Dubai, Iraq, Iran, Kuwait, Oman, Qatar and other with our purchase of middle eastern oil. How many trillions would you guess? Do you think it has destabilized the middle east? How many weapons do you think we sold them to get the cash back? Where pray tell does the USA source most of its Oil Needs from Einstein? Something tells me you'd be surprised at the answer", 
        "intTime": 20090401, 
        "postID": 16, 
        "quote": "Originally posted by Another4Truth: quote: Originally posted by Duster6: If Israel attacks Iran, Iran will hit them with a Nuke. If that happens every Muslim in the world will rejoice and dance in the streets. Even those here in the US. The US will not be able to do anything about it since the War on Terror is no more. The best thing for Obama to do now IMO is to give Iran 3 Trillion dollars as a stimulus gift and ask them not to carry out any attacks for at least 5 or 6 years. Interesting point and I wonder how much money we have given Saudi, Dubai, Iraq, Iran, Kuwait, Oman, Qatar and other with our purchase of middle eastern oil. How many trillions would you guess? Do you think it has destabilized the middle east? How many weapons do you think we sold them to get the cash back?", 
        "reply": " Where pray tell does the USA source most of its Oil Needs from Einstein? Something tells me you'd be surprised at the answer", 
        "threadID": "672198221_3650065912001", 
        "time": "2009-04-01 21:25:00", 
        "title": "Petraeus: Israel Might Attack Iran", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "Netaniahu is a pragmatic leader. Should he has been so extreme as you like to paint him, he would have never have anything to Palestinians. And yet, he gave Hebron, a very important city to Jews. That and the rest of what he gave, is by far more than Rabin&Peres (Labor leaders the ones that have initiated Oslo) ever gave. If Iran will nuke us, Muslims will have very little to rejoice about, since that the first nukes will go to Mecca, Medina, Najaf, Karbala, Samaraa, Baghdad. The rest, will go to Cairo, Damascus, Beirut, and whatever is left by then. I seriously doubt that Iranians will nuke is if we will attack them. If we will attack them, we will attack them before they will have a nuke to use.", 
        "intTime": 20090402, 
        "postID": 17, 
        "quote": "", 
        "reply": "Netaniahu is a pragmatic leader. Should he has been so extreme as you like to paint him, he would have never have anything to Palestinians. And yet, he gave Hebron, a very important city to Jews. That and the rest of what he gave, is by far more than Rabin&Peres (Labor leaders the ones that have initiated Oslo) ever gave. If Iran will nuke us, Muslims will have very little to rejoice about, since that the first nukes will go to Mecca, Medina, Najaf, Karbala, Samaraa, Baghdad. The rest, will go to Cairo, Damascus, Beirut, and whatever is left by then. I seriously doubt that Iranians will nuke is if we will attack them. If we will attack them, we will attack them before they will have a nuke to use.", 
        "threadID": "672198221_3650065912001", 
        "time": "2009-04-02 06:09:00", 
        "title": "Petraeus: Israel Might Attack Iran", 
        "userID": "PanzerMeister"
    }, 
    {
        "content": "quote: Originally posted by PanzerMeister: Netaniahu is a pragmatic leader. Should he has been so extreme as you like to paint him, he would have never have anything to Palestinians. And yet, he gave Hebron, a very important city to Jews. That and the rest of what he gave, is by far more than Rabin&Peres (Labor leaders the ones that have initiated Oslo) ever gave. If Iran will nuke us, Muslims will have very little to rejoice about, since that the first nukes will go to Mecca, Medina, Najaf, Karbala, Samaraa, Baghdad. The rest, will go to Cairo, Damascus, Beirut, and whatever is left by then. I seriously doubt that Iranians will nuke is if we will attack them. If we will attack them, we will attack them before they will have a nuke to use. I love the rhetoric, but I don't think dropping a nuke on Baghdad while there are a few thousand American troops sitting there will work out that great for you...and make no mistake, whether we're talking next week or next decade, there are going to be a few thousand US troops in Baghdad. Don't let widespread apathy about the IAF \"accidentally\" strafing the Liberty fool you; dropping a nuke on Americans will end badly for Israel. I can pretty much guarantee that Congress would pass a declaration of war within about 3 days, and it would go downhill from there.", 
        "intTime": 20090402, 
        "postID": 18, 
        "quote": "Originally posted by PanzerMeister: Netaniahu is a pragmatic leader. Should he has been so extreme as you like to paint him, he would have never have anything to Palestinians. And yet, he gave Hebron, a very important city to Jews. That and the rest of what he gave, is by far more than Rabin&Peres (Labor leaders the ones that have initiated Oslo) ever gave. If Iran will nuke us, Muslims will have very little to rejoice about, since that the first nukes will go to Mecca, Medina, Najaf, Karbala, Samaraa, Baghdad. The rest, will go to Cairo, Damascus, Beirut, and whatever is left by then. I seriously doubt that Iranians will nuke is if we will attack them. If we will attack them, we will attack them before they will have a nuke to use.", 
        "reply": " I love the rhetoric, but I don't think dropping a nuke on Baghdad while there are a few thousand American troops sitting there will work out that great for you...and make no mistake, whether we're talking next week or next decade, there are going to be a few thousand US troops in Baghdad. Don't let widespread apathy about the IAF \"accidentally\" strafing the Liberty fool you; dropping a nuke on Americans will end badly for Israel. I can pretty much guarantee that Congress would pass a declaration of war within about 3 days, and it would go downhill from there.", 
        "threadID": "672198221_3650065912001", 
        "time": "2009-04-02 06:39:00", 
        "title": "Petraeus: Israel Might Attack Iran", 
        "userID": "jwr6"
    }, 
    {
        "content": "quote: Originally posted by jwr6: quote: Originally posted by PanzerMeister: Netaniahu is a pragmatic leader. Should he has been so extreme as you like to paint him, he would have never have anything to Palestinians. And yet, he gave Hebron, a very important city to Jews. That and the rest of what he gave, is by far more than Rabin&Peres (Labor leaders the ones that have initiated Oslo) ever gave. If Iran will nuke us, Muslims will have very little to rejoice about, since that the first nukes will go to Mecca, Medina, Najaf, Karbala, Samaraa, Baghdad. The rest, will go to Cairo, Damascus, Beirut, and whatever is left by then. I seriously doubt that Iranians will nuke is if we will attack them. If we will attack them, we will attack them before they will have a nuke to use. I love the rhetoric, but I don't think dropping a nuke on Baghdad while there are a few thousand American troops sitting there will work out that great for you...and make no mistake, whether we're talking next week or next decade, there are going to be a few thousand US troops in Baghdad. Don't let widespread apathy about the IAF \"accidentally\" strafing the Liberty fool you; dropping a nuke on Americans will end badly for Israel. I can pretty much guarantee that Congress would pass a declaration of war within about 3 days, and it would go downhill from there. Ok, i forgot about US presence in Iraq. It still will not prevent Israel from glassing everything else.", 
        "intTime": 20090403, 
        "postID": 19, 
        "quote": "Originally posted by jwr6: quote: Originally posted by PanzerMeister: Netaniahu is a pragmatic leader. Should he has been so extreme as you like to paint him, he would have never have anything to Palestinians. And yet, he gave Hebron, a very important city to Jews. That and the rest of what he gave, is by far more than Rabin&Peres (Labor leaders the ones that have initiated Oslo) ever gave. If Iran will nuke us, Muslims will have very little to rejoice about, since that the first nukes will go to Mecca, Medina, Najaf, Karbala, Samaraa, Baghdad. The rest, will go to Cairo, Damascus, Beirut, and whatever is left by then. I seriously doubt that Iranians will nuke is if we will attack them. If we will attack them, we will attack them before they will have a nuke to use. I love the rhetoric, but I don't think dropping a nuke on Baghdad while there are a few thousand American troops sitting there will work out that great for you...and make no mistake, whether we're talking next week or next decade, there are going to be a few thousand US troops in Baghdad. Don't let widespread apathy about the IAF \"accidentally\" strafing the Liberty fool you; dropping a nuke on Americans will end badly for Israel. I can pretty much guarantee that Congress would pass a declaration of war within about 3 days, and it would go downhill from there.", 
        "reply": " Ok, i forgot about US presence in Iraq. It still will not prevent Israel from glassing everything else.", 
        "threadID": "672198221_3650065912001", 
        "time": "2009-04-03 00:56:00", 
        "title": "Petraeus: Israel Might Attack Iran", 
        "userID": "PanzerMeister"
    }
]