[
    {
        "content": "\"http://hosted.ap.org/dynamic/stories/U/US_MOUNTAIN_LION_ATTACK?SITE=FLTAM&SECTION=US\" Mountain lion mauls dog that defended owners \"LAKE ELSINORE, Calif. (AP) -- A mountain lion attacked and nearly killed a dog that defended its owners Tuesday on a trail in the Santa Ana Mountains. The dog was severely mauled in the stomach area and rushed to a veterinary hospital for surgery, said Orange County sheriff's spokesman Jim Amormino. The 5-year-old black Labrador mix named Hoagie underwent a four-hour operation and was expected to survive, he said. William Morse told KABC-TV that he was hiking with his wife near a campground in the Cleveland National Forest, about 10 miles from Lake Elsinore, when a 120-pound mountain lion approached.\" Incidentally, I think they should build that War Monument to Military Dogs as well. I'll donate to it.", 
        "intTime": 20090506, 
        "postID": 1, 
        "quote": "", 
        "reply": "\"http://hosted.ap.org/dynamic/stories/U/US_MOUNTAIN_LION_ATTACK?SITE=FLTAM&SECTION=US\" Mountain lion mauls dog that defended owners \"LAKE ELSINORE, Calif. (AP) -- A mountain lion attacked and nearly killed a dog that defended its owners Tuesday on a trail in the Santa Ana Mountains. The dog was severely mauled in the stomach area and rushed to a veterinary hospital for surgery, said Orange County sheriff's spokesman Jim Amormino. The 5-year-old black Labrador mix named Hoagie underwent a four-hour operation and was expected to survive, he said. William Morse told KABC-TV that he was hiking with his wife near a campground in the Cleveland National Forest, about 10 miles from Lake Elsinore, when a 120-pound mountain lion approached.\" Incidentally, I think they should build that War Monument to Military Dogs as well. I'll donate to it.", 
        "threadID": "672198221_2920086222001", 
        "time": "2009-05-06 18:21:00", 
        "title": "Proof Of Mans Best Friend", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "You have too love dogs, feed them and give them a little attention and they'll die for you.", 
        "intTime": 20090507, 
        "postID": 2, 
        "quote": "", 
        "reply": "You have too love dogs, feed them and give them a little attention and they'll die for you.", 
        "threadID": "672198221_2920086222001", 
        "time": "2009-05-07 00:40:00", 
        "title": "Proof Of Mans Best Friend", 
        "userID": "qsam6"
    }, 
    {
        "content": "As A dog trainer....and an owner of more than I care to admit....a little love goes a long way in life...I saw Hoagie last nite on the news....he looked happy to have served Already past the future", 
        "intTime": 20090507, 
        "postID": 3, 
        "quote": "", 
        "reply": "As A dog trainer....and an owner of more than I care to admit....a little love goes a long way in life...I saw Hoagie last nite on the news....he looked happy to have served Already past the future", 
        "threadID": "672198221_2920086222001", 
        "time": "2009-05-07 04:54:00", 
        "title": "Proof Of Mans Best Friend", 
        "userID": "6486143"
    }, 
    {
        "content": "quote: Originally posted by qsam6: You have too love dogs, feed them and give them a little attention and they'll die for you. They are simply amazing. About four years ago, I was in Florida taking my dog out first thing in the morning. I was in a lot of pain from injuries I had from an accident. A new neighbor walked up on us quickly and once I finally saw him and was trying to get out a quick warning to let my dog come to him, my German Shepherd freaked. Good thing I had him on a leash. I thought the guy would be mad but I guess he knew dogs and apologized for walking up on us quickly. I asked the vet about it as I was concerned my dog might hurt someone. Usually he is very social with people. The vet told me that the dog probably sensed the pain I was in and went into a higher level of protection. Apache, my dog, is the most loyal and protective pet I have ever owned in my life. Like you posted, all he costs me is food, attention and the occasional vet bills. Don", 
        "intTime": 20090507, 
        "postID": 4, 
        "quote": "Originally posted by qsam6: You have too love dogs, feed them and give them a little attention and they'll die for you.", 
        "reply": " They are simply amazing. About four years ago, I was in Florida taking my dog out first thing in the morning. I was in a lot of pain from injuries I had from an accident. A new neighbor walked up on us quickly and once I finally saw him and was trying to get out a quick warning to let my dog come to him, my German Shepherd freaked. Good thing I had him on a leash. I thought the guy would be mad but I guess he knew dogs and apologized for walking up on us quickly. I asked the vet about it as I was concerned my dog might hurt someone. Usually he is very social with people. The vet told me that the dog probably sensed the pain I was in and went into a higher level of protection. Apache, my dog, is the most loyal and protective pet I have ever owned in my life. Like you posted, all he costs me is food, attention and the occasional vet bills. Don", 
        "threadID": "672198221_2920086222001", 
        "time": "2009-05-07 06:22:00", 
        "title": "Proof Of Mans Best Friend", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "Thats a good looking Dog Dogs are truly Mans' best friend. This platitude cannot be repeated enough, in much the same way that appreciation for these creatures cannot be measured. You know, I think the Military spends way to much money on these stupid internet/Television/digit sources of entertainment and relaxation in warzones....If they would just give each unit in Iraq/Afgahnistan one dog it would boost and maintain moral higher than TV or the internet....I guarantee it.(It could be any animal actually, Dog, Cat,....monkey?) Some individuals in a land far away were ready to mutiny when an officer shot and killed the pet monkey some soldiers were carrying with them I'm sure the Dog who saved his owner from the Mountain Lion will receive a medal", 
        "intTime": 20090507, 
        "postID": 5, 
        "quote": "", 
        "reply": "Thats a good looking Dog Dogs are truly Mans' best friend. This platitude cannot be repeated enough, in much the same way that appreciation for these creatures cannot be measured. You know, I think the Military spends way to much money on these stupid internet/Television/digit sources of entertainment and relaxation in warzones....If they would just give each unit in Iraq/Afgahnistan one dog it would boost and maintain moral higher than TV or the internet....I guarantee it.(It could be any animal actually, Dog, Cat,....monkey?) Some individuals in a land far away were ready to mutiny when an officer shot and killed the pet monkey some soldiers were carrying with them I'm sure the Dog who saved his owner from the Mountain Lion will receive a medal", 
        "threadID": "672198221_2920086222001", 
        "time": "2009-05-07 09:00:00", 
        "title": "Proof Of Mans Best Friend", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "I always liked what my friend Mark Twain said about dogs: \"Heaven goes by favor; if it went by merit, you would stay out and your dog would go in.\" \"The dog is a gentleman; I hope to go to his heaven, not man's.\" ~Mark Twain Sullivan013", 
        "intTime": 20090507, 
        "postID": 6, 
        "quote": "", 
        "reply": "I always liked what my friend Mark Twain said about dogs: \"Heaven goes by favor; if it went by merit, you would stay out and your dog would go in.\" \"The dog is a gentleman; I hope to go to his heaven, not man's.\" ~Mark Twain Sullivan013", 
        "threadID": "672198221_2920086222001", 
        "time": "2009-05-07 09:05:00", 
        "title": "Proof Of Mans Best Friend", 
        "userID": "sullivan013"
    }, 
    {
        "content": "quote: Originally posted by sullivan013: I always liked what my friend Mark Twain said about dogs: \"Heaven goes by favor; if it went by merit, you would stay out and your dog would go in.\" \"The dog is a gentleman; I hope to go to his heaven, not man's.\" ~Mark Twain Sullivan013 Here's another from Twain \"The principle difference between a dog and a man, is that if you take him in and make him prosperous, he wont stab you in the back.\" Dave", 
        "intTime": 20090507, 
        "postID": 7, 
        "quote": "Originally posted by sullivan013: I always liked what my friend Mark Twain said about dogs: \"Heaven goes by favor; if it went by merit, you would stay out and your dog would go in.\" \"The dog is a gentleman; I hope to go to his heaven, not man's.\" ~Mark Twain Sullivan013", 
        "reply": " Here's another from Twain \"The principle difference between a dog and a man, is that if you take him in and make him prosperous, he wont stab you in the back.\" Dave", 
        "threadID": "672198221_2920086222001", 
        "time": "2009-05-07 09:56:00", 
        "title": "Proof Of Mans Best Friend", 
        "userID": "Grachus"
    }, 
    {
        "content": "Heard today that the 3 yr old kid that wandered off was discovered alive and well this AM off in the woods with 2 dogs lying with him keeping him warm. Anyone doubt he'd have been dead without that body heat?", 
        "intTime": 20090507, 
        "postID": 8, 
        "quote": "", 
        "reply": "Heard today that the 3 yr old kid that wandered off was discovered alive and well this AM off in the woods with 2 dogs lying with him keeping him warm. Anyone doubt he'd have been dead without that body heat?", 
        "threadID": "672198221_2920086222001", 
        "time": "2009-05-07 10:38:00", 
        "title": "Proof Of Mans Best Friend", 
        "userID": "peter3_1"
    }
]