[
    {
        "content": "Disclaimer: This posting IS not BIASED FREE. Read at your own risk. “I think that she is going to be a significant player,” said Gingrich during an interview on CBS’s “Face the Nation”. “But she’s going to be one of 20 or 30 significant players. She’s not going to be the de facto leader.” \"http://thehill.com/leading-the-news/gingrich-says-palin-will-not-be-the-future-gop-leader-2008-11-16.html\" Can't imagine why (to the headline of the news article)", 
        "intTime": 20090420, 
        "postID": 1, 
        "quote": "", 
        "reply": "Disclaimer: This posting IS not BIASED FREE. Read at your own risk. “I think that she is going to be a significant player,” said Gingrich during an interview on CBS’s “Face the Nation”. “But she’s going to be one of 20 or 30 significant players. She’s not going to be the de facto leader.” \"http://thehill.com/leading-the-news/gingrich-says-palin-will-not-be-the-future-gop-leader-2008-11-16.html\" Can't imagine why (to the headline of the news article)", 
        "threadID": "672198221_2990003122001", 
        "time": "2009-04-20 17:48:00", 
        "title": "Gingrich: Palin won't be future GOP leader", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "That woman is going to go down in flames everytime she puts herself forward. Her views are not in line with most people's views and only seek to alienate voters rather than unite them. Her own daughter is proof that her views are not realistic.", 
        "intTime": 20090421, 
        "postID": 2, 
        "quote": "", 
        "reply": "That woman is going to go down in flames everytime she puts herself forward. Her views are not in line with most people's views and only seek to alienate voters rather than unite them. Her own daughter is proof that her views are not realistic.", 
        "threadID": "672198221_2990003122001", 
        "time": "2009-04-21 12:29:00", 
        "title": "Gingrich: Palin won't be future GOP leader", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: That woman is going to go down in flames everytime she puts herself forward. Her views are not in line with most people's views and only seek to alienate voters rather than unite them. Her own daughter is proof that her views are not realistic. She's quite popular with the disconnected. And the disconnected now run the Republican Party - Or haven't you noticed? Maybe a Plain/Limbaugh ticket? And there will be posters whose dreams will come true if this should occur. Good for them! My best wishes... Dave Dave", 
        "intTime": 20090421, 
        "postID": 3, 
        "quote": "Originally posted by mrmixitup: That woman is going to go down in flames everytime she puts herself forward. Her views are not in line with most people's views and only seek to alienate voters rather than unite them. Her own daughter is proof that her views are not realistic.", 
        "reply": " She's quite popular with the disconnected. And the disconnected now run the Republican Party - Or haven't you noticed? Maybe a Plain/Limbaugh ticket? And there will be posters whose dreams will come true if this should occur. Good for them! My best wishes... Dave Dave", 
        "threadID": "672198221_2990003122001", 
        "time": "2009-04-21 12:32:00", 
        "title": "Gingrich: Palin won't be future GOP leader", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: That woman is going to go down in flames everytime she puts herself forward. Her views are not in line with most people's views and only seek to alienate voters rather than unite them. Her own daughter is proof that her views are not realistic. She's quite popular with the disconnected. And the disconnected now run the Republican Party - Or haven't you noticed? Maybe a Palin/Limbaugh ticket? And there will be posters whose dreams will come true if this should occur. Good for them! My best wishes... Dave", 
        "intTime": 20090421, 
        "postID": 4, 
        "quote": "Originally posted by mrmixitup: That woman is going to go down in flames everytime she puts herself forward. Her views are not in line with most people's views and only seek to alienate voters rather than unite them. Her own daughter is proof that her views are not realistic.", 
        "reply": " She's quite popular with the disconnected. And the disconnected now run the Republican Party - Or haven't you noticed? Maybe a Palin/Limbaugh ticket? And there will be posters whose dreams will come true if this should occur. Good for them! My best wishes... Dave", 
        "threadID": "672198221_2990003122001", 
        "time": "2009-04-21 12:34:00", 
        "title": "Gingrich: Palin won't be future GOP leader", 
        "userID": "Grachus"
    }, 
    {
        "content": "THIS JUST IN: Gingrich will not be the future \"leader\" of the republican party, either! WHOOPDEDOOO! So what?", 
        "intTime": 20090421, 
        "postID": 5, 
        "quote": "", 
        "reply": "THIS JUST IN: Gingrich will not be the future \"leader\" of the republican party, either! WHOOPDEDOOO! So what?", 
        "threadID": "672198221_2990003122001", 
        "time": "2009-04-21 12:35:00", 
        "title": "Gingrich: Palin won't be future GOP leader", 
        "userID": "peter3_1"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by mrmixitup: That woman is going to go down in flames everytime she puts herself forward. Her views are not in line with most people's views and only seek to alienate voters rather than unite them. Her own daughter is proof that her views are not realistic. She's quite popular with the disconnected. And the disconnected now run the Republican Party - Or haven't you noticed? Maybe a Palin/Limbaugh ticket? And there will be posters whose dreams will come true if this should occur. Good for them! My best wishes... Dave Limbaugh is ALL about the money and there is NO WAY he would take a pay cut to be VP or even Pres. BEsides if he was in office he might actually have to try to implement what he says he believes in and he would never take that chance.", 
        "intTime": 20090421, 
        "postID": 6, 
        "quote": "Originally posted by Grachus: quote: Originally posted by mrmixitup: That woman is going to go down in flames everytime she puts herself forward. Her views are not in line with most people's views and only seek to alienate voters rather than unite them. Her own daughter is proof that her views are not realistic. She's quite popular with the disconnected. And the disconnected now run the Republican Party - Or haven't you noticed? Maybe a Palin/Limbaugh ticket? And there will be posters whose dreams will come true if this should occur. Good for them! My best wishes... Dave", 
        "reply": " Limbaugh is ALL about the money and there is NO WAY he would take a pay cut to be VP or even Pres. BEsides if he was in office he might actually have to try to implement what he says he believes in and he would never take that chance.", 
        "threadID": "672198221_2990003122001", 
        "time": "2009-04-21 12:44:00", 
        "title": "Gingrich: Palin won't be future GOP leader", 
        "userID": "rayld2"
    }, 
    {
        "content": "Palin has done a pretty good job as Governor in Alaska. She had (and may still have) over an 80% approval rating before the election. She may have ended up as a decent candidate on the national stage in the future but she was not ready in 2008 and she will never recover from the beating she's taken (and continues to take). Most of it is her and John McCain's fault, but it is also true that there was a fair amount of simple bias.", 
        "intTime": 20090421, 
        "postID": 7, 
        "quote": "", 
        "reply": "Palin has done a pretty good job as Governor in Alaska. She had (and may still have) over an 80% approval rating before the election. She may have ended up as a decent candidate on the national stage in the future but she was not ready in 2008 and she will never recover from the beating she's taken (and continues to take). Most of it is her and John McCain's fault, but it is also true that there was a fair amount of simple bias.", 
        "threadID": "672198221_2990003122001", 
        "time": "2009-04-21 13:42:00", 
        "title": "Gingrich: Palin won't be future GOP leader", 
        "userID": "foxred03"
    }, 
    {
        "content": "quote: Originally posted by foxred03: Palin has done a pretty good job as Governor in Alaska. She had (and may still have) over an 80% approval rating before the election. She may have ended up as a decent candidate on the national stage in the future but she was not ready in 2008 and she will never recover from the beating she's taken (and continues to take). Most of it is her and John McCain's fault, but it is also true that there was a fair amount of simple bias. A poll at conservatives4palin.com shows her with 60% approval about 35% very positive in March. This poll is from before Ms. Palin’s highly controversial choice of Wayne Anthony Ross as Attorney General, her not attending the meeting with Alaskan Legislators to discuss the stimulus money, and before her press release on that matter which Republican Senate President Gary Stevens called “absolutely false”, note attacks by Repubs might hurt her approval in Alaska.", 
        "intTime": 20090421, 
        "postID": 8, 
        "quote": "Originally posted by foxred03: Palin has done a pretty good job as Governor in Alaska. She had (and may still have) over an 80% approval rating before the election. She may have ended up as a decent candidate on the national stage in the future but she was not ready in 2008 and she will never recover from the beating she's taken (and continues to take). Most of it is her and John McCain's fault, but it is also true that there was a fair amount of simple bias.", 
        "reply": " A poll at conservatives4palin.com shows her with 60% approval about 35% very positive in March. This poll is from before Ms. Palin’s highly controversial choice of Wayne Anthony Ross as Attorney General, her not attending the meeting with Alaskan Legislators to discuss the stimulus money, and before her press release on that matter which Republican Senate President Gary Stevens called “absolutely false”, note attacks by Repubs might hurt her approval in Alaska.", 
        "threadID": "672198221_2990003122001", 
        "time": "2009-04-21 14:41:00", 
        "title": "Gingrich: Palin won't be future GOP leader", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by foxred03: Palin has done a pretty good job as Governor in Alaska. She had (and may still have) over an 80% approval rating before the election. She may have ended up as a decent candidate on the national stage in the future but she was not ready in 2008 and she will never recover from the beating she's taken (and continues to take). Most of it is her and John McCain's fault, but it is also true that there was a fair amount of simple bias. foxred, Excellent post! Well balanced comments. Count me in agreement. Jack", 
        "intTime": 20090421, 
        "postID": 9, 
        "quote": "Originally posted by foxred03: Palin has done a pretty good job as Governor in Alaska. She had (and may still have) over an 80% approval rating before the election. She may have ended up as a decent candidate on the national stage in the future but she was not ready in 2008 and she will never recover from the beating she's taken (and continues to take). Most of it is her and John McCain's fault, but it is also true that there was a fair amount of simple bias.", 
        "reply": " foxred, Excellent post! Well balanced comments. Count me in agreement. Jack", 
        "threadID": "672198221_2990003122001", 
        "time": "2009-04-21 14:49:00", 
        "title": "Gingrich: Palin won't be future GOP leader", 
        "userID": "jackhunter1"
    }, 
    {
        "content": "Anyone would have to admit that Alaska has got to be the easiest state in the country to govern. People wise there are a less than most major american cities. I mean you have Achorage, Fairbanks and Juneau, beyond that what do you have a buch of little towns like Wasilla or others that are little more than eskimo villages that as long as they get there \"permanent fund\" checks every year could care less about the state goverment. From a actual run things standpoint all she or any of her previous govenors have ever really had to do is re-distribute money that either comes in from the oil companies or in the form of earmarks from the federal goverment. Tough buget choices? No it is more a case of figuring out what to spend it on, it has never really been a case of needing to choose between for example laying off teachers or other state workers or not doing some other state goverment thing that they (the other states) can not afford to do. My dad was mayor of a town bigger than Wasilla and a county supervisor. I am sure he could run Alaska just fine too but would be way out of his league trying to run my home state of WI.", 
        "intTime": 20090421, 
        "postID": 10, 
        "quote": "", 
        "reply": "Anyone would have to admit that Alaska has got to be the easiest state in the country to govern. People wise there are a less than most major american cities. I mean you have Achorage, Fairbanks and Juneau, beyond that what do you have a buch of little towns like Wasilla or others that are little more than eskimo villages that as long as they get there \"permanent fund\" checks every year could care less about the state goverment. From a actual run things standpoint all she or any of her previous govenors have ever really had to do is re-distribute money that either comes in from the oil companies or in the form of earmarks from the federal goverment. Tough buget choices? No it is more a case of figuring out what to spend it on, it has never really been a case of needing to choose between for example laying off teachers or other state workers or not doing some other state goverment thing that they (the other states) can not afford to do. My dad was mayor of a town bigger than Wasilla and a county supervisor. I am sure he could run Alaska just fine too but would be way out of his league trying to run my home state of WI.", 
        "threadID": "672198221_2990003122001", 
        "time": "2009-04-21 16:55:00", 
        "title": "Gingrich: Palin won't be future GOP leader", 
        "userID": "ETCPJ"
    }, 
    {
        "content": "I don’t think it takes a genius to know that Gov. Palin will not be a driving force in the future GOP.", 
        "intTime": 20090421, 
        "postID": 11, 
        "quote": "", 
        "reply": "I don’t think it takes a genius to know that Gov. Palin will not be a driving force in the future GOP.", 
        "threadID": "672198221_2990003122001", 
        "time": "2009-04-21 20:21:00", 
        "title": "Gingrich: Palin won't be future GOP leader", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "quote: Originally posted by IHAWKER: I don’t think it takes a genius to know that Gov. Palin will not be a driving force in the future GOP. More bad news for the GOP. There have been 38 presidential elections since 1860, and Obama received the 6th highest share of the vote for a Democrat. Only FDR (four times) and LBJ (once) exceeded Obama’s percentage. There were three giant demographic shifts that powered this: “— The young broke more than 2-1 Democratic, and it was an intense preference unlikely to fade quickly. As this group ages and replaces older voters, Democrats will benefit even more since this group’s turnout will go up. “— The proportion of minority voters (black, Hispanic, and Asian) shot up and is likely to climb consistently every four years (mainly because of Hispanics). Democrats get about three-quarters of the votes of minorities, taken as a collective group. “— Americans with post-graduate educations have begun to move firmly to the Democrats, not just because of Bush and the economy but also because of the GOP’s conservative stance on social issues (abortion, gay rights, etc.) “Republicans will be in the wilderness for a while, whatever they do. If they want to shorten that time, though, they need to focus on the three populations we discuss in the book. There are many ways to increase their attractiveness, but one essential ingredient is to deemphasize social issues — as unhappy as that may make some fundamentalist Christians.” From a new book out by The University of Virginia’s Larry J. Sabato “The Year of Obama: How Barack Obama Won the White House.” http://www.politico.com/playbook/0409/playbook653.html", 
        "intTime": 20090421, 
        "postID": 12, 
        "quote": "Originally posted by IHAWKER: I don’t think it takes a genius to know that Gov. Palin will not be a driving force in the future GOP.", 
        "reply": " More bad news for the GOP. There have been 38 presidential elections since 1860, and Obama received the 6th highest share of the vote for a Democrat. Only FDR (four times) and LBJ (once) exceeded Obama’s percentage. There were three giant demographic shifts that powered this: “— The young broke more than 2-1 Democratic, and it was an intense preference unlikely to fade quickly. As this group ages and replaces older voters, Democrats will benefit even more since this group’s turnout will go up. “— The proportion of minority voters (black, Hispanic, and Asian) shot up and is likely to climb consistently every four years (mainly because of Hispanics). Democrats get about three-quarters of the votes of minorities, taken as a collective group. “— Americans with post-graduate educations have begun to move firmly to the Democrats, not just because of Bush and the economy but also because of the GOP’s conservative stance on social issues (abortion, gay rights, etc.) “Republicans will be in the wilderness for a while, whatever they do. If they want to shorten that time, though, they need to focus on the three populations we discuss in the book. There are many ways to increase their attractiveness, but one essential ingredient is to deemphasize social issues — as unhappy as that may make some fundamentalist Christians.” From a new book out by The University of Virginia’s Larry J. Sabato “The Year of Obama: How Barack Obama Won the White House.” http://www.politico.com/playbook/0409/playbook653.html", 
        "threadID": "672198221_2990003122001", 
        "time": "2009-04-21 21:09:00", 
        "title": "Gingrich: Palin won't be future GOP leader", 
        "userID": "jdksfcret"
    }, 
    {
        "content": "quote: Originally posted by foxred03: Palin has done a pretty good job as Governor in Alaska. She had (and may still have) over an 80% approval rating before the election. She may have ended up as a decent candidate on the national stage in the future but she was not ready in 2008 and she will never recover from the beating she's taken (and continues to take). Most of it is her and John McCain's fault, but it is also true that there was a fair amount of simple bias. I agree. She wasn't ready, period. She wasn't McCain's pick, he wanted to pick Lieberman. Republicans want someone they can relate to, and they don't relate to her. She's a follower, and not a leader. She would have failed miserably if for some reason McCain couldn't finish out his term, which is ultimately what cost her.", 
        "intTime": 20090422, 
        "postID": 13, 
        "quote": "Originally posted by foxred03: Palin has done a pretty good job as Governor in Alaska. She had (and may still have) over an 80% approval rating before the election. She may have ended up as a decent candidate on the national stage in the future but she was not ready in 2008 and she will never recover from the beating she's taken (and continues to take). Most of it is her and John McCain's fault, but it is also true that there was a fair amount of simple bias.", 
        "reply": " I agree. She wasn't ready, period. She wasn't McCain's pick, he wanted to pick Lieberman. Republicans want someone they can relate to, and they don't relate to her. She's a follower, and not a leader. She would have failed miserably if for some reason McCain couldn't finish out his term, which is ultimately what cost her.", 
        "threadID": "672198221_2990003122001", 
        "time": "2009-04-22 02:38:00", 
        "title": "Gingrich: Palin won't be future GOP leader", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by jdksfcret: More bad news for the GOP. The REAL bad news for the GOP is that every day the country becomes more liberal. Whether they want to admit it or not, it's true. Also, it doesn't help that Mexicans have finally seen through the cloud that Republicans have long held over their heads (as indicated by all the Blue votes along the Rio Grande on the last election).", 
        "intTime": 20090422, 
        "postID": 14, 
        "quote": "Originally posted by jdksfcret: More bad news for the GOP.", 
        "reply": " The REAL bad news for the GOP is that every day the country becomes more liberal. Whether they want to admit it or not, it's true. Also, it doesn't help that Mexicans have finally seen through the cloud that Republicans have long held over their heads (as indicated by all the Blue votes along the Rio Grande on the last election).", 
        "threadID": "672198221_2990003122001", 
        "time": "2009-04-22 02:42:00", 
        "title": "Gingrich: Palin won't be future GOP leader", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "I'm starting to like this democratic rule. Once you figure out their system you can do or say just about anything and get away with it. Come on folks wise up and use it to your advantage.", 
        "intTime": 20090422, 
        "postID": 15, 
        "quote": "", 
        "reply": "I'm starting to like this democratic rule. Once you figure out their system you can do or say just about anything and get away with it. Come on folks wise up and use it to your advantage.", 
        "threadID": "672198221_2990003122001", 
        "time": "2009-04-22 02:46:00", 
        "title": "Gingrich: Palin won't be future GOP leader", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by foxred03: Palin has done a pretty good job as Governor in Alaska. She had (and may still have) over an 80% approval rating before the election. She may have ended up as a decent candidate on the national stage in the future but she was not ready in 2008 and she will never recover from the beating she's taken (and continues to take). Most of it is her and John McCain's fault, but it is also true that there was a fair amount of simple bias. Agreed, but would modify \"fair amount of simple bias\" to read \"insane lunatic attacks\". I seriously doubt Joe Biden would survive the same level of scrutiny.", 
        "intTime": 20090422, 
        "postID": 16, 
        "quote": "Originally posted by foxred03: Palin has done a pretty good job as Governor in Alaska. She had (and may still have) over an 80% approval rating before the election. She may have ended up as a decent candidate on the national stage in the future but she was not ready in 2008 and she will never recover from the beating she's taken (and continues to take). Most of it is her and John McCain's fault, but it is also true that there was a fair amount of simple bias.", 
        "reply": " Agreed, but would modify \"fair amount of simple bias\" to read \"insane lunatic attacks\". I seriously doubt Joe Biden would survive the same level of scrutiny.", 
        "threadID": "672198221_2990003122001", 
        "time": "2009-04-22 02:56:00", 
        "title": "Gingrich: Palin won't be future GOP leader", 
        "userID": "adminnco1"
    }, 
    {
        "content": "Put quite simply, Palin becoming a leader of the GOP would be very bad for it's future as a political party. The GOP needs to ditch the Limbaugh/Palin wing and find themselves a modern day Teddy Roosevelt or Barry Goldwater if they want to avoid going the way of the Whigs.", 
        "intTime": 20090422, 
        "postID": 17, 
        "quote": "", 
        "reply": "Put quite simply, Palin becoming a leader of the GOP would be very bad for it's future as a political party. The GOP needs to ditch the Limbaugh/Palin wing and find themselves a modern day Teddy Roosevelt or Barry Goldwater if they want to avoid going the way of the Whigs.", 
        "threadID": "672198221_2990003122001", 
        "time": "2009-04-22 05:08:00", 
        "title": "Gingrich: Palin won't be future GOP leader", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by jdksfcret: More bad news for the GOP. The REAL bad news for the GOP is that every day the country becomes more liberal. Whether they want to admit it or not, it's true. Also, it doesn't help that Mexicans have finally seen through the cloud that Republicans have long held over their heads (as indicated by all the Blue votes along the Rio Grande on the last election). Actually I don't think the country has shifted to being more liberal I think that the Republican party has shifted further to the right with many of the local party organizations being controlled by religious and/or social conservatives. This control by the party extreme is the same problem that the Demos had from the 70's until the 90's (for the Demos the extreme left lost \"control\" after losing several elections) and will force Repub candidates to present positions most of the country will think are to extreme to get nominated.", 
        "intTime": 20090422, 
        "postID": 18, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by jdksfcret: More bad news for the GOP. The REAL bad news for the GOP is that every day the country becomes more liberal. Whether they want to admit it or not, it's true. Also, it doesn't help that Mexicans have finally seen through the cloud that Republicans have long held over their heads (as indicated by all the Blue votes along the Rio Grande on the last election).", 
        "reply": " Actually I don't think the country has shifted to being more liberal I think that the Republican party has shifted further to the right with many of the local party organizations being controlled by religious and/or social conservatives. This control by the party extreme is the same problem that the Demos had from the 70's until the 90's (for the Demos the extreme left lost \"control\" after losing several elections) and will force Repub candidates to present positions most of the country will think are to extreme to get nominated.", 
        "threadID": "672198221_2990003122001", 
        "time": "2009-04-22 05:59:00", 
        "title": "Gingrich: Palin won't be future GOP leader", 
        "userID": "rayld2"
    }, 
    {
        "content": "The way Obam is publicly degradeing our country and being handled by our enemys, there is no doubt Sarah would be a far far better President!", 
        "intTime": 20090422, 
        "postID": 19, 
        "quote": "", 
        "reply": "The way Obam is publicly degradeing our country and being handled by our enemys, there is no doubt Sarah would be a far far better President!", 
        "threadID": "672198221_2990003122001", 
        "time": "2009-04-22 06:26:00", 
        "title": "Gingrich: Palin won't be future GOP leader", 
        "userID": "EAG154"
    }, 
    {
        "content": "So far Obama has accomplished two things, giveing away billions to corporate to big wigs and bashing the U.S.A. all over the world! Thanks alot Dems", 
        "intTime": 20090422, 
        "postID": 20, 
        "quote": "", 
        "reply": "So far Obama has accomplished two things, giveing away billions to corporate to big wigs and bashing the U.S.A. all over the world! Thanks alot Dems", 
        "threadID": "672198221_2990003122001", 
        "time": "2009-04-22 06:36:00", 
        "title": "Gingrich: Palin won't be future GOP leader", 
        "userID": "EAG154"
    }, 
    {
        "content": "Disclaimer: This posting IS not BIASED FREE. Read at your own risk. “I think that she is going to be a significant player,” said Gingrich during an interview on CBS’s “Face the Nation”. “But she’s going to be one of 20 or 30 significant players. She’s not going to be the de facto leader.” \"http://thehill.com/leading-the-news/gingrich-says-palin-will-not-be-the-future-gop-leader-2008-11-16.html\" Can't imagine why (to the headline of the news article)", 
        "intTime": 20090420, 
        "postID": 21, 
        "quote": "", 
        "reply": "Disclaimer: This posting IS not BIASED FREE. Read at your own risk. “I think that she is going to be a significant player,” said Gingrich during an interview on CBS’s “Face the Nation”. “But she’s going to be one of 20 or 30 significant players. She’s not going to be the de facto leader.” \"http://thehill.com/leading-the-news/gingrich-says-palin-will-not-be-the-future-gop-leader-2008-11-16.html\" Can't imagine why (to the headline of the news article)", 
        "threadID": "672198221_2990003122001", 
        "time": "2009-04-20 17:48:00", 
        "title": "Gingrich: Palin won't be future GOP leader", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "That woman is going to go down in flames everytime she puts herself forward. Her views are not in line with most people's views and only seek to alienate voters rather than unite them. Her own daughter is proof that her views are not realistic.", 
        "intTime": 20090421, 
        "postID": 22, 
        "quote": "", 
        "reply": "That woman is going to go down in flames everytime she puts herself forward. Her views are not in line with most people's views and only seek to alienate voters rather than unite them. Her own daughter is proof that her views are not realistic.", 
        "threadID": "672198221_2990003122001", 
        "time": "2009-04-21 12:29:00", 
        "title": "Gingrich: Palin won't be future GOP leader", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: That woman is going to go down in flames everytime she puts herself forward. Her views are not in line with most people's views and only seek to alienate voters rather than unite them. Her own daughter is proof that her views are not realistic. She's quite popular with the disconnected. And the disconnected now run the Republican Party - Or haven't you noticed? Maybe a Plain/Limbaugh ticket? And there will be posters whose dreams will come true if this should occur. Good for them! My best wishes... Dave Dave", 
        "intTime": 20090421, 
        "postID": 23, 
        "quote": "Originally posted by mrmixitup: That woman is going to go down in flames everytime she puts herself forward. Her views are not in line with most people's views and only seek to alienate voters rather than unite them. Her own daughter is proof that her views are not realistic.", 
        "reply": " She's quite popular with the disconnected. And the disconnected now run the Republican Party - Or haven't you noticed? Maybe a Plain/Limbaugh ticket? And there will be posters whose dreams will come true if this should occur. Good for them! My best wishes... Dave Dave", 
        "threadID": "672198221_2990003122001", 
        "time": "2009-04-21 12:32:00", 
        "title": "Gingrich: Palin won't be future GOP leader", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: That woman is going to go down in flames everytime she puts herself forward. Her views are not in line with most people's views and only seek to alienate voters rather than unite them. Her own daughter is proof that her views are not realistic. She's quite popular with the disconnected. And the disconnected now run the Republican Party - Or haven't you noticed? Maybe a Palin/Limbaugh ticket? And there will be posters whose dreams will come true if this should occur. Good for them! My best wishes... Dave", 
        "intTime": 20090421, 
        "postID": 24, 
        "quote": "Originally posted by mrmixitup: That woman is going to go down in flames everytime she puts herself forward. Her views are not in line with most people's views and only seek to alienate voters rather than unite them. Her own daughter is proof that her views are not realistic.", 
        "reply": " She's quite popular with the disconnected. And the disconnected now run the Republican Party - Or haven't you noticed? Maybe a Palin/Limbaugh ticket? And there will be posters whose dreams will come true if this should occur. Good for them! My best wishes... Dave", 
        "threadID": "672198221_2990003122001", 
        "time": "2009-04-21 12:34:00", 
        "title": "Gingrich: Palin won't be future GOP leader", 
        "userID": "Grachus"
    }, 
    {
        "content": "THIS JUST IN: Gingrich will not be the future \"leader\" of the republican party, either! WHOOPDEDOOO! So what?", 
        "intTime": 20090421, 
        "postID": 25, 
        "quote": "", 
        "reply": "THIS JUST IN: Gingrich will not be the future \"leader\" of the republican party, either! WHOOPDEDOOO! So what?", 
        "threadID": "672198221_2990003122001", 
        "time": "2009-04-21 12:35:00", 
        "title": "Gingrich: Palin won't be future GOP leader", 
        "userID": "peter3_1"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by mrmixitup: That woman is going to go down in flames everytime she puts herself forward. Her views are not in line with most people's views and only seek to alienate voters rather than unite them. Her own daughter is proof that her views are not realistic. She's quite popular with the disconnected. And the disconnected now run the Republican Party - Or haven't you noticed? Maybe a Palin/Limbaugh ticket? And there will be posters whose dreams will come true if this should occur. Good for them! My best wishes... Dave Limbaugh is ALL about the money and there is NO WAY he would take a pay cut to be VP or even Pres. BEsides if he was in office he might actually have to try to implement what he says he believes in and he would never take that chance.", 
        "intTime": 20090421, 
        "postID": 26, 
        "quote": "Originally posted by Grachus: quote: Originally posted by mrmixitup: That woman is going to go down in flames everytime she puts herself forward. Her views are not in line with most people's views and only seek to alienate voters rather than unite them. Her own daughter is proof that her views are not realistic. She's quite popular with the disconnected. And the disconnected now run the Republican Party - Or haven't you noticed? Maybe a Palin/Limbaugh ticket? And there will be posters whose dreams will come true if this should occur. Good for them! My best wishes... Dave", 
        "reply": " Limbaugh is ALL about the money and there is NO WAY he would take a pay cut to be VP or even Pres. BEsides if he was in office he might actually have to try to implement what he says he believes in and he would never take that chance.", 
        "threadID": "672198221_2990003122001", 
        "time": "2009-04-21 12:44:00", 
        "title": "Gingrich: Palin won't be future GOP leader", 
        "userID": "rayld2"
    }, 
    {
        "content": "Palin has done a pretty good job as Governor in Alaska. She had (and may still have) over an 80% approval rating before the election. She may have ended up as a decent candidate on the national stage in the future but she was not ready in 2008 and she will never recover from the beating she's taken (and continues to take). Most of it is her and John McCain's fault, but it is also true that there was a fair amount of simple bias.", 
        "intTime": 20090421, 
        "postID": 27, 
        "quote": "", 
        "reply": "Palin has done a pretty good job as Governor in Alaska. She had (and may still have) over an 80% approval rating before the election. She may have ended up as a decent candidate on the national stage in the future but she was not ready in 2008 and she will never recover from the beating she's taken (and continues to take). Most of it is her and John McCain's fault, but it is also true that there was a fair amount of simple bias.", 
        "threadID": "672198221_2990003122001", 
        "time": "2009-04-21 13:42:00", 
        "title": "Gingrich: Palin won't be future GOP leader", 
        "userID": "foxred03"
    }, 
    {
        "content": "quote: Originally posted by foxred03: Palin has done a pretty good job as Governor in Alaska. She had (and may still have) over an 80% approval rating before the election. She may have ended up as a decent candidate on the national stage in the future but she was not ready in 2008 and she will never recover from the beating she's taken (and continues to take). Most of it is her and John McCain's fault, but it is also true that there was a fair amount of simple bias. A poll at conservatives4palin.com shows her with 60% approval about 35% very positive in March. This poll is from before Ms. Palin’s highly controversial choice of Wayne Anthony Ross as Attorney General, her not attending the meeting with Alaskan Legislators to discuss the stimulus money, and before her press release on that matter which Republican Senate President Gary Stevens called “absolutely false”, note attacks by Repubs might hurt her approval in Alaska.", 
        "intTime": 20090421, 
        "postID": 28, 
        "quote": "Originally posted by foxred03: Palin has done a pretty good job as Governor in Alaska. She had (and may still have) over an 80% approval rating before the election. She may have ended up as a decent candidate on the national stage in the future but she was not ready in 2008 and she will never recover from the beating she's taken (and continues to take). Most of it is her and John McCain's fault, but it is also true that there was a fair amount of simple bias.", 
        "reply": " A poll at conservatives4palin.com shows her with 60% approval about 35% very positive in March. This poll is from before Ms. Palin’s highly controversial choice of Wayne Anthony Ross as Attorney General, her not attending the meeting with Alaskan Legislators to discuss the stimulus money, and before her press release on that matter which Republican Senate President Gary Stevens called “absolutely false”, note attacks by Repubs might hurt her approval in Alaska.", 
        "threadID": "672198221_2990003122001", 
        "time": "2009-04-21 14:41:00", 
        "title": "Gingrich: Palin won't be future GOP leader", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by foxred03: Palin has done a pretty good job as Governor in Alaska. She had (and may still have) over an 80% approval rating before the election. She may have ended up as a decent candidate on the national stage in the future but she was not ready in 2008 and she will never recover from the beating she's taken (and continues to take). Most of it is her and John McCain's fault, but it is also true that there was a fair amount of simple bias. foxred, Excellent post! Well balanced comments. Count me in agreement. Jack", 
        "intTime": 20090421, 
        "postID": 29, 
        "quote": "Originally posted by foxred03: Palin has done a pretty good job as Governor in Alaska. She had (and may still have) over an 80% approval rating before the election. She may have ended up as a decent candidate on the national stage in the future but she was not ready in 2008 and she will never recover from the beating she's taken (and continues to take). Most of it is her and John McCain's fault, but it is also true that there was a fair amount of simple bias.", 
        "reply": " foxred, Excellent post! Well balanced comments. Count me in agreement. Jack", 
        "threadID": "672198221_2990003122001", 
        "time": "2009-04-21 14:49:00", 
        "title": "Gingrich: Palin won't be future GOP leader", 
        "userID": "jackhunter1"
    }, 
    {
        "content": "Anyone would have to admit that Alaska has got to be the easiest state in the country to govern. People wise there are a less than most major american cities. I mean you have Achorage, Fairbanks and Juneau, beyond that what do you have a buch of little towns like Wasilla or others that are little more than eskimo villages that as long as they get there \"permanent fund\" checks every year could care less about the state goverment. From a actual run things standpoint all she or any of her previous govenors have ever really had to do is re-distribute money that either comes in from the oil companies or in the form of earmarks from the federal goverment. Tough buget choices? No it is more a case of figuring out what to spend it on, it has never really been a case of needing to choose between for example laying off teachers or other state workers or not doing some other state goverment thing that they (the other states) can not afford to do. My dad was mayor of a town bigger than Wasilla and a county supervisor. I am sure he could run Alaska just fine too but would be way out of his league trying to run my home state of WI.", 
        "intTime": 20090421, 
        "postID": 30, 
        "quote": "", 
        "reply": "Anyone would have to admit that Alaska has got to be the easiest state in the country to govern. People wise there are a less than most major american cities. I mean you have Achorage, Fairbanks and Juneau, beyond that what do you have a buch of little towns like Wasilla or others that are little more than eskimo villages that as long as they get there \"permanent fund\" checks every year could care less about the state goverment. From a actual run things standpoint all she or any of her previous govenors have ever really had to do is re-distribute money that either comes in from the oil companies or in the form of earmarks from the federal goverment. Tough buget choices? No it is more a case of figuring out what to spend it on, it has never really been a case of needing to choose between for example laying off teachers or other state workers or not doing some other state goverment thing that they (the other states) can not afford to do. My dad was mayor of a town bigger than Wasilla and a county supervisor. I am sure he could run Alaska just fine too but would be way out of his league trying to run my home state of WI.", 
        "threadID": "672198221_2990003122001", 
        "time": "2009-04-21 16:55:00", 
        "title": "Gingrich: Palin won't be future GOP leader", 
        "userID": "ETCPJ"
    }, 
    {
        "content": "I don’t think it takes a genius to know that Gov. Palin will not be a driving force in the future GOP.", 
        "intTime": 20090421, 
        "postID": 31, 
        "quote": "", 
        "reply": "I don’t think it takes a genius to know that Gov. Palin will not be a driving force in the future GOP.", 
        "threadID": "672198221_2990003122001", 
        "time": "2009-04-21 20:21:00", 
        "title": "Gingrich: Palin won't be future GOP leader", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "quote: Originally posted by IHAWKER: I don’t think it takes a genius to know that Gov. Palin will not be a driving force in the future GOP. More bad news for the GOP. There have been 38 presidential elections since 1860, and Obama received the 6th highest share of the vote for a Democrat. Only FDR (four times) and LBJ (once) exceeded Obama’s percentage. There were three giant demographic shifts that powered this: “— The young broke more than 2-1 Democratic, and it was an intense preference unlikely to fade quickly. As this group ages and replaces older voters, Democrats will benefit even more since this group’s turnout will go up. “— The proportion of minority voters (black, Hispanic, and Asian) shot up and is likely to climb consistently every four years (mainly because of Hispanics). Democrats get about three-quarters of the votes of minorities, taken as a collective group. “— Americans with post-graduate educations have begun to move firmly to the Democrats, not just because of Bush and the economy but also because of the GOP’s conservative stance on social issues (abortion, gay rights, etc.) “Republicans will be in the wilderness for a while, whatever they do. If they want to shorten that time, though, they need to focus on the three populations we discuss in the book. There are many ways to increase their attractiveness, but one essential ingredient is to deemphasize social issues — as unhappy as that may make some fundamentalist Christians.” From a new book out by The University of Virginia’s Larry J. Sabato “The Year of Obama: How Barack Obama Won the White House.” http://www.politico.com/playbook/0409/playbook653.html", 
        "intTime": 20090421, 
        "postID": 32, 
        "quote": "Originally posted by IHAWKER: I don’t think it takes a genius to know that Gov. Palin will not be a driving force in the future GOP.", 
        "reply": " More bad news for the GOP. There have been 38 presidential elections since 1860, and Obama received the 6th highest share of the vote for a Democrat. Only FDR (four times) and LBJ (once) exceeded Obama’s percentage. There were three giant demographic shifts that powered this: “— The young broke more than 2-1 Democratic, and it was an intense preference unlikely to fade quickly. As this group ages and replaces older voters, Democrats will benefit even more since this group’s turnout will go up. “— The proportion of minority voters (black, Hispanic, and Asian) shot up and is likely to climb consistently every four years (mainly because of Hispanics). Democrats get about three-quarters of the votes of minorities, taken as a collective group. “— Americans with post-graduate educations have begun to move firmly to the Democrats, not just because of Bush and the economy but also because of the GOP’s conservative stance on social issues (abortion, gay rights, etc.) “Republicans will be in the wilderness for a while, whatever they do. If they want to shorten that time, though, they need to focus on the three populations we discuss in the book. There are many ways to increase their attractiveness, but one essential ingredient is to deemphasize social issues — as unhappy as that may make some fundamentalist Christians.” From a new book out by The University of Virginia’s Larry J. Sabato “The Year of Obama: How Barack Obama Won the White House.” http://www.politico.com/playbook/0409/playbook653.html", 
        "threadID": "672198221_2990003122001", 
        "time": "2009-04-21 21:09:00", 
        "title": "Gingrich: Palin won't be future GOP leader", 
        "userID": "jdksfcret"
    }, 
    {
        "content": "quote: Originally posted by foxred03: Palin has done a pretty good job as Governor in Alaska. She had (and may still have) over an 80% approval rating before the election. She may have ended up as a decent candidate on the national stage in the future but she was not ready in 2008 and she will never recover from the beating she's taken (and continues to take). Most of it is her and John McCain's fault, but it is also true that there was a fair amount of simple bias. I agree. She wasn't ready, period. She wasn't McCain's pick, he wanted to pick Lieberman. Republicans want someone they can relate to, and they don't relate to her. She's a follower, and not a leader. She would have failed miserably if for some reason McCain couldn't finish out his term, which is ultimately what cost her.", 
        "intTime": 20090422, 
        "postID": 33, 
        "quote": "Originally posted by foxred03: Palin has done a pretty good job as Governor in Alaska. She had (and may still have) over an 80% approval rating before the election. She may have ended up as a decent candidate on the national stage in the future but she was not ready in 2008 and she will never recover from the beating she's taken (and continues to take). Most of it is her and John McCain's fault, but it is also true that there was a fair amount of simple bias.", 
        "reply": " I agree. She wasn't ready, period. She wasn't McCain's pick, he wanted to pick Lieberman. Republicans want someone they can relate to, and they don't relate to her. She's a follower, and not a leader. She would have failed miserably if for some reason McCain couldn't finish out his term, which is ultimately what cost her.", 
        "threadID": "672198221_2990003122001", 
        "time": "2009-04-22 02:38:00", 
        "title": "Gingrich: Palin won't be future GOP leader", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by jdksfcret: More bad news for the GOP. The REAL bad news for the GOP is that every day the country becomes more liberal. Whether they want to admit it or not, it's true. Also, it doesn't help that Mexicans have finally seen through the cloud that Republicans have long held over their heads (as indicated by all the Blue votes along the Rio Grande on the last election).", 
        "intTime": 20090422, 
        "postID": 34, 
        "quote": "Originally posted by jdksfcret: More bad news for the GOP.", 
        "reply": " The REAL bad news for the GOP is that every day the country becomes more liberal. Whether they want to admit it or not, it's true. Also, it doesn't help that Mexicans have finally seen through the cloud that Republicans have long held over their heads (as indicated by all the Blue votes along the Rio Grande on the last election).", 
        "threadID": "672198221_2990003122001", 
        "time": "2009-04-22 02:42:00", 
        "title": "Gingrich: Palin won't be future GOP leader", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "I'm starting to like this democratic rule. Once you figure out their system you can do or say just about anything and get away with it. Come on folks wise up and use it to your advantage.", 
        "intTime": 20090422, 
        "postID": 35, 
        "quote": "", 
        "reply": "I'm starting to like this democratic rule. Once you figure out their system you can do or say just about anything and get away with it. Come on folks wise up and use it to your advantage.", 
        "threadID": "672198221_2990003122001", 
        "time": "2009-04-22 02:46:00", 
        "title": "Gingrich: Palin won't be future GOP leader", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by foxred03: Palin has done a pretty good job as Governor in Alaska. She had (and may still have) over an 80% approval rating before the election. She may have ended up as a decent candidate on the national stage in the future but she was not ready in 2008 and she will never recover from the beating she's taken (and continues to take). Most of it is her and John McCain's fault, but it is also true that there was a fair amount of simple bias. Agreed, but would modify \"fair amount of simple bias\" to read \"insane lunatic attacks\". I seriously doubt Joe Biden would survive the same level of scrutiny.", 
        "intTime": 20090422, 
        "postID": 36, 
        "quote": "Originally posted by foxred03: Palin has done a pretty good job as Governor in Alaska. She had (and may still have) over an 80% approval rating before the election. She may have ended up as a decent candidate on the national stage in the future but she was not ready in 2008 and she will never recover from the beating she's taken (and continues to take). Most of it is her and John McCain's fault, but it is also true that there was a fair amount of simple bias.", 
        "reply": " Agreed, but would modify \"fair amount of simple bias\" to read \"insane lunatic attacks\". I seriously doubt Joe Biden would survive the same level of scrutiny.", 
        "threadID": "672198221_2990003122001", 
        "time": "2009-04-22 02:56:00", 
        "title": "Gingrich: Palin won't be future GOP leader", 
        "userID": "adminnco1"
    }, 
    {
        "content": "Put quite simply, Palin becoming a leader of the GOP would be very bad for it's future as a political party. The GOP needs to ditch the Limbaugh/Palin wing and find themselves a modern day Teddy Roosevelt or Barry Goldwater if they want to avoid going the way of the Whigs.", 
        "intTime": 20090422, 
        "postID": 37, 
        "quote": "", 
        "reply": "Put quite simply, Palin becoming a leader of the GOP would be very bad for it's future as a political party. The GOP needs to ditch the Limbaugh/Palin wing and find themselves a modern day Teddy Roosevelt or Barry Goldwater if they want to avoid going the way of the Whigs.", 
        "threadID": "672198221_2990003122001", 
        "time": "2009-04-22 05:08:00", 
        "title": "Gingrich: Palin won't be future GOP leader", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by jdksfcret: More bad news for the GOP. The REAL bad news for the GOP is that every day the country becomes more liberal. Whether they want to admit it or not, it's true. Also, it doesn't help that Mexicans have finally seen through the cloud that Republicans have long held over their heads (as indicated by all the Blue votes along the Rio Grande on the last election). Actually I don't think the country has shifted to being more liberal I think that the Republican party has shifted further to the right with many of the local party organizations being controlled by religious and/or social conservatives. This control by the party extreme is the same problem that the Demos had from the 70's until the 90's (for the Demos the extreme left lost \"control\" after losing several elections) and will force Repub candidates to present positions most of the country will think are to extreme to get nominated.", 
        "intTime": 20090422, 
        "postID": 38, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by jdksfcret: More bad news for the GOP. The REAL bad news for the GOP is that every day the country becomes more liberal. Whether they want to admit it or not, it's true. Also, it doesn't help that Mexicans have finally seen through the cloud that Republicans have long held over their heads (as indicated by all the Blue votes along the Rio Grande on the last election).", 
        "reply": " Actually I don't think the country has shifted to being more liberal I think that the Republican party has shifted further to the right with many of the local party organizations being controlled by religious and/or social conservatives. This control by the party extreme is the same problem that the Demos had from the 70's until the 90's (for the Demos the extreme left lost \"control\" after losing several elections) and will force Repub candidates to present positions most of the country will think are to extreme to get nominated.", 
        "threadID": "672198221_2990003122001", 
        "time": "2009-04-22 05:59:00", 
        "title": "Gingrich: Palin won't be future GOP leader", 
        "userID": "rayld2"
    }, 
    {
        "content": "The way Obam is publicly degradeing our country and being handled by our enemys, there is no doubt Sarah would be a far far better President!", 
        "intTime": 20090422, 
        "postID": 39, 
        "quote": "", 
        "reply": "The way Obam is publicly degradeing our country and being handled by our enemys, there is no doubt Sarah would be a far far better President!", 
        "threadID": "672198221_2990003122001", 
        "time": "2009-04-22 06:26:00", 
        "title": "Gingrich: Palin won't be future GOP leader", 
        "userID": "EAG154"
    }, 
    {
        "content": "So far Obama has accomplished two things, giveing away billions to corporate to big wigs and bashing the U.S.A. all over the world! Thanks alot Dems", 
        "intTime": 20090422, 
        "postID": 40, 
        "quote": "", 
        "reply": "So far Obama has accomplished two things, giveing away billions to corporate to big wigs and bashing the U.S.A. all over the world! Thanks alot Dems", 
        "threadID": "672198221_2990003122001", 
        "time": "2009-04-22 06:36:00", 
        "title": "Gingrich: Palin won't be future GOP leader", 
        "userID": "EAG154"
    }
]