[
    {
        "content": "quote: All Things Considered, April 30, 2009 · Two famous parrots and a bevy of YouTube videos have now convinced scientists that people aren't the only ones who can groove to a musical beat. Dancing has long been thought to be uniquely human. Toddlers will spontaneously bob along with music, but you never see dogs or cats listen to a tune and tap their tails in time. So a couple of years ago, a neurobiologist named Aniruddh Patel was astonished when someone e-mailed him a link to a YouTube video of a sulfur-crested cockatoo named Snowball dancing to the Backstreet Boys. \"I said, you know, this is much more than just a cute pet trick. This is potentially scientifically very important,\" recalls Patel, who studies music and the brain at the Neurosciences Institute in San Diego. I was listening to this on NPR on the way home from work, so decided to go to youtube to see it for myself. *http://www.npr.org/templates/story/story.php?storyId=103629651 The scientists even tried speeding the music up and slowing it down, but Snowball never missed a beat, LOL. The funniest part is at the end when the parrot is so pleased with himself.", 
        "intTime": 20090501, 
        "postID": 1, 
        "quote": "All Things Considered, April 30, 2009 · Two famous parrots and a bevy of YouTube videos have now convinced scientists that people aren't the only ones who can groove to a musical beat. Dancing has long been thought to be uniquely human. Toddlers will spontaneously bob along with music, but you never see dogs or cats listen to a tune and tap their tails in time. So a couple of years ago, a neurobiologist named Aniruddh Patel was astonished when someone e-mailed him a link to a YouTube video of a sulfur-crested cockatoo named Snowball dancing to the Backstreet Boys. \"I said, you know, this is much more than just a cute pet trick. This is potentially scientifically very important,\" recalls Patel, who studies music and the brain at the Neurosciences Institute in San Diego.", 
        "reply": " I was listening to this on NPR on the way home from work, so decided to go to youtube to see it for myself. *http://www.npr.org/templates/story/story.php?storyId=103629651 The scientists even tried speeding the music up and slowing it down, but Snowball never missed a beat, LOL. The funniest part is at the end when the parrot is so pleased with himself.", 
        "threadID": "672198221_7790052222001", 
        "time": "2009-05-01 12:17:00", 
        "title": "Birdies Got Da Rhythm!", 
        "userID": "OrangeCat97"
    }, 
    {
        "content": "We have 2 cockatoos, one Umbrella who is about 7 years old, and a Lesser Sulfur Crested who is about a year old. Yes, our house gets quite loud at times. LOL. Both dance to music quite well, and tend to have preferences to what music is played. If my umbrella, (aptly named PIA, for Pain In the A**), doesn't like a song, she'll say \"knock it off\". If we don't turn it off, she'll tell us to \"shut the 'F' up\". A phrase learned when someone else, oddly enough, while I was deployed. How quickly they pick up phrases!!! I'll try to post some pics after work of her in dance mode.", 
        "intTime": 20090501, 
        "postID": 2, 
        "quote": "", 
        "reply": "We have 2 cockatoos, one Umbrella who is about 7 years old, and a Lesser Sulfur Crested who is about a year old. Yes, our house gets quite loud at times. LOL. Both dance to music quite well, and tend to have preferences to what music is played. If my umbrella, (aptly named PIA, for Pain In the A**), doesn't like a song, she'll say \"knock it off\". If we don't turn it off, she'll tell us to \"shut the 'F' up\". A phrase learned when someone else, oddly enough, while I was deployed. How quickly they pick up phrases!!! I'll try to post some pics after work of her in dance mode.", 
        "threadID": "672198221_7790052222001", 
        "time": "2009-05-01 23:53:00", 
        "title": "Birdies Got Da Rhythm!", 
        "userID": "cajunspc34"
    }
]