[
    {
        "content": "quote: By TOM McELROY, Associated Press Writer Tom Mcelroy, Associated Press Writer Excerpt; NEW YORK – The FBI arrested four men Wednesday in what authorities called a plot to detonate a bomb outside a Jewish temple and to shoot military planes with guided missiles. Officials told The Associated Press the arrests came after a long-running undercover operation that began in Newburgh, N.Y., about 70 miles north of New York City. James Cromitie, David Williams, Onta Williams and Laguerre Payen, all of Newburgh, were charged with conspiracy to use weapons of mass destruction within the United States and conspiracy to acquire and use anti-aircraft missiles, the U.S. attorney's office said. The men had planned to detonate a car with plastic explosives outside a temple in the Bronx neighborhood of Riverdale and to shoot military planes at the New York Air National Guard base at Stewart Airport in Newburgh with Stinger surface-to-air guided missiles, authorities said. The defendants planned to \"destroy a synagogue and a Jewish community center with C-4 plastic explosives,\" Acting U.S. Attorney Lev L. Dassin said. The religious targets were the Riverdale Temple, founded in 1947, and the Riverdale Jewish Center, authorities said. more at (*http://news.yahoo.com/s/ap/20090521/ap_on_re_us/us_temple_plot*)", 
        "intTime": 20090520, 
        "postID": 1, 
        "quote": "By TOM McELROY, Associated Press Writer Tom Mcelroy, Associated Press Writer Excerpt; NEW YORK – The FBI arrested four men Wednesday in what authorities called a plot to detonate a bomb outside a Jewish temple and to shoot military planes with guided missiles. Officials told The Associated Press the arrests came after a long-running undercover operation that began in Newburgh, N.Y., about 70 miles north of New York City. James Cromitie, David Williams, Onta Williams and Laguerre Payen, all of Newburgh, were charged with conspiracy to use weapons of mass destruction within the United States and conspiracy to acquire and use anti-aircraft missiles, the U.S. attorney's office said. The men had planned to detonate a car with plastic explosives outside a temple in the Bronx neighborhood of Riverdale and to shoot military planes at the New York Air National Guard base at Stewart Airport in Newburgh with Stinger surface-to-air guided missiles, authorities said. The defendants planned to \"destroy a synagogue and a Jewish community center with C-4 plastic explosives,\" Acting U.S. Attorney Lev L. Dassin said. The religious targets were the Riverdale Temple, founded in 1947, and the Riverdale Jewish Center, authorities said. more at (*http://news.yahoo.com/s/ap/20090521/ap_on_re_us/us_temple_plot*)", 
        "reply": "", 
        "threadID": "672198221_1910038322001", 
        "time": "2009-05-20 22:03:00", 
        "title": "APNewsBreak: 4 arrested in plot to bomb NYC temple", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "Newburgh, the Detriot of the east. 3 were Jailbird Converts to Islam, and Payan a Haitian immigrant.", 
        "intTime": 20090521, 
        "postID": 2, 
        "quote": "", 
        "reply": "Newburgh, the Detriot of the east. 3 were Jailbird Converts to Islam, and Payan a Haitian immigrant.", 
        "threadID": "672198221_1910038322001", 
        "time": "2009-05-21 00:58:00", 
        "title": "APNewsBreak: 4 arrested in plot to bomb NYC temple", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "What is strange is that the story doesn't mention that Newburgh while 70 mi North of NYC is ONLY ABOUT 15 mi from WEST POINT MILITARY ACADEMY. Having a group of terrorists or a terrorist cell with plans to shoot down military aircraft this close to the Military Academy doesn't bode well", 
        "intTime": 20090521, 
        "postID": 3, 
        "quote": "", 
        "reply": "What is strange is that the story doesn't mention that Newburgh while 70 mi North of NYC is ONLY ABOUT 15 mi from WEST POINT MILITARY ACADEMY. Having a group of terrorists or a terrorist cell with plans to shoot down military aircraft this close to the Military Academy doesn't bode well", 
        "threadID": "672198221_1910038322001", 
        "time": "2009-05-21 01:25:00", 
        "title": "APNewsBreak: 4 arrested in plot to bomb NYC temple", 
        "userID": "ronald45"
    }, 
    {
        "content": "quote: Originally posted by ronald45: What is strange is that the story doesn't mention that Newburgh while 70 mi North of NYC is ONLY ABOUT 15 mi from WEST POINT MILITARY ACADEMY. Having a group of terrorists or a terrorist cell with plans to shoot down military aircraft this close to the Military Academy doesn't bode well Nor the fact that they are convert Islam, but hey if you ask Jack though he will tell you how that isn't possible and they would be lower than rapist. Ain't that right Jack. This is why the GITMO boys don't belong in the Federal Prisons. They would just recruit more. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090521, 
        "postID": 4, 
        "quote": "Originally posted by ronald45: What is strange is that the story doesn't mention that Newburgh while 70 mi North of NYC is ONLY ABOUT 15 mi from WEST POINT MILITARY ACADEMY. Having a group of terrorists or a terrorist cell with plans to shoot down military aircraft this close to the Military Academy doesn't bode well", 
        "reply": " Nor the fact that they are convert Islam, but hey if you ask Jack though he will tell you how that isn't possible and they would be lower than rapist. Ain't that right Jack. This is why the GITMO boys don't belong in the Federal Prisons. They would just recruit more. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_1910038322001", 
        "time": "2009-05-21 05:15:00", 
        "title": "APNewsBreak: 4 arrested in plot to bomb NYC temple", 
        "userID": "Anbar7"
    }, 
    {
        "content": "Isn't it strange that when the FBI needs another terrorist episode to keep up the fear level, they go out and create one out of nothing. This terroist threat didn't come from offshore but was created right here in the good ole' U S of A, by our very own FBI. I wonder how many operations like this they have in the works for next month and the month after that? I think it is time for the FBI to get down to real work and quit making up plots to report.", 
        "intTime": 20090521, 
        "postID": 5, 
        "quote": "", 
        "reply": "Isn't it strange that when the FBI needs another terrorist episode to keep up the fear level, they go out and create one out of nothing. This terroist threat didn't come from offshore but was created right here in the good ole' U S of A, by our very own FBI. I wonder how many operations like this they have in the works for next month and the month after that? I think it is time for the FBI to get down to real work and quit making up plots to report.", 
        "threadID": "672198221_1910038322001", 
        "time": "2009-05-21 06:25:00", 
        "title": "APNewsBreak: 4 arrested in plot to bomb NYC temple", 
        "userID": "Another4Truth"
    }, 
    {
        "content": "quote: Originally posted by Another4Truth: Isn't it strange that when the FBI needs another terrorist episode to keep up the fear level, they go out and create one out of nothing. This terroist threat didn't come from offshore but was created right here in the good ole' U S of A, by our very own FBI. I wonder how many operations like this they have in the works for next month and the month after that? I think it is time for the FBI to get down to real work and quit making up plots to report. Is there a shortage of tinfoil today or what?", 
        "intTime": 20090521, 
        "postID": 6, 
        "quote": "Originally posted by Another4Truth: Isn't it strange that when the FBI needs another terrorist episode to keep up the fear level, they go out and create one out of nothing. This terroist threat didn't come from offshore but was created right here in the good ole' U S of A, by our very own FBI. I wonder how many operations like this they have in the works for next month and the month after that? I think it is time for the FBI to get down to real work and quit making up plots to report.", 
        "reply": " Is there a shortage of tinfoil today or what?", 
        "threadID": "672198221_1910038322001", 
        "time": "2009-05-21 06:29:00", 
        "title": "APNewsBreak: 4 arrested in plot to bomb NYC temple", 
        "userID": "NickBrand"
    }, 
    {
        "content": "quote: Originally posted by NickBrand: quote: Originally posted by Another4Truth: Isn't it strange that when the FBI needs another terrorist episode to keep up the fear level, they go out and create one out of nothing. This terroist threat didn't come from offshore but was created right here in the good ole' U S of A, by our very own FBI. I wonder how many operations like this they have in the works for next month and the month after that? I think it is time for the FBI to get down to real work and quit making up plots to report. Is there a shortage of tinfoil today or what? Quick! shape it into a pointy hat!!!!", 
        "intTime": 20090521, 
        "postID": 7, 
        "quote": "Originally posted by NickBrand: quote: Originally posted by Another4Truth: Isn't it strange that when the FBI needs another terrorist episode to keep up the fear level, they go out and create one out of nothing. This terroist threat didn't come from offshore but was created right here in the good ole' U S of A, by our very own FBI. I wonder how many operations like this they have in the works for next month and the month after that? I think it is time for the FBI to get down to real work and quit making up plots to report. Is there a shortage of tinfoil today or what?", 
        "reply": " Quick! shape it into a pointy hat!!!!", 
        "threadID": "672198221_1910038322001", 
        "time": "2009-05-21 06:38:00", 
        "title": "APNewsBreak: 4 arrested in plot to bomb NYC temple", 
        "userID": "FIST101CAV"
    }, 
    {
        "content": "quote: Originally posted by Another4Truth: Isn't it strange that when the FBI needs another terrorist episode to keep up the fear level, they go out and create one out of nothing. This terroist threat didn't come from offshore but was created right here in the good ole' U S of A, by our very own FBI. I wonder how many operations like this they have in the works for next month and the month after that? I think it is time for the FBI to get down to real work and quit making up plots to report. ________________________________________________ Who are you?", 
        "intTime": 20090521, 
        "postID": 8, 
        "quote": "Originally posted by Another4Truth: Isn't it strange that when the FBI needs another terrorist episode to keep up the fear level, they go out and create one out of nothing. This terroist threat didn't come from offshore but was created right here in the good ole' U S of A, by our very own FBI. I wonder how many operations like this they have in the works for next month and the month after that? I think it is time for the FBI to get down to real work and quit making up plots to report.", 
        "reply": " ________________________________________________ Who are you?", 
        "threadID": "672198221_1910038322001", 
        "time": "2009-05-21 06:40:00", 
        "title": "APNewsBreak: 4 arrested in plot to bomb NYC temple", 
        "userID": "18830518"
    }, 
    {
        "content": "quote: Originally posted by Another4Truth: Isn't it strange that when the FBI needs another terrorist episode to keep up the fear level, they go out and create one out of nothing. This terroist threat didn't come from offshore but was created right here in the good ole' U S of A, by our very own FBI. I wonder how many operations like this they have in the works for next month and the month after that? I think it is time for the FBI to get down to real work and quit making up plots to report.", 
        "intTime": 20090521, 
        "postID": 9, 
        "quote": "Originally posted by Another4Truth: Isn't it strange that when the FBI needs another terrorist episode to keep up the fear level, they go out and create one out of nothing. This terroist threat didn't come from offshore but was created right here in the good ole' U S of A, by our very own FBI. I wonder how many operations like this they have in the works for next month and the month after that? I think it is time for the FBI to get down to real work and quit making up plots to report.", 
        "reply": "", 
        "threadID": "672198221_1910038322001", 
        "time": "2009-05-21 08:28:00", 
        "title": "APNewsBreak: 4 arrested in plot to bomb NYC temple", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "quote: Originally posted by LineDoggie: quote: Originally posted by Another4Truth: Isn't it strange that when the FBI needs another terrorist episode to keep up the fear level, they go out and create one out of nothing. This terroist threat didn't come from offshore but was created right here in the good ole' U S of A, by our very own FBI. I wonder how many operations like this they have in the works for next month and the month after that? I think it is time for the FBI to get down to real work and quit making up plots to report. HOLY CRAP! I spit coffee everywhere!!!!!!", 
        "intTime": 20090521, 
        "postID": 10, 
        "quote": "Originally posted by LineDoggie: quote: Originally posted by Another4Truth: Isn't it strange that when the FBI needs another terrorist episode to keep up the fear level, they go out and create one out of nothing. This terroist threat didn't come from offshore but was created right here in the good ole' U S of A, by our very own FBI. I wonder how many operations like this they have in the works for next month and the month after that? I think it is time for the FBI to get down to real work and quit making up plots to report.", 
        "reply": " HOLY CRAP! I spit coffee everywhere!!!!!!", 
        "threadID": "672198221_1910038322001", 
        "time": "2009-05-21 08:29:00", 
        "title": "APNewsBreak: 4 arrested in plot to bomb NYC temple", 
        "userID": "FIST101CAV"
    }, 
    {
        "content": "Let's make sure to report that the Feds got their tip from a Muslim in the Newburg Mosque.", 
        "intTime": 20090521, 
        "postID": 11, 
        "quote": "", 
        "reply": "Let's make sure to report that the Feds got their tip from a Muslim in the Newburg Mosque.", 
        "threadID": "672198221_1910038322001", 
        "time": "2009-05-21 09:11:00", 
        "title": "APNewsBreak: 4 arrested in plot to bomb NYC temple", 
        "userID": "Sgt_Salaam"
    }, 
    {
        "content": "This is a BS case, although I'm not complaining that they were locked up. Lock up anyone who is ready to bomb a temple or shoot down a plane. But it's bravo Sierra in the sense that, these guys might have never got beyond the talking stage except that the police stepped in and provided them with the \"bombs,\" and provided them with the \"stinger\" missle. Who knows how much \"convincing\" they needed in order to actually do this? As this case moves through the Court system we shall find out more, but just like the Florida case, these guys had no connection with any real terrorists. Will the evidence show that they were basically recruited by the Police? We shall see. But so far the Florida case hasn't resulted in any convictions. Dave", 
        "intTime": 20090521, 
        "postID": 12, 
        "quote": "", 
        "reply": "This is a BS case, although I'm not complaining that they were locked up. Lock up anyone who is ready to bomb a temple or shoot down a plane. But it's bravo Sierra in the sense that, these guys might have never got beyond the talking stage except that the police stepped in and provided them with the \"bombs,\" and provided them with the \"stinger\" missle. Who knows how much \"convincing\" they needed in order to actually do this? As this case moves through the Court system we shall find out more, but just like the Florida case, these guys had no connection with any real terrorists. Will the evidence show that they were basically recruited by the Police? We shall see. But so far the Florida case hasn't resulted in any convictions. Dave", 
        "threadID": "672198221_1910038322001", 
        "time": "2009-05-21 09:23:00", 
        "title": "APNewsBreak: 4 arrested in plot to bomb NYC temple", 
        "userID": "Grachus"
    }, 
    {
        "content": "When do we break out the water and some boards?", 
        "intTime": 20090521, 
        "postID": 13, 
        "quote": "", 
        "reply": "When do we break out the water and some boards?", 
        "threadID": "672198221_1910038322001", 
        "time": "2009-05-21 09:51:00", 
        "title": "APNewsBreak: 4 arrested in plot to bomb NYC temple", 
        "userID": "shuman14"
    }, 
    {
        "content": "quote: Originally posted by Grachus: This is a BS case, although I'm not complaining that they were locked up. Lock up anyone who is ready to bomb a temple or shoot down a plane. But it's bravo Sierra in the sense that, these guys might have never got beyond the talking stage except that the police stepped in and provided them with the \"bombs,\" and provided them with the \"stinger\" missle. Who knows how much \"convincing\" they needed in order to actually do this? As this case moves through the Court system we shall find out more, but just like the Florida case, these guys had no connection with any real terrorists. Will the evidence show that they were basically recruited by the Police? We shall see. But so far the Florida case hasn't resulted in any convictions. Dave When did it become BS to attempt to buy illegal items from undercover agents? I guess the FBI were acting in an un-fair manner. Lets free them then. I'm sure they wouldn't have commited any violence if the FBI hadn't gotten involved. As a matter of fact lets level the playing field a bit more. From now on, all undercover law inforcement personnel are to wear uniforms, or at least display department badges during all undercover operations.", 
        "intTime": 20090521, 
        "postID": 14, 
        "quote": "Originally posted by Grachus: This is a BS case, although I'm not complaining that they were locked up. Lock up anyone who is ready to bomb a temple or shoot down a plane. But it's bravo Sierra in the sense that, these guys might have never got beyond the talking stage except that the police stepped in and provided them with the \"bombs,\" and provided them with the \"stinger\" missle. Who knows how much \"convincing\" they needed in order to actually do this? As this case moves through the Court system we shall find out more, but just like the Florida case, these guys had no connection with any real terrorists. Will the evidence show that they were basically recruited by the Police? We shall see. But so far the Florida case hasn't resulted in any convictions. Dave", 
        "reply": " When did it become BS to attempt to buy illegal items from undercover agents? I guess the FBI were acting in an un-fair manner. Lets free them then. I'm sure they wouldn't have commited any violence if the FBI hadn't gotten involved. As a matter of fact lets level the playing field a bit more. From now on, all undercover law inforcement personnel are to wear uniforms, or at least display department badges during all undercover operations.", 
        "threadID": "672198221_1910038322001", 
        "time": "2009-05-21 10:06:00", 
        "title": "APNewsBreak: 4 arrested in plot to bomb NYC temple", 
        "userID": "FIST101CAV"
    }, 
    {
        "content": "quote: Originally posted by FIST101CAV: quote: Originally posted by Grachus: This is a BS case, although I'm not complaining that they were locked up. Lock up anyone who is ready to bomb a temple or shoot down a plane. But it's bravo Sierra in the sense that, these guys might have never got beyond the talking stage except that the police stepped in and provided them with the \"bombs,\" and provided them with the \"stinger\" missle. Who knows how much \"convincing\" they needed in order to actually do this? As this case moves through the Court system we shall find out more, but just like the Florida case, these guys had no connection with any real terrorists. Will the evidence show that they were basically recruited by the Police? We shall see. But so far the Florida case hasn't resulted in any convictions. Dave When did it become BS to attempt to buy illegal items from undercover agents? I guess the FBI were acting in an un-fair manner. Lets free them then. I'm sure they wouldn't have commited any violence if the FBI hadn't gotten involved. As a matter of fact lets level the playing field a bit more. From now on, all undercover law inforcement personnel are to wear uniforms, or at least display department badges during all undercover operations. The Florida \"Ninja Turtle\" case was quite similar to this one. The FBI paid those guys 50K to be terrorists. Were these men also paid? Were they terrorist fanatics, or were they common criminals recruited to \"do a job?\" Did they buy these \"bombs\" or were the bombs supllied to them? Where the F would these clowns get a hold of a stinger missle? You think they \"bought\" that as well? As if some street punks could buy more than a saturday night special? As I said, I'm not going to waste any tears over people ready to bomb holy sites, or shoot down a plane - But give me a break? Big terrorist case my azz. Dave", 
        "intTime": 20090521, 
        "postID": 15, 
        "quote": "Originally posted by FIST101CAV: quote: Originally posted by Grachus: This is a BS case, although I'm not complaining that they were locked up. Lock up anyone who is ready to bomb a temple or shoot down a plane. But it's bravo Sierra in the sense that, these guys might have never got beyond the talking stage except that the police stepped in and provided them with the \"bombs,\" and provided them with the \"stinger\" missle. Who knows how much \"convincing\" they needed in order to actually do this? As this case moves through the Court system we shall find out more, but just like the Florida case, these guys had no connection with any real terrorists. Will the evidence show that they were basically recruited by the Police? We shall see. But so far the Florida case hasn't resulted in any convictions. Dave When did it become BS to attempt to buy illegal items from undercover agents? I guess the FBI were acting in an un-fair manner. Lets free them then. I'm sure they wouldn't have commited any violence if the FBI hadn't gotten involved. As a matter of fact lets level the playing field a bit more. From now on, all undercover law inforcement personnel are to wear uniforms, or at least display department badges during all undercover operations.", 
        "reply": " The Florida \"Ninja Turtle\" case was quite similar to this one. The FBI paid those guys 50K to be terrorists. Were these men also paid? Were they terrorist fanatics, or were they common criminals recruited to \"do a job?\" Did they buy these \"bombs\" or were the bombs supllied to them? Where the F would these clowns get a hold of a stinger missle? You think they \"bought\" that as well? As if some street punks could buy more than a saturday night special? As I said, I'm not going to waste any tears over people ready to bomb holy sites, or shoot down a plane - But give me a break? Big terrorist case my azz. Dave", 
        "threadID": "672198221_1910038322001", 
        "time": "2009-05-21 10:27:00", 
        "title": "APNewsBreak: 4 arrested in plot to bomb NYC temple", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by FIST101CAV: quote: Originally posted by Grachus: This is a BS case, although I'm not complaining that they were locked up. Lock up anyone who is ready to bomb a temple or shoot down a plane. But it's bravo Sierra in the sense that, these guys might have never got beyond the talking stage except that the police stepped in and provided them with the \"bombs,\" and provided them with the \"stinger\" missle. Who knows how much \"convincing\" they needed in order to actually do this? As this case moves through the Court system we shall find out more, but just like the Florida case, these guys had no connection with any real terrorists. Will the evidence show that they were basically recruited by the Police? We shall see. But so far the Florida case hasn't resulted in any convictions. Dave When did it become BS to attempt to buy illegal items from undercover agents? I guess the FBI were acting in an un-fair manner. Lets free them then. I'm sure they wouldn't have commited any violence if the FBI hadn't gotten involved. As a matter of fact lets level the playing field a bit more. From now on, all undercover law inforcement personnel are to wear uniforms, or at least display department badges during all undercover operations. The Florida \"Ninja Turtle\" case was quite similar to this one. The FBI paid those guys 50K to be terrorists. Were these men also paid? Were they terrorist fanatics, or were they common criminals recruited to \"do a job?\" Did they buy these \"bombs\" or were the bombs supllied to them? Where the F would these clowns get a hold of a stinger missle? You think they \"bought\" that as well? As if some street punks could buy more than a saturday night special? As I said, I'm not going to waste any tears over people ready to bomb holy sites, or shoot down a plane - But give me a break? Big terrorist case my azz. Dave", 
        "intTime": 20090521, 
        "postID": 16, 
        "quote": "Originally posted by Grachus: quote: Originally posted by FIST101CAV: quote: Originally posted by Grachus: This is a BS case, although I'm not complaining that they were locked up. Lock up anyone who is ready to bomb a temple or shoot down a plane. But it's bravo Sierra in the sense that, these guys might have never got beyond the talking stage except that the police stepped in and provided them with the \"bombs,\" and provided them with the \"stinger\" missle. Who knows how much \"convincing\" they needed in order to actually do this? As this case moves through the Court system we shall find out more, but just like the Florida case, these guys had no connection with any real terrorists. Will the evidence show that they were basically recruited by the Police? We shall see. But so far the Florida case hasn't resulted in any convictions. Dave When did it become BS to attempt to buy illegal items from undercover agents? I guess the FBI were acting in an un-fair manner. Lets free them then. I'm sure they wouldn't have commited any violence if the FBI hadn't gotten involved. As a matter of fact lets level the playing field a bit more. From now on, all undercover law inforcement personnel are to wear uniforms, or at least display department badges during all undercover operations. The Florida \"Ninja Turtle\" case was quite similar to this one. The FBI paid those guys 50K to be terrorists. Were these men also paid? Were they terrorist fanatics, or were they common criminals recruited to \"do a job?\" Did they buy these \"bombs\" or were the bombs supllied to them? Where the F would these clowns get a hold of a stinger missle? You think they \"bought\" that as well? As if some street punks could buy more than a saturday night special? As I said, I'm not going to waste any tears over people ready to bomb holy sites, or shoot down a plane - But give me a break? Big terrorist case my azz. Dave", 
        "reply": "", 
        "threadID": "672198221_1910038322001", 
        "time": "2009-05-21 10:32:00", 
        "title": "APNewsBreak: 4 arrested in plot to bomb NYC temple", 
        "userID": "FIST101CAV"
    }, 
    {
        "content": "quote: Originally posted by FIST101CAV: quote: Originally posted by LineDoggie: quote: Originally posted by Another4Truth: Isn't it strange that when the FBI needs another terrorist episode to keep up the fear level, they go out and create one out of nothing. This terroist threat didn't come from offshore but was created right here in the good ole' U S of A, by our very own FBI. I wonder how many operations like this they have in the works for next month and the month after that? I think it is time for the FBI to get down to real work and quit making up plots to report. HOLY CRAP! I spit coffee everywhere!!!!!! Don't you fellers follow up any stories about the FBI and the phony terrorist cases they have manufactured in the last few years to keep up the terrorist threat? Just released a few minutes ago that the FBI admits that none of those arrested were connected to any terrorist groups except for the one the FBI created to entrap these idiots. There are still a lot of right wingers in the FBI held over from the Bush era, just like those in the military still in the Pentagon. 'GOD' is a Space Alien!", 
        "intTime": 20090521, 
        "postID": 17, 
        "quote": "Originally posted by FIST101CAV: quote: Originally posted by LineDoggie: quote: Originally posted by Another4Truth: Isn't it strange that when the FBI needs another terrorist episode to keep up the fear level, they go out and create one out of nothing. This terroist threat didn't come from offshore but was created right here in the good ole' U S of A, by our very own FBI. I wonder how many operations like this they have in the works for next month and the month after that? I think it is time for the FBI to get down to real work and quit making up plots to report. HOLY CRAP! I spit coffee everywhere!!!!!!", 
        "reply": " Don't you fellers follow up any stories about the FBI and the phony terrorist cases they have manufactured in the last few years to keep up the terrorist threat? Just released a few minutes ago that the FBI admits that none of those arrested were connected to any terrorist groups except for the one the FBI created to entrap these idiots. There are still a lot of right wingers in the FBI held over from the Bush era, just like those in the military still in the Pentagon. 'GOD' is a Space Alien!", 
        "threadID": "672198221_1910038322001", 
        "time": "2009-05-21 10:35:00", 
        "title": "APNewsBreak: 4 arrested in plot to bomb NYC temple", 
        "userID": "Another4Truth"
    }, 
    {
        "content": "quote: Originally posted by Another4Truth: Don't you fellers follow up any stories about the FBI and the phony terrorist cases they have manufactured in the last few years to keep up the terrorist threat? Just released a few minutes ago that the FBI admits that none of those arrested were connected to any terrorist groups except for the one the FBI created to entrap these idiots. There are still a lot of right wingers in the FBI held over from the Bush era, just like those in the military still in the Pentagon. 'GOD' is a Space Alien! The reason the Florida case has resulted in aquitals and hung juries is that those terrorists were paid 50K for their time and trouble and the defense claims that for 50K they'll swear alleigance to the KKK and Mothers Against Drunk Driving. What will be revealed in this case? I have no idea. In the Florida case the defendents couldn't procede with their plans until the FBI provided them with the proper Ninja uniforms. In this case apparently these guys actually were ready to blow places up. Screw em. On the other hand, to handle this like they stopped another 9/11 is pure Bravo Sierra. Dave", 
        "intTime": 20090521, 
        "postID": 18, 
        "quote": "Originally posted by Another4Truth: Don't you fellers follow up any stories about the FBI and the phony terrorist cases they have manufactured in the last few years to keep up the terrorist threat? Just released a few minutes ago that the FBI admits that none of those arrested were connected to any terrorist groups except for the one the FBI created to entrap these idiots. There are still a lot of right wingers in the FBI held over from the Bush era, just like those in the military still in the Pentagon. 'GOD' is a Space Alien!", 
        "reply": " The reason the Florida case has resulted in aquitals and hung juries is that those terrorists were paid 50K for their time and trouble and the defense claims that for 50K they'll swear alleigance to the KKK and Mothers Against Drunk Driving. What will be revealed in this case? I have no idea. In the Florida case the defendents couldn't procede with their plans until the FBI provided them with the proper Ninja uniforms. In this case apparently these guys actually were ready to blow places up. Screw em. On the other hand, to handle this like they stopped another 9/11 is pure Bravo Sierra. Dave", 
        "threadID": "672198221_1910038322001", 
        "time": "2009-05-21 11:00:00", 
        "title": "APNewsBreak: 4 arrested in plot to bomb NYC temple", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by FIST101CAV: quote: Originally posted by Grachus: This is a BS case, although I'm not complaining that they were locked up. Lock up anyone who is ready to bomb a temple or shoot down a plane. But it's bravo Sierra in the sense that, these guys might have never got beyond the talking stage except that the police stepped in and provided them with the \"bombs,\" and provided them with the \"stinger\" missle. Who knows how much \"convincing\" they needed in order to actually do this? As this case moves through the Court system we shall find out more, but just like the Florida case, these guys had no connection with any real terrorists. Will the evidence show that they were basically recruited by the Police? We shall see. But so far the Florida case hasn't resulted in any convictions. Dave When did it become BS to attempt to buy illegal items from undercover agents? I guess the FBI were acting in an un-fair manner. Lets free them then. I'm sure they wouldn't have commited any violence if the FBI hadn't gotten involved. As a matter of fact lets level the playing field a bit more. From now on, all undercover law inforcement personnel are to wear uniforms, or at least display department badges during all undercover operations. The Florida \"Ninja Turtle\" case was quite similar to this one. The FBI paid those guys 50K to be terrorists. Were these men also paid? Were they terrorist fanatics, or were they common criminals recruited to \"do a job?\" Did they buy these \"bombs\" or were the bombs supllied to them? Where the F would these clowns get a hold of a stinger missle? You think they \"bought\" that as well? As if some street punks could buy more than a saturday night special? As I said, I'm not going to waste any tears over people ready to bomb holy sites, or shoot down a plane - But give me a break? Big terrorist case my azz. Dave Ever heard of the black market. You can get anything there. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090521, 
        "postID": 19, 
        "quote": "Originally posted by Grachus: quote: Originally posted by FIST101CAV: quote: Originally posted by Grachus: This is a BS case, although I'm not complaining that they were locked up. Lock up anyone who is ready to bomb a temple or shoot down a plane. But it's bravo Sierra in the sense that, these guys might have never got beyond the talking stage except that the police stepped in and provided them with the \"bombs,\" and provided them with the \"stinger\" missle. Who knows how much \"convincing\" they needed in order to actually do this? As this case moves through the Court system we shall find out more, but just like the Florida case, these guys had no connection with any real terrorists. Will the evidence show that they were basically recruited by the Police? We shall see. But so far the Florida case hasn't resulted in any convictions. Dave When did it become BS to attempt to buy illegal items from undercover agents? I guess the FBI were acting in an un-fair manner. Lets free them then. I'm sure they wouldn't have commited any violence if the FBI hadn't gotten involved. As a matter of fact lets level the playing field a bit more. From now on, all undercover law inforcement personnel are to wear uniforms, or at least display department badges during all undercover operations. The Florida \"Ninja Turtle\" case was quite similar to this one. The FBI paid those guys 50K to be terrorists. Were these men also paid? Were they terrorist fanatics, or were they common criminals recruited to \"do a job?\" Did they buy these \"bombs\" or were the bombs supllied to them? Where the F would these clowns get a hold of a stinger missle? You think they \"bought\" that as well? As if some street punks could buy more than a saturday night special? As I said, I'm not going to waste any tears over people ready to bomb holy sites, or shoot down a plane - But give me a break? Big terrorist case my azz. Dave", 
        "reply": " Ever heard of the black market. You can get anything there. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_1910038322001", 
        "time": "2009-05-21 11:02:00", 
        "title": "APNewsBreak: 4 arrested in plot to bomb NYC temple", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by Grachus: quote: Originally posted by FIST101CAV: quote: Originally posted by Grachus: This is a BS case, although I'm not complaining that they were locked up. Lock up anyone who is ready to bomb a temple or shoot down a plane. But it's bravo Sierra in the sense that, these guys might have never got beyond the talking stage except that the police stepped in and provided them with the \"bombs,\" and provided them with the \"stinger\" missle. Who knows how much \"convincing\" they needed in order to actually do this? As this case moves through the Court system we shall find out more, but just like the Florida case, these guys had no connection with any real terrorists. Will the evidence show that they were basically recruited by the Police? We shall see. But so far the Florida case hasn't resulted in any convictions. Dave When did it become BS to attempt to buy illegal items from undercover agents? I guess the FBI were acting in an un-fair manner. Lets free them then. I'm sure they wouldn't have commited any violence if the FBI hadn't gotten involved. As a matter of fact lets level the playing field a bit more. From now on, all undercover law inforcement personnel are to wear uniforms, or at least display department badges during all undercover operations. The Florida \"Ninja Turtle\" case was quite similar to this one. The FBI paid those guys 50K to be terrorists. Were these men also paid? Were they terrorist fanatics, or were they common criminals recruited to \"do a job?\" Did they buy these \"bombs\" or were the bombs supllied to them? Where the F would these clowns get a hold of a stinger missle? You think they \"bought\" that as well? As if some street punks could buy more than a saturday night special? As I said, I'm not going to waste any tears over people ready to bomb holy sites, or shoot down a plane - But give me a break? Big terrorist case my azz. Dave Ever heard of the black market. You can get anything there. There's a black market, and then there's a black market. These guys would be lucky to be able to score for a Saturday Night special. GMAB - They're just street thugs with the \"Big Time\" connections to score a basket of hot fruit. Obviously it's way too soon for me or anyone else to be certain of anything. But this case \"smells\" bad. They would have a hard time buying legal black powder let alone getting their hands on C4. Stinger Missle? You're kidding right? Dave", 
        "intTime": 20090521, 
        "postID": 20, 
        "quote": "Originally posted by Anbar7: quote: Originally posted by Grachus: quote: Originally posted by FIST101CAV: quote: Originally posted by Grachus: This is a BS case, although I'm not complaining that they were locked up. Lock up anyone who is ready to bomb a temple or shoot down a plane. But it's bravo Sierra in the sense that, these guys might have never got beyond the talking stage except that the police stepped in and provided them with the \"bombs,\" and provided them with the \"stinger\" missle. Who knows how much \"convincing\" they needed in order to actually do this? As this case moves through the Court system we shall find out more, but just like the Florida case, these guys had no connection with any real terrorists. Will the evidence show that they were basically recruited by the Police? We shall see. But so far the Florida case hasn't resulted in any convictions. Dave When did it become BS to attempt to buy illegal items from undercover agents? I guess the FBI were acting in an un-fair manner. Lets free them then. I'm sure they wouldn't have commited any violence if the FBI hadn't gotten involved. As a matter of fact lets level the playing field a bit more. From now on, all undercover law inforcement personnel are to wear uniforms, or at least display department badges during all undercover operations. The Florida \"Ninja Turtle\" case was quite similar to this one. The FBI paid those guys 50K to be terrorists. Were these men also paid? Were they terrorist fanatics, or were they common criminals recruited to \"do a job?\" Did they buy these \"bombs\" or were the bombs supllied to them? Where the F would these clowns get a hold of a stinger missle? You think they \"bought\" that as well? As if some street punks could buy more than a saturday night special? As I said, I'm not going to waste any tears over people ready to bomb holy sites, or shoot down a plane - But give me a break? Big terrorist case my azz. Dave Ever heard of the black market. You can get anything there.", 
        "reply": " There's a black market, and then there's a black market. These guys would be lucky to be able to score for a Saturday Night special. GMAB - They're just street thugs with the \"Big Time\" connections to score a basket of hot fruit. Obviously it's way too soon for me or anyone else to be certain of anything. But this case \"smells\" bad. They would have a hard time buying legal black powder let alone getting their hands on C4. Stinger Missle? You're kidding right? Dave", 
        "threadID": "672198221_1910038322001", 
        "time": "2009-05-21 11:11:00", 
        "title": "APNewsBreak: 4 arrested in plot to bomb NYC temple", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: By TOM McELROY, Associated Press Writer Tom Mcelroy, Associated Press Writer Excerpt; NEW YORK – The FBI arrested four men Wednesday in what authorities called a plot to detonate a bomb outside a Jewish temple and to shoot military planes with guided missiles. Officials told The Associated Press the arrests came after a long-running undercover operation that began in Newburgh, N.Y., about 70 miles north of New York City. James Cromitie, David Williams, Onta Williams and Laguerre Payen, all of Newburgh, were charged with conspiracy to use weapons of mass destruction within the United States and conspiracy to acquire and use anti-aircraft missiles, the U.S. attorney's office said. The men had planned to detonate a car with plastic explosives outside a temple in the Bronx neighborhood of Riverdale and to shoot military planes at the New York Air National Guard base at Stewart Airport in Newburgh with Stinger surface-to-air guided missiles, authorities said. The defendants planned to \"destroy a synagogue and a Jewish community center with C-4 plastic explosives,\" Acting U.S. Attorney Lev L. Dassin said. The religious targets were the Riverdale Temple, founded in 1947, and the Riverdale Jewish Center, authorities said. more at (*http://news.yahoo.com/s/ap/20090521/ap_on_re_us/us_temple_plot*)", 
        "intTime": 20090520, 
        "postID": 21, 
        "quote": "By TOM McELROY, Associated Press Writer Tom Mcelroy, Associated Press Writer Excerpt; NEW YORK – The FBI arrested four men Wednesday in what authorities called a plot to detonate a bomb outside a Jewish temple and to shoot military planes with guided missiles. Officials told The Associated Press the arrests came after a long-running undercover operation that began in Newburgh, N.Y., about 70 miles north of New York City. James Cromitie, David Williams, Onta Williams and Laguerre Payen, all of Newburgh, were charged with conspiracy to use weapons of mass destruction within the United States and conspiracy to acquire and use anti-aircraft missiles, the U.S. attorney's office said. The men had planned to detonate a car with plastic explosives outside a temple in the Bronx neighborhood of Riverdale and to shoot military planes at the New York Air National Guard base at Stewart Airport in Newburgh with Stinger surface-to-air guided missiles, authorities said. The defendants planned to \"destroy a synagogue and a Jewish community center with C-4 plastic explosives,\" Acting U.S. Attorney Lev L. Dassin said. The religious targets were the Riverdale Temple, founded in 1947, and the Riverdale Jewish Center, authorities said. more at (*http://news.yahoo.com/s/ap/20090521/ap_on_re_us/us_temple_plot*)", 
        "reply": "", 
        "threadID": "672198221_1910038322001", 
        "time": "2009-05-20 22:03:00", 
        "title": "APNewsBreak: 4 arrested in plot to bomb NYC temple", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "Newburgh, the Detriot of the east. 3 were Jailbird Converts to Islam, and Payan a Haitian immigrant.", 
        "intTime": 20090521, 
        "postID": 22, 
        "quote": "", 
        "reply": "Newburgh, the Detriot of the east. 3 were Jailbird Converts to Islam, and Payan a Haitian immigrant.", 
        "threadID": "672198221_1910038322001", 
        "time": "2009-05-21 00:58:00", 
        "title": "APNewsBreak: 4 arrested in plot to bomb NYC temple", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "What is strange is that the story doesn't mention that Newburgh while 70 mi North of NYC is ONLY ABOUT 15 mi from WEST POINT MILITARY ACADEMY. Having a group of terrorists or a terrorist cell with plans to shoot down military aircraft this close to the Military Academy doesn't bode well", 
        "intTime": 20090521, 
        "postID": 23, 
        "quote": "", 
        "reply": "What is strange is that the story doesn't mention that Newburgh while 70 mi North of NYC is ONLY ABOUT 15 mi from WEST POINT MILITARY ACADEMY. Having a group of terrorists or a terrorist cell with plans to shoot down military aircraft this close to the Military Academy doesn't bode well", 
        "threadID": "672198221_1910038322001", 
        "time": "2009-05-21 01:25:00", 
        "title": "APNewsBreak: 4 arrested in plot to bomb NYC temple", 
        "userID": "ronald45"
    }, 
    {
        "content": "quote: Originally posted by ronald45: What is strange is that the story doesn't mention that Newburgh while 70 mi North of NYC is ONLY ABOUT 15 mi from WEST POINT MILITARY ACADEMY. Having a group of terrorists or a terrorist cell with plans to shoot down military aircraft this close to the Military Academy doesn't bode well Nor the fact that they are convert Islam, but hey if you ask Jack though he will tell you how that isn't possible and they would be lower than rapist. Ain't that right Jack. This is why the GITMO boys don't belong in the Federal Prisons. They would just recruit more. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090521, 
        "postID": 24, 
        "quote": "Originally posted by ronald45: What is strange is that the story doesn't mention that Newburgh while 70 mi North of NYC is ONLY ABOUT 15 mi from WEST POINT MILITARY ACADEMY. Having a group of terrorists or a terrorist cell with plans to shoot down military aircraft this close to the Military Academy doesn't bode well", 
        "reply": " Nor the fact that they are convert Islam, but hey if you ask Jack though he will tell you how that isn't possible and they would be lower than rapist. Ain't that right Jack. This is why the GITMO boys don't belong in the Federal Prisons. They would just recruit more. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_1910038322001", 
        "time": "2009-05-21 05:15:00", 
        "title": "APNewsBreak: 4 arrested in plot to bomb NYC temple", 
        "userID": "Anbar7"
    }, 
    {
        "content": "Isn't it strange that when the FBI needs another terrorist episode to keep up the fear level, they go out and create one out of nothing. This terroist threat didn't come from offshore but was created right here in the good ole' U S of A, by our very own FBI. I wonder how many operations like this they have in the works for next month and the month after that? I think it is time for the FBI to get down to real work and quit making up plots to report.", 
        "intTime": 20090521, 
        "postID": 25, 
        "quote": "", 
        "reply": "Isn't it strange that when the FBI needs another terrorist episode to keep up the fear level, they go out and create one out of nothing. This terroist threat didn't come from offshore but was created right here in the good ole' U S of A, by our very own FBI. I wonder how many operations like this they have in the works for next month and the month after that? I think it is time for the FBI to get down to real work and quit making up plots to report.", 
        "threadID": "672198221_1910038322001", 
        "time": "2009-05-21 06:25:00", 
        "title": "APNewsBreak: 4 arrested in plot to bomb NYC temple", 
        "userID": "Another4Truth"
    }, 
    {
        "content": "quote: Originally posted by Another4Truth: Isn't it strange that when the FBI needs another terrorist episode to keep up the fear level, they go out and create one out of nothing. This terroist threat didn't come from offshore but was created right here in the good ole' U S of A, by our very own FBI. I wonder how many operations like this they have in the works for next month and the month after that? I think it is time for the FBI to get down to real work and quit making up plots to report. Is there a shortage of tinfoil today or what?", 
        "intTime": 20090521, 
        "postID": 26, 
        "quote": "Originally posted by Another4Truth: Isn't it strange that when the FBI needs another terrorist episode to keep up the fear level, they go out and create one out of nothing. This terroist threat didn't come from offshore but was created right here in the good ole' U S of A, by our very own FBI. I wonder how many operations like this they have in the works for next month and the month after that? I think it is time for the FBI to get down to real work and quit making up plots to report.", 
        "reply": " Is there a shortage of tinfoil today or what?", 
        "threadID": "672198221_1910038322001", 
        "time": "2009-05-21 06:29:00", 
        "title": "APNewsBreak: 4 arrested in plot to bomb NYC temple", 
        "userID": "NickBrand"
    }, 
    {
        "content": "quote: Originally posted by NickBrand: quote: Originally posted by Another4Truth: Isn't it strange that when the FBI needs another terrorist episode to keep up the fear level, they go out and create one out of nothing. This terroist threat didn't come from offshore but was created right here in the good ole' U S of A, by our very own FBI. I wonder how many operations like this they have in the works for next month and the month after that? I think it is time for the FBI to get down to real work and quit making up plots to report. Is there a shortage of tinfoil today or what? Quick! shape it into a pointy hat!!!!", 
        "intTime": 20090521, 
        "postID": 27, 
        "quote": "Originally posted by NickBrand: quote: Originally posted by Another4Truth: Isn't it strange that when the FBI needs another terrorist episode to keep up the fear level, they go out and create one out of nothing. This terroist threat didn't come from offshore but was created right here in the good ole' U S of A, by our very own FBI. I wonder how many operations like this they have in the works for next month and the month after that? I think it is time for the FBI to get down to real work and quit making up plots to report. Is there a shortage of tinfoil today or what?", 
        "reply": " Quick! shape it into a pointy hat!!!!", 
        "threadID": "672198221_1910038322001", 
        "time": "2009-05-21 06:38:00", 
        "title": "APNewsBreak: 4 arrested in plot to bomb NYC temple", 
        "userID": "FIST101CAV"
    }, 
    {
        "content": "quote: Originally posted by Another4Truth: Isn't it strange that when the FBI needs another terrorist episode to keep up the fear level, they go out and create one out of nothing. This terroist threat didn't come from offshore but was created right here in the good ole' U S of A, by our very own FBI. I wonder how many operations like this they have in the works for next month and the month after that? I think it is time for the FBI to get down to real work and quit making up plots to report. ________________________________________________ Who are you?", 
        "intTime": 20090521, 
        "postID": 28, 
        "quote": "Originally posted by Another4Truth: Isn't it strange that when the FBI needs another terrorist episode to keep up the fear level, they go out and create one out of nothing. This terroist threat didn't come from offshore but was created right here in the good ole' U S of A, by our very own FBI. I wonder how many operations like this they have in the works for next month and the month after that? I think it is time for the FBI to get down to real work and quit making up plots to report.", 
        "reply": " ________________________________________________ Who are you?", 
        "threadID": "672198221_1910038322001", 
        "time": "2009-05-21 06:40:00", 
        "title": "APNewsBreak: 4 arrested in plot to bomb NYC temple", 
        "userID": "18830518"
    }, 
    {
        "content": "quote: Originally posted by Another4Truth: Isn't it strange that when the FBI needs another terrorist episode to keep up the fear level, they go out and create one out of nothing. This terroist threat didn't come from offshore but was created right here in the good ole' U S of A, by our very own FBI. I wonder how many operations like this they have in the works for next month and the month after that? I think it is time for the FBI to get down to real work and quit making up plots to report.", 
        "intTime": 20090521, 
        "postID": 29, 
        "quote": "Originally posted by Another4Truth: Isn't it strange that when the FBI needs another terrorist episode to keep up the fear level, they go out and create one out of nothing. This terroist threat didn't come from offshore but was created right here in the good ole' U S of A, by our very own FBI. I wonder how many operations like this they have in the works for next month and the month after that? I think it is time for the FBI to get down to real work and quit making up plots to report.", 
        "reply": "", 
        "threadID": "672198221_1910038322001", 
        "time": "2009-05-21 08:28:00", 
        "title": "APNewsBreak: 4 arrested in plot to bomb NYC temple", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "quote: Originally posted by LineDoggie: quote: Originally posted by Another4Truth: Isn't it strange that when the FBI needs another terrorist episode to keep up the fear level, they go out and create one out of nothing. This terroist threat didn't come from offshore but was created right here in the good ole' U S of A, by our very own FBI. I wonder how many operations like this they have in the works for next month and the month after that? I think it is time for the FBI to get down to real work and quit making up plots to report. HOLY CRAP! I spit coffee everywhere!!!!!!", 
        "intTime": 20090521, 
        "postID": 30, 
        "quote": "Originally posted by LineDoggie: quote: Originally posted by Another4Truth: Isn't it strange that when the FBI needs another terrorist episode to keep up the fear level, they go out and create one out of nothing. This terroist threat didn't come from offshore but was created right here in the good ole' U S of A, by our very own FBI. I wonder how many operations like this they have in the works for next month and the month after that? I think it is time for the FBI to get down to real work and quit making up plots to report.", 
        "reply": " HOLY CRAP! I spit coffee everywhere!!!!!!", 
        "threadID": "672198221_1910038322001", 
        "time": "2009-05-21 08:29:00", 
        "title": "APNewsBreak: 4 arrested in plot to bomb NYC temple", 
        "userID": "FIST101CAV"
    }, 
    {
        "content": "Let's make sure to report that the Feds got their tip from a Muslim in the Newburg Mosque.", 
        "intTime": 20090521, 
        "postID": 31, 
        "quote": "", 
        "reply": "Let's make sure to report that the Feds got their tip from a Muslim in the Newburg Mosque.", 
        "threadID": "672198221_1910038322001", 
        "time": "2009-05-21 09:11:00", 
        "title": "APNewsBreak: 4 arrested in plot to bomb NYC temple", 
        "userID": "Sgt_Salaam"
    }, 
    {
        "content": "This is a BS case, although I'm not complaining that they were locked up. Lock up anyone who is ready to bomb a temple or shoot down a plane. But it's bravo Sierra in the sense that, these guys might have never got beyond the talking stage except that the police stepped in and provided them with the \"bombs,\" and provided them with the \"stinger\" missle. Who knows how much \"convincing\" they needed in order to actually do this? As this case moves through the Court system we shall find out more, but just like the Florida case, these guys had no connection with any real terrorists. Will the evidence show that they were basically recruited by the Police? We shall see. But so far the Florida case hasn't resulted in any convictions. Dave", 
        "intTime": 20090521, 
        "postID": 32, 
        "quote": "", 
        "reply": "This is a BS case, although I'm not complaining that they were locked up. Lock up anyone who is ready to bomb a temple or shoot down a plane. But it's bravo Sierra in the sense that, these guys might have never got beyond the talking stage except that the police stepped in and provided them with the \"bombs,\" and provided them with the \"stinger\" missle. Who knows how much \"convincing\" they needed in order to actually do this? As this case moves through the Court system we shall find out more, but just like the Florida case, these guys had no connection with any real terrorists. Will the evidence show that they were basically recruited by the Police? We shall see. But so far the Florida case hasn't resulted in any convictions. Dave", 
        "threadID": "672198221_1910038322001", 
        "time": "2009-05-21 09:23:00", 
        "title": "APNewsBreak: 4 arrested in plot to bomb NYC temple", 
        "userID": "Grachus"
    }, 
    {
        "content": "When do we break out the water and some boards?", 
        "intTime": 20090521, 
        "postID": 33, 
        "quote": "", 
        "reply": "When do we break out the water and some boards?", 
        "threadID": "672198221_1910038322001", 
        "time": "2009-05-21 09:51:00", 
        "title": "APNewsBreak: 4 arrested in plot to bomb NYC temple", 
        "userID": "shuman14"
    }, 
    {
        "content": "quote: Originally posted by Grachus: This is a BS case, although I'm not complaining that they were locked up. Lock up anyone who is ready to bomb a temple or shoot down a plane. But it's bravo Sierra in the sense that, these guys might have never got beyond the talking stage except that the police stepped in and provided them with the \"bombs,\" and provided them with the \"stinger\" missle. Who knows how much \"convincing\" they needed in order to actually do this? As this case moves through the Court system we shall find out more, but just like the Florida case, these guys had no connection with any real terrorists. Will the evidence show that they were basically recruited by the Police? We shall see. But so far the Florida case hasn't resulted in any convictions. Dave When did it become BS to attempt to buy illegal items from undercover agents? I guess the FBI were acting in an un-fair manner. Lets free them then. I'm sure they wouldn't have commited any violence if the FBI hadn't gotten involved. As a matter of fact lets level the playing field a bit more. From now on, all undercover law inforcement personnel are to wear uniforms, or at least display department badges during all undercover operations.", 
        "intTime": 20090521, 
        "postID": 34, 
        "quote": "Originally posted by Grachus: This is a BS case, although I'm not complaining that they were locked up. Lock up anyone who is ready to bomb a temple or shoot down a plane. But it's bravo Sierra in the sense that, these guys might have never got beyond the talking stage except that the police stepped in and provided them with the \"bombs,\" and provided them with the \"stinger\" missle. Who knows how much \"convincing\" they needed in order to actually do this? As this case moves through the Court system we shall find out more, but just like the Florida case, these guys had no connection with any real terrorists. Will the evidence show that they were basically recruited by the Police? We shall see. But so far the Florida case hasn't resulted in any convictions. Dave", 
        "reply": " When did it become BS to attempt to buy illegal items from undercover agents? I guess the FBI were acting in an un-fair manner. Lets free them then. I'm sure they wouldn't have commited any violence if the FBI hadn't gotten involved. As a matter of fact lets level the playing field a bit more. From now on, all undercover law inforcement personnel are to wear uniforms, or at least display department badges during all undercover operations.", 
        "threadID": "672198221_1910038322001", 
        "time": "2009-05-21 10:06:00", 
        "title": "APNewsBreak: 4 arrested in plot to bomb NYC temple", 
        "userID": "FIST101CAV"
    }, 
    {
        "content": "quote: Originally posted by FIST101CAV: quote: Originally posted by Grachus: This is a BS case, although I'm not complaining that they were locked up. Lock up anyone who is ready to bomb a temple or shoot down a plane. But it's bravo Sierra in the sense that, these guys might have never got beyond the talking stage except that the police stepped in and provided them with the \"bombs,\" and provided them with the \"stinger\" missle. Who knows how much \"convincing\" they needed in order to actually do this? As this case moves through the Court system we shall find out more, but just like the Florida case, these guys had no connection with any real terrorists. Will the evidence show that they were basically recruited by the Police? We shall see. But so far the Florida case hasn't resulted in any convictions. Dave When did it become BS to attempt to buy illegal items from undercover agents? I guess the FBI were acting in an un-fair manner. Lets free them then. I'm sure they wouldn't have commited any violence if the FBI hadn't gotten involved. As a matter of fact lets level the playing field a bit more. From now on, all undercover law inforcement personnel are to wear uniforms, or at least display department badges during all undercover operations. The Florida \"Ninja Turtle\" case was quite similar to this one. The FBI paid those guys 50K to be terrorists. Were these men also paid? Were they terrorist fanatics, or were they common criminals recruited to \"do a job?\" Did they buy these \"bombs\" or were the bombs supllied to them? Where the F would these clowns get a hold of a stinger missle? You think they \"bought\" that as well? As if some street punks could buy more than a saturday night special? As I said, I'm not going to waste any tears over people ready to bomb holy sites, or shoot down a plane - But give me a break? Big terrorist case my azz. Dave", 
        "intTime": 20090521, 
        "postID": 35, 
        "quote": "Originally posted by FIST101CAV: quote: Originally posted by Grachus: This is a BS case, although I'm not complaining that they were locked up. Lock up anyone who is ready to bomb a temple or shoot down a plane. But it's bravo Sierra in the sense that, these guys might have never got beyond the talking stage except that the police stepped in and provided them with the \"bombs,\" and provided them with the \"stinger\" missle. Who knows how much \"convincing\" they needed in order to actually do this? As this case moves through the Court system we shall find out more, but just like the Florida case, these guys had no connection with any real terrorists. Will the evidence show that they were basically recruited by the Police? We shall see. But so far the Florida case hasn't resulted in any convictions. Dave When did it become BS to attempt to buy illegal items from undercover agents? I guess the FBI were acting in an un-fair manner. Lets free them then. I'm sure they wouldn't have commited any violence if the FBI hadn't gotten involved. As a matter of fact lets level the playing field a bit more. From now on, all undercover law inforcement personnel are to wear uniforms, or at least display department badges during all undercover operations.", 
        "reply": " The Florida \"Ninja Turtle\" case was quite similar to this one. The FBI paid those guys 50K to be terrorists. Were these men also paid? Were they terrorist fanatics, or were they common criminals recruited to \"do a job?\" Did they buy these \"bombs\" or were the bombs supllied to them? Where the F would these clowns get a hold of a stinger missle? You think they \"bought\" that as well? As if some street punks could buy more than a saturday night special? As I said, I'm not going to waste any tears over people ready to bomb holy sites, or shoot down a plane - But give me a break? Big terrorist case my azz. Dave", 
        "threadID": "672198221_1910038322001", 
        "time": "2009-05-21 10:27:00", 
        "title": "APNewsBreak: 4 arrested in plot to bomb NYC temple", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by FIST101CAV: quote: Originally posted by Grachus: This is a BS case, although I'm not complaining that they were locked up. Lock up anyone who is ready to bomb a temple or shoot down a plane. But it's bravo Sierra in the sense that, these guys might have never got beyond the talking stage except that the police stepped in and provided them with the \"bombs,\" and provided them with the \"stinger\" missle. Who knows how much \"convincing\" they needed in order to actually do this? As this case moves through the Court system we shall find out more, but just like the Florida case, these guys had no connection with any real terrorists. Will the evidence show that they were basically recruited by the Police? We shall see. But so far the Florida case hasn't resulted in any convictions. Dave When did it become BS to attempt to buy illegal items from undercover agents? I guess the FBI were acting in an un-fair manner. Lets free them then. I'm sure they wouldn't have commited any violence if the FBI hadn't gotten involved. As a matter of fact lets level the playing field a bit more. From now on, all undercover law inforcement personnel are to wear uniforms, or at least display department badges during all undercover operations. The Florida \"Ninja Turtle\" case was quite similar to this one. The FBI paid those guys 50K to be terrorists. Were these men also paid? Were they terrorist fanatics, or were they common criminals recruited to \"do a job?\" Did they buy these \"bombs\" or were the bombs supllied to them? Where the F would these clowns get a hold of a stinger missle? You think they \"bought\" that as well? As if some street punks could buy more than a saturday night special? As I said, I'm not going to waste any tears over people ready to bomb holy sites, or shoot down a plane - But give me a break? Big terrorist case my azz. Dave", 
        "intTime": 20090521, 
        "postID": 36, 
        "quote": "Originally posted by Grachus: quote: Originally posted by FIST101CAV: quote: Originally posted by Grachus: This is a BS case, although I'm not complaining that they were locked up. Lock up anyone who is ready to bomb a temple or shoot down a plane. But it's bravo Sierra in the sense that, these guys might have never got beyond the talking stage except that the police stepped in and provided them with the \"bombs,\" and provided them with the \"stinger\" missle. Who knows how much \"convincing\" they needed in order to actually do this? As this case moves through the Court system we shall find out more, but just like the Florida case, these guys had no connection with any real terrorists. Will the evidence show that they were basically recruited by the Police? We shall see. But so far the Florida case hasn't resulted in any convictions. Dave When did it become BS to attempt to buy illegal items from undercover agents? I guess the FBI were acting in an un-fair manner. Lets free them then. I'm sure they wouldn't have commited any violence if the FBI hadn't gotten involved. As a matter of fact lets level the playing field a bit more. From now on, all undercover law inforcement personnel are to wear uniforms, or at least display department badges during all undercover operations. The Florida \"Ninja Turtle\" case was quite similar to this one. The FBI paid those guys 50K to be terrorists. Were these men also paid? Were they terrorist fanatics, or were they common criminals recruited to \"do a job?\" Did they buy these \"bombs\" or were the bombs supllied to them? Where the F would these clowns get a hold of a stinger missle? You think they \"bought\" that as well? As if some street punks could buy more than a saturday night special? As I said, I'm not going to waste any tears over people ready to bomb holy sites, or shoot down a plane - But give me a break? Big terrorist case my azz. Dave", 
        "reply": "", 
        "threadID": "672198221_1910038322001", 
        "time": "2009-05-21 10:32:00", 
        "title": "APNewsBreak: 4 arrested in plot to bomb NYC temple", 
        "userID": "FIST101CAV"
    }, 
    {
        "content": "quote: Originally posted by FIST101CAV: quote: Originally posted by LineDoggie: quote: Originally posted by Another4Truth: Isn't it strange that when the FBI needs another terrorist episode to keep up the fear level, they go out and create one out of nothing. This terroist threat didn't come from offshore but was created right here in the good ole' U S of A, by our very own FBI. I wonder how many operations like this they have in the works for next month and the month after that? I think it is time for the FBI to get down to real work and quit making up plots to report. HOLY CRAP! I spit coffee everywhere!!!!!! Don't you fellers follow up any stories about the FBI and the phony terrorist cases they have manufactured in the last few years to keep up the terrorist threat? Just released a few minutes ago that the FBI admits that none of those arrested were connected to any terrorist groups except for the one the FBI created to entrap these idiots. There are still a lot of right wingers in the FBI held over from the Bush era, just like those in the military still in the Pentagon. 'GOD' is a Space Alien!", 
        "intTime": 20090521, 
        "postID": 37, 
        "quote": "Originally posted by FIST101CAV: quote: Originally posted by LineDoggie: quote: Originally posted by Another4Truth: Isn't it strange that when the FBI needs another terrorist episode to keep up the fear level, they go out and create one out of nothing. This terroist threat didn't come from offshore but was created right here in the good ole' U S of A, by our very own FBI. I wonder how many operations like this they have in the works for next month and the month after that? I think it is time for the FBI to get down to real work and quit making up plots to report. HOLY CRAP! I spit coffee everywhere!!!!!!", 
        "reply": " Don't you fellers follow up any stories about the FBI and the phony terrorist cases they have manufactured in the last few years to keep up the terrorist threat? Just released a few minutes ago that the FBI admits that none of those arrested were connected to any terrorist groups except for the one the FBI created to entrap these idiots. There are still a lot of right wingers in the FBI held over from the Bush era, just like those in the military still in the Pentagon. 'GOD' is a Space Alien!", 
        "threadID": "672198221_1910038322001", 
        "time": "2009-05-21 10:35:00", 
        "title": "APNewsBreak: 4 arrested in plot to bomb NYC temple", 
        "userID": "Another4Truth"
    }, 
    {
        "content": "quote: Originally posted by Another4Truth: Don't you fellers follow up any stories about the FBI and the phony terrorist cases they have manufactured in the last few years to keep up the terrorist threat? Just released a few minutes ago that the FBI admits that none of those arrested were connected to any terrorist groups except for the one the FBI created to entrap these idiots. There are still a lot of right wingers in the FBI held over from the Bush era, just like those in the military still in the Pentagon. 'GOD' is a Space Alien! The reason the Florida case has resulted in aquitals and hung juries is that those terrorists were paid 50K for their time and trouble and the defense claims that for 50K they'll swear alleigance to the KKK and Mothers Against Drunk Driving. What will be revealed in this case? I have no idea. In the Florida case the defendents couldn't procede with their plans until the FBI provided them with the proper Ninja uniforms. In this case apparently these guys actually were ready to blow places up. Screw em. On the other hand, to handle this like they stopped another 9/11 is pure Bravo Sierra. Dave", 
        "intTime": 20090521, 
        "postID": 38, 
        "quote": "Originally posted by Another4Truth: Don't you fellers follow up any stories about the FBI and the phony terrorist cases they have manufactured in the last few years to keep up the terrorist threat? Just released a few minutes ago that the FBI admits that none of those arrested were connected to any terrorist groups except for the one the FBI created to entrap these idiots. There are still a lot of right wingers in the FBI held over from the Bush era, just like those in the military still in the Pentagon. 'GOD' is a Space Alien!", 
        "reply": " The reason the Florida case has resulted in aquitals and hung juries is that those terrorists were paid 50K for their time and trouble and the defense claims that for 50K they'll swear alleigance to the KKK and Mothers Against Drunk Driving. What will be revealed in this case? I have no idea. In the Florida case the defendents couldn't procede with their plans until the FBI provided them with the proper Ninja uniforms. In this case apparently these guys actually were ready to blow places up. Screw em. On the other hand, to handle this like they stopped another 9/11 is pure Bravo Sierra. Dave", 
        "threadID": "672198221_1910038322001", 
        "time": "2009-05-21 11:00:00", 
        "title": "APNewsBreak: 4 arrested in plot to bomb NYC temple", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by FIST101CAV: quote: Originally posted by Grachus: This is a BS case, although I'm not complaining that they were locked up. Lock up anyone who is ready to bomb a temple or shoot down a plane. But it's bravo Sierra in the sense that, these guys might have never got beyond the talking stage except that the police stepped in and provided them with the \"bombs,\" and provided them with the \"stinger\" missle. Who knows how much \"convincing\" they needed in order to actually do this? As this case moves through the Court system we shall find out more, but just like the Florida case, these guys had no connection with any real terrorists. Will the evidence show that they were basically recruited by the Police? We shall see. But so far the Florida case hasn't resulted in any convictions. Dave When did it become BS to attempt to buy illegal items from undercover agents? I guess the FBI were acting in an un-fair manner. Lets free them then. I'm sure they wouldn't have commited any violence if the FBI hadn't gotten involved. As a matter of fact lets level the playing field a bit more. From now on, all undercover law inforcement personnel are to wear uniforms, or at least display department badges during all undercover operations. The Florida \"Ninja Turtle\" case was quite similar to this one. The FBI paid those guys 50K to be terrorists. Were these men also paid? Were they terrorist fanatics, or were they common criminals recruited to \"do a job?\" Did they buy these \"bombs\" or were the bombs supllied to them? Where the F would these clowns get a hold of a stinger missle? You think they \"bought\" that as well? As if some street punks could buy more than a saturday night special? As I said, I'm not going to waste any tears over people ready to bomb holy sites, or shoot down a plane - But give me a break? Big terrorist case my azz. Dave Ever heard of the black market. You can get anything there. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090521, 
        "postID": 39, 
        "quote": "Originally posted by Grachus: quote: Originally posted by FIST101CAV: quote: Originally posted by Grachus: This is a BS case, although I'm not complaining that they were locked up. Lock up anyone who is ready to bomb a temple or shoot down a plane. But it's bravo Sierra in the sense that, these guys might have never got beyond the talking stage except that the police stepped in and provided them with the \"bombs,\" and provided them with the \"stinger\" missle. Who knows how much \"convincing\" they needed in order to actually do this? As this case moves through the Court system we shall find out more, but just like the Florida case, these guys had no connection with any real terrorists. Will the evidence show that they were basically recruited by the Police? We shall see. But so far the Florida case hasn't resulted in any convictions. Dave When did it become BS to attempt to buy illegal items from undercover agents? I guess the FBI were acting in an un-fair manner. Lets free them then. I'm sure they wouldn't have commited any violence if the FBI hadn't gotten involved. As a matter of fact lets level the playing field a bit more. From now on, all undercover law inforcement personnel are to wear uniforms, or at least display department badges during all undercover operations. The Florida \"Ninja Turtle\" case was quite similar to this one. The FBI paid those guys 50K to be terrorists. Were these men also paid? Were they terrorist fanatics, or were they common criminals recruited to \"do a job?\" Did they buy these \"bombs\" or were the bombs supllied to them? Where the F would these clowns get a hold of a stinger missle? You think they \"bought\" that as well? As if some street punks could buy more than a saturday night special? As I said, I'm not going to waste any tears over people ready to bomb holy sites, or shoot down a plane - But give me a break? Big terrorist case my azz. Dave", 
        "reply": " Ever heard of the black market. You can get anything there. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_1910038322001", 
        "time": "2009-05-21 11:02:00", 
        "title": "APNewsBreak: 4 arrested in plot to bomb NYC temple", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by Grachus: quote: Originally posted by FIST101CAV: quote: Originally posted by Grachus: This is a BS case, although I'm not complaining that they were locked up. Lock up anyone who is ready to bomb a temple or shoot down a plane. But it's bravo Sierra in the sense that, these guys might have never got beyond the talking stage except that the police stepped in and provided them with the \"bombs,\" and provided them with the \"stinger\" missle. Who knows how much \"convincing\" they needed in order to actually do this? As this case moves through the Court system we shall find out more, but just like the Florida case, these guys had no connection with any real terrorists. Will the evidence show that they were basically recruited by the Police? We shall see. But so far the Florida case hasn't resulted in any convictions. Dave When did it become BS to attempt to buy illegal items from undercover agents? I guess the FBI were acting in an un-fair manner. Lets free them then. I'm sure they wouldn't have commited any violence if the FBI hadn't gotten involved. As a matter of fact lets level the playing field a bit more. From now on, all undercover law inforcement personnel are to wear uniforms, or at least display department badges during all undercover operations. The Florida \"Ninja Turtle\" case was quite similar to this one. The FBI paid those guys 50K to be terrorists. Were these men also paid? Were they terrorist fanatics, or were they common criminals recruited to \"do a job?\" Did they buy these \"bombs\" or were the bombs supllied to them? Where the F would these clowns get a hold of a stinger missle? You think they \"bought\" that as well? As if some street punks could buy more than a saturday night special? As I said, I'm not going to waste any tears over people ready to bomb holy sites, or shoot down a plane - But give me a break? Big terrorist case my azz. Dave Ever heard of the black market. You can get anything there. There's a black market, and then there's a black market. These guys would be lucky to be able to score for a Saturday Night special. GMAB - They're just street thugs with the \"Big Time\" connections to score a basket of hot fruit. Obviously it's way too soon for me or anyone else to be certain of anything. But this case \"smells\" bad. They would have a hard time buying legal black powder let alone getting their hands on C4. Stinger Missle? You're kidding right? Dave", 
        "intTime": 20090521, 
        "postID": 40, 
        "quote": "Originally posted by Anbar7: quote: Originally posted by Grachus: quote: Originally posted by FIST101CAV: quote: Originally posted by Grachus: This is a BS case, although I'm not complaining that they were locked up. Lock up anyone who is ready to bomb a temple or shoot down a plane. But it's bravo Sierra in the sense that, these guys might have never got beyond the talking stage except that the police stepped in and provided them with the \"bombs,\" and provided them with the \"stinger\" missle. Who knows how much \"convincing\" they needed in order to actually do this? As this case moves through the Court system we shall find out more, but just like the Florida case, these guys had no connection with any real terrorists. Will the evidence show that they were basically recruited by the Police? We shall see. But so far the Florida case hasn't resulted in any convictions. Dave When did it become BS to attempt to buy illegal items from undercover agents? I guess the FBI were acting in an un-fair manner. Lets free them then. I'm sure they wouldn't have commited any violence if the FBI hadn't gotten involved. As a matter of fact lets level the playing field a bit more. From now on, all undercover law inforcement personnel are to wear uniforms, or at least display department badges during all undercover operations. The Florida \"Ninja Turtle\" case was quite similar to this one. The FBI paid those guys 50K to be terrorists. Were these men also paid? Were they terrorist fanatics, or were they common criminals recruited to \"do a job?\" Did they buy these \"bombs\" or were the bombs supllied to them? Where the F would these clowns get a hold of a stinger missle? You think they \"bought\" that as well? As if some street punks could buy more than a saturday night special? As I said, I'm not going to waste any tears over people ready to bomb holy sites, or shoot down a plane - But give me a break? Big terrorist case my azz. Dave Ever heard of the black market. You can get anything there.", 
        "reply": " There's a black market, and then there's a black market. These guys would be lucky to be able to score for a Saturday Night special. GMAB - They're just street thugs with the \"Big Time\" connections to score a basket of hot fruit. Obviously it's way too soon for me or anyone else to be certain of anything. But this case \"smells\" bad. They would have a hard time buying legal black powder let alone getting their hands on C4. Stinger Missle? You're kidding right? Dave", 
        "threadID": "672198221_1910038322001", 
        "time": "2009-05-21 11:11:00", 
        "title": "APNewsBreak: 4 arrested in plot to bomb NYC temple", 
        "userID": "Grachus"
    }
]