[
    {
        "content": "Uggggh. The trend doesn't look like it will stop. quote: Journalist throws shoe at India's home minister Reuters By Nigam Prusty Nigam Prusty – 1 hr 4 mins ago A journalist throws his shoe at India's Home Minister Palaniappan Chidambaram during a news conference in New Delhi in this video frame grab from ANI TV released April 7, 2009. A Sikh journalist threw a shoe at Chidambaram during a news conference on Tuesday after getting angry with the minister's reply to a question on the 1984 riots in which hundreds of Sikhs were killed. The shoe missed Chidambaram, who leaned back to avoid it. He later smiled and asked security guards to take the reporter out of the room. REUTERS/ANI TV (INDIA POLITICS MEDIA) NEW DELHI (Reuters) – A Sikh journalist threw a shoe at India's home minister during a news conference on Tuesday after getting angry with the minister's reply to a question about 1984 riots in which hundreds of Sikhs were killed. The shoe missed Palaniappan Chidambaram, who leaned back to avoid it. He later smiled and asked security guards to take the reporter out of the room. (...) This was the latest incident of shoe-throwing as a mark of protest against political leaders, including former U.S. President George W. Bush and Chinese Premier Wen Jiabao. Throwing a shoe at someone is considered an insult in India. The reporter was seen being taken away by plainclothes police... (...) ++http://news.yahoo.com/nphotos/news-conference-Chidambaram/photo//090407/ids_photos_wl/r2777300590.jpg//s:/nm/20090407/lf_nm_life/us_india_shoe_minister", 
        "intTime": 20090407, 
        "postID": 1, 
        "quote": "Journalist throws shoe at India's home minister Reuters By Nigam Prusty Nigam Prusty – 1 hr 4 mins ago A journalist throws his shoe at India's Home Minister Palaniappan Chidambaram during a news conference in New Delhi in this video frame grab from ANI TV released April 7, 2009. A Sikh journalist threw a shoe at Chidambaram during a news conference on Tuesday after getting angry with the minister's reply to a question on the 1984 riots in which hundreds of Sikhs were killed. The shoe missed Chidambaram, who leaned back to avoid it. He later smiled and asked security guards to take the reporter out of the room. REUTERS/ANI TV (INDIA POLITICS MEDIA) NEW DELHI (Reuters) – A Sikh journalist threw a shoe at India's home minister during a news conference on Tuesday after getting angry with the minister's reply to a question about 1984 riots in which hundreds of Sikhs were killed. The shoe missed Palaniappan Chidambaram, who leaned back to avoid it. He later smiled and asked security guards to take the reporter out of the room. (...) This was the latest incident of shoe-throwing as a mark of protest against political leaders, including former U.S. President George W. Bush and Chinese Premier Wen Jiabao. Throwing a shoe at someone is considered an insult in India. The reporter was seen being taken away by plainclothes police... (...) ++http://news.yahoo.com/nphotos/news-conference-Chidambaram/photo//090407/ids_photos_wl/r2777300590.jpg//s:/nm/20090407/lf_nm_life/us_india_shoe_minister", 
        "reply": "Uggggh. The trend doesn't look like it will stop. ", 
        "threadID": "672198221_8120080022001", 
        "time": "2009-04-07 11:09:00", 
        "title": "Another shoe thrown! Will the SHOE-THROWING at politicians STOP ALREADY?", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "quote: Originally posted by Canuck_Centaur: The shoe missed Chidambaram, who leaned back to avoid it. Send him back down to the minors!", 
        "intTime": 20090407, 
        "postID": 2, 
        "quote": "Originally posted by Canuck_Centaur: The shoe missed Chidambaram, who leaned back to avoid it.", 
        "reply": " Send him back down to the minors!", 
        "threadID": "672198221_8120080022001", 
        "time": "2009-04-07 11:17:00", 
        "title": "Another shoe thrown! Will the SHOE-THROWING at politicians STOP ALREADY?", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by 67NOV: quote: Originally posted by Canuck_Centaur: The shoe missed Chidambaram, who leaned back to avoid it. Send him back down to the minors! This thread inspires me. I'm going to add throwable shoes to my on-going aluminum hat business. Not only that, but living in New York, I can collect all my \"product\" from lamp posts and telephone wires - Old New York tradition for teens to hurl unused sneakers onto telephone wires. I'm going to \"clean -up!!!!\" Dave", 
        "intTime": 20090407, 
        "postID": 3, 
        "quote": "Originally posted by 67NOV: quote: Originally posted by Canuck_Centaur: The shoe missed Chidambaram, who leaned back to avoid it. Send him back down to the minors!", 
        "reply": " This thread inspires me. I'm going to add throwable shoes to my on-going aluminum hat business. Not only that, but living in New York, I can collect all my \"product\" from lamp posts and telephone wires - Old New York tradition for teens to hurl unused sneakers onto telephone wires. I'm going to \"clean -up!!!!\" Dave", 
        "threadID": "672198221_8120080022001", 
        "time": "2009-04-07 11:22:00", 
        "title": "Another shoe thrown! Will the SHOE-THROWING at politicians STOP ALREADY?", 
        "userID": "Grachus"
    }, 
    {
        "content": "First, we had to take our shoes off at the airport. Next, we're going to have to take our shoes off for press briefings. Seriously, I agree. Enough of the rip-off artists out there. There is only one true shoe-man and he threw the shoe heard round the world.", 
        "intTime": 20090407, 
        "postID": 4, 
        "quote": "", 
        "reply": "First, we had to take our shoes off at the airport. Next, we're going to have to take our shoes off for press briefings. Seriously, I agree. Enough of the rip-off artists out there. There is only one true shoe-man and he threw the shoe heard round the world.", 
        "threadID": "672198221_8120080022001", 
        "time": "2009-04-07 11:24:00", 
        "title": "Another shoe thrown! Will the SHOE-THROWING at politicians STOP ALREADY?", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "They do it west of the Hudson also Dave, let me know if you need a shipment!", 
        "intTime": 20090407, 
        "postID": 5, 
        "quote": "", 
        "reply": "They do it west of the Hudson also Dave, let me know if you need a shipment!", 
        "threadID": "672198221_8120080022001", 
        "time": "2009-04-07 11:24:00", 
        "title": "Another shoe thrown! Will the SHOE-THROWING at politicians STOP ALREADY?", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: First, we had to take our shoes off at the airport. Next, we're going to have to take our shoes off for press briefings. When they took the shoes at the airport, I did not say anything, because I did not fly. Then they took the shoes at the press conference, I did not say anything, because I did not report...", 
        "intTime": 20090407, 
        "postID": 6, 
        "quote": "Originally posted by mrmixitup: First, we had to take our shoes off at the airport. Next, we're going to have to take our shoes off for press briefings.", 
        "reply": " When they took the shoes at the airport, I did not say anything, because I did not fly. Then they took the shoes at the press conference, I did not say anything, because I did not report...", 
        "threadID": "672198221_8120080022001", 
        "time": "2009-04-07 11:27:00", 
        "title": "Another shoe thrown! Will the SHOE-THROWING at politicians STOP ALREADY?", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by 67NOV: They do it west of the Hudson also Dave, let me know if you need a shipment! Well, it's a new addition to the catalogue. Give it a chance to catch on... I am however running out of collanders that I can customise by spot welding antenna on... It's a real shame that the \"Bush took down the WTC crowd\" has died down, but I have my hopes with the \"Obama was created in a Muslim test tube\" bunch, and I'm hoping business will pick up again. Dave", 
        "intTime": 20090407, 
        "postID": 7, 
        "quote": "Originally posted by 67NOV: They do it west of the Hudson also Dave, let me know if you need a shipment!", 
        "reply": " Well, it's a new addition to the catalogue. Give it a chance to catch on... I am however running out of collanders that I can customise by spot welding antenna on... It's a real shame that the \"Bush took down the WTC crowd\" has died down, but I have my hopes with the \"Obama was created in a Muslim test tube\" bunch, and I'm hoping business will pick up again. Dave", 
        "threadID": "672198221_8120080022001", 
        "time": "2009-04-07 11:53:00", 
        "title": "Another shoe thrown! Will the SHOE-THROWING at politicians STOP ALREADY?", 
        "userID": "Grachus"
    }, 
    {
        "content": "I'd probably get sent to Gitmo. I wear size 12Ds.", 
        "intTime": 20090407, 
        "postID": 8, 
        "quote": "", 
        "reply": "I'd probably get sent to Gitmo. I wear size 12Ds.", 
        "threadID": "672198221_8120080022001", 
        "time": "2009-04-07 11:56:00", 
        "title": "Another shoe thrown! Will the SHOE-THROWING at politicians STOP ALREADY?", 
        "userID": "Motive25"
    }, 
    {
        "content": "Y'all leave him alone! He is a freedom fighter and speaks for the oppressed that GB2 has oppressed! Think of the millions Gb2 killed, whats a shoe? Oh, this isnt about GB2.", 
        "intTime": 20090407, 
        "postID": 9, 
        "quote": "", 
        "reply": "Y'all leave him alone! He is a freedom fighter and speaks for the oppressed that GB2 has oppressed! Think of the millions Gb2 killed, whats a shoe? Oh, this isnt about GB2.", 
        "threadID": "672198221_8120080022001", 
        "time": "2009-04-07 11:59:00", 
        "title": "Another shoe thrown! Will the SHOE-THROWING at politicians STOP ALREADY?", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: Y'all leave him alone! He is a freedom fighter and speaks for the oppressed that GB2 has oppressed! Think of the millions Gb2 killed, whats a shoe? Oh, this isnt about GB2. Yeah, sorry, Bush Bashing is behind door number two. You don't collect ANY prize money... Dave", 
        "intTime": 20090407, 
        "postID": 10, 
        "quote": "Originally posted by GunnyRet03: Y'all leave him alone! He is a freedom fighter and speaks for the oppressed that GB2 has oppressed! Think of the millions Gb2 killed, whats a shoe? Oh, this isnt about GB2.", 
        "reply": " Yeah, sorry, Bush Bashing is behind door number two. You don't collect ANY prize money... Dave", 
        "threadID": "672198221_8120080022001", 
        "time": "2009-04-07 12:02:00", 
        "title": "Another shoe thrown! Will the SHOE-THROWING at politicians STOP ALREADY?", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by GunnyRet03: Y'all leave him alone! He is a freedom fighter and speaks for the oppressed that GB2 has oppressed! Think of the millions Gb2 killed, whats a shoe? Oh, this isnt about GB2. Yeah, sorry, Bush Bashing is behind door number two. You don't collect ANY prize money... Dave Just filling in for the original shoe throwing advocates that were here pulling for the shoe thrower when it was gb2, they must be thinking ahhh the good Ole days.", 
        "intTime": 20090407, 
        "postID": 11, 
        "quote": "Originally posted by Grachus: quote: Originally posted by GunnyRet03: Y'all leave him alone! He is a freedom fighter and speaks for the oppressed that GB2 has oppressed! Think of the millions Gb2 killed, whats a shoe? Oh, this isnt about GB2. Yeah, sorry, Bush Bashing is behind door number two. You don't collect ANY prize money... Dave", 
        "reply": " Just filling in for the original shoe throwing advocates that were here pulling for the shoe thrower when it was gb2, they must be thinking ahhh the good Ole days.", 
        "threadID": "672198221_8120080022001", 
        "time": "2009-04-07 12:08:00", 
        "title": "Another shoe thrown! Will the SHOE-THROWING at politicians STOP ALREADY?", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by Grachus: quote: Originally posted by GunnyRet03: Y'all leave him alone! He is a freedom fighter and speaks for the oppressed that GB2 has oppressed! Think of the millions Gb2 killed, whats a shoe? Oh, this isnt about GB2. Yeah, sorry, Bush Bashing is behind door number two. You don't collect ANY prize money... Dave Just filling in for the original shoe throwing advocates that were here pulling for the shoe thrower when it was gb2, they must be thinking ahhh the good Ole days. He, he, heh... I posted on that thread. Mr. Bush came out looking pretty good from that incident. He made jokes about it, while some here were calling for the death penalty for the thrower. If I recall, I said that I would have had a heart attack in Mr. Bush's position - Who knew what the guy was throwing... But - All's well that's ends well, and this incident is going to lift my bottom line!!! Dave", 
        "intTime": 20090407, 
        "postID": 12, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by Grachus: quote: Originally posted by GunnyRet03: Y'all leave him alone! He is a freedom fighter and speaks for the oppressed that GB2 has oppressed! Think of the millions Gb2 killed, whats a shoe? Oh, this isnt about GB2. Yeah, sorry, Bush Bashing is behind door number two. You don't collect ANY prize money... Dave Just filling in for the original shoe throwing advocates that were here pulling for the shoe thrower when it was gb2, they must be thinking ahhh the good Ole days.", 
        "reply": " He, he, heh... I posted on that thread. Mr. Bush came out looking pretty good from that incident. He made jokes about it, while some here were calling for the death penalty for the thrower. If I recall, I said that I would have had a heart attack in Mr. Bush's position - Who knew what the guy was throwing... But - All's well that's ends well, and this incident is going to lift my bottom line!!! Dave", 
        "threadID": "672198221_8120080022001", 
        "time": "2009-04-07 12:17:00", 
        "title": "Another shoe thrown! Will the SHOE-THROWING at politicians STOP ALREADY?", 
        "userID": "Grachus"
    }
]