[
    {
        "content": "PITTSBURGH (AP) — A gunman wearing a bulletproof vest and \"lying in wait\" opened fire on officers responding to a domestic disturbance call Saturday, killing three of them and turning a quiet Pittsburgh street into a battlefield, police said. Police Chief Nate Harper said the motive for the shooting isn't clear, but friends said the gunman recently had been upset about losing his job and feared the Obama administration was poised to ban guns. Richard Poplawski, 23, met officers at the doorway and shot two of them in the head immediately, Harper said. An officer who tried to help the two also was killed. Poplawski, armed with an assault rifle and two other guns, then held police at bay for four hours as the fallen officers were left bleeding nearby, their colleagues unable to reach them, according to police and witnesses. More than 100 rounds were fired by the SWAT teams and Poplawski, Harper said. The three slain officers were Eric Kelly, Stephen Mayhle and Paul Sciullo III. Kelly had been on the force for 14 years, Mayhle and Sciullo for two years each. Another officer, Timothy McManaway, was shot in the hand and a fifth broke his leg on a fence. Poplawski had gunshot wounds in his legs but was otherwise unharmed because he was wearing a bulletproof vest, Harper said. He was charged with three counts of homicide, aggravated assault and a weapons violation... Poplawski had feared \"the Obama gun ban that's on the way\" and \"didn't like our rights being infringed upon,\" said Edward Perkovic, his best friend. Perkovic, 22, said he got a call at work from him in which he said, \"Eddie, I am going to die today. ... Tell your family I love them and I love you.\" Perkovic said: \"I heard gunshots and he hung up. ... He sounded like he was in pain, like he got shot.\" Poplawski had once tried to join the Marines, but was kicked out of boot camp after throwing a food tray at a drill sergeant, Perkovic said. Another longtime friend, Aaron Vire, said Poplawski feared that President Barack Obama was going to take away his rights, though he said he \"wasn't violently against Obama.\" \"http://www.google.com/hostednews/ap/article/ALeqM5gxAP_ul1xtDvN-3H8XQ5EaI6_7cAD97BTBD80\" Nobody's a criminal until they commit a crime. Is there a reason I'm the first person to post this news item?", 
        "intTime": 20090404, 
        "postID": 1, 
        "quote": "", 
        "reply": "PITTSBURGH (AP) — A gunman wearing a bulletproof vest and \"lying in wait\" opened fire on officers responding to a domestic disturbance call Saturday, killing three of them and turning a quiet Pittsburgh street into a battlefield, police said. Police Chief Nate Harper said the motive for the shooting isn't clear, but friends said the gunman recently had been upset about losing his job and feared the Obama administration was poised to ban guns. Richard Poplawski, 23, met officers at the doorway and shot two of them in the head immediately, Harper said. An officer who tried to help the two also was killed. Poplawski, armed with an assault rifle and two other guns, then held police at bay for four hours as the fallen officers were left bleeding nearby, their colleagues unable to reach them, according to police and witnesses. More than 100 rounds were fired by the SWAT teams and Poplawski, Harper said. The three slain officers were Eric Kelly, Stephen Mayhle and Paul Sciullo III. Kelly had been on the force for 14 years, Mayhle and Sciullo for two years each. Another officer, Timothy McManaway, was shot in the hand and a fifth broke his leg on a fence. Poplawski had gunshot wounds in his legs but was otherwise unharmed because he was wearing a bulletproof vest, Harper said. He was charged with three counts of homicide, aggravated assault and a weapons violation... Poplawski had feared \"the Obama gun ban that's on the way\" and \"didn't like our rights being infringed upon,\" said Edward Perkovic, his best friend. Perkovic, 22, said he got a call at work from him in which he said, \"Eddie, I am going to die today. ... Tell your family I love them and I love you.\" Perkovic said: \"I heard gunshots and he hung up. ... He sounded like he was in pain, like he got shot.\" Poplawski had once tried to join the Marines, but was kicked out of boot camp after throwing a food tray at a drill sergeant, Perkovic said. Another longtime friend, Aaron Vire, said Poplawski feared that President Barack Obama was going to take away his rights, though he said he \"wasn't violently against Obama.\" \"http://www.google.com/hostednews/ap/article/ALeqM5gxAP_ul1xtDvN-3H8XQ5EaI6_7cAD97BTBD80\" Nobody's a criminal until they commit a crime. Is there a reason I'm the first person to post this news item?", 
        "threadID": "672198221_5520058912001", 
        "time": "2009-04-04 16:46:00", 
        "title": "Man Who Feared Losing His Guns Kills Three Pittsburgh Police Officers", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: PITTSBURGH (AP) — A gunman wearing a bulletproof vest and \"lying in wait\" opened fire on officers responding to a domestic disturbance call Saturday, killing three of them and turning a quiet Pittsburgh street into a battlefield, police said. Police Chief Nate Harper said the motive for the shooting isn't clear, but friends said the gunman recently had been upset about losing his job and feared the Obama administration was poised to ban guns. Richard Poplawski, 23, met officers at the doorway and shot two of them in the head immediately, Harper said. An officer who tried to help the two also was killed. Poplawski, armed with an assault rifle and two other guns, then held police at bay for four hours as the fallen officers were left bleeding nearby, their colleagues unable to reach them, according to police and witnesses. More than 100 rounds were fired by the SWAT teams and Poplawski, Harper said. The three slain officers were Eric Kelly, Stephen Mayhle and Paul Sciullo III. Kelly had been on the force for 14 years, Mayhle and Sciullo for two years each. Another officer, Timothy McManaway, was shot in the hand and a fifth broke his leg on a fence. Poplawski had gunshot wounds in his legs but was otherwise unharmed because he was wearing a bulletproof vest, Harper said. He was charged with three counts of homicide, aggravated assault and a weapons violation... Poplawski had feared \"the Obama gun ban that's on the way\" and \"didn't like our rights being infringed upon,\" said Edward Perkovic, his best friend. Perkovic, 22, said he got a call at work from him in which he said, \"Eddie, I am going to die today. ... Tell your family I love them and I love you.\" Perkovic said: \"I heard gunshots and he hung up. ... He sounded like he was in pain, like he got shot.\" Poplawski had once tried to join the Marines, but was kicked out of boot camp after throwing a food tray at a drill sergeant, Perkovic said. Another longtime friend, Aaron Vire, said Poplawski feared that President Barack Obama was going to take away his rights, though he said he \"wasn't violently against Obama.\" \"http://www.google.com/hostednews/ap/article/ALeqM5gxAP_ul1xtDvN-3H8XQ5EaI6_7cAD97BTBD80\" Nobody's a criminal until they commit a crime. Is there a reason I'm the first person to post this news item? ....because you have no respect for uniformed personnel or their loved ones... Already past the future", 
        "intTime": 20090404, 
        "postID": 2, 
        "quote": "Originally posted by mcgreer: PITTSBURGH (AP) — A gunman wearing a bulletproof vest and \"lying in wait\" opened fire on officers responding to a domestic disturbance call Saturday, killing three of them and turning a quiet Pittsburgh street into a battlefield, police said. Police Chief Nate Harper said the motive for the shooting isn't clear, but friends said the gunman recently had been upset about losing his job and feared the Obama administration was poised to ban guns. Richard Poplawski, 23, met officers at the doorway and shot two of them in the head immediately, Harper said. An officer who tried to help the two also was killed. Poplawski, armed with an assault rifle and two other guns, then held police at bay for four hours as the fallen officers were left bleeding nearby, their colleagues unable to reach them, according to police and witnesses. More than 100 rounds were fired by the SWAT teams and Poplawski, Harper said. The three slain officers were Eric Kelly, Stephen Mayhle and Paul Sciullo III. Kelly had been on the force for 14 years, Mayhle and Sciullo for two years each. Another officer, Timothy McManaway, was shot in the hand and a fifth broke his leg on a fence. Poplawski had gunshot wounds in his legs but was otherwise unharmed because he was wearing a bulletproof vest, Harper said. He was charged with three counts of homicide, aggravated assault and a weapons violation... Poplawski had feared \"the Obama gun ban that's on the way\" and \"didn't like our rights being infringed upon,\" said Edward Perkovic, his best friend. Perkovic, 22, said he got a call at work from him in which he said, \"Eddie, I am going to die today. ... Tell your family I love them and I love you.\" Perkovic said: \"I heard gunshots and he hung up. ... He sounded like he was in pain, like he got shot.\" Poplawski had once tried to join the Marines, but was kicked out of boot camp after throwing a food tray at a drill sergeant, Perkovic said. Another longtime friend, Aaron Vire, said Poplawski feared that President Barack Obama was going to take away his rights, though he said he \"wasn't violently against Obama.\" \"http://www.google.com/hostednews/ap/article/ALeqM5gxAP_ul1xtDvN-3H8XQ5EaI6_7cAD97BTBD80\" Nobody's a criminal until they commit a crime. Is there a reason I'm the first person to post this news item?", 
        "reply": " ....because you have no respect for uniformed personnel or their loved ones... Already past the future", 
        "threadID": "672198221_5520058912001", 
        "time": "2009-04-04 17:15:00", 
        "title": "Man Who Feared Losing His Guns Kills Three Pittsburgh Police Officers", 
        "userID": "6486143"
    }, 
    {
        "content": "Really? Now, if I made a statement that accurately characterized your comment, I'd likely be suspended - so I'll let you use your imagination.", 
        "intTime": 20090404, 
        "postID": 3, 
        "quote": "", 
        "reply": "Really? Now, if I made a statement that accurately characterized your comment, I'd likely be suspended - so I'll let you use your imagination.", 
        "threadID": "672198221_5520058912001", 
        "time": "2009-04-04 17:18:00", 
        "title": "Man Who Feared Losing His Guns Kills Three Pittsburgh Police Officers", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: PITTSBURGH (AP) — A gunman wearing a bulletproof vest and \"lying in wait\" opened fire on officers responding to a domestic disturbance call Saturday, killing three of them and turning a quiet Pittsburgh street into a battlefield, police said. Police Chief Nate Harper said the motive for the shooting isn't clear, but friends said the gunman recently had been upset about losing his job and feared the Obama administration was poised to ban guns. Richard Poplawski, 23, met officers at the doorway and shot two of them in the head immediately, Harper said. An officer who tried to help the two also was killed. Poplawski, armed with an assault rifle and two other guns, then held police at bay for four hours as the fallen officers were left bleeding nearby, their colleagues unable to reach them, according to police and witnesses. More than 100 rounds were fired by the SWAT teams and Poplawski, Harper said. The three slain officers were Eric Kelly, Stephen Mayhle and Paul Sciullo III. Kelly had been on the force for 14 years, Mayhle and Sciullo for two years each. Another officer, Timothy McManaway, was shot in the hand and a fifth broke his leg on a fence. Poplawski had gunshot wounds in his legs but was otherwise unharmed because he was wearing a bulletproof vest, Harper said. He was charged with three counts of homicide, aggravated assault and a weapons violation... Poplawski had feared \"the Obama gun ban that's on the way\" and \"didn't like our rights being infringed upon,\" said Edward Perkovic, his best friend. Perkovic, 22, said he got a call at work from him in which he said, \"Eddie, I am going to die today. ... Tell your family I love them and I love you.\" Perkovic said: \"I heard gunshots and he hung up. ... He sounded like he was in pain, like he got shot.\" Poplawski had once tried to join the Marines, but was kicked out of boot camp after throwing a food tray at a drill sergeant, Perkovic said. Another longtime friend, Aaron Vire, said Poplawski feared that President Barack Obama was going to take away his rights, though he said he \"wasn't violently against Obama.\" \"http://www.google.com/hostednews/ap/article/ALeqM5gxAP_ul1xtDvN-3H8XQ5EaI6_7cAD97BTBD80\" Nobody's a criminal until they commit a crime. Is there a reason I'm the first person to post this news item? No... Respectfully, SUNLINER81", 
        "intTime": 20090404, 
        "postID": 4, 
        "quote": "Originally posted by mcgreer: PITTSBURGH (AP) — A gunman wearing a bulletproof vest and \"lying in wait\" opened fire on officers responding to a domestic disturbance call Saturday, killing three of them and turning a quiet Pittsburgh street into a battlefield, police said. Police Chief Nate Harper said the motive for the shooting isn't clear, but friends said the gunman recently had been upset about losing his job and feared the Obama administration was poised to ban guns. Richard Poplawski, 23, met officers at the doorway and shot two of them in the head immediately, Harper said. An officer who tried to help the two also was killed. Poplawski, armed with an assault rifle and two other guns, then held police at bay for four hours as the fallen officers were left bleeding nearby, their colleagues unable to reach them, according to police and witnesses. More than 100 rounds were fired by the SWAT teams and Poplawski, Harper said. The three slain officers were Eric Kelly, Stephen Mayhle and Paul Sciullo III. Kelly had been on the force for 14 years, Mayhle and Sciullo for two years each. Another officer, Timothy McManaway, was shot in the hand and a fifth broke his leg on a fence. Poplawski had gunshot wounds in his legs but was otherwise unharmed because he was wearing a bulletproof vest, Harper said. He was charged with three counts of homicide, aggravated assault and a weapons violation... Poplawski had feared \"the Obama gun ban that's on the way\" and \"didn't like our rights being infringed upon,\" said Edward Perkovic, his best friend. Perkovic, 22, said he got a call at work from him in which he said, \"Eddie, I am going to die today. ... Tell your family I love them and I love you.\" Perkovic said: \"I heard gunshots and he hung up. ... He sounded like he was in pain, like he got shot.\" Poplawski had once tried to join the Marines, but was kicked out of boot camp after throwing a food tray at a drill sergeant, Perkovic said. Another longtime friend, Aaron Vire, said Poplawski feared that President Barack Obama was going to take away his rights, though he said he \"wasn't violently against Obama.\" \"http://www.google.com/hostednews/ap/article/ALeqM5gxAP_ul1xtDvN-3H8XQ5EaI6_7cAD97BTBD80\" Nobody's a criminal until they commit a crime. Is there a reason I'm the first person to post this news item?", 
        "reply": " No... Respectfully, SUNLINER81", 
        "threadID": "672198221_5520058912001", 
        "time": "2009-04-04 17:27:00", 
        "title": "Man Who Feared Losing His Guns Kills Three Pittsburgh Police Officers", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "The guvmint policy of the past generation, to provide handouts to people and seek equal outcomes, not equal opportunity, (a major jackass party theme) has deluded all kinds of weak-minded folks to carry a really big chip on their shoulders, powerful resentment, when things get personally tough for them. After all, they have been suckered to think that they are \"entitled\" to the same outcomes as others they see around them, never mind their personal screwups or that no matter what we do, crap hits the fan for almost all of us at some times in our lives. The underlying American toughness that settled the nation domestically and has provided far more stability than trouble internationally seems perverted and flaccid nowadays. Moreover, this guy was not all together, now, was he? Throwing a food tray at a drill sergeant? A few of 80 million gun owners will do wrong. Far, far more people who have no right to possess firearms do so anyway, never mind any laws against it, and the evil they do is not constrained a whit by any laws existing or planned. Because a handful of people allowed to exercise such rights fail to do so responsibly does not justify any rationalization by control freaks that many tens of millions should be deprived of or see curtailed their God-given and Constitutionally affirmed rights. If anybody thinks this report from the sidestream, alphabet media mavens of the guy's real motive is true (so somebody says, who really knows? but such media outlets always try to gen up the leftist control-freak themes), then it looks like there'd better be some well-proclaimed and objectively supported assurances that the administration will, indeed, support the clear Constitutional intent in letter and spirit--none of their equivocations. The article's words make it seem more likely that the guy just disliked Obama's policies, in general, not simply any Second Amendment threats. To place the firearms ownership issue into better perspective, too bad New York has such ridiculous concealed carry restrictions--derived from early attempts to keep firearms out of the hands of newer minorities in the state and NYC. Had there been just one citizen with the skill, will, and drill to confront the murderous civics center intruder with a .44 or .45, then many or all of those 12 innocents would likely now be alive. At least they would have had a chance.", 
        "intTime": 20090404, 
        "postID": 5, 
        "quote": "", 
        "reply": "The guvmint policy of the past generation, to provide handouts to people and seek equal outcomes, not equal opportunity, (a major jackass party theme) has deluded all kinds of weak-minded folks to carry a really big chip on their shoulders, powerful resentment, when things get personally tough for them. After all, they have been suckered to think that they are \"entitled\" to the same outcomes as others they see around them, never mind their personal screwups or that no matter what we do, crap hits the fan for almost all of us at some times in our lives. The underlying American toughness that settled the nation domestically and has provided far more stability than trouble internationally seems perverted and flaccid nowadays. Moreover, this guy was not all together, now, was he? Throwing a food tray at a drill sergeant? A few of 80 million gun owners will do wrong. Far, far more people who have no right to possess firearms do so anyway, never mind any laws against it, and the evil they do is not constrained a whit by any laws existing or planned. Because a handful of people allowed to exercise such rights fail to do so responsibly does not justify any rationalization by control freaks that many tens of millions should be deprived of or see curtailed their God-given and Constitutionally affirmed rights. If anybody thinks this report from the sidestream, alphabet media mavens of the guy's real motive is true (so somebody says, who really knows? but such media outlets always try to gen up the leftist control-freak themes), then it looks like there'd better be some well-proclaimed and objectively supported assurances that the administration will, indeed, support the clear Constitutional intent in letter and spirit--none of their equivocations. The article's words make it seem more likely that the guy just disliked Obama's policies, in general, not simply any Second Amendment threats. To place the firearms ownership issue into better perspective, too bad New York has such ridiculous concealed carry restrictions--derived from early attempts to keep firearms out of the hands of newer minorities in the state and NYC. Had there been just one citizen with the skill, will, and drill to confront the murderous civics center intruder with a .44 or .45, then many or all of those 12 innocents would likely now be alive. At least they would have had a chance.", 
        "threadID": "672198221_5520058912001", 
        "time": "2009-04-04 17:38:00", 
        "title": "Man Who Feared Losing His Guns Kills Three Pittsburgh Police Officers", 
        "userID": "RRR52"
    }, 
    {
        "content": "quote: Originally posted by RRR52: The guvmint policy of the past generation, to provide handouts to people and seek equal outcomes, not equal opportunity, (a major jackass party theme) has deluded all kinds of weak-minded folks to carry a really big chip on their shoulders, powerful resentment, when things get personally tough for them. After all, they have been suckered to think that they are \"entitled\" to the same outcomes as others they see around them, never mind their personal screwups or that no matter what we do, crap hits the fan for almost all of us at some times in our lives. The underlying American toughness that settled the nation domestically and has provided far more stability than trouble internationally seems perverted and flaccid nowadays. Moreover, this guy was not all together, now, was he? Throwing a food tray at a drill sergeant? A few of 80 million gun owners will do wrong. Far, far more people who have no right to possess firearms do so anyway, never mind any laws against it, and the evil they do is not constrained a whit by any laws existing or planned. Because a handful of people allowed to exercise such rights fail to do so responsibly does not justify any rationalization by control freaks that many tens of millions should be deprived of or see curtailed their God-given and Constitutionally affirmed rights. If anybody thinks this report from the sidestream, alphabet media mavens of the guy's real motive is true (so somebody says, who really knows? but such media outlets always try to gen up the leftist control-freak themes), then it looks like there'd better be some well-proclaimed and objectively supported assurances that the administration will, indeed, support the clear Constitutional intent in letter and spirit--none of their equivocations. The article's words make it seem more likely that the guy just disliked Obama's policies, in general, not simply any Second Amendment threats. To place the firearms ownership issue into better perspective, too bad New York has such ridiculous concealed carry restrictions--derived from early attempts to keep firearms out of the hands of newer minorities in the state and NYC. Had there been just one citizen with the skill, will, and drill to confront the murderous civics center intruder with a .44 or .45, then many or all of those 12 innocents would likely now be alive. At least they would have had a chance. Sheesh, so our society produces nut jobs because of leftists? And meanwhile, a whole bunch of leftists will be claiming the exact opposite. Could it be, could it just possibly be, that neither the Right nor the Left has a monopoly on hypocrisy, cynacism and dishonesty? You bet, weak minds, can't handle the presure. So THAT MEANS it's all Bush's fault? Or is it all Obama's fault? No wonder I'm a registered Green... AND a Socialist. Dave", 
        "intTime": 20090404, 
        "postID": 6, 
        "quote": "Originally posted by RRR52: The guvmint policy of the past generation, to provide handouts to people and seek equal outcomes, not equal opportunity, (a major jackass party theme) has deluded all kinds of weak-minded folks to carry a really big chip on their shoulders, powerful resentment, when things get personally tough for them. After all, they have been suckered to think that they are \"entitled\" to the same outcomes as others they see around them, never mind their personal screwups or that no matter what we do, crap hits the fan for almost all of us at some times in our lives. The underlying American toughness that settled the nation domestically and has provided far more stability than trouble internationally seems perverted and flaccid nowadays. Moreover, this guy was not all together, now, was he? Throwing a food tray at a drill sergeant? A few of 80 million gun owners will do wrong. Far, far more people who have no right to possess firearms do so anyway, never mind any laws against it, and the evil they do is not constrained a whit by any laws existing or planned. Because a handful of people allowed to exercise such rights fail to do so responsibly does not justify any rationalization by control freaks that many tens of millions should be deprived of or see curtailed their God-given and Constitutionally affirmed rights. If anybody thinks this report from the sidestream, alphabet media mavens of the guy's real motive is true (so somebody says, who really knows? but such media outlets always try to gen up the leftist control-freak themes), then it looks like there'd better be some well-proclaimed and objectively supported assurances that the administration will, indeed, support the clear Constitutional intent in letter and spirit--none of their equivocations. The article's words make it seem more likely that the guy just disliked Obama's policies, in general, not simply any Second Amendment threats. To place the firearms ownership issue into better perspective, too bad New York has such ridiculous concealed carry restrictions--derived from early attempts to keep firearms out of the hands of newer minorities in the state and NYC. Had there been just one citizen with the skill, will, and drill to confront the murderous civics center intruder with a .44 or .45, then many or all of those 12 innocents would likely now be alive. At least they would have had a chance.", 
        "reply": " Sheesh, so our society produces nut jobs because of leftists? And meanwhile, a whole bunch of leftists will be claiming the exact opposite. Could it be, could it just possibly be, that neither the Right nor the Left has a monopoly on hypocrisy, cynacism and dishonesty? You bet, weak minds, can't handle the presure. So THAT MEANS it's all Bush's fault? Or is it all Obama's fault? No wonder I'm a registered Green... AND a Socialist. Dave", 
        "threadID": "672198221_5520058912001", 
        "time": "2009-04-04 17:45:00", 
        "title": "Man Who Feared Losing His Guns Kills Three Pittsburgh Police Officers", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: Sheesh, so our society produces nut jobs because of leftists? And meanwhile, a whole bunch of leftists will be claiming the exact opposite. Could it be, could it just possibly be, that neither the Right nor the Left has a monopoly on hypocrisy, cynacism and dishonesty? Over time, national policies and a bombardment of false ideas for polytickle expediency can allow or even encourage people to change their attitudes from one of self-reliance and personal toughness to that of victimhood. And that, certainly, can lead to behaviors like this, when perpetrators become convinved that they are \"owed\" more than they have ever earned. Did that happen here? I don't know, and neither do you or any of the rest. Maybe we'll find out; maybe not.", 
        "intTime": 20090404, 
        "postID": 7, 
        "quote": "Originally posted by Grachus: Sheesh, so our society produces nut jobs because of leftists? And meanwhile, a whole bunch of leftists will be claiming the exact opposite. Could it be, could it just possibly be, that neither the Right nor the Left has a monopoly on hypocrisy, cynacism and dishonesty?", 
        "reply": " Over time, national policies and a bombardment of false ideas for polytickle expediency can allow or even encourage people to change their attitudes from one of self-reliance and personal toughness to that of victimhood. And that, certainly, can lead to behaviors like this, when perpetrators become convinved that they are \"owed\" more than they have ever earned. Did that happen here? I don't know, and neither do you or any of the rest. Maybe we'll find out; maybe not.", 
        "threadID": "672198221_5520058912001", 
        "time": "2009-04-04 18:09:00", 
        "title": "Man Who Feared Losing His Guns Kills Three Pittsburgh Police Officers", 
        "userID": "RRR52"
    }, 
    {
        "content": "McGreer and all others, TOS paragraph 5 and 6 iv prohibit posting of copyrighted material, you may post the non-hotlink to the material and small snippets of the material. It is your responsibility to keep your posts from violating the restrictions of the copyright law and assuring they meet the standards of military,com. I’m not going to give anyone an official warning this time. But, the nest time it will be official. I have lock this thread and it will be moved to burn barrel shortly. OAL God and the soldier, All men adore, In time of trouble, And no more; For when war is over, And all things righted, God is neglected - The old soldier slighted. Founding Member Original DVG & Proud Member, Rupterd Duck/Derelict Veterans", 
        "intTime": 20090404, 
        "postID": 8, 
        "quote": "", 
        "reply": "McGreer and all others, TOS paragraph 5 and 6 iv prohibit posting of copyrighted material, you may post the non-hotlink to the material and small snippets of the material. It is your responsibility to keep your posts from violating the restrictions of the copyright law and assuring they meet the standards of military,com. I’m not going to give anyone an official warning this time. But, the nest time it will be official. I have lock this thread and it will be moved to burn barrel shortly. OAL God and the soldier, All men adore, In time of trouble, And no more; For when war is over, And all things righted, God is neglected - The old soldier slighted. Founding Member Original DVG & Proud Member, Rupterd Duck/Derelict Veterans", 
        "threadID": "672198221_5520058912001", 
        "time": "2009-04-04 18:13:00", 
        "title": "Man Who Feared Losing His Guns Kills Three Pittsburgh Police Officers", 
        "userID": "OldArmyLove"
    }
]