[
    {
        "content": "President Barack Obama speaks with Chile's President Michelle Bachelet during UNASUR countries meeting at Summit of the Americas, 18 Apr 2009 quote: President Barack Obama is vowing to listen and learn during a Summit of the Americas, where he hopes to forge new partnerships among Western Hemisphere nations. Mr. Obama made the comments Saturday, the second day of the three-day summit in Trinidad and Tobago. Just before a separate meeting with South American leaders, Mr. Obama told reporters he looked forward to productive meetings to determine how the region can work together more effectively. Before cameras were ushered out of the room, Venezuelan President Hugo Chavez, an old U.S. adversary, walked over to President Obama, handed him a book and shook his hand. Reporters in the room say the book was entitled \"The Open Veins of Latin America,\" and is about Latin America's exploitation by foreign powers. On Friday, Mr. Chavez and Mr. Obama shook hands and Mr. Chavez is reported to have told the U.S. president \"I want to be your friend.\" President Obama on Friday called for a new beginning in relations between the United States and Cuba - a country not represented at the summit. Cuban President Raul Castro has said Havana is prepared to discuss any issue with Washington. The United States has lifted restrictions on travel and money transfers by Cuban-Americans to the island, but not the trade embargo. The head of the Organization of American States, Jose Miguel Insulza, says he will ask his group to re-admit Cuba at the next OAS General Assembly meeting this June in Honduras. Cuba was suspended from the OAS in 1962 after the organization said Cuba's Communist government was incompatible with the OAS charter. (....) +http://www.voanews.com/english/2009-04-18-voa17.cfm \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090418, 
        "postID": 1, 
        "quote": "President Barack Obama is vowing to listen and learn during a Summit of the Americas, where he hopes to forge new partnerships among Western Hemisphere nations. Mr. Obama made the comments Saturday, the second day of the three-day summit in Trinidad and Tobago. Just before a separate meeting with South American leaders, Mr. Obama told reporters he looked forward to productive meetings to determine how the region can work together more effectively. Before cameras were ushered out of the room, Venezuelan President Hugo Chavez, an old U.S. adversary, walked over to President Obama, handed him a book and shook his hand. Reporters in the room say the book was entitled \"The Open Veins of Latin America,\" and is about Latin America's exploitation by foreign powers. On Friday, Mr. Chavez and Mr. Obama shook hands and Mr. Chavez is reported to have told the U.S. president \"I want to be your friend.\" President Obama on Friday called for a new beginning in relations between the United States and Cuba - a country not represented at the summit. Cuban President Raul Castro has said Havana is prepared to discuss any issue with Washington. The United States has lifted restrictions on travel and money transfers by Cuban-Americans to the island, but not the trade embargo. The head of the Organization of American States, Jose Miguel Insulza, says he will ask his group to re-admit Cuba at the next OAS General Assembly meeting this June in Honduras. Cuba was suspended from the OAS in 1962 after the organization said Cuba's Communist government was incompatible with the OAS charter. (....)", 
        "reply": "President Barack Obama speaks with Chile's President Michelle Bachelet during UNASUR countries meeting at Summit of the Americas, 18 Apr 2009  +http://www.voanews.com/english/2009-04-18-voa17.cfm \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_2080011122001", 
        "time": "2009-04-18 08:09:00", 
        "title": "Obama Vows to Listen to US Neighbors", 
        "userID": "NSNN"
    }, 
    {
        "content": "That is fine, but will they also listen to us? Will they clamo down on the rampant corruption inside their own borders? Will they help with unchecked illegal immigration from points south? Will they really help in stopping the flow of drugs? I have no issue with letting go a policy that has run its course, but it can not be a one-way street. We are already traveling down too many of them.", 
        "intTime": 20090418, 
        "postID": 2, 
        "quote": "", 
        "reply": "That is fine, but will they also listen to us? Will they clamo down on the rampant corruption inside their own borders? Will they help with unchecked illegal immigration from points south? Will they really help in stopping the flow of drugs? I have no issue with letting go a policy that has run its course, but it can not be a one-way street. We are already traveling down too many of them.", 
        "threadID": "672198221_2080011122001", 
        "time": "2009-04-18 09:49:00", 
        "title": "Obama Vows to Listen to US Neighbors", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by sw614: That is fine, but will they also listen to us? Will they clamo down on the rampant corruption inside their own borders? Will they help with unchecked illegal immigration from points south? Will they really help in stopping the flow of drugs? I have no issue with letting go a policy that has run its course, but it can not be a one-way street. We are already traveling down too many of them. I believe they will listen & agree it must not be a one way street (either way)! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090418, 
        "postID": 3, 
        "quote": "Originally posted by sw614: That is fine, but will they also listen to us? Will they clamo down on the rampant corruption inside their own borders? Will they help with unchecked illegal immigration from points south? Will they really help in stopping the flow of drugs? I have no issue with letting go a policy that has run its course, but it can not be a one-way street. We are already traveling down too many of them.", 
        "reply": " I believe they will listen & agree it must not be a one way street (either way)! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_2080011122001", 
        "time": "2009-04-18 10:11:00", 
        "title": "Obama Vows to Listen to US Neighbors", 
        "userID": "NSNN"
    }, 
    {
        "content": "i wouldnt believe a word or give that 2 bit dictator from the south any ear time with the potus... and cuba??? yea lets reward communism and another 2 bit dictator from the south.... obama is destroying this country faster then larry craig can tap his figure...", 
        "intTime": 20090418, 
        "postID": 4, 
        "quote": "", 
        "reply": "i wouldnt believe a word or give that 2 bit dictator from the south any ear time with the potus... and cuba??? yea lets reward communism and another 2 bit dictator from the south.... obama is destroying this country faster then larry craig can tap his figure...", 
        "threadID": "672198221_2080011122001", 
        "time": "2009-04-18 10:29:00", 
        "title": "Obama Vows to Listen to US Neighbors", 
        "userID": "outlaws93"
    }, 
    {
        "content": "We now have a president willing to listen, to talk rather than threaten, to negotiate rather than bomb and invade, and to mend fences rather than continue the policies of alienation and arrogance. Yet, as he demonstrated in the showdown with pirates who captured the captain of one of our merchant ships, he is no pushover and will employ our power when needed. This is merely the beginning of a new era, one in which America has the opportunity to regain credibility, honor, and respect. It is quite likely that we are destined to regain our reputation and destroy the image of America as the arrogant \"bully on the block\". Jack", 
        "intTime": 20090418, 
        "postID": 5, 
        "quote": "", 
        "reply": "We now have a president willing to listen, to talk rather than threaten, to negotiate rather than bomb and invade, and to mend fences rather than continue the policies of alienation and arrogance. Yet, as he demonstrated in the showdown with pirates who captured the captain of one of our merchant ships, he is no pushover and will employ our power when needed. This is merely the beginning of a new era, one in which America has the opportunity to regain credibility, honor, and respect. It is quite likely that we are destined to regain our reputation and destroy the image of America as the arrogant \"bully on the block\". Jack", 
        "threadID": "672198221_2080011122001", 
        "time": "2009-04-18 10:57:00", 
        "title": "Obama Vows to Listen to US Neighbors", 
        "userID": "jackhunter1"
    }, 
    {
        "content": "quote: On Friday, Mr. Chavez and Mr. Obama shook hands and Mr. Chavez is reported to have told the U.S. president \"I want to be your friend.\" Really? quote: Chavez Gifts Obama With Book That Assails U.S. for Exploiting Latin America At President Obama's meeting with the heads of South American countries this morning, Venezuelan President Hugo Chavez stood, walked over to him, and presented him with a copy of \"Open Veins of Latin America: Five Centuries of the Pillage of a Continent\" by Uruguayan author Eduardo Galeano. Obama politely posed for a photograph with Chavez, shook his hand, and accepted the gift. The book, first published in Spanish in 1971, offers a critique of the consequences of 500 years of European and U.S. colonization of Latin America. \"http://blogs.abcnews.com/politicalpunch/2009/04/chavez-gifts-ob.html\"", 
        "intTime": 20090418, 
        "postID": 6, 
        "quote": "On Friday, Mr. Chavez and Mr. Obama shook hands and Mr. Chavez is reported to have told the U.S. president \"I want to be your friend.\"", 
        "reply": " Really? quote: Chavez Gifts Obama With Book That Assails U.S. for Exploiting Latin America At President Obama's meeting with the heads of South American countries this morning, Venezuelan President Hugo Chavez stood, walked over to him, and presented him with a copy of \"Open Veins of Latin America: Five Centuries of the Pillage of a Continent\" by Uruguayan author Eduardo Galeano. Obama politely posed for a photograph with Chavez, shook his hand, and accepted the gift. The book, first published in Spanish in 1971, offers a critique of the consequences of 500 years of European and U.S. colonization of Latin America. \"http://blogs.abcnews.com/politicalpunch/2009/04/chavez-gifts-ob.html\"", 
        "threadID": "672198221_2080011122001", 
        "time": "2009-04-18 11:16:00", 
        "title": "Obama Vows to Listen to US Neighbors", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Originally posted by stec74: quote: On Friday, Mr. Chavez and Mr. Obama shook hands and Mr. Chavez is reported to have told the U.S. president \"I want to be your friend.\" Really? quote: Chavez Gifts Obama With Book That Assails U.S. for Exploiting Latin America At President Obama's meeting with the heads of South American countries this morning, Venezuelan President Hugo Chavez stood, walked over to him, and presented him with a copy of \"Open Veins of Latin America: Five Centuries of the Pillage of a Continent\" by Uruguayan author Eduardo Galeano. Obama politely posed for a photograph with Chavez, shook his hand, and accepted the gift. The book, first published in Spanish in 1971, offers a critique of the consequences of 500 years of European and U.S. colonization of Latin America. \"http://blogs.abcnews.com/politicalpunch/2009/04/chavez-gifts-ob.html\" A pretty dubious title for a blog from someone who's probably never read the book. I looked around the internet, and can't keep seem to find hardly any bad reviews about it. Of course, the right-wing blogs haven't started the spin on it yet. I suspect the U.S. isn't mentioned very much in the book, since we've only been in existence 2 out of the 5 centuries the book is referring to. \"http://search.barnesandnoble.com/Open-Veins-of-Latin-America/Eduardo-Galeano/e/9780853459910\"", 
        "intTime": 20090418, 
        "postID": 7, 
        "quote": "Originally posted by stec74: quote: On Friday, Mr. Chavez and Mr. Obama shook hands and Mr. Chavez is reported to have told the U.S. president \"I want to be your friend.\" Really? quote: Chavez Gifts Obama With Book That Assails U.S. for Exploiting Latin America At President Obama's meeting with the heads of South American countries this morning, Venezuelan President Hugo Chavez stood, walked over to him, and presented him with a copy of \"Open Veins of Latin America: Five Centuries of the Pillage of a Continent\" by Uruguayan author Eduardo Galeano. Obama politely posed for a photograph with Chavez, shook his hand, and accepted the gift. The book, first published in Spanish in 1971, offers a critique of the consequences of 500 years of European and U.S. colonization of Latin America. \"http://blogs.abcnews.com/politicalpunch/2009/04/chavez-gifts-ob.html\"", 
        "reply": " A pretty dubious title for a blog from someone who's probably never read the book. I looked around the internet, and can't keep seem to find hardly any bad reviews about it. Of course, the right-wing blogs haven't started the spin on it yet. I suspect the U.S. isn't mentioned very much in the book, since we've only been in existence 2 out of the 5 centuries the book is referring to. \"http://search.barnesandnoble.com/Open-Veins-of-Latin-America/Eduardo-Galeano/e/9780853459910\"", 
        "threadID": "672198221_2080011122001", 
        "time": "2009-04-18 11:45:00", 
        "title": "Obama Vows to Listen to US Neighbors", 
        "userID": "Esample1"
    }, 
    {
        "content": "quote: Originally posted by sw614: That is fine, but will they also listen to us? Will they clamo down on the rampant corruption inside their own borders? Will they help with unchecked illegal immigration from points south? Will they really help in stopping the flow of drugs? I have no issue with letting go a policy that has run its course, but it can not be a one-way street. We are already traveling down too many of them. The answer is no, no, no, and no!", 
        "intTime": 20090418, 
        "postID": 8, 
        "quote": "Originally posted by sw614: That is fine, but will they also listen to us? Will they clamo down on the rampant corruption inside their own borders? Will they help with unchecked illegal immigration from points south? Will they really help in stopping the flow of drugs? I have no issue with letting go a policy that has run its course, but it can not be a one-way street. We are already traveling down too many of them.", 
        "reply": " The answer is no, no, no, and no!", 
        "threadID": "672198221_2080011122001", 
        "time": "2009-04-18 12:24:00", 
        "title": "Obama Vows to Listen to US Neighbors", 
        "userID": "EAG154"
    }, 
    {
        "content": "It's becoming a Marxist freakshow. \"The World's Finest\"", 
        "intTime": 20090418, 
        "postID": 9, 
        "quote": "", 
        "reply": "It's becoming a Marxist freakshow. \"The World's Finest\"", 
        "threadID": "672198221_2080011122001", 
        "time": "2009-04-18 12:28:00", 
        "title": "Obama Vows to Listen to US Neighbors", 
        "userID": "Kegler300"
    }, 
    {
        "content": "President open the door, Prss Secretary said now it's in Castro court to do something with political prisoners and the Secretary of State Clinton is offering talk. You'll remember President Clinton did something similar just before Cuba shot down two civilian aircraft bearing leaflets supposively not in Cuban air space. Possibly why the last eight years Cuba wasn't offered any deals. They did receive food and medical subsidies as well as hurricane relief. Pizz and moan all you want, I don't give a damn about party, but America is doing their fair share of putting out the fire. Maybe this time?", 
        "intTime": 20090418, 
        "postID": 10, 
        "quote": "", 
        "reply": "President open the door, Prss Secretary said now it's in Castro court to do something with political prisoners and the Secretary of State Clinton is offering talk. You'll remember President Clinton did something similar just before Cuba shot down two civilian aircraft bearing leaflets supposively not in Cuban air space. Possibly why the last eight years Cuba wasn't offered any deals. They did receive food and medical subsidies as well as hurricane relief. Pizz and moan all you want, I don't give a damn about party, but America is doing their fair share of putting out the fire. Maybe this time?", 
        "threadID": "672198221_2080011122001", 
        "time": "2009-04-18 13:23:00", 
        "title": "Obama Vows to Listen to US Neighbors", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: Originally posted by jackhunter1: We now have a president willing to listen, to talk rather than threaten, to negotiate rather than bomb and invade, and to mend fences rather than continue the policies of alienation and arrogance. Yet, as he demonstrated in the showdown with pirates who captured the captain of one of our merchant ships, he is no pushover and will employ our power when needed. This is merely the beginning of a new era, one in which America has the opportunity to regain credibility, honor, and respect. It is quite likely that we are destined to regain our reputation and destroy the image of America as the arrogant \"bully on the block\". Jack you're right jack........ the pres did say something along these lines, and it might turn out to be a good thing (tho I doubt it) but I fear the pres is going to be schit on..... next step however is to invite these respected neighbors to a White House 'Tea' Party. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090418, 
        "postID": 11, 
        "quote": "Originally posted by jackhunter1: We now have a president willing to listen, to talk rather than threaten, to negotiate rather than bomb and invade, and to mend fences rather than continue the policies of alienation and arrogance. Yet, as he demonstrated in the showdown with pirates who captured the captain of one of our merchant ships, he is no pushover and will employ our power when needed. This is merely the beginning of a new era, one in which America has the opportunity to regain credibility, honor, and respect. It is quite likely that we are destined to regain our reputation and destroy the image of America as the arrogant \"bully on the block\". Jack", 
        "reply": " you're right jack........ the pres did say something along these lines, and it might turn out to be a good thing (tho I doubt it) but I fear the pres is going to be schit on..... next step however is to invite these respected neighbors to a White House 'Tea' Party. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_2080011122001", 
        "time": "2009-04-18 14:55:00", 
        "title": "Obama Vows to Listen to US Neighbors", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "look at the photo on the first post THE individual in the backgroubd say's it all A PICTURE IS WORTH A THOUSAND WORDS", 
        "intTime": 20090418, 
        "postID": 12, 
        "quote": "", 
        "reply": "look at the photo on the first post THE individual in the backgroubd say's it all A PICTURE IS WORTH A THOUSAND WORDS", 
        "threadID": "672198221_2080011122001", 
        "time": "2009-04-18 15:02:00", 
        "title": "Obama Vows to Listen to US Neighbors", 
        "userID": "ss_287"
    }, 
    {
        "content": "quote: Originally posted by jackhunter1: We now have a president willing to listen, to talk rather than threaten, to negotiate rather than bomb and invade, and to mend fences rather than continue the policies of alienation and arrogance. Yet, as he demonstrated in the showdown with pirates who captured the captain of one of our merchant ships, he is no pushover and will employ our power when needed. This is merely the beginning of a new era, one in which America has the opportunity to regain credibility, honor, and respect. It is quite likely that we are destined to regain our reputation and destroy the image of America as the arrogant \"bully on the block\". Jack Obama decided how to handle the pirates? You mean the Navy called him up and asked what they should do? Gee!! And all this time I thought it was the military that made those types of decision. \"They love our milk and honey but they preach about some other way of living When you’re running down my country, Hoss you’re walking on the fighting side of me\" - - Merle Haggard", 
        "intTime": 20090418, 
        "postID": 13, 
        "quote": "Originally posted by jackhunter1: We now have a president willing to listen, to talk rather than threaten, to negotiate rather than bomb and invade, and to mend fences rather than continue the policies of alienation and arrogance. Yet, as he demonstrated in the showdown with pirates who captured the captain of one of our merchant ships, he is no pushover and will employ our power when needed. This is merely the beginning of a new era, one in which America has the opportunity to regain credibility, honor, and respect. It is quite likely that we are destined to regain our reputation and destroy the image of America as the arrogant \"bully on the block\". Jack", 
        "reply": " Obama decided how to handle the pirates? You mean the Navy called him up and asked what they should do? Gee!! And all this time I thought it was the military that made those types of decision. \"They love our milk and honey but they preach about some other way of living When you’re running down my country, Hoss you’re walking on the fighting side of me\" - - Merle Haggard", 
        "threadID": "672198221_2080011122001", 
        "time": "2009-04-18 18:08:00", 
        "title": "Obama Vows to Listen to US Neighbors", 
        "userID": "aggie_swife"
    }, 
    {
        "content": "quote: Originally posted by aggie_swife: quote: Originally posted by jackhunter1: We now have a president willing to listen, to talk rather than threaten, to negotiate rather than bomb and invade, and to mend fences rather than continue the policies of alienation and arrogance. Yet, as he demonstrated in the showdown with pirates who captured the captain of one of our merchant ships, he is no pushover and will employ our power when needed. This is merely the beginning of a new era, one in which America has the opportunity to regain credibility, honor, and respect. It is quite likely that we are destined to regain our reputation and destroy the image of America as the arrogant \"bully on the block\". Jack Obama decided how to handle the pirates? You mean the Navy called him up and asked what they should do? Gee!! And all this time I thought it was the military that made those types of decision. aggie_swife, Please do not put words in my post. I did not say \"Obama decided how to handle the pirates\". As was reported by the world-wide news media, stated by the Secretary Gates and others, the President \"authorized the military to take immediate action if the ship's captain's life was in danger\". That is considerably different than President Obama personally deciding \"how to handle the pirates\". He gave the military the authorization to proceed as necessary. Jack", 
        "intTime": 20090418, 
        "postID": 14, 
        "quote": "Originally posted by aggie_swife: quote: Originally posted by jackhunter1: We now have a president willing to listen, to talk rather than threaten, to negotiate rather than bomb and invade, and to mend fences rather than continue the policies of alienation and arrogance. Yet, as he demonstrated in the showdown with pirates who captured the captain of one of our merchant ships, he is no pushover and will employ our power when needed. This is merely the beginning of a new era, one in which America has the opportunity to regain credibility, honor, and respect. It is quite likely that we are destined to regain our reputation and destroy the image of America as the arrogant \"bully on the block\". Jack Obama decided how to handle the pirates? You mean the Navy called him up and asked what they should do? Gee!! And all this time I thought it was the military that made those types of decision.", 
        "reply": " aggie_swife, Please do not put words in my post. I did not say \"Obama decided how to handle the pirates\". As was reported by the world-wide news media, stated by the Secretary Gates and others, the President \"authorized the military to take immediate action if the ship's captain's life was in danger\". That is considerably different than President Obama personally deciding \"how to handle the pirates\". He gave the military the authorization to proceed as necessary. Jack", 
        "threadID": "672198221_2080011122001", 
        "time": "2009-04-18 18:31:00", 
        "title": "Obama Vows to Listen to US Neighbors", 
        "userID": "jackhunter1"
    }, 
    {
        "content": "quote: the President \"authorized the military to take immediate action if the ship's captain's life was in danger\" yea 4 days later...", 
        "intTime": 20090418, 
        "postID": 15, 
        "quote": "the President \"authorized the military to take immediate action if the ship's captain's life was in danger\"", 
        "reply": " yea 4 days later...", 
        "threadID": "672198221_2080011122001", 
        "time": "2009-04-18 18:36:00", 
        "title": "Obama Vows to Listen to US Neighbors", 
        "userID": "outlaws93"
    }, 
    {
        "content": "I have always thought we should try to keep our back yard neighbors friendly towards us. However, I do think the hard stance was needed. Maybe now they will be willing to listen to reason and meet us in the middle. I do not want it it end up as giving them all they want and us not getting anything in return. I would much rather try a two way street than to have China, Russia and Iran setting up in our back yard neighbor's yard while we remain hostile towards them. I just hope it doesn't turn out as it did when Clinton tried opening the door.", 
        "intTime": 20090419, 
        "postID": 16, 
        "quote": "", 
        "reply": "I have always thought we should try to keep our back yard neighbors friendly towards us. However, I do think the hard stance was needed. Maybe now they will be willing to listen to reason and meet us in the middle. I do not want it it end up as giving them all they want and us not getting anything in return. I would much rather try a two way street than to have China, Russia and Iran setting up in our back yard neighbor's yard while we remain hostile towards them. I just hope it doesn't turn out as it did when Clinton tried opening the door.", 
        "threadID": "672198221_2080011122001", 
        "time": "2009-04-19 06:02:00", 
        "title": "Obama Vows to Listen to US Neighbors", 
        "userID": "Woody_in_La"
    }, 
    {
        "content": "quote: Originally posted by jackhunter1: quote: Originally posted by aggie_swife: quote: Originally posted by jackhunter1: We now have a president willing to listen, to talk rather than threaten, to negotiate rather than bomb and invade, and to mend fences rather than continue the policies of alienation and arrogance. Yet, as he demonstrated in the showdown with pirates who captured the captain of one of our merchant ships, he is no pushover and will employ our power when needed. This is merely the beginning of a new era, one in which America has the opportunity to regain credibility, honor, and respect. It is quite likely that we are destined to regain our reputation and destroy the image of America as the arrogant \"bully on the block\". Jack Obama decided how to handle the pirates? You mean the Navy called him up and asked what they should do? Gee!! And all this time I thought it was the military that made those types of decision. aggie_swife, Please do not put words in my post. I did not say \"Obama decided how to handle the pirates\". As was reported by the world-wide news media, stated by the Secretary Gates and others, the President \"authorized the military to take immediate action if the ship's captain's life was in danger\". That is considerably different than President Obama personally deciding \"how to handle the pirates\". He gave the military the authorization to proceed as necessary. Jack Jack, I merely read what you wrote, and it sounded as though credit was given to the president. Was this any different than when President Bush was in office? Does the military not have authority to make this type of decision? \"They love our milk and honey but they preach about some other way of living When you’re running down my country, Hoss you’re walking on the fighting side of me\" - - Merle Haggard", 
        "intTime": 20090419, 
        "postID": 17, 
        "quote": "Originally posted by jackhunter1: quote: Originally posted by aggie_swife: quote: Originally posted by jackhunter1: We now have a president willing to listen, to talk rather than threaten, to negotiate rather than bomb and invade, and to mend fences rather than continue the policies of alienation and arrogance. Yet, as he demonstrated in the showdown with pirates who captured the captain of one of our merchant ships, he is no pushover and will employ our power when needed. This is merely the beginning of a new era, one in which America has the opportunity to regain credibility, honor, and respect. It is quite likely that we are destined to regain our reputation and destroy the image of America as the arrogant \"bully on the block\". Jack Obama decided how to handle the pirates? You mean the Navy called him up and asked what they should do? Gee!! And all this time I thought it was the military that made those types of decision. aggie_swife, Please do not put words in my post. I did not say \"Obama decided how to handle the pirates\". As was reported by the world-wide news media, stated by the Secretary Gates and others, the President \"authorized the military to take immediate action if the ship's captain's life was in danger\". That is considerably different than President Obama personally deciding \"how to handle the pirates\". He gave the military the authorization to proceed as necessary. Jack", 
        "reply": " Jack, I merely read what you wrote, and it sounded as though credit was given to the president. Was this any different than when President Bush was in office? Does the military not have authority to make this type of decision? \"They love our milk and honey but they preach about some other way of living When you’re running down my country, Hoss you’re walking on the fighting side of me\" - - Merle Haggard", 
        "threadID": "672198221_2080011122001", 
        "time": "2009-04-19 08:18:00", 
        "title": "Obama Vows to Listen to US Neighbors", 
        "userID": "aggie_swife"
    }
]