[
    {
        "content": "The PETA strikes again. Just an update for the ongoing \"Guards' bearskin hats to be phased out?\" military.com thread at the British and Commonwealth militaries' section, if any one here is interested: quote: Michael Sheen calls for ban on bearskins Clare Hutchinson, Western Mail, 1 May 09 ACTOR Michael Sheen has asked Gordon Brown to call for an immediate end to the killing of black bears for Welsh Guards’ bearskin hats. The Port Talbot leading man, who has portrayed former Prime Minister Tony Blair in the 2006 film The Queen and on television in The Deal, wrote to the PM on behalf of animal charity People for the Ethical Treatment of Animals. In the letter, Sheen, pictured, accused the Ministry of Defence of going back on their promise to find a synthetic alternative to bear- skin. He said: “Not only is the purchase and importation of bearskins from Canada a deplorable waste of military funding, it is also a waste of animals’ lives.”....", 
        "intTime": 20090501, 
        "postID": 1, 
        "quote": "Michael Sheen calls for ban on bearskins Clare Hutchinson, Western Mail, 1 May 09 ACTOR Michael Sheen has asked Gordon Brown to call for an immediate end to the killing of black bears for Welsh Guards’ bearskin hats. The Port Talbot leading man, who has portrayed former Prime Minister Tony Blair in the 2006 film The Queen and on television in The Deal, wrote to the PM on behalf of animal charity People for the Ethical Treatment of Animals. In the letter, Sheen, pictured, accused the Ministry of Defence of going back on their promise to find a synthetic alternative to bear- skin. He said: “Not only is the purchase and importation of bearskins from Canada a deplorable waste of military funding, it is also a waste of animals’ lives.”....", 
        "reply": "The PETA strikes again. Just an update for the ongoing \"Guards' bearskin hats to be phased out?\" military.com thread at the British and Commonwealth militaries' section, if any one here is interested: ", 
        "threadID": "672198221_4720042222001", 
        "time": "2009-05-01 07:36:00", 
        "title": "UK actor Michael Sheen calls on Welsh Guards' Soldiers to stop using bearskin hats", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "Make 'em wear berets. They've done wonders for our morale.", 
        "intTime": 20090501, 
        "postID": 2, 
        "quote": "", 
        "reply": "Make 'em wear berets. They've done wonders for our morale.", 
        "threadID": "672198221_4720042222001", 
        "time": "2009-05-01 07:39:00", 
        "title": "UK actor Michael Sheen calls on Welsh Guards' Soldiers to stop using bearskin hats", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "Dear Welsh Guards, feel free to come to New Jersey for material for your hats, the black bear population is growing unchecked.", 
        "intTime": 20090501, 
        "postID": 3, 
        "quote": "", 
        "reply": "Dear Welsh Guards, feel free to come to New Jersey for material for your hats, the black bear population is growing unchecked.", 
        "threadID": "672198221_4720042222001", 
        "time": "2009-05-01 10:22:00", 
        "title": "UK actor Michael Sheen calls on Welsh Guards' Soldiers to stop using bearskin hats", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: Make 'em wear berets. They've done wonders for our morale. They do wear berets, khaki ones with a fetching blue-red-blue flash. And their morale is generally good, but then they do know how to wear a beret without it looking crap, an art the US Army is yet to master. As for Sheen? Dozy Welsh prat, it seems to be impossible to drill into these peoples limited intellects that even if the Brigade of Guards didn't wear 'skins the bears would still end up dead because they're culls.", 
        "intTime": 20090501, 
        "postID": 4, 
        "quote": "Originally posted by mrmixitup: Make 'em wear berets. They've done wonders for our morale.", 
        "reply": " They do wear berets, khaki ones with a fetching blue-red-blue flash. And their morale is generally good, but then they do know how to wear a beret without it looking crap, an art the US Army is yet to master. As for Sheen? Dozy Welsh prat, it seems to be impossible to drill into these peoples limited intellects that even if the Brigade of Guards didn't wear 'skins the bears would still end up dead because they're culls.", 
        "threadID": "672198221_4720042222001", 
        "time": "2009-05-01 10:51:00", 
        "title": "UK actor Michael Sheen calls on Welsh Guards' Soldiers to stop using bearskin hats", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "Talented actor. Idiot conservationist. You hit the nail on the head Blades, the things are culled anyway, why waste the pelt? And your right about berets, I hate 'em, but the US military has taken the HLS style to new and as yet undreampt of heights! Go back to caps fellas for Christs sake.", 
        "intTime": 20090501, 
        "postID": 5, 
        "quote": "", 
        "reply": "Talented actor. Idiot conservationist. You hit the nail on the head Blades, the things are culled anyway, why waste the pelt? And your right about berets, I hate 'em, but the US military has taken the HLS style to new and as yet undreampt of heights! Go back to caps fellas for Christs sake.", 
        "threadID": "672198221_4720042222001", 
        "time": "2009-05-01 13:30:00", 
        "title": "UK actor Michael Sheen calls on Welsh Guards' Soldiers to stop using bearskin hats", 
        "userID": "redcoat72"
    }, 
    {
        "content": "quote: Originally posted by redcoat72: Talented actor. Idiot conservationist. You hit the nail on the head Blades, the things are culled anyway, why waste the pelt? And your right about berets, I hate 'em, but the US military has taken the HLS style to new and as yet undreampt of heights! Go back to caps fellas for Christs sake. Once upon a time berets were worn by an elite group within the US military, who knew how to wear them because they earned them. Such is life.", 
        "intTime": 20090501, 
        "postID": 6, 
        "quote": "Originally posted by redcoat72: Talented actor. Idiot conservationist. You hit the nail on the head Blades, the things are culled anyway, why waste the pelt? And your right about berets, I hate 'em, but the US military has taken the HLS style to new and as yet undreampt of heights! Go back to caps fellas for Christs sake.", 
        "reply": " Once upon a time berets were worn by an elite group within the US military, who knew how to wear them because they earned them. Such is life.", 
        "threadID": "672198221_4720042222001", 
        "time": "2009-05-01 13:34:00", 
        "title": "UK actor Michael Sheen calls on Welsh Guards' Soldiers to stop using bearskin hats", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by 67NOV: quote: Originally posted by redcoat72: Talented actor. Idiot conservationist. You hit the nail on the head Blades, the things are culled anyway, why waste the pelt? And your right about berets, I hate 'em, but the US military has taken the HLS style to new and as yet undreampt of heights! Go back to caps fellas for Christs sake. Once upon a time berets were worn by an elite group within the US military, who knew how to wear them because they earned them. Such is life. You do mean the Tankers right? I mean they were the original wearers of berets in the US military.....", 
        "intTime": 20090501, 
        "postID": 7, 
        "quote": "Originally posted by 67NOV: quote: Originally posted by redcoat72: Talented actor. Idiot conservationist. You hit the nail on the head Blades, the things are culled anyway, why waste the pelt? And your right about berets, I hate 'em, but the US military has taken the HLS style to new and as yet undreampt of heights! Go back to caps fellas for Christs sake. Once upon a time berets were worn by an elite group within the US military, who knew how to wear them because they earned them. Such is life.", 
        "reply": " You do mean the Tankers right? I mean they were the original wearers of berets in the US military.....", 
        "threadID": "672198221_4720042222001", 
        "time": "2009-05-01 13:46:00", 
        "title": "UK actor Michael Sheen calls on Welsh Guards' Soldiers to stop using bearskin hats", 
        "userID": "NickBrand"
    }, 
    {
        "content": "Sorry Nick, I was thinking about Rangers, but duly noted.", 
        "intTime": 20090501, 
        "postID": 8, 
        "quote": "", 
        "reply": "Sorry Nick, I was thinking about Rangers, but duly noted.", 
        "threadID": "672198221_4720042222001", 
        "time": "2009-05-01 13:59:00", 
        "title": "UK actor Michael Sheen calls on Welsh Guards' Soldiers to stop using bearskin hats", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by NickBrand: quote: Originally posted by 67NOV: quote: Originally posted by redcoat72: Talented actor. Idiot conservationist. You hit the nail on the head Blades, the things are culled anyway, why waste the pelt? And your right about berets, I hate 'em, but the US military has taken the HLS style to new and as yet undreampt of heights! Go back to caps fellas for Christs sake. Once upon a time berets were worn by an elite group within the US military, who knew how to wear them because they earned them. Such is life. You do mean the Tankers right? I mean they were the original wearers of berets in the US military..... Not what I read in the US history of the wearing of the beret. Yes, it was the british tankers who wore them first but it was the 509th in 1943 who first wore the beret, maroon one in this case within the US forces.", 
        "intTime": 20090501, 
        "postID": 9, 
        "quote": "Originally posted by NickBrand: quote: Originally posted by 67NOV: quote: Originally posted by redcoat72: Talented actor. Idiot conservationist. You hit the nail on the head Blades, the things are culled anyway, why waste the pelt? And your right about berets, I hate 'em, but the US military has taken the HLS style to new and as yet undreampt of heights! Go back to caps fellas for Christs sake. Once upon a time berets were worn by an elite group within the US military, who knew how to wear them because they earned them. Such is life. You do mean the Tankers right? I mean they were the original wearers of berets in the US military.....", 
        "reply": " Not what I read in the US history of the wearing of the beret. Yes, it was the british tankers who wore them first but it was the 509th in 1943 who first wore the beret, maroon one in this case within the US forces.", 
        "threadID": "672198221_4720042222001", 
        "time": "2009-05-01 17:21:00", 
        "title": "UK actor Michael Sheen calls on Welsh Guards' Soldiers to stop using bearskin hats", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "We call them Tankies not Tankers. A Tanker is a big ship. Always trying to murder my language you Colonials!", 
        "intTime": 20090501, 
        "postID": 10, 
        "quote": "", 
        "reply": "We call them Tankies not Tankers. A Tanker is a big ship. Always trying to murder my language you Colonials!", 
        "threadID": "672198221_4720042222001", 
        "time": "2009-05-01 23:41:00", 
        "title": "UK actor Michael Sheen calls on Welsh Guards' Soldiers to stop using bearskin hats", 
        "userID": "redcoat72"
    }, 
    {
        "content": "quote: Originally posted by redcoat72: We call them Tankies not Tankers. A Tanker is a big ship. Always trying to murder my language you Colonials! Actually, they are called 'Treadheads' here.", 
        "intTime": 20090502, 
        "postID": 11, 
        "quote": "Originally posted by redcoat72: We call them Tankies not Tankers. A Tanker is a big ship. Always trying to murder my language you Colonials!", 
        "reply": " Actually, they are called 'Treadheads' here.", 
        "threadID": "672198221_4720042222001", 
        "time": "2009-05-02 05:36:00", 
        "title": "UK actor Michael Sheen calls on Welsh Guards' Soldiers to stop using bearskin hats", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "My suggestion, tell PETA that they are made of fake bearskin.", 
        "intTime": 20090502, 
        "postID": 12, 
        "quote": "", 
        "reply": "My suggestion, tell PETA that they are made of fake bearskin.", 
        "threadID": "672198221_4720042222001", 
        "time": "2009-05-02 06:39:00", 
        "title": "UK actor Michael Sheen calls on Welsh Guards' Soldiers to stop using bearskin hats", 
        "userID": "fishnfanatic"
    }, 
    {
        "content": "I guess one could come up with a way to use PETA protesters as hats some of them are pretty furry. Of course a sect of radical leftist PETA types are trying to ban cattle grazing in the western US. the article cites some BOGUS study done by leftists with an agenda. >>http://www.google.com/hostednews/ap/article/ALeqM5jeUjNoBPK4YMzaH8t8pvHERBw5-wD97TA1HG1 Actors should stick with something they know just a little about...Like ACTING. They are NOT policy makers and generally dont have a clue about issues.", 
        "intTime": 20090502, 
        "postID": 13, 
        "quote": "", 
        "reply": "I guess one could come up with a way to use PETA protesters as hats some of them are pretty furry. Of course a sect of radical leftist PETA types are trying to ban cattle grazing in the western US. the article cites some BOGUS study done by leftists with an agenda. >>http://www.google.com/hostednews/ap/article/ALeqM5jeUjNoBPK4YMzaH8t8pvHERBw5-wD97TA1HG1 Actors should stick with something they know just a little about...Like ACTING. They are NOT policy makers and generally dont have a clue about issues.", 
        "threadID": "672198221_4720042222001", 
        "time": "2009-05-02 07:26:00", 
        "title": "UK actor Michael Sheen calls on Welsh Guards' Soldiers to stop using bearskin hats", 
        "userID": "FlankerFlyer"
    }, 
    {
        "content": "You called them Tankers in your post, however, not quibbling!", 
        "intTime": 20090502, 
        "postID": 14, 
        "quote": "", 
        "reply": "You called them Tankers in your post, however, not quibbling!", 
        "threadID": "672198221_4720042222001", 
        "time": "2009-05-02 07:41:00", 
        "title": "UK actor Michael Sheen calls on Welsh Guards' Soldiers to stop using bearskin hats", 
        "userID": "redcoat72"
    }, 
    {
        "content": "quote: Originally posted by fishnfanatic: My suggestion, tell PETA that they are made of fake bearskin. Why NOT make them out of fake bearskins? Who would know? Aside from the bears of course... Dave", 
        "intTime": 20090502, 
        "postID": 15, 
        "quote": "Originally posted by fishnfanatic: My suggestion, tell PETA that they are made of fake bearskin.", 
        "reply": " Why NOT make them out of fake bearskins? Who would know? Aside from the bears of course... Dave", 
        "threadID": "672198221_4720042222001", 
        "time": "2009-05-02 07:50:00", 
        "title": "UK actor Michael Sheen calls on Welsh Guards' Soldiers to stop using bearskin hats", 
        "userID": "Grachus"
    }, 
    {
        "content": "They have tried. In the wet they look flat and when they dry they look like Doc's haircut out of 'back to the future'. Incidentally all Guards regiments wear the Bearskin, not just the Welsh Guards.", 
        "intTime": 20090502, 
        "postID": 16, 
        "quote": "", 
        "reply": "They have tried. In the wet they look flat and when they dry they look like Doc's haircut out of 'back to the future'. Incidentally all Guards regiments wear the Bearskin, not just the Welsh Guards.", 
        "threadID": "672198221_4720042222001", 
        "time": "2009-05-02 07:58:00", 
        "title": "UK actor Michael Sheen calls on Welsh Guards' Soldiers to stop using bearskin hats", 
        "userID": "redcoat72"
    }, 
    {
        "content": "quote: Originally posted by FlankerFlyer: I guess one could come up with a way to use PETA protesters as hats some of them are pretty furry. Of course a sect of radical leftist PETA types are trying to ban cattle grazing in the western US. the article cites some BOGUS study done by leftists with an agenda. >>http://www.google.com/hostednews/ap/article/ALeqM5jeUjNoBPK4YMzaH8t8pvHERBw5-wD97TA1HG1 Actors should stick with something they know just a little about...Like ACTING. They are NOT policy makers and generally dont have a clue about issues. Well, you always support giving welfare to the wealthy. The majority of users of Federal Land are not small ranchers, but rather Corporate Farmers. For a tiny fee they get to use OUR land, and feed THEIR cattle for free, and do whatever they want with it. Now personally I don't think grazing cattle is automatically harmful to wildlife. Sheep of course can be very destructive. Nor would I want to see small ranchers forced out of buisness. But this is a scientific question of what WE want to do with OUR land. Those who want to hunt, fish, hike, camp, etc, have as much of a say so, as some corporate food processor getting welfare paid for by the taxpayer. Land use and preservation is a science, not a welfare program. Certainly we shouldn't make decision based on what one interest group tells us - Doesn't mean we should believe the Other interest group. Dave", 
        "intTime": 20090502, 
        "postID": 17, 
        "quote": "Originally posted by FlankerFlyer: I guess one could come up with a way to use PETA protesters as hats some of them are pretty furry. Of course a sect of radical leftist PETA types are trying to ban cattle grazing in the western US. the article cites some BOGUS study done by leftists with an agenda. >>http://www.google.com/hostednews/ap/article/ALeqM5jeUjNoBPK4YMzaH8t8pvHERBw5-wD97TA1HG1 Actors should stick with something they know just a little about...Like ACTING. They are NOT policy makers and generally dont have a clue about issues.", 
        "reply": " Well, you always support giving welfare to the wealthy. The majority of users of Federal Land are not small ranchers, but rather Corporate Farmers. For a tiny fee they get to use OUR land, and feed THEIR cattle for free, and do whatever they want with it. Now personally I don't think grazing cattle is automatically harmful to wildlife. Sheep of course can be very destructive. Nor would I want to see small ranchers forced out of buisness. But this is a scientific question of what WE want to do with OUR land. Those who want to hunt, fish, hike, camp, etc, have as much of a say so, as some corporate food processor getting welfare paid for by the taxpayer. Land use and preservation is a science, not a welfare program. Certainly we shouldn't make decision based on what one interest group tells us - Doesn't mean we should believe the Other interest group. Dave", 
        "threadID": "672198221_4720042222001", 
        "time": "2009-05-02 07:58:00", 
        "title": "UK actor Michael Sheen calls on Welsh Guards' Soldiers to stop using bearskin hats", 
        "userID": "Grachus"
    }, 
    {
        "content": "I thought the decision to replace the busbies, as they wore out with 'faux fur' had been madfe a decade back. Mybe they got hung up on deciding between the plain bear and a more 'upscale' leopard or jaguarundi. Sort of like the beanies 'n cravats of the \"Fightin' 264th\" in Wag the Dog.", 
        "intTime": 20090502, 
        "postID": 18, 
        "quote": "", 
        "reply": "I thought the decision to replace the busbies, as they wore out with 'faux fur' had been madfe a decade back. Mybe they got hung up on deciding between the plain bear and a more 'upscale' leopard or jaguarundi. Sort of like the beanies 'n cravats of the \"Fightin' 264th\" in Wag the Dog.", 
        "threadID": "672198221_4720042222001", 
        "time": "2009-05-02 07:59:00", 
        "title": "UK actor Michael Sheen calls on Welsh Guards' Soldiers to stop using bearskin hats", 
        "userID": "popsiq"
    }, 
    {
        "content": "Yes Popsiq the MOD has said if a suitable fake fur replacement can be manufactured they would on balance probably adopt it. And the Bearskin is not a 'Busby', that is an entirely different form of headgear. Just to be accurate.", 
        "intTime": 20090502, 
        "postID": 19, 
        "quote": "", 
        "reply": "Yes Popsiq the MOD has said if a suitable fake fur replacement can be manufactured they would on balance probably adopt it. And the Bearskin is not a 'Busby', that is an entirely different form of headgear. Just to be accurate.", 
        "threadID": "672198221_4720042222001", 
        "time": "2009-05-02 08:02:00", 
        "title": "UK actor Michael Sheen calls on Welsh Guards' Soldiers to stop using bearskin hats", 
        "userID": "redcoat72"
    }
]