[
    {
        "content": "But then he doesn’t give Obama a pass either. I think that if the Repubs need to look for a spokesperson; they need look no farther than this well respected gentleman. JMHO of course. quote: Former Homeland Security Secretary Tom Ridge is the latest Republican to disagree with former Vice President Dick Cheney's assertion that President Obama's policies have made the country less safe. In an interview that will air on CNN's \"State of the Union\" on Sunday, Ridge, a former Pennsylvania governor, was asked whether he believes Obama's policies are putting the country more at risk and less safe. \"I do not,\" Ridge said. \"I disagree with Dick Cheney.\" Ridge wasn't entirely positive about Obama, though. He disagreed with Obama's assertion in his Thursday speech that Bush administration officials developed policies based on fear and \"trimmed facts and evident to fit ideological predispositions.\" \"I'm surprised that President Obama, who I really, truly believe knows better, would make such a statement,\" Ridge said. \"The men and women in charge of America's security, whether they're military, or the intelligence community - the president, the vice president, the attorney general, the FBI director - did everything they could at the time to prevent another attack on America. And did it consistent with the Constitution and the rule of law.\" Ridge also said he is \"disappointed\" in Obama because he continues to look backward even though he stresses he focus on the future. \"He keeps looking backwards to justify what he's doing now,\" Ridge said. \"I think that becomes more politics than policy and I don't think it's the kind of approach that we need to bring America together on this very important issue.\" http://briefingroom.thehill.com/2009/05/22/ridge-disagrees-with-cheney/", 
        "intTime": 20090522, 
        "postID": 1, 
        "quote": "Former Homeland Security Secretary Tom Ridge is the latest Republican to disagree with former Vice President Dick Cheney's assertion that President Obama's policies have made the country less safe. In an interview that will air on CNN's \"State of the Union\" on Sunday, Ridge, a former Pennsylvania governor, was asked whether he believes Obama's policies are putting the country more at risk and less safe. \"I do not,\" Ridge said. \"I disagree with Dick Cheney.\" Ridge wasn't entirely positive about Obama, though. He disagreed with Obama's assertion in his Thursday speech that Bush administration officials developed policies based on fear and \"trimmed facts and evident to fit ideological predispositions.\" \"I'm surprised that President Obama, who I really, truly believe knows better, would make such a statement,\" Ridge said. \"The men and women in charge of America's security, whether they're military, or the intelligence community - the president, the vice president, the attorney general, the FBI director - did everything they could at the time to prevent another attack on America. And did it consistent with the Constitution and the rule of law.\" Ridge also said he is \"disappointed\" in Obama because he continues to look backward even though he stresses he focus on the future. \"He keeps looking backwards to justify what he's doing now,\" Ridge said. \"I think that becomes more politics than policy and I don't think it's the kind of approach that we need to bring America together on this very important issue.\" http://briefingroom.thehill.com/2009/05/22/ridge-disagrees-with-cheney/", 
        "reply": "But then he doesn’t give Obama a pass either. I think that if the Repubs need to look for a spokesperson; they need look no farther than this well respected gentleman. JMHO of course. ", 
        "threadID": "672198221_1300030422001", 
        "time": "2009-05-22 17:16:00", 
        "title": "Ridge disagrees with Cheney", 
        "userID": "jdksfcret"
    }, 
    {
        "content": "- yep, dick cheney needs to shut his yapper. what was it he was saying just a few years ago about political dissent making the nation look weaker to its enemies? freakin' hypocrite! -", 
        "intTime": 20090523, 
        "postID": 2, 
        "quote": "", 
        "reply": "- yep, dick cheney needs to shut his yapper. what was it he was saying just a few years ago about political dissent making the nation look weaker to its enemies? freakin' hypocrite! -", 
        "threadID": "672198221_1300030422001", 
        "time": "2009-05-23 00:53:00", 
        "title": "Ridge disagrees with Cheney", 
        "userID": "ANZACbiscuit"
    }
]