[
    {
        "content": "One long year after activists at Jobs for Afghans began putting out their unique message, that creating cash-for-work jobs in Afghanistan would cut short the insurgency and be much cheaper than a prolonged war, Time Magazine has thrust this solution into the spotlight with this week's cover story \"How Not to Lose in Afghanistan\" (April 20, 2009.) The double-page spread leading into the story makes no bones about where it is headed: JOBS. This is not a nod in the direction of fighting smarter. This is a full embrace. Taking a page from Sun Tzu's Art of War, Time, if not the American people, seems to understand that the most preferable way to win a war is never to have to fight it. Reporter Aryn Baker quotes a Korengal Valley elder: quote: \"The Taliban say they are fighting because there are Americans here and it's a jihad. But the fact is, they aren't fighting for religion. They are fighting for money. If they had jobs, they would stop fighting.\" Thank you Time Magazine. I thought it would be a cold day in h--l before I'd hear myself saying that. Baker muses: quote: Is it really that simple? Afghans like Khan say only a small fraction of the insurgency consists of hardened jihadis willing to fight to the death; the rest are ordinary, poor villagers who simply haven't been given a better option. Khan estimates that the insurgents earn from $100 to $200 a month...\" Most of that money comes from illegal trade like opium or clear-cut lumber. Baker notes that the U.S. policy of poppy eradication has only fueled the fighting by eliminating income without providing an alternative. Baker flips the emerging Pakistan-first analysis on its head, and notes the obvious: quote: Stabilizing Afghanistan might well become crucial to preventing the far more terrifying prospect of an Islamist takeover in Pakistan. Buy this issue of Time. It's not every day that the flagship of the corporate media, bizarrely miscast by the far-right as \"liberal,\" not only gets it right, but gets it exactly right. We may be forgiven if we think we hear in the distance the footfalls of a Velvet Revolution. A hawk-dove issue it is not. One of the first to go public with jobs-as-a-weapon-of-counterinsurgency was Karl Eikenberry. As in, General Karl Eikenberry, Former Commander of US Forces in Afghanistan: quote: \"Much of the enemy force is drawn from the ranks of unemployed men looking for wages to support their families\" The far-right will attempt to squash this deviation in thinking from that preferred by the military-industrial complex, which Republican President Eisenhower warned us about. Eisenhower warned us that war is profitable, but sometimes there are solutions other than war. He urged us to recognize that business forces will tend to drive us towards war. Not that there isn't fighting ahead. There will be fighting. But perhaps not of the stupid sort, which brings to fruition bin Laden's dream of \"bleeding America to the point of bankruptcy.\" He said: quote: \"All that we have to do is to send two mujahedeen to the furthest point east to raise a piece of cloth on which is written al Qaeda, in order to make generals race there to cause America to suffer human, economic and political losses without their achieving anything of note,\" The surge in itself may not be fatal. It is not the number of soldiers in the mission, but what that mission consists of. Chase \"Taliban\" only as far as necessary to protect populations and work crews, and hand out jobs and money. Changes in tune like the Time article do not just happen. The credit goes to activists who quietly forward and fax articles and arguments to congressmen, to the White House, to newspapers, to the media. They may not talk about it or write diaries or make comments in blogs, but they do the work. You are succeeding. George Patton said the greatest endeavor of man is war. This is wrong. The greatest endeavor is to stop wars. Somewhere a wheel was turned, and the 20,000-ton ship-of-state is now showing that turn. Somewhere a soldier high over the Atlantic headed for ultimate destination Baghram is reading Time Magazine, and hoping his exalted elders are doing something more than cheerleading sending him into a meat grinder. Hoping his government has done its d--ned best to make men down there decide not to shoot at him, or plant one of those dreaded IEDs. The one that will kill me, or worse. There are already a number of cash-for-work pilot programs in Afghanistan, in Jawzjan Province, Uruzgan, and Balkh Province, run by Action Aid, Mercy Corps, and USAID, respectively. The USAID project involves the clearing of springs and removal of silt which clogs irrigation ditches. Afghanistan, the last place empires test their might. Perhaps hardest to believe is that Time Magazine's path is cheaper. I have heard the argument made, yes, despicable, that winning it this way is far too expensive, better to go in and get a bunch of people killed, including ours, and get it over with. That is stupidity on top of ignorance on top of callousness. This is when I start talking about a universal draft. The cost of military operations in Afghanistan? Going on $30 billion a year. The cost of 500,000 day-labor jobs there for a year? $4 billion. To not create jobs in Afghanistan is penny-wise and pound foolish. By short-circuiting this quagmire, we'll be saving billions that we're going to need to create our own jobs. \"How Not to Lose in Afghanistan\" article: \"\"http://www.time.com/time/world/article/0,8599,1890243,00.html Jobs for Afghans \"\"http://jobsforafghans.org Please circulate and forward this to your congressmember and the White House. LINK TO CONGRESS EMAILS. \"\"http://www.visi.com/juan/congress/ LINK TO EMAIL WHITE HOUSE \"\"http://www.whitehouse.gov/contact/", 
        "intTime": 20090416, 
        "postID": 1, 
        "quote": "\"The Taliban say they are fighting because there are Americans here and it's a jihad. But the fact is, they aren't fighting for religion. They are fighting for money. If they had jobs, they would stop fighting.\"", 
        "reply": "One long year after activists at Jobs for Afghans began putting out their unique message, that creating cash-for-work jobs in Afghanistan would cut short the insurgency and be much cheaper than a prolonged war, Time Magazine has thrust this solution into the spotlight with this week's cover story \"How Not to Lose in Afghanistan\" (April 20, 2009.) The double-page spread leading into the story makes no bones about where it is headed: JOBS. This is not a nod in the direction of fighting smarter. This is a full embrace. Taking a page from Sun Tzu's Art of War, Time, if not the American people, seems to understand that the most preferable way to win a war is never to have to fight it. Reporter Aryn Baker quotes a Korengal Valley elder:  Thank you Time Magazine. I thought it would be a cold day in h--l before I'd hear myself saying that. Baker muses: quote: Is it really that simple? Afghans like Khan say only a small fraction of the insurgency consists of hardened jihadis willing to fight to the death; the rest are ordinary, poor villagers who simply haven't been given a better option. Khan estimates that the insurgents earn from $100 to $200 a month...\" Most of that money comes from illegal trade like opium or clear-cut lumber. Baker notes that the U.S. policy of poppy eradication has only fueled the fighting by eliminating income without providing an alternative. Baker flips the emerging Pakistan-first analysis on its head, and notes the obvious: quote: Stabilizing Afghanistan might well become crucial to preventing the far more terrifying prospect of an Islamist takeover in Pakistan. Buy this issue of Time. It's not every day that the flagship of the corporate media, bizarrely miscast by the far-right as \"liberal,\" not only gets it right, but gets it exactly right. We may be forgiven if we think we hear in the distance the footfalls of a Velvet Revolution. A hawk-dove issue it is not. One of the first to go public with jobs-as-a-weapon-of-counterinsurgency was Karl Eikenberry. As in, General Karl Eikenberry, Former Commander of US Forces in Afghanistan: quote: \"Much of the enemy force is drawn from the ranks of unemployed men looking for wages to support their families\" The far-right will attempt to squash this deviation in thinking from that preferred by the military-industrial complex, which Republican President Eisenhower warned us about. Eisenhower warned us that war is profitable, but sometimes there are solutions other than war. He urged us to recognize that business forces will tend to drive us towards war. Not that there isn't fighting ahead. There will be fighting. But perhaps not of the stupid sort, which brings to fruition bin Laden's dream of \"bleeding America to the point of bankruptcy.\" He said: quote: \"All that we have to do is to send two mujahedeen to the furthest point east to raise a piece of cloth on which is written al Qaeda, in order to make generals race there to cause America to suffer human, economic and political losses without their achieving anything of note,\" The surge in itself may not be fatal. It is not the number of soldiers in the mission, but what that mission consists of. Chase \"Taliban\" only as far as necessary to protect populations and work crews, and hand out jobs and money. Changes in tune like the Time article do not just happen. The credit goes to activists who quietly forward and fax articles and arguments to congressmen, to the White House, to newspapers, to the media. They may not talk about it or write diaries or make comments in blogs, but they do the work. You are succeeding. George Patton said the greatest endeavor of man is war. This is wrong. The greatest endeavor is to stop wars. Somewhere a wheel was turned, and the 20,000-ton ship-of-state is now showing that turn. Somewhere a soldier high over the Atlantic headed for ultimate destination Baghram is reading Time Magazine, and hoping his exalted elders are doing something more than cheerleading sending him into a meat grinder. Hoping his government has done its d--ned best to make men down there decide not to shoot at him, or plant one of those dreaded IEDs. The one that will kill me, or worse. There are already a number of cash-for-work pilot programs in Afghanistan, in Jawzjan Province, Uruzgan, and Balkh Province, run by Action Aid, Mercy Corps, and USAID, respectively. The USAID project involves the clearing of springs and removal of silt which clogs irrigation ditches. Afghanistan, the last place empires test their might. Perhaps hardest to believe is that Time Magazine's path is cheaper. I have heard the argument made, yes, despicable, that winning it this way is far too expensive, better to go in and get a bunch of people killed, including ours, and get it over with. That is stupidity on top of ignorance on top of callousness. This is when I start talking about a universal draft. The cost of military operations in Afghanistan? Going on $30 billion a year. The cost of 500,000 day-labor jobs there for a year? $4 billion. To not create jobs in Afghanistan is penny-wise and pound foolish. By short-circuiting this quagmire, we'll be saving billions that we're going to need to create our own jobs. \"How Not to Lose in Afghanistan\" article: \"\"http://www.time.com/time/world/article/0,8599,1890243,00.html Jobs for Afghans \"\"http://jobsforafghans.org Please circulate and forward this to your congressmember and the White House. LINK TO CONGRESS EMAILS. \"\"http://www.visi.com/juan/congress/ LINK TO EMAIL WHITE HOUSE \"\"http://www.whitehouse.gov/contact/", 
        "threadID": "672198221_6320039022001", 
        "time": "2009-04-16 11:15:00", 
        "title": "Time Says No Win In Afghanistan Without Jobs", 
        "userID": "WitchitaKid"
    }, 
    {
        "content": "The problem is money. The operating costs of their Army alone is $2 billion per year. The total income of the government last year? $800 million. Yea, that's a serious problem. They don't have oil money to **** away like Iraq does.", 
        "intTime": 20090417, 
        "postID": 2, 
        "quote": "", 
        "reply": "The problem is money. The operating costs of their Army alone is $2 billion per year. The total income of the government last year? $800 million. Yea, that's a serious problem. They don't have oil money to **** away like Iraq does.", 
        "threadID": "672198221_6320039022001", 
        "time": "2009-04-17 06:25:00", 
        "title": "Time Says No Win In Afghanistan Without Jobs", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "Wow Time Magazine is now Military experts,,,,, NOT. Where they may have some good points, it's not OUR job to provide work for Afghans, it's their country, let them create the jobs. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090417, 
        "postID": 3, 
        "quote": "", 
        "reply": "Wow Time Magazine is now Military experts,,,,, NOT. Where they may have some good points, it's not OUR job to provide work for Afghans, it's their country, let them create the jobs. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_6320039022001", 
        "time": "2009-04-17 07:16:00", 
        "title": "Time Says No Win In Afghanistan Without Jobs", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: Wow Time Magazine is now Military experts,,,,, NOT. Where they may have some good points, it's not OUR job to provide work for Afghans, it's their country, let them create the jobs. Dur, it's obvious they aren't going to. So, what's your other solution?", 
        "intTime": 20090417, 
        "postID": 4, 
        "quote": "Originally posted by L0A1: Wow Time Magazine is now Military experts,,,,, NOT. Where they may have some good points, it's not OUR job to provide work for Afghans, it's their country, let them create the jobs.", 
        "reply": " Dur, it's obvious they aren't going to. So, what's your other solution?", 
        "threadID": "672198221_6320039022001", 
        "time": "2009-04-17 07:41:00", 
        "title": "Time Says No Win In Afghanistan Without Jobs", 
        "userID": "mrmixitup"
    }
]