[
    {
        "content": "Krauthammer's Asterisks Charles Krauthammer, in his Washington Post opinion column this morning, tries to find loopholes for impermissible evil. \"Torture is an impermissible evil. Except under two circumstances,\" he writes. \"The first is the ticking time bomb. An innocent's life is at stake. The bad guy you have captured possesses information that could save this life. He refuses to divulge. In such a case, the choice is easy.\" Actually, no. The ticking time bomb scenario only exists in two places: On TV and in the dark fantasies of power-crazed and morally deficient authoritarians. In real life, things are never that certain. And trained interrogators say that even in the most extreme circumstances, traditional methods are the most effective. Krauthammer continues: \"Some people, however, believe you never torture. Ever. They are akin to conscientious objectors who will never fight in any war under any circumstances, and for whom we correctly show respect by exempting them from war duty. But we would never make one of them Centcom commander.\" Actually, no. They are normal people who share the post-World War II international consensus that \"recognition of the inherent dignity and of the equal and inalienable rights of all members of the human family is the foundation of freedom, justice and peace in the world.\" Indeed, the idea of putting someone without a healthy respect for human rights at Centcom is abhorrent -- unless of course you believe that human rights don't matter. Krauthamer: \"The second exception to the no-torture rule is the extraction of information from a high-value enemy in possession of high-value information likely to save lives. This case lacks the black-and-white clarity of the ticking time bomb scenario. We know less about the length of the fuse or the nature of the next attack. But we do know the danger is great.\" This of course is a blatant post-facto attempt at rationalizing the (inevitable) misdiagnosis of the ticking time bomb scenario. Now all of a sudden the standards are lower. Krauthammer is advocating fishing expeditions -- with a waterboard. \"Under those circumstances, you do what you have to do.\" Krauthammer's core argument then is that the ends justify the means. He quotes two former CIA officials, both deeply invested in covering their asses, who unsurprisingly insist that torture worked. But none of the claims they or others in the complicit chain of command have made held up under even modest public scrutiny. And he mocks the idea put forth by President Obama on Wednesday -- and supported by people who actually have experience in interrogation, rather than in watching TV and fantasizing about being Jack Bauer -- that traditional interrogation techniques are extremely effective. For instance, he writes: \"KSM, the mastermind of 9/11 who knew more about more plots than anyone else, did not seem very inclined to respond to polite inquiries about future plans. The man who boasted of personally beheading Daniel Pearl with a butcher knife answered questions about plots with 'soon you will know' -- meaning, when you count the bodies in the morgue and find horribly disfigured burn victims in hospitals, you will know then what we are planning now.\" But as Scott Shane recently pointed out in the New York Times, with more than a little understatement: \"Mr. Mohammed, captured on March 1, 2003, was waterboarded 183 times that month. That striking number, which would average out to six waterboardings a day, suggests that interrogators did not try a traditional, rapport-building approach for long before escalating to their most extreme tool.\" And almost nobody who knows anything about the Pearl case (see, for instance, Lawrence Wright and Peter Bergen) actually thinks KSM -- who confessed to the killing after being tortured -- had anything to do with it. Torture after all is really only good at one thing: eliciting false confessions. That we got plenty of from KSM. But his \"soon you will know\" boast was all bluster -- sort of like Saddam Hussein's claim to have nuclear capability. (\"Responding to bluster with war crimes\" -- there's a great motto for an administration.) Nothing KSM said came close to thwarting any imminent attack. One hundred and eighty three waterboarding sessions later, the \"bodies in the morgue\" and the \"horribly disfigured burn victims\" were still only a fantasy of the torturers -- and certain opinion columnists. Krauthammer: \"The other problem is one of timing. The good cop routine can take weeks or months or years. We didn't have that luxury in the aftermath of 9/11 when waterboarding, for example, was in use.\" But his compacting of the timeline is shameless revisionism. Top officials of the Bush administration -- and yes, I'm looking at you, Mr. Cheney -- panicked. And they continued to panic after any excuse for panic was long over. Waterboarding was conducted over a period of several months, long after 9/11 -- from August 2002 at least through March 2003. Other torture tactics were widely employed in Iraq, Afghanistan and Guantanamo over a period of years. Legal memos defending various forms of torture were being commissioned by the White House until virtually the end of the Bush administration. And in his final defense, Krauthammer argues that the lack of objections at the time from Nancy Pelosi and other members of Congress who were briefed on interrogation policies is proof that \"at the time the information was important enough, the danger great enough and our blindness about the enemy's plans severe enough to justify an exception to the moral injunction against torture.\" Precisely what members of Congress were told and how they responded should absolutely be a part of any thorough official investigation into the abuses of the Bush years. The enablers must be exposed as surely as the complicit. And members of Congress who knew what was happening and remained silent must be held to public account for their moral cowardice. But their failure to speak out does not change the fundamental moral equation. If the United States is to live up to its core values, if it is to once again be a beacon of human rights to the world and a champion of human dignity, then when it comes to torture -- to impermissible evil, as Krauthammer himself puts it -- there can be no asterisks. By Dan Froomkin", 
        "intTime": 20090501, 
        "postID": 1, 
        "quote": "", 
        "reply": "Krauthammer's Asterisks Charles Krauthammer, in his Washington Post opinion column this morning, tries to find loopholes for impermissible evil. \"Torture is an impermissible evil. Except under two circumstances,\" he writes. \"The first is the ticking time bomb. An innocent's life is at stake. The bad guy you have captured possesses information that could save this life. He refuses to divulge. In such a case, the choice is easy.\" Actually, no. The ticking time bomb scenario only exists in two places: On TV and in the dark fantasies of power-crazed and morally deficient authoritarians. In real life, things are never that certain. And trained interrogators say that even in the most extreme circumstances, traditional methods are the most effective. Krauthammer continues: \"Some people, however, believe you never torture. Ever. They are akin to conscientious objectors who will never fight in any war under any circumstances, and for whom we correctly show respect by exempting them from war duty. But we would never make one of them Centcom commander.\" Actually, no. They are normal people who share the post-World War II international consensus that \"recognition of the inherent dignity and of the equal and inalienable rights of all members of the human family is the foundation of freedom, justice and peace in the world.\" Indeed, the idea of putting someone without a healthy respect for human rights at Centcom is abhorrent -- unless of course you believe that human rights don't matter. Krauthamer: \"The second exception to the no-torture rule is the extraction of information from a high-value enemy in possession of high-value information likely to save lives. This case lacks the black-and-white clarity of the ticking time bomb scenario. We know less about the length of the fuse or the nature of the next attack. But we do know the danger is great.\" This of course is a blatant post-facto attempt at rationalizing the (inevitable) misdiagnosis of the ticking time bomb scenario. Now all of a sudden the standards are lower. Krauthammer is advocating fishing expeditions -- with a waterboard. \"Under those circumstances, you do what you have to do.\" Krauthammer's core argument then is that the ends justify the means. He quotes two former CIA officials, both deeply invested in covering their asses, who unsurprisingly insist that torture worked. But none of the claims they or others in the complicit chain of command have made held up under even modest public scrutiny. And he mocks the idea put forth by President Obama on Wednesday -- and supported by people who actually have experience in interrogation, rather than in watching TV and fantasizing about being Jack Bauer -- that traditional interrogation techniques are extremely effective. For instance, he writes: \"KSM, the mastermind of 9/11 who knew more about more plots than anyone else, did not seem very inclined to respond to polite inquiries about future plans. The man who boasted of personally beheading Daniel Pearl with a butcher knife answered questions about plots with 'soon you will know' -- meaning, when you count the bodies in the morgue and find horribly disfigured burn victims in hospitals, you will know then what we are planning now.\" But as Scott Shane recently pointed out in the New York Times, with more than a little understatement: \"Mr. Mohammed, captured on March 1, 2003, was waterboarded 183 times that month. That striking number, which would average out to six waterboardings a day, suggests that interrogators did not try a traditional, rapport-building approach for long before escalating to their most extreme tool.\" And almost nobody who knows anything about the Pearl case (see, for instance, Lawrence Wright and Peter Bergen) actually thinks KSM -- who confessed to the killing after being tortured -- had anything to do with it. Torture after all is really only good at one thing: eliciting false confessions. That we got plenty of from KSM. But his \"soon you will know\" boast was all bluster -- sort of like Saddam Hussein's claim to have nuclear capability. (\"Responding to bluster with war crimes\" -- there's a great motto for an administration.) Nothing KSM said came close to thwarting any imminent attack. One hundred and eighty three waterboarding sessions later, the \"bodies in the morgue\" and the \"horribly disfigured burn victims\" were still only a fantasy of the torturers -- and certain opinion columnists. Krauthammer: \"The other problem is one of timing. The good cop routine can take weeks or months or years. We didn't have that luxury in the aftermath of 9/11 when waterboarding, for example, was in use.\" But his compacting of the timeline is shameless revisionism. Top officials of the Bush administration -- and yes, I'm looking at you, Mr. Cheney -- panicked. And they continued to panic after any excuse for panic was long over. Waterboarding was conducted over a period of several months, long after 9/11 -- from August 2002 at least through March 2003. Other torture tactics were widely employed in Iraq, Afghanistan and Guantanamo over a period of years. Legal memos defending various forms of torture were being commissioned by the White House until virtually the end of the Bush administration. And in his final defense, Krauthammer argues that the lack of objections at the time from Nancy Pelosi and other members of Congress who were briefed on interrogation policies is proof that \"at the time the information was important enough, the danger great enough and our blindness about the enemy's plans severe enough to justify an exception to the moral injunction against torture.\" Precisely what members of Congress were told and how they responded should absolutely be a part of any thorough official investigation into the abuses of the Bush years. The enablers must be exposed as surely as the complicit. And members of Congress who knew what was happening and remained silent must be held to public account for their moral cowardice. But their failure to speak out does not change the fundamental moral equation. If the United States is to live up to its core values, if it is to once again be a beacon of human rights to the world and a champion of human dignity, then when it comes to torture -- to impermissible evil, as Krauthammer himself puts it -- there can be no asterisks. By Dan Froomkin", 
        "threadID": "672198221_1490052222001", 
        "time": "2009-05-01 12:11:00", 
        "title": "Torture Issues Illuminated", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "What a bunch of crap...somebody is writing for the funny books. All members who voted for us to go into Iraq are guilty, regardless of party. We went into Iraq base upon bad Intell pass on by the Clinton admin. Even John Kerry who sat on the intell committee said many times IRAQ HAS WMD's..period..now thats the truth and not one liberal or democrat can deny that, you can try. Or maybe have Berger go in a steal the info like he already did for Clinton. As far as Torture, lets say you or you or you, take my son, daughter, grand children and torture them, I can assure you as I stand here now, if I would ever catch up to the one who did it, they would know the feeling right back and twice over. Just shooting them is way to easy, they must feel the pain they put MY love ones through. I will not stand there and turn the other cheek, I promise you that with my very being. That person will get theirs if I have anything to do with it. Torture is a very big word, what does it really stand for? Seeking info about your enemy's? or revenge about the slaughter of one's family? When did it start? and why? The above? Which one came first? Info or revenge? When can it be deem right? Info or Revenge? and don't tell never, for if it happen to a member of your family, then the gloves are off and you know it, maybe you have to torture someone to get the info about the person you want revenge on. It goes on and on..And I truley believe that the us, the United States not torturing anyone will end torture world wide. Man is Man and as long as we are on this earth, there is ONE thing for certain and thats WAR!!! And with War, comes all the horrors of it. Just because we don't or stop, means another will follow suit... Only the strong make it, the weak and meek go by the way side and crower before their masters in hopes of living another day.", 
        "intTime": 20090501, 
        "postID": 2, 
        "quote": "", 
        "reply": "What a bunch of crap...somebody is writing for the funny books. All members who voted for us to go into Iraq are guilty, regardless of party. We went into Iraq base upon bad Intell pass on by the Clinton admin. Even John Kerry who sat on the intell committee said many times IRAQ HAS WMD's..period..now thats the truth and not one liberal or democrat can deny that, you can try. Or maybe have Berger go in a steal the info like he already did for Clinton. As far as Torture, lets say you or you or you, take my son, daughter, grand children and torture them, I can assure you as I stand here now, if I would ever catch up to the one who did it, they would know the feeling right back and twice over. Just shooting them is way to easy, they must feel the pain they put MY love ones through. I will not stand there and turn the other cheek, I promise you that with my very being. That person will get theirs if I have anything to do with it. Torture is a very big word, what does it really stand for? Seeking info about your enemy's? or revenge about the slaughter of one's family? When did it start? and why? The above? Which one came first? Info or revenge? When can it be deem right? Info or Revenge? and don't tell never, for if it happen to a member of your family, then the gloves are off and you know it, maybe you have to torture someone to get the info about the person you want revenge on. It goes on and on..And I truley believe that the us, the United States not torturing anyone will end torture world wide. Man is Man and as long as we are on this earth, there is ONE thing for certain and thats WAR!!! And with War, comes all the horrors of it. Just because we don't or stop, means another will follow suit... Only the strong make it, the weak and meek go by the way side and crower before their masters in hopes of living another day.", 
        "threadID": "672198221_1490052222001", 
        "time": "2009-05-01 13:44:00", 
        "title": "Torture Issues Illuminated", 
        "userID": "dman1948"
    }, 
    {
        "content": "I'm not debating torture any more. I want the courts to decide it. I may just file my own law suit against certain past USG officials to get the truth, and see justice brought, like some have done with certain birth certs proofs. Anyone care to join me?", 
        "intTime": 20090502, 
        "postID": 3, 
        "quote": "", 
        "reply": "I'm not debating torture any more. I want the courts to decide it. I may just file my own law suit against certain past USG officials to get the truth, and see justice brought, like some have done with certain birth certs proofs. Anyone care to join me?", 
        "threadID": "672198221_1490052222001", 
        "time": "2009-05-02 14:50:00", 
        "title": "Torture Issues Illuminated", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "Charles Krauthammer is correct!", 
        "intTime": 20090502, 
        "postID": 4, 
        "quote": "", 
        "reply": "Charles Krauthammer is correct!", 
        "threadID": "672198221_1490052222001", 
        "time": "2009-05-02 17:04:00", 
        "title": "Torture Issues Illuminated", 
        "userID": "EAG154"
    }, 
    {
        "content": "quote: Originally posted by EAG154: Charles Krauthammer is correct! agreed why must folks drunk on whiskey continue to post dozens of anti-interrogation threads every single day? there are nearly 20 threads in hot topics on this. is another fuqqin thread going to stop the practice of protecting the USA from thugs who prefer to cut off heads than negotiate? Im still waiting to see what the fools and pansies would do if it was their wife or their kid in danger and they had to make the decision. I guaran-fuqqin-tee they wouldnt be saying \"oh pretty please will you tell me\" to the ******* that knows. Nobody who has done it enjoys having to extract information from scumbag terrorists but someone has to step up to the plate and protect American citizens and soldiers from harm and as we see its a thankless and sobering job that those who have actually done it prefer to keep to themselves. They dont go around writing op ed articles or books about it. They sure as hell dont want to be famous for it because its already bad enough to have to live with doing what had to be done to protect your brother or sister at arms or the American citizens you swore to protect and serve. Do you honestly think AQ gives a flying fuq whether we do or dont torture(and we dont)? When is the last time an American cut off a reporter's head or anyone else's for that matter? When is the last time an American has done anything remotely like what that fool in UAE did? WHen is the last time an AMerican mutilated a young girl's genitalia or burned down their school because their law allows womwen to be treated no better than cattle? The USA is far, far morally superior to the enemies being fought and NOTHING done in the past 8 years comes even remotely close to what is done to people in A-stan or P-stan daily who follow a twisted and brutal version of Islamic law. Some of you wont realize there is a war against Islamic extremists until your family's heads are hanging from a bridge. You may not think we are at war with them but I guarantee they havent forgot a damn thing and they ARE AT WAR with us whether you are too blind to realize it or not.", 
        "intTime": 20090502, 
        "postID": 5, 
        "quote": "Originally posted by EAG154: Charles Krauthammer is correct!", 
        "reply": " agreed why must folks drunk on whiskey continue to post dozens of anti-interrogation threads every single day? there are nearly 20 threads in hot topics on this. is another fuqqin thread going to stop the practice of protecting the USA from thugs who prefer to cut off heads than negotiate? Im still waiting to see what the fools and pansies would do if it was their wife or their kid in danger and they had to make the decision. I guaran-fuqqin-tee they wouldnt be saying \"oh pretty please will you tell me\" to the ******* that knows. Nobody who has done it enjoys having to extract information from scumbag terrorists but someone has to step up to the plate and protect American citizens and soldiers from harm and as we see its a thankless and sobering job that those who have actually done it prefer to keep to themselves. They dont go around writing op ed articles or books about it. They sure as hell dont want to be famous for it because its already bad enough to have to live with doing what had to be done to protect your brother or sister at arms or the American citizens you swore to protect and serve. Do you honestly think AQ gives a flying fuq whether we do or dont torture(and we dont)? When is the last time an American cut off a reporter's head or anyone else's for that matter? When is the last time an American has done anything remotely like what that fool in UAE did? WHen is the last time an AMerican mutilated a young girl's genitalia or burned down their school because their law allows womwen to be treated no better than cattle? The USA is far, far morally superior to the enemies being fought and NOTHING done in the past 8 years comes even remotely close to what is done to people in A-stan or P-stan daily who follow a twisted and brutal version of Islamic law. Some of you wont realize there is a war against Islamic extremists until your family's heads are hanging from a bridge. You may not think we are at war with them but I guarantee they havent forgot a damn thing and they ARE AT WAR with us whether you are too blind to realize it or not.", 
        "threadID": "672198221_1490052222001", 
        "time": "2009-05-02 20:18:00", 
        "title": "Torture Issues Illuminated", 
        "userID": "FlankerFlyer"
    }, 
    {
        "content": "\"It has been clear for a long time that under the Bush Administration torture was widely accepted and used. While this fact is troubling in itself, what is really disappointing is that some people seem determined to defend it. Whether by partisan hackery, or just sheer ignorance some people refuse to admit the plain and simple fact. Enlightened peoples simply do not torture other people. No matter what anyone's arguments on history are the undisputable fact is that America was the first country founded upon the liberal ideals of the Enlightenment. One of those ideals is that someone no matter their crime and no matter how much you disagreed or hated them should not have to be submitted to torture. What I find the most odd is that it seems that all of those who long have sought to lecture Progressives on their patriotism and on \"American values\" are the very people who so vehemently defend this practice. And why?? What is there to defend about capturing \"enemy combatants\" and submitting them to torture?? The simple truth of the matter is that torture simply does not work. It puts our troops at risk of retalitory torture, it helps al-Queda and other terrorist groups recruit, and it diminishes our moral standing in the world. How can we use diplomacy against regimes like N. Korea and China that torture to get them to give their citizens more human rights when we ourselves torture?? Just listen to former FBI interrogator Jack Cloonan speaking on the subject of torture: But what of the argument that torture helped \"keep us safe\" by preventing another terrorist attack?? I think it is important to note right of the bat that this argument is being forwarded by folks who failed our country miserably in preventing the first 9-11. It is cover for their own failures after recieving a national security memo entitled \"Bin-Laden Determined to Strike in the United States\". Folks that did nothing to prevent this attack and a President that felt it was more important to vacation than try to get to the bottom of the plot outlined in that memo are the same ones that used and defend torture. The fact is that torture did not work in it's most famous circumstance: Democrats say the Bush administration's interrogations policies hurt the nation more than helped it, and they accuse Republicans of twisting the debate. They note, for instance, that former Vice President Dick Cheney and others say suspected al-Qaida terrorist Abu Zubaydah underwent harsh interrogation, including waterboarding, and yielded vital information. But records show that some of his most important information, such as the identity of would-be bomber Jose Padilla, came before the harsh treatments were used. ... The main argument I have heard for the use of torture is that terrorists behead people, and torture too. That reminds me of when all our mothers would ask us, [b]\"Well, if so and so jumped off a bridge, would you do it too??\" Is the fact that some of the most un-Enlightened people that we consider our sworn enemies are doing something really a basis for us to do it ourselves?? Do we aspire to make our country more like Saudi Arabia, Iran and al-Queda?? I think it is pretty sad to think that some Americans would really like to make us more like terrorists. And what about those who are Christian that have no problem with our country torturing?? In the Christian belief Jesus Christ was tortured and murdered and died for our sins so that we may have eternal life. What would he think about those who aspire to follow him torturing others?? I think it is very likely a relief to him he has not a grave to roll over in. I think it all boils down to whether Americans want us to be an Enlightened, rule of law society or not. Enlightened peoples simply do not torture their fellow man. Christian peoples don't either. Torture runs against all the principles our country was founded on, and indeed runs against all the principles Christianity was founded on.\" .http://www.hillbillyreport.org/diary/72/torture-debate-quite-troubling, I can't say it better than that. Walt", 
        "intTime": 20090502, 
        "postID": 6, 
        "quote": "", 
        "reply": "\"It has been clear for a long time that under the Bush Administration torture was widely accepted and used. While this fact is troubling in itself, what is really disappointing is that some people seem determined to defend it. Whether by partisan hackery, or just sheer ignorance some people refuse to admit the plain and simple fact. Enlightened peoples simply do not torture other people. No matter what anyone's arguments on history are the undisputable fact is that America was the first country founded upon the liberal ideals of the Enlightenment. One of those ideals is that someone no matter their crime and no matter how much you disagreed or hated them should not have to be submitted to torture. What I find the most odd is that it seems that all of those who long have sought to lecture Progressives on their patriotism and on \"American values\" are the very people who so vehemently defend this practice. And why?? What is there to defend about capturing \"enemy combatants\" and submitting them to torture?? The simple truth of the matter is that torture simply does not work. It puts our troops at risk of retalitory torture, it helps al-Queda and other terrorist groups recruit, and it diminishes our moral standing in the world. How can we use diplomacy against regimes like N. Korea and China that torture to get them to give their citizens more human rights when we ourselves torture?? Just listen to former FBI interrogator Jack Cloonan speaking on the subject of torture: But what of the argument that torture helped \"keep us safe\" by preventing another terrorist attack?? I think it is important to note right of the bat that this argument is being forwarded by folks who failed our country miserably in preventing the first 9-11. It is cover for their own failures after recieving a national security memo entitled \"Bin-Laden Determined to Strike in the United States\". Folks that did nothing to prevent this attack and a President that felt it was more important to vacation than try to get to the bottom of the plot outlined in that memo are the same ones that used and defend torture. The fact is that torture did not work in it's most famous circumstance: Democrats say the Bush administration's interrogations policies hurt the nation more than helped it, and they accuse Republicans of twisting the debate. They note, for instance, that former Vice President Dick Cheney and others say suspected al-Qaida terrorist Abu Zubaydah underwent harsh interrogation, including waterboarding, and yielded vital information. But records show that some of his most important information, such as the identity of would-be bomber Jose Padilla, came before the harsh treatments were used. ... The main argument I have heard for the use of torture is that terrorists behead people, and torture too. That reminds me of when all our mothers would ask us, [b]\"Well, if so and so jumped off a bridge, would you do it too??\" Is the fact that some of the most un-Enlightened people that we consider our sworn enemies are doing something really a basis for us to do it ourselves?? Do we aspire to make our country more like Saudi Arabia, Iran and al-Queda?? I think it is pretty sad to think that some Americans would really like to make us more like terrorists. And what about those who are Christian that have no problem with our country torturing?? In the Christian belief Jesus Christ was tortured and murdered and died for our sins so that we may have eternal life. What would he think about those who aspire to follow him torturing others?? I think it is very likely a relief to him he has not a grave to roll over in. I think it all boils down to whether Americans want us to be an Enlightened, rule of law society or not. Enlightened peoples simply do not torture their fellow man. Christian peoples don't either. Torture runs against all the principles our country was founded on, and indeed runs against all the principles Christianity was founded on.\" .http://www.hillbillyreport.org/diary/72/torture-debate-quite-troubling, I can't say it better than that. Walt", 
        "threadID": "672198221_1490052222001", 
        "time": "2009-05-02 23:54:00", 
        "title": "Torture Issues Illuminated", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "quote: Originally posted by WhiskeyPapa: Actually, no. The ticking time bomb scenario only exists in two places: On TV and in the dark fantasies of power-crazed and morally deficient authoritarians. In real life, things are never that certain. And trained interrogators say that even in the most extreme circumstances, traditional methods are the most effective. I try to tell people this all the time, but since they've seen it on \"24\" which is apparently how things happen in real life, you can't convince them this doesn't happen.", 
        "intTime": 20090503, 
        "postID": 7, 
        "quote": "Originally posted by WhiskeyPapa: Actually, no. The ticking time bomb scenario only exists in two places: On TV and in the dark fantasies of power-crazed and morally deficient authoritarians. In real life, things are never that certain. And trained interrogators say that even in the most extreme circumstances, traditional methods are the most effective.", 
        "reply": " I try to tell people this all the time, but since they've seen it on \"24\" which is apparently how things happen in real life, you can't convince them this doesn't happen.", 
        "threadID": "672198221_1490052222001", 
        "time": "2009-05-03 03:40:00", 
        "title": "Torture Issues Illuminated", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: It puts our troops at risk of retalitory torture, it helps al-Queda and other terrorist groups recruit, and it diminishes our moral standing in the world. In case you havent taken note of history I should remind you of how the Mujahadeen behaved in Afghanistan in the 80s, Beruit bombing, Pan Am Airliner hijacking and many other events all occurred BEFORE Bush came into office. AQ doesnt give a flying fuq about our moral standing. To them, we ARE ALL INFIDELS whether we are American, British, Russian, Israeli or simply dont follow their extreme form of Islam. quote: No matter what anyone's arguments on history are the undisputable fact is that America was the first country founded upon the liberal ideals of the Enlightenment. liberal ideas? Read up buddy, it was founded under Judeo-Christian values. I didnt read anywhere that they embraced liberal ideas like homosexuality, taxing the rich to death, abortions at 34 weeks or other liberal values. quote: I think it is important to note right of the bat that this argument is being forwarded by folks who failed our country miserably in preventing the first 9-11. Oh, you mean like Clinton who chose not to take out Bin Laden, not once but three times? The one who did nothing after the Cole bombing or the embassy bombings? The one who gutted the military and intelligence services? quote: The main argument I have heard for the use of torture is that terrorists behead people, and torture too. HOW MANY TIMES DOES IT TAKE FOR SOME OF YOU TO GET THE USA DOES NOT TORTURE quote: Enlightened peoples simply do not torture their fellow man. NAMBLA and unborn baby killers tell us THEY are enlightened. No thanks, you can keep that liberal version of enlightenment and I choose to defend the weakest in society from liberal oppression and genocide.", 
        "intTime": 20090503, 
        "postID": 8, 
        "quote": "It puts our troops at risk of retalitory torture, it helps al-Queda and other terrorist groups recruit, and it diminishes our moral standing in the world.", 
        "reply": " In case you havent taken note of history I should remind you of how the Mujahadeen behaved in Afghanistan in the 80s, Beruit bombing, Pan Am Airliner hijacking and many other events all occurred BEFORE Bush came into office. AQ doesnt give a flying fuq about our moral standing. To them, we ARE ALL INFIDELS whether we are American, British, Russian, Israeli or simply dont follow their extreme form of Islam. quote: No matter what anyone's arguments on history are the undisputable fact is that America was the first country founded upon the liberal ideals of the Enlightenment. liberal ideas? Read up buddy, it was founded under Judeo-Christian values. I didnt read anywhere that they embraced liberal ideas like homosexuality, taxing the rich to death, abortions at 34 weeks or other liberal values. quote: I think it is important to note right of the bat that this argument is being forwarded by folks who failed our country miserably in preventing the first 9-11. Oh, you mean like Clinton who chose not to take out Bin Laden, not once but three times? The one who did nothing after the Cole bombing or the embassy bombings? The one who gutted the military and intelligence services? quote: The main argument I have heard for the use of torture is that terrorists behead people, and torture too. HOW MANY TIMES DOES IT TAKE FOR SOME OF YOU TO GET THE USA DOES NOT TORTURE quote: Enlightened peoples simply do not torture their fellow man. NAMBLA and unborn baby killers tell us THEY are enlightened. No thanks, you can keep that liberal version of enlightenment and I choose to defend the weakest in society from liberal oppression and genocide.", 
        "threadID": "672198221_1490052222001", 
        "time": "2009-05-03 06:41:00", 
        "title": "Torture Issues Illuminated", 
        "userID": "FlankerFlyer"
    }, 
    {
        "content": "Obama hugging Castro and Chaves is pure torture, I think I've said this before!", 
        "intTime": 20090503, 
        "postID": 9, 
        "quote": "", 
        "reply": "Obama hugging Castro and Chaves is pure torture, I think I've said this before!", 
        "threadID": "672198221_1490052222001", 
        "time": "2009-05-03 08:25:00", 
        "title": "Torture Issues Illuminated", 
        "userID": "EAG154"
    }, 
    {
        "content": "So far to date there is no evidence that water boarding is torture", 
        "intTime": 20090503, 
        "postID": 10, 
        "quote": "", 
        "reply": "So far to date there is no evidence that water boarding is torture", 
        "threadID": "672198221_1490052222001", 
        "time": "2009-05-03 08:30:00", 
        "title": "Torture Issues Illuminated", 
        "userID": "EAG154"
    }, 
    {
        "content": "quote: Originally posted by FlankerFlyer: HOW MANY TIMES DOES IT TAKE FOR SOME OF YOU TO GET THE USA DOES NOT TORTURE Photographic and verbal evidence indicates otherwise.", 
        "intTime": 20090503, 
        "postID": 11, 
        "quote": "Originally posted by FlankerFlyer: HOW MANY TIMES DOES IT TAKE FOR SOME OF YOU TO GET THE USA DOES NOT TORTURE", 
        "reply": " Photographic and verbal evidence indicates otherwise.", 
        "threadID": "672198221_1490052222001", 
        "time": "2009-05-03 10:40:00", 
        "title": "Torture Issues Illuminated", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by FlankerFlyer: HOW MANY TIMES DOES IT TAKE FOR SOME OF YOU TO GET THE USA DOES NOT TORTURE Photographic and verbal evidence indicates otherwise. OMG!! you're right, I forgot about those photos of panties on the head and human pyramids Yeah, Im sure they would have prefered their head be cut off, thats far more humane These false \"torture\" threads are right up there with conspiracy theories. Im sure we took them up on space ships and anally probed them as well", 
        "intTime": 20090503, 
        "postID": 12, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by FlankerFlyer: HOW MANY TIMES DOES IT TAKE FOR SOME OF YOU TO GET THE USA DOES NOT TORTURE Photographic and verbal evidence indicates otherwise.", 
        "reply": " OMG!! you're right, I forgot about those photos of panties on the head and human pyramids Yeah, Im sure they would have prefered their head be cut off, thats far more humane These false \"torture\" threads are right up there with conspiracy theories. Im sure we took them up on space ships and anally probed them as well", 
        "threadID": "672198221_1490052222001", 
        "time": "2009-05-03 22:31:00", 
        "title": "Torture Issues Illuminated", 
        "userID": "FlankerFlyer"
    }, 
    {
        "content": "Very simple, water boarding = torture... Torture = war crime... Those that did it or authorized it = war criminal... Nothing more to see here, move along... Respectfully, SUNLINER81", 
        "intTime": 20090504, 
        "postID": 13, 
        "quote": "", 
        "reply": "Very simple, water boarding = torture... Torture = war crime... Those that did it or authorized it = war criminal... Nothing more to see here, move along... Respectfully, SUNLINER81", 
        "threadID": "672198221_1490052222001", 
        "time": "2009-05-04 00:37:00", 
        "title": "Torture Issues Illuminated", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by dman1948: What a bunch of crap...somebody is writing for the funny books. All members who voted for us to go into Iraq are guilty, regardless of party. We went into Iraq base upon bad Intell pass on by the Clinton admin. Even John Kerry who sat on the intell committee said many times IRAQ HAS WMD's..period..now thats the truth and not one liberal or democrat can deny that, you can try. Or maybe have Berger go in a steal the info like he already did for Clinton. As far as Torture, lets say you or you or you, take my son, daughter, grand children and torture them, I can assure you as I stand here now, if I would ever catch up to the one who did it, they would know the feeling right back and twice over. Just shooting them is way to easy, they must feel the pain they put MY love ones through. I will not stand there and turn the other cheek, I promise you that with my very being. That person will get theirs if I have anything to do with it. Torture is a very big word, what does it really stand for? Seeking info about your enemy's? or revenge about the slaughter of one's family? When did it start? and why? The above? Which one came first? Info or revenge? When can it be deem right? Info or Revenge? and don't tell never, for if it happen to a member of your family, then the gloves are off and you know it, maybe you have to torture someone to get the info about the person you want revenge on. It goes on and on..And I truley believe that the us, the United States not torturing anyone will end torture world wide. Man is Man and as long as we are on this earth, there is ONE thing for certain and thats WAR!!! And with War, comes all the horrors of it. Just because we don't or stop, means another will follow suit... Only the strong make it, the weak and meek go by the way side and crower before their masters in hopes of living another day.", 
        "intTime": 20090504, 
        "postID": 14, 
        "quote": "Originally posted by dman1948: What a bunch of crap...somebody is writing for the funny books. All members who voted for us to go into Iraq are guilty, regardless of party. We went into Iraq base upon bad Intell pass on by the Clinton admin. Even John Kerry who sat on the intell committee said many times IRAQ HAS WMD's..period..now thats the truth and not one liberal or democrat can deny that, you can try. Or maybe have Berger go in a steal the info like he already did for Clinton. As far as Torture, lets say you or you or you, take my son, daughter, grand children and torture them, I can assure you as I stand here now, if I would ever catch up to the one who did it, they would know the feeling right back and twice over. Just shooting them is way to easy, they must feel the pain they put MY love ones through. I will not stand there and turn the other cheek, I promise you that with my very being. That person will get theirs if I have anything to do with it. Torture is a very big word, what does it really stand for? Seeking info about your enemy's? or revenge about the slaughter of one's family? When did it start? and why? The above? Which one came first? Info or revenge? When can it be deem right? Info or Revenge? and don't tell never, for if it happen to a member of your family, then the gloves are off and you know it, maybe you have to torture someone to get the info about the person you want revenge on. It goes on and on..And I truley believe that the us, the United States not torturing anyone will end torture world wide. Man is Man and as long as we are on this earth, there is ONE thing for certain and thats WAR!!! And with War, comes all the horrors of it. Just because we don't or stop, means another will follow suit... Only the strong make it, the weak and meek go by the way side and crower before their masters in hopes of living another day.", 
        "reply": "", 
        "threadID": "672198221_1490052222001", 
        "time": "2009-05-04 12:28:00", 
        "title": "Torture Issues Illuminated", 
        "userID": "7129716"
    }, 
    {
        "content": "quote: Originally posted by EAG154: So far to date there is no evidence that water boarding is torture Here is the link you want: >http://www.vanityfair.com/politics/features/2008/08/hitchens200808< Walt", 
        "intTime": 20090504, 
        "postID": 15, 
        "quote": "Originally posted by EAG154: So far to date there is no evidence that water boarding is torture", 
        "reply": " Here is the link you want: >http://www.vanityfair.com/politics/features/2008/08/hitchens200808< Walt", 
        "threadID": "672198221_1490052222001", 
        "time": "2009-05-04 12:44:00", 
        "title": "Torture Issues Illuminated", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "I don't agree with torture and think anyone that is invloved be prosecuted. That said, this is In the News, not in the Opinion. So why are you posting an Opinion peice as a news article????? This thread should not be In the News. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090504, 
        "postID": 16, 
        "quote": "", 
        "reply": "I don't agree with torture and think anyone that is invloved be prosecuted. That said, this is In the News, not in the Opinion. So why are you posting an Opinion peice as a news article????? This thread should not be In the News. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_1490052222001", 
        "time": "2009-05-04 12:49:00", 
        "title": "Torture Issues Illuminated", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: I don't agree with torture and think anyone that is invloved be prosecuted. That said, this is In the News, not in the Opinion. So why are you posting an Opinion peice as a news article????? This thread should not be In the News. Krauthammer's Article was in the WashPost late last week. That's in the news. Walt", 
        "intTime": 20090504, 
        "postID": 17, 
        "quote": "Originally posted by L0A1: I don't agree with torture and think anyone that is invloved be prosecuted. That said, this is In the News, not in the Opinion. So why are you posting an Opinion peice as a news article????? This thread should not be In the News.", 
        "reply": " Krauthammer's Article was in the WashPost late last week. That's in the news. Walt", 
        "threadID": "672198221_1490052222001", 
        "time": "2009-05-04 13:09:00", 
        "title": "Torture Issues Illuminated", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: I'm not debating torture any more. I want the courts to decide it. I may just file my own law suit against certain past USG officials to get the truth, and see justice brought, like some have done with certain birth certs proofs. Anyone care to join me? Yeah, I'll bring charges against Barack Hussein Obama for giving \"aid and comfort to the enemy\". By releasing photos an documents relating to our National Security, he has done just that. Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989 MOD HAT ON Accusing the President of the United States of treason is not acceptable on this site. You are On Warning for 20 days. This message has been edited. Last edited by: stillkit, Tue 05 May 2009 08:15 AM", 
        "intTime": 20090504, 
        "postID": 18, 
        "quote": "Originally posted by crackerjacks61: I'm not debating torture any more. I want the courts to decide it. I may just file my own law suit against certain past USG officials to get the truth, and see justice brought, like some have done with certain birth certs proofs. Anyone care to join me?", 
        "reply": " Yeah, I'll bring charges against Barack Hussein Obama for giving \"aid and comfort to the enemy\". By releasing photos an documents relating to our National Security, he has done just that. Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989 MOD HAT ON Accusing the President of the United States of treason is not acceptable on this site. You are On Warning for 20 days. This message has been edited. Last edited by: stillkit, Tue 05 May 2009 08:15 AM", 
        "threadID": "672198221_1490052222001", 
        "time": "2009-05-04 13:15:00", 
        "title": "Torture Issues Illuminated", 
        "userID": "Proudformermarine"
    }, 
    {
        "content": "quote: Originally posted by Proudformermarine: quote: Originally posted by crackerjacks61: I'm not debating torture any more. I want the courts to decide it. I may just file my own law suit against certain past USG officials to get the truth, and see justice brought, like some have done with certain birth certs proofs. Anyone care to join me? Yeah, I'll bring charges against Barack Hussein Obama for giving \"aid and comfort to the enemy\". By releasing photos an documents relating to our National Security, he has done just that. Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989 Did you have a similar reaction when when Cheney had the name of a covert CIA agent leaked to Robert Novak? Walt", 
        "intTime": 20090504, 
        "postID": 19, 
        "quote": "Originally posted by Proudformermarine: quote: Originally posted by crackerjacks61: I'm not debating torture any more. I want the courts to decide it. I may just file my own law suit against certain past USG officials to get the truth, and see justice brought, like some have done with certain birth certs proofs. Anyone care to join me? Yeah, I'll bring charges against Barack Hussein Obama for giving \"aid and comfort to the enemy\". By releasing photos an documents relating to our National Security, he has done just that. Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989", 
        "reply": " Did you have a similar reaction when when Cheney had the name of a covert CIA agent leaked to Robert Novak? Walt", 
        "threadID": "672198221_1490052222001", 
        "time": "2009-05-04 13:25:00", 
        "title": "Torture Issues Illuminated", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "Krauthammer's Asterisks Charles Krauthammer, in his Washington Post opinion column this morning, tries to find loopholes for impermissible evil. \"Torture is an impermissible evil. Except under two circumstances,\" he writes. \"The first is the ticking time bomb. An innocent's life is at stake. The bad guy you have captured possesses information that could save this life. He refuses to divulge. In such a case, the choice is easy.\" Actually, no. The ticking time bomb scenario only exists in two places: On TV and in the dark fantasies of power-crazed and morally deficient authoritarians. In real life, things are never that certain. And trained interrogators say that even in the most extreme circumstances, traditional methods are the most effective. Krauthammer continues: \"Some people, however, believe you never torture. Ever. They are akin to conscientious objectors who will never fight in any war under any circumstances, and for whom we correctly show respect by exempting them from war duty. But we would never make one of them Centcom commander.\" Actually, no. They are normal people who share the post-World War II international consensus that \"recognition of the inherent dignity and of the equal and inalienable rights of all members of the human family is the foundation of freedom, justice and peace in the world.\" Indeed, the idea of putting someone without a healthy respect for human rights at Centcom is abhorrent -- unless of course you believe that human rights don't matter. Krauthamer: \"The second exception to the no-torture rule is the extraction of information from a high-value enemy in possession of high-value information likely to save lives. This case lacks the black-and-white clarity of the ticking time bomb scenario. We know less about the length of the fuse or the nature of the next attack. But we do know the danger is great.\" This of course is a blatant post-facto attempt at rationalizing the (inevitable) misdiagnosis of the ticking time bomb scenario. Now all of a sudden the standards are lower. Krauthammer is advocating fishing expeditions -- with a waterboard. \"Under those circumstances, you do what you have to do.\" Krauthammer's core argument then is that the ends justify the means. He quotes two former CIA officials, both deeply invested in covering their asses, who unsurprisingly insist that torture worked. But none of the claims they or others in the complicit chain of command have made held up under even modest public scrutiny. And he mocks the idea put forth by President Obama on Wednesday -- and supported by people who actually have experience in interrogation, rather than in watching TV and fantasizing about being Jack Bauer -- that traditional interrogation techniques are extremely effective. For instance, he writes: \"KSM, the mastermind of 9/11 who knew more about more plots than anyone else, did not seem very inclined to respond to polite inquiries about future plans. The man who boasted of personally beheading Daniel Pearl with a butcher knife answered questions about plots with 'soon you will know' -- meaning, when you count the bodies in the morgue and find horribly disfigured burn victims in hospitals, you will know then what we are planning now.\" But as Scott Shane recently pointed out in the New York Times, with more than a little understatement: \"Mr. Mohammed, captured on March 1, 2003, was waterboarded 183 times that month. That striking number, which would average out to six waterboardings a day, suggests that interrogators did not try a traditional, rapport-building approach for long before escalating to their most extreme tool.\" And almost nobody who knows anything about the Pearl case (see, for instance, Lawrence Wright and Peter Bergen) actually thinks KSM -- who confessed to the killing after being tortured -- had anything to do with it. Torture after all is really only good at one thing: eliciting false confessions. That we got plenty of from KSM. But his \"soon you will know\" boast was all bluster -- sort of like Saddam Hussein's claim to have nuclear capability. (\"Responding to bluster with war crimes\" -- there's a great motto for an administration.) Nothing KSM said came close to thwarting any imminent attack. One hundred and eighty three waterboarding sessions later, the \"bodies in the morgue\" and the \"horribly disfigured burn victims\" were still only a fantasy of the torturers -- and certain opinion columnists. Krauthammer: \"The other problem is one of timing. The good cop routine can take weeks or months or years. We didn't have that luxury in the aftermath of 9/11 when waterboarding, for example, was in use.\" But his compacting of the timeline is shameless revisionism. Top officials of the Bush administration -- and yes, I'm looking at you, Mr. Cheney -- panicked. And they continued to panic after any excuse for panic was long over. Waterboarding was conducted over a period of several months, long after 9/11 -- from August 2002 at least through March 2003. Other torture tactics were widely employed in Iraq, Afghanistan and Guantanamo over a period of years. Legal memos defending various forms of torture were being commissioned by the White House until virtually the end of the Bush administration. And in his final defense, Krauthammer argues that the lack of objections at the time from Nancy Pelosi and other members of Congress who were briefed on interrogation policies is proof that \"at the time the information was important enough, the danger great enough and our blindness about the enemy's plans severe enough to justify an exception to the moral injunction against torture.\" Precisely what members of Congress were told and how they responded should absolutely be a part of any thorough official investigation into the abuses of the Bush years. The enablers must be exposed as surely as the complicit. And members of Congress who knew what was happening and remained silent must be held to public account for their moral cowardice. But their failure to speak out does not change the fundamental moral equation. If the United States is to live up to its core values, if it is to once again be a beacon of human rights to the world and a champion of human dignity, then when it comes to torture -- to impermissible evil, as Krauthammer himself puts it -- there can be no asterisks. By Dan Froomkin", 
        "intTime": 20090501, 
        "postID": 20, 
        "quote": "", 
        "reply": "Krauthammer's Asterisks Charles Krauthammer, in his Washington Post opinion column this morning, tries to find loopholes for impermissible evil. \"Torture is an impermissible evil. Except under two circumstances,\" he writes. \"The first is the ticking time bomb. An innocent's life is at stake. The bad guy you have captured possesses information that could save this life. He refuses to divulge. In such a case, the choice is easy.\" Actually, no. The ticking time bomb scenario only exists in two places: On TV and in the dark fantasies of power-crazed and morally deficient authoritarians. In real life, things are never that certain. And trained interrogators say that even in the most extreme circumstances, traditional methods are the most effective. Krauthammer continues: \"Some people, however, believe you never torture. Ever. They are akin to conscientious objectors who will never fight in any war under any circumstances, and for whom we correctly show respect by exempting them from war duty. But we would never make one of them Centcom commander.\" Actually, no. They are normal people who share the post-World War II international consensus that \"recognition of the inherent dignity and of the equal and inalienable rights of all members of the human family is the foundation of freedom, justice and peace in the world.\" Indeed, the idea of putting someone without a healthy respect for human rights at Centcom is abhorrent -- unless of course you believe that human rights don't matter. Krauthamer: \"The second exception to the no-torture rule is the extraction of information from a high-value enemy in possession of high-value information likely to save lives. This case lacks the black-and-white clarity of the ticking time bomb scenario. We know less about the length of the fuse or the nature of the next attack. But we do know the danger is great.\" This of course is a blatant post-facto attempt at rationalizing the (inevitable) misdiagnosis of the ticking time bomb scenario. Now all of a sudden the standards are lower. Krauthammer is advocating fishing expeditions -- with a waterboard. \"Under those circumstances, you do what you have to do.\" Krauthammer's core argument then is that the ends justify the means. He quotes two former CIA officials, both deeply invested in covering their asses, who unsurprisingly insist that torture worked. But none of the claims they or others in the complicit chain of command have made held up under even modest public scrutiny. And he mocks the idea put forth by President Obama on Wednesday -- and supported by people who actually have experience in interrogation, rather than in watching TV and fantasizing about being Jack Bauer -- that traditional interrogation techniques are extremely effective. For instance, he writes: \"KSM, the mastermind of 9/11 who knew more about more plots than anyone else, did not seem very inclined to respond to polite inquiries about future plans. The man who boasted of personally beheading Daniel Pearl with a butcher knife answered questions about plots with 'soon you will know' -- meaning, when you count the bodies in the morgue and find horribly disfigured burn victims in hospitals, you will know then what we are planning now.\" But as Scott Shane recently pointed out in the New York Times, with more than a little understatement: \"Mr. Mohammed, captured on March 1, 2003, was waterboarded 183 times that month. That striking number, which would average out to six waterboardings a day, suggests that interrogators did not try a traditional, rapport-building approach for long before escalating to their most extreme tool.\" And almost nobody who knows anything about the Pearl case (see, for instance, Lawrence Wright and Peter Bergen) actually thinks KSM -- who confessed to the killing after being tortured -- had anything to do with it. Torture after all is really only good at one thing: eliciting false confessions. That we got plenty of from KSM. But his \"soon you will know\" boast was all bluster -- sort of like Saddam Hussein's claim to have nuclear capability. (\"Responding to bluster with war crimes\" -- there's a great motto for an administration.) Nothing KSM said came close to thwarting any imminent attack. One hundred and eighty three waterboarding sessions later, the \"bodies in the morgue\" and the \"horribly disfigured burn victims\" were still only a fantasy of the torturers -- and certain opinion columnists. Krauthammer: \"The other problem is one of timing. The good cop routine can take weeks or months or years. We didn't have that luxury in the aftermath of 9/11 when waterboarding, for example, was in use.\" But his compacting of the timeline is shameless revisionism. Top officials of the Bush administration -- and yes, I'm looking at you, Mr. Cheney -- panicked. And they continued to panic after any excuse for panic was long over. Waterboarding was conducted over a period of several months, long after 9/11 -- from August 2002 at least through March 2003. Other torture tactics were widely employed in Iraq, Afghanistan and Guantanamo over a period of years. Legal memos defending various forms of torture were being commissioned by the White House until virtually the end of the Bush administration. And in his final defense, Krauthammer argues that the lack of objections at the time from Nancy Pelosi and other members of Congress who were briefed on interrogation policies is proof that \"at the time the information was important enough, the danger great enough and our blindness about the enemy's plans severe enough to justify an exception to the moral injunction against torture.\" Precisely what members of Congress were told and how they responded should absolutely be a part of any thorough official investigation into the abuses of the Bush years. The enablers must be exposed as surely as the complicit. And members of Congress who knew what was happening and remained silent must be held to public account for their moral cowardice. But their failure to speak out does not change the fundamental moral equation. If the United States is to live up to its core values, if it is to once again be a beacon of human rights to the world and a champion of human dignity, then when it comes to torture -- to impermissible evil, as Krauthammer himself puts it -- there can be no asterisks. By Dan Froomkin", 
        "threadID": "672198221_1490052222001", 
        "time": "2009-05-01 12:11:00", 
        "title": "Torture Issues Illuminated", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "What a bunch of crap...somebody is writing for the funny books. All members who voted for us to go into Iraq are guilty, regardless of party. We went into Iraq base upon bad Intell pass on by the Clinton admin. Even John Kerry who sat on the intell committee said many times IRAQ HAS WMD's..period..now thats the truth and not one liberal or democrat can deny that, you can try. Or maybe have Berger go in a steal the info like he already did for Clinton. As far as Torture, lets say you or you or you, take my son, daughter, grand children and torture them, I can assure you as I stand here now, if I would ever catch up to the one who did it, they would know the feeling right back and twice over. Just shooting them is way to easy, they must feel the pain they put MY love ones through. I will not stand there and turn the other cheek, I promise you that with my very being. That person will get theirs if I have anything to do with it. Torture is a very big word, what does it really stand for? Seeking info about your enemy's? or revenge about the slaughter of one's family? When did it start? and why? The above? Which one came first? Info or revenge? When can it be deem right? Info or Revenge? and don't tell never, for if it happen to a member of your family, then the gloves are off and you know it, maybe you have to torture someone to get the info about the person you want revenge on. It goes on and on..And I truley believe that the us, the United States not torturing anyone will end torture world wide. Man is Man and as long as we are on this earth, there is ONE thing for certain and thats WAR!!! And with War, comes all the horrors of it. Just because we don't or stop, means another will follow suit... Only the strong make it, the weak and meek go by the way side and crower before their masters in hopes of living another day.", 
        "intTime": 20090501, 
        "postID": 21, 
        "quote": "", 
        "reply": "What a bunch of crap...somebody is writing for the funny books. All members who voted for us to go into Iraq are guilty, regardless of party. We went into Iraq base upon bad Intell pass on by the Clinton admin. Even John Kerry who sat on the intell committee said many times IRAQ HAS WMD's..period..now thats the truth and not one liberal or democrat can deny that, you can try. Or maybe have Berger go in a steal the info like he already did for Clinton. As far as Torture, lets say you or you or you, take my son, daughter, grand children and torture them, I can assure you as I stand here now, if I would ever catch up to the one who did it, they would know the feeling right back and twice over. Just shooting them is way to easy, they must feel the pain they put MY love ones through. I will not stand there and turn the other cheek, I promise you that with my very being. That person will get theirs if I have anything to do with it. Torture is a very big word, what does it really stand for? Seeking info about your enemy's? or revenge about the slaughter of one's family? When did it start? and why? The above? Which one came first? Info or revenge? When can it be deem right? Info or Revenge? and don't tell never, for if it happen to a member of your family, then the gloves are off and you know it, maybe you have to torture someone to get the info about the person you want revenge on. It goes on and on..And I truley believe that the us, the United States not torturing anyone will end torture world wide. Man is Man and as long as we are on this earth, there is ONE thing for certain and thats WAR!!! And with War, comes all the horrors of it. Just because we don't or stop, means another will follow suit... Only the strong make it, the weak and meek go by the way side and crower before their masters in hopes of living another day.", 
        "threadID": "672198221_1490052222001", 
        "time": "2009-05-01 13:44:00", 
        "title": "Torture Issues Illuminated", 
        "userID": "dman1948"
    }, 
    {
        "content": "I'm not debating torture any more. I want the courts to decide it. I may just file my own law suit against certain past USG officials to get the truth, and see justice brought, like some have done with certain birth certs proofs. Anyone care to join me?", 
        "intTime": 20090502, 
        "postID": 22, 
        "quote": "", 
        "reply": "I'm not debating torture any more. I want the courts to decide it. I may just file my own law suit against certain past USG officials to get the truth, and see justice brought, like some have done with certain birth certs proofs. Anyone care to join me?", 
        "threadID": "672198221_1490052222001", 
        "time": "2009-05-02 14:50:00", 
        "title": "Torture Issues Illuminated", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "Charles Krauthammer is correct!", 
        "intTime": 20090502, 
        "postID": 23, 
        "quote": "", 
        "reply": "Charles Krauthammer is correct!", 
        "threadID": "672198221_1490052222001", 
        "time": "2009-05-02 17:04:00", 
        "title": "Torture Issues Illuminated", 
        "userID": "EAG154"
    }, 
    {
        "content": "quote: Originally posted by EAG154: Charles Krauthammer is correct! agreed why must folks drunk on whiskey continue to post dozens of anti-interrogation threads every single day? there are nearly 20 threads in hot topics on this. is another fuqqin thread going to stop the practice of protecting the USA from thugs who prefer to cut off heads than negotiate? Im still waiting to see what the fools and pansies would do if it was their wife or their kid in danger and they had to make the decision. I guaran-fuqqin-tee they wouldnt be saying \"oh pretty please will you tell me\" to the ******* that knows. Nobody who has done it enjoys having to extract information from scumbag terrorists but someone has to step up to the plate and protect American citizens and soldiers from harm and as we see its a thankless and sobering job that those who have actually done it prefer to keep to themselves. They dont go around writing op ed articles or books about it. They sure as hell dont want to be famous for it because its already bad enough to have to live with doing what had to be done to protect your brother or sister at arms or the American citizens you swore to protect and serve. Do you honestly think AQ gives a flying fuq whether we do or dont torture(and we dont)? When is the last time an American cut off a reporter's head or anyone else's for that matter? When is the last time an American has done anything remotely like what that fool in UAE did? WHen is the last time an AMerican mutilated a young girl's genitalia or burned down their school because their law allows womwen to be treated no better than cattle? The USA is far, far morally superior to the enemies being fought and NOTHING done in the past 8 years comes even remotely close to what is done to people in A-stan or P-stan daily who follow a twisted and brutal version of Islamic law. Some of you wont realize there is a war against Islamic extremists until your family's heads are hanging from a bridge. You may not think we are at war with them but I guarantee they havent forgot a damn thing and they ARE AT WAR with us whether you are too blind to realize it or not.", 
        "intTime": 20090502, 
        "postID": 24, 
        "quote": "Originally posted by EAG154: Charles Krauthammer is correct!", 
        "reply": " agreed why must folks drunk on whiskey continue to post dozens of anti-interrogation threads every single day? there are nearly 20 threads in hot topics on this. is another fuqqin thread going to stop the practice of protecting the USA from thugs who prefer to cut off heads than negotiate? Im still waiting to see what the fools and pansies would do if it was their wife or their kid in danger and they had to make the decision. I guaran-fuqqin-tee they wouldnt be saying \"oh pretty please will you tell me\" to the ******* that knows. Nobody who has done it enjoys having to extract information from scumbag terrorists but someone has to step up to the plate and protect American citizens and soldiers from harm and as we see its a thankless and sobering job that those who have actually done it prefer to keep to themselves. They dont go around writing op ed articles or books about it. They sure as hell dont want to be famous for it because its already bad enough to have to live with doing what had to be done to protect your brother or sister at arms or the American citizens you swore to protect and serve. Do you honestly think AQ gives a flying fuq whether we do or dont torture(and we dont)? When is the last time an American cut off a reporter's head or anyone else's for that matter? When is the last time an American has done anything remotely like what that fool in UAE did? WHen is the last time an AMerican mutilated a young girl's genitalia or burned down their school because their law allows womwen to be treated no better than cattle? The USA is far, far morally superior to the enemies being fought and NOTHING done in the past 8 years comes even remotely close to what is done to people in A-stan or P-stan daily who follow a twisted and brutal version of Islamic law. Some of you wont realize there is a war against Islamic extremists until your family's heads are hanging from a bridge. You may not think we are at war with them but I guarantee they havent forgot a damn thing and they ARE AT WAR with us whether you are too blind to realize it or not.", 
        "threadID": "672198221_1490052222001", 
        "time": "2009-05-02 20:18:00", 
        "title": "Torture Issues Illuminated", 
        "userID": "FlankerFlyer"
    }, 
    {
        "content": "\"It has been clear for a long time that under the Bush Administration torture was widely accepted and used. While this fact is troubling in itself, what is really disappointing is that some people seem determined to defend it. Whether by partisan hackery, or just sheer ignorance some people refuse to admit the plain and simple fact. Enlightened peoples simply do not torture other people. No matter what anyone's arguments on history are the undisputable fact is that America was the first country founded upon the liberal ideals of the Enlightenment. One of those ideals is that someone no matter their crime and no matter how much you disagreed or hated them should not have to be submitted to torture. What I find the most odd is that it seems that all of those who long have sought to lecture Progressives on their patriotism and on \"American values\" are the very people who so vehemently defend this practice. And why?? What is there to defend about capturing \"enemy combatants\" and submitting them to torture?? The simple truth of the matter is that torture simply does not work. It puts our troops at risk of retalitory torture, it helps al-Queda and other terrorist groups recruit, and it diminishes our moral standing in the world. How can we use diplomacy against regimes like N. Korea and China that torture to get them to give their citizens more human rights when we ourselves torture?? Just listen to former FBI interrogator Jack Cloonan speaking on the subject of torture: But what of the argument that torture helped \"keep us safe\" by preventing another terrorist attack?? I think it is important to note right of the bat that this argument is being forwarded by folks who failed our country miserably in preventing the first 9-11. It is cover for their own failures after recieving a national security memo entitled \"Bin-Laden Determined to Strike in the United States\". Folks that did nothing to prevent this attack and a President that felt it was more important to vacation than try to get to the bottom of the plot outlined in that memo are the same ones that used and defend torture. The fact is that torture did not work in it's most famous circumstance: Democrats say the Bush administration's interrogations policies hurt the nation more than helped it, and they accuse Republicans of twisting the debate. They note, for instance, that former Vice President Dick Cheney and others say suspected al-Qaida terrorist Abu Zubaydah underwent harsh interrogation, including waterboarding, and yielded vital information. But records show that some of his most important information, such as the identity of would-be bomber Jose Padilla, came before the harsh treatments were used. ... The main argument I have heard for the use of torture is that terrorists behead people, and torture too. That reminds me of when all our mothers would ask us, [b]\"Well, if so and so jumped off a bridge, would you do it too??\" Is the fact that some of the most un-Enlightened people that we consider our sworn enemies are doing something really a basis for us to do it ourselves?? Do we aspire to make our country more like Saudi Arabia, Iran and al-Queda?? I think it is pretty sad to think that some Americans would really like to make us more like terrorists. And what about those who are Christian that have no problem with our country torturing?? In the Christian belief Jesus Christ was tortured and murdered and died for our sins so that we may have eternal life. What would he think about those who aspire to follow him torturing others?? I think it is very likely a relief to him he has not a grave to roll over in. I think it all boils down to whether Americans want us to be an Enlightened, rule of law society or not. Enlightened peoples simply do not torture their fellow man. Christian peoples don't either. Torture runs against all the principles our country was founded on, and indeed runs against all the principles Christianity was founded on.\" .http://www.hillbillyreport.org/diary/72/torture-debate-quite-troubling, I can't say it better than that. Walt", 
        "intTime": 20090502, 
        "postID": 25, 
        "quote": "", 
        "reply": "\"It has been clear for a long time that under the Bush Administration torture was widely accepted and used. While this fact is troubling in itself, what is really disappointing is that some people seem determined to defend it. Whether by partisan hackery, or just sheer ignorance some people refuse to admit the plain and simple fact. Enlightened peoples simply do not torture other people. No matter what anyone's arguments on history are the undisputable fact is that America was the first country founded upon the liberal ideals of the Enlightenment. One of those ideals is that someone no matter their crime and no matter how much you disagreed or hated them should not have to be submitted to torture. What I find the most odd is that it seems that all of those who long have sought to lecture Progressives on their patriotism and on \"American values\" are the very people who so vehemently defend this practice. And why?? What is there to defend about capturing \"enemy combatants\" and submitting them to torture?? The simple truth of the matter is that torture simply does not work. It puts our troops at risk of retalitory torture, it helps al-Queda and other terrorist groups recruit, and it diminishes our moral standing in the world. How can we use diplomacy against regimes like N. Korea and China that torture to get them to give their citizens more human rights when we ourselves torture?? Just listen to former FBI interrogator Jack Cloonan speaking on the subject of torture: But what of the argument that torture helped \"keep us safe\" by preventing another terrorist attack?? I think it is important to note right of the bat that this argument is being forwarded by folks who failed our country miserably in preventing the first 9-11. It is cover for their own failures after recieving a national security memo entitled \"Bin-Laden Determined to Strike in the United States\". Folks that did nothing to prevent this attack and a President that felt it was more important to vacation than try to get to the bottom of the plot outlined in that memo are the same ones that used and defend torture. The fact is that torture did not work in it's most famous circumstance: Democrats say the Bush administration's interrogations policies hurt the nation more than helped it, and they accuse Republicans of twisting the debate. They note, for instance, that former Vice President Dick Cheney and others say suspected al-Qaida terrorist Abu Zubaydah underwent harsh interrogation, including waterboarding, and yielded vital information. But records show that some of his most important information, such as the identity of would-be bomber Jose Padilla, came before the harsh treatments were used. ... The main argument I have heard for the use of torture is that terrorists behead people, and torture too. That reminds me of when all our mothers would ask us, [b]\"Well, if so and so jumped off a bridge, would you do it too??\" Is the fact that some of the most un-Enlightened people that we consider our sworn enemies are doing something really a basis for us to do it ourselves?? Do we aspire to make our country more like Saudi Arabia, Iran and al-Queda?? I think it is pretty sad to think that some Americans would really like to make us more like terrorists. And what about those who are Christian that have no problem with our country torturing?? In the Christian belief Jesus Christ was tortured and murdered and died for our sins so that we may have eternal life. What would he think about those who aspire to follow him torturing others?? I think it is very likely a relief to him he has not a grave to roll over in. I think it all boils down to whether Americans want us to be an Enlightened, rule of law society or not. Enlightened peoples simply do not torture their fellow man. Christian peoples don't either. Torture runs against all the principles our country was founded on, and indeed runs against all the principles Christianity was founded on.\" .http://www.hillbillyreport.org/diary/72/torture-debate-quite-troubling, I can't say it better than that. Walt", 
        "threadID": "672198221_1490052222001", 
        "time": "2009-05-02 23:54:00", 
        "title": "Torture Issues Illuminated", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "quote: Originally posted by WhiskeyPapa: Actually, no. The ticking time bomb scenario only exists in two places: On TV and in the dark fantasies of power-crazed and morally deficient authoritarians. In real life, things are never that certain. And trained interrogators say that even in the most extreme circumstances, traditional methods are the most effective. I try to tell people this all the time, but since they've seen it on \"24\" which is apparently how things happen in real life, you can't convince them this doesn't happen.", 
        "intTime": 20090503, 
        "postID": 26, 
        "quote": "Originally posted by WhiskeyPapa: Actually, no. The ticking time bomb scenario only exists in two places: On TV and in the dark fantasies of power-crazed and morally deficient authoritarians. In real life, things are never that certain. And trained interrogators say that even in the most extreme circumstances, traditional methods are the most effective.", 
        "reply": " I try to tell people this all the time, but since they've seen it on \"24\" which is apparently how things happen in real life, you can't convince them this doesn't happen.", 
        "threadID": "672198221_1490052222001", 
        "time": "2009-05-03 03:40:00", 
        "title": "Torture Issues Illuminated", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: It puts our troops at risk of retalitory torture, it helps al-Queda and other terrorist groups recruit, and it diminishes our moral standing in the world. In case you havent taken note of history I should remind you of how the Mujahadeen behaved in Afghanistan in the 80s, Beruit bombing, Pan Am Airliner hijacking and many other events all occurred BEFORE Bush came into office. AQ doesnt give a flying fuq about our moral standing. To them, we ARE ALL INFIDELS whether we are American, British, Russian, Israeli or simply dont follow their extreme form of Islam. quote: No matter what anyone's arguments on history are the undisputable fact is that America was the first country founded upon the liberal ideals of the Enlightenment. liberal ideas? Read up buddy, it was founded under Judeo-Christian values. I didnt read anywhere that they embraced liberal ideas like homosexuality, taxing the rich to death, abortions at 34 weeks or other liberal values. quote: I think it is important to note right of the bat that this argument is being forwarded by folks who failed our country miserably in preventing the first 9-11. Oh, you mean like Clinton who chose not to take out Bin Laden, not once but three times? The one who did nothing after the Cole bombing or the embassy bombings? The one who gutted the military and intelligence services? quote: The main argument I have heard for the use of torture is that terrorists behead people, and torture too. HOW MANY TIMES DOES IT TAKE FOR SOME OF YOU TO GET THE USA DOES NOT TORTURE quote: Enlightened peoples simply do not torture their fellow man. NAMBLA and unborn baby killers tell us THEY are enlightened. No thanks, you can keep that liberal version of enlightenment and I choose to defend the weakest in society from liberal oppression and genocide.", 
        "intTime": 20090503, 
        "postID": 27, 
        "quote": "It puts our troops at risk of retalitory torture, it helps al-Queda and other terrorist groups recruit, and it diminishes our moral standing in the world.", 
        "reply": " In case you havent taken note of history I should remind you of how the Mujahadeen behaved in Afghanistan in the 80s, Beruit bombing, Pan Am Airliner hijacking and many other events all occurred BEFORE Bush came into office. AQ doesnt give a flying fuq about our moral standing. To them, we ARE ALL INFIDELS whether we are American, British, Russian, Israeli or simply dont follow their extreme form of Islam. quote: No matter what anyone's arguments on history are the undisputable fact is that America was the first country founded upon the liberal ideals of the Enlightenment. liberal ideas? Read up buddy, it was founded under Judeo-Christian values. I didnt read anywhere that they embraced liberal ideas like homosexuality, taxing the rich to death, abortions at 34 weeks or other liberal values. quote: I think it is important to note right of the bat that this argument is being forwarded by folks who failed our country miserably in preventing the first 9-11. Oh, you mean like Clinton who chose not to take out Bin Laden, not once but three times? The one who did nothing after the Cole bombing or the embassy bombings? The one who gutted the military and intelligence services? quote: The main argument I have heard for the use of torture is that terrorists behead people, and torture too. HOW MANY TIMES DOES IT TAKE FOR SOME OF YOU TO GET THE USA DOES NOT TORTURE quote: Enlightened peoples simply do not torture their fellow man. NAMBLA and unborn baby killers tell us THEY are enlightened. No thanks, you can keep that liberal version of enlightenment and I choose to defend the weakest in society from liberal oppression and genocide.", 
        "threadID": "672198221_1490052222001", 
        "time": "2009-05-03 06:41:00", 
        "title": "Torture Issues Illuminated", 
        "userID": "FlankerFlyer"
    }, 
    {
        "content": "Obama hugging Castro and Chaves is pure torture, I think I've said this before!", 
        "intTime": 20090503, 
        "postID": 28, 
        "quote": "", 
        "reply": "Obama hugging Castro and Chaves is pure torture, I think I've said this before!", 
        "threadID": "672198221_1490052222001", 
        "time": "2009-05-03 08:25:00", 
        "title": "Torture Issues Illuminated", 
        "userID": "EAG154"
    }, 
    {
        "content": "So far to date there is no evidence that water boarding is torture", 
        "intTime": 20090503, 
        "postID": 29, 
        "quote": "", 
        "reply": "So far to date there is no evidence that water boarding is torture", 
        "threadID": "672198221_1490052222001", 
        "time": "2009-05-03 08:30:00", 
        "title": "Torture Issues Illuminated", 
        "userID": "EAG154"
    }, 
    {
        "content": "quote: Originally posted by FlankerFlyer: HOW MANY TIMES DOES IT TAKE FOR SOME OF YOU TO GET THE USA DOES NOT TORTURE Photographic and verbal evidence indicates otherwise.", 
        "intTime": 20090503, 
        "postID": 30, 
        "quote": "Originally posted by FlankerFlyer: HOW MANY TIMES DOES IT TAKE FOR SOME OF YOU TO GET THE USA DOES NOT TORTURE", 
        "reply": " Photographic and verbal evidence indicates otherwise.", 
        "threadID": "672198221_1490052222001", 
        "time": "2009-05-03 10:40:00", 
        "title": "Torture Issues Illuminated", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by FlankerFlyer: HOW MANY TIMES DOES IT TAKE FOR SOME OF YOU TO GET THE USA DOES NOT TORTURE Photographic and verbal evidence indicates otherwise. OMG!! you're right, I forgot about those photos of panties on the head and human pyramids Yeah, Im sure they would have prefered their head be cut off, thats far more humane These false \"torture\" threads are right up there with conspiracy theories. Im sure we took them up on space ships and anally probed them as well", 
        "intTime": 20090503, 
        "postID": 31, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by FlankerFlyer: HOW MANY TIMES DOES IT TAKE FOR SOME OF YOU TO GET THE USA DOES NOT TORTURE Photographic and verbal evidence indicates otherwise.", 
        "reply": " OMG!! you're right, I forgot about those photos of panties on the head and human pyramids Yeah, Im sure they would have prefered their head be cut off, thats far more humane These false \"torture\" threads are right up there with conspiracy theories. Im sure we took them up on space ships and anally probed them as well", 
        "threadID": "672198221_1490052222001", 
        "time": "2009-05-03 22:31:00", 
        "title": "Torture Issues Illuminated", 
        "userID": "FlankerFlyer"
    }, 
    {
        "content": "Very simple, water boarding = torture... Torture = war crime... Those that did it or authorized it = war criminal... Nothing more to see here, move along... Respectfully, SUNLINER81", 
        "intTime": 20090504, 
        "postID": 32, 
        "quote": "", 
        "reply": "Very simple, water boarding = torture... Torture = war crime... Those that did it or authorized it = war criminal... Nothing more to see here, move along... Respectfully, SUNLINER81", 
        "threadID": "672198221_1490052222001", 
        "time": "2009-05-04 00:37:00", 
        "title": "Torture Issues Illuminated", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by dman1948: What a bunch of crap...somebody is writing for the funny books. All members who voted for us to go into Iraq are guilty, regardless of party. We went into Iraq base upon bad Intell pass on by the Clinton admin. Even John Kerry who sat on the intell committee said many times IRAQ HAS WMD's..period..now thats the truth and not one liberal or democrat can deny that, you can try. Or maybe have Berger go in a steal the info like he already did for Clinton. As far as Torture, lets say you or you or you, take my son, daughter, grand children and torture them, I can assure you as I stand here now, if I would ever catch up to the one who did it, they would know the feeling right back and twice over. Just shooting them is way to easy, they must feel the pain they put MY love ones through. I will not stand there and turn the other cheek, I promise you that with my very being. That person will get theirs if I have anything to do with it. Torture is a very big word, what does it really stand for? Seeking info about your enemy's? or revenge about the slaughter of one's family? When did it start? and why? The above? Which one came first? Info or revenge? When can it be deem right? Info or Revenge? and don't tell never, for if it happen to a member of your family, then the gloves are off and you know it, maybe you have to torture someone to get the info about the person you want revenge on. It goes on and on..And I truley believe that the us, the United States not torturing anyone will end torture world wide. Man is Man and as long as we are on this earth, there is ONE thing for certain and thats WAR!!! And with War, comes all the horrors of it. Just because we don't or stop, means another will follow suit... Only the strong make it, the weak and meek go by the way side and crower before their masters in hopes of living another day.", 
        "intTime": 20090504, 
        "postID": 33, 
        "quote": "Originally posted by dman1948: What a bunch of crap...somebody is writing for the funny books. All members who voted for us to go into Iraq are guilty, regardless of party. We went into Iraq base upon bad Intell pass on by the Clinton admin. Even John Kerry who sat on the intell committee said many times IRAQ HAS WMD's..period..now thats the truth and not one liberal or democrat can deny that, you can try. Or maybe have Berger go in a steal the info like he already did for Clinton. As far as Torture, lets say you or you or you, take my son, daughter, grand children and torture them, I can assure you as I stand here now, if I would ever catch up to the one who did it, they would know the feeling right back and twice over. Just shooting them is way to easy, they must feel the pain they put MY love ones through. I will not stand there and turn the other cheek, I promise you that with my very being. That person will get theirs if I have anything to do with it. Torture is a very big word, what does it really stand for? Seeking info about your enemy's? or revenge about the slaughter of one's family? When did it start? and why? The above? Which one came first? Info or revenge? When can it be deem right? Info or Revenge? and don't tell never, for if it happen to a member of your family, then the gloves are off and you know it, maybe you have to torture someone to get the info about the person you want revenge on. It goes on and on..And I truley believe that the us, the United States not torturing anyone will end torture world wide. Man is Man and as long as we are on this earth, there is ONE thing for certain and thats WAR!!! And with War, comes all the horrors of it. Just because we don't or stop, means another will follow suit... Only the strong make it, the weak and meek go by the way side and crower before their masters in hopes of living another day.", 
        "reply": "", 
        "threadID": "672198221_1490052222001", 
        "time": "2009-05-04 12:28:00", 
        "title": "Torture Issues Illuminated", 
        "userID": "7129716"
    }, 
    {
        "content": "quote: Originally posted by EAG154: So far to date there is no evidence that water boarding is torture Here is the link you want: >http://www.vanityfair.com/politics/features/2008/08/hitchens200808< Walt", 
        "intTime": 20090504, 
        "postID": 34, 
        "quote": "Originally posted by EAG154: So far to date there is no evidence that water boarding is torture", 
        "reply": " Here is the link you want: >http://www.vanityfair.com/politics/features/2008/08/hitchens200808< Walt", 
        "threadID": "672198221_1490052222001", 
        "time": "2009-05-04 12:44:00", 
        "title": "Torture Issues Illuminated", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "I don't agree with torture and think anyone that is invloved be prosecuted. That said, this is In the News, not in the Opinion. So why are you posting an Opinion peice as a news article????? This thread should not be In the News. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090504, 
        "postID": 35, 
        "quote": "", 
        "reply": "I don't agree with torture and think anyone that is invloved be prosecuted. That said, this is In the News, not in the Opinion. So why are you posting an Opinion peice as a news article????? This thread should not be In the News. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_1490052222001", 
        "time": "2009-05-04 12:49:00", 
        "title": "Torture Issues Illuminated", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: I don't agree with torture and think anyone that is invloved be prosecuted. That said, this is In the News, not in the Opinion. So why are you posting an Opinion peice as a news article????? This thread should not be In the News. Krauthammer's Article was in the WashPost late last week. That's in the news. Walt", 
        "intTime": 20090504, 
        "postID": 36, 
        "quote": "Originally posted by L0A1: I don't agree with torture and think anyone that is invloved be prosecuted. That said, this is In the News, not in the Opinion. So why are you posting an Opinion peice as a news article????? This thread should not be In the News.", 
        "reply": " Krauthammer's Article was in the WashPost late last week. That's in the news. Walt", 
        "threadID": "672198221_1490052222001", 
        "time": "2009-05-04 13:09:00", 
        "title": "Torture Issues Illuminated", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: I'm not debating torture any more. I want the courts to decide it. I may just file my own law suit against certain past USG officials to get the truth, and see justice brought, like some have done with certain birth certs proofs. Anyone care to join me? Yeah, I'll bring charges against Barack Hussein Obama for giving \"aid and comfort to the enemy\". By releasing photos an documents relating to our National Security, he has done just that. Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989 MOD HAT ON Accusing the President of the United States of treason is not acceptable on this site. You are On Warning for 20 days. This message has been edited. Last edited by: stillkit, Tue 05 May 2009 08:15 AM", 
        "intTime": 20090504, 
        "postID": 37, 
        "quote": "Originally posted by crackerjacks61: I'm not debating torture any more. I want the courts to decide it. I may just file my own law suit against certain past USG officials to get the truth, and see justice brought, like some have done with certain birth certs proofs. Anyone care to join me?", 
        "reply": " Yeah, I'll bring charges against Barack Hussein Obama for giving \"aid and comfort to the enemy\". By releasing photos an documents relating to our National Security, he has done just that. Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989 MOD HAT ON Accusing the President of the United States of treason is not acceptable on this site. You are On Warning for 20 days. This message has been edited. Last edited by: stillkit, Tue 05 May 2009 08:15 AM", 
        "threadID": "672198221_1490052222001", 
        "time": "2009-05-04 13:15:00", 
        "title": "Torture Issues Illuminated", 
        "userID": "Proudformermarine"
    }, 
    {
        "content": "quote: Originally posted by Proudformermarine: quote: Originally posted by crackerjacks61: I'm not debating torture any more. I want the courts to decide it. I may just file my own law suit against certain past USG officials to get the truth, and see justice brought, like some have done with certain birth certs proofs. Anyone care to join me? Yeah, I'll bring charges against Barack Hussein Obama for giving \"aid and comfort to the enemy\". By releasing photos an documents relating to our National Security, he has done just that. Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989 Did you have a similar reaction when when Cheney had the name of a covert CIA agent leaked to Robert Novak? Walt", 
        "intTime": 20090504, 
        "postID": 38, 
        "quote": "Originally posted by Proudformermarine: quote: Originally posted by crackerjacks61: I'm not debating torture any more. I want the courts to decide it. I may just file my own law suit against certain past USG officials to get the truth, and see justice brought, like some have done with certain birth certs proofs. Anyone care to join me? Yeah, I'll bring charges against Barack Hussein Obama for giving \"aid and comfort to the enemy\". By releasing photos an documents relating to our National Security, he has done just that. Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989", 
        "reply": " Did you have a similar reaction when when Cheney had the name of a covert CIA agent leaked to Robert Novak? Walt", 
        "threadID": "672198221_1490052222001", 
        "time": "2009-05-04 13:25:00", 
        "title": "Torture Issues Illuminated", 
        "userID": "WhiskeyPapa"
    }
]