[
    {
        "content": "That General Motors might be forced to declare BANKRUPTCY by June 1st, 2009!?! What do you think the ramifications might be???", 
        "intTime": 20090522, 
        "postID": 1, 
        "quote": "", 
        "reply": "That General Motors might be forced to declare BANKRUPTCY by June 1st, 2009!?! What do you think the ramifications might be???", 
        "threadID": "672198221_5480010422001", 
        "time": "2009-05-22 16:16:00", 
        "title": "The News \"talking heads\" speculate...", 
        "userID": "strobelvets"
    }, 
    {
        "content": "quote: Originally posted by strobelvets: That General Motors might be forced to declare BANKRUPTCY by June 1st, 2009!?! What do you think the ramifications might be??? We'll have a decent Automaker in the US now: Toyota, and cheap Camaros", 
        "intTime": 20090522, 
        "postID": 2, 
        "quote": "Originally posted by strobelvets: That General Motors might be forced to declare BANKRUPTCY by June 1st, 2009!?! What do you think the ramifications might be???", 
        "reply": " We'll have a decent Automaker in the US now: Toyota, and cheap Camaros", 
        "threadID": "672198221_5480010422001", 
        "time": "2009-05-22 16:30:00", 
        "title": "The News \"talking heads\" speculate...", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by strobelvets: That General Motors might be forced to declare BANKRUPTCY by June 1st, 2009!?! What do you think the ramifications might be??? We'll have a decent Automaker in the US now: Toyota, and cheap Camaros Already past the future", 
        "intTime": 20090522, 
        "postID": 3, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Originally posted by strobelvets: That General Motors might be forced to declare BANKRUPTCY by June 1st, 2009!?! What do you think the ramifications might be??? We'll have a decent Automaker in the US now: Toyota, and cheap Camaros", 
        "reply": " Already past the future", 
        "threadID": "672198221_5480010422001", 
        "time": "2009-05-22 16:49:00", 
        "title": "The News \"talking heads\" speculate...", 
        "userID": "6486143"
    }, 
    {
        "content": "HHmmmm. How many more lay offs? CNN, the democratic station, mentioned about 493000 retirees could be impacted. Will this be enough to push unemployment numbers to depression levels? What are the ramifications while China and Russia lick their chops?", 
        "intTime": 20090522, 
        "postID": 4, 
        "quote": "", 
        "reply": "HHmmmm. How many more lay offs? CNN, the democratic station, mentioned about 493000 retirees could be impacted. Will this be enough to push unemployment numbers to depression levels? What are the ramifications while China and Russia lick their chops?", 
        "threadID": "672198221_5480010422001", 
        "time": "2009-05-22 17:01:00", 
        "title": "The News \"talking heads\" speculate...", 
        "userID": "strobelvets"
    }, 
    {
        "content": "quote: Originally posted by strobelvets: HHmmmm. How many more lay offs? CNN, the democratic station, mentioned about 493000 retirees could be impacted. Will this be enough to push unemployment numbers to depression levels? What are the ramifications while China and Russia lick their chops? They should go back to school and learn another trade. We need accountants and nurses, and it can be done in two years. If they didn't save up money oh well..", 
        "intTime": 20090522, 
        "postID": 5, 
        "quote": "Originally posted by strobelvets: HHmmmm. How many more lay offs? CNN, the democratic station, mentioned about 493000 retirees could be impacted. Will this be enough to push unemployment numbers to depression levels? What are the ramifications while China and Russia lick their chops?", 
        "reply": " They should go back to school and learn another trade. We need accountants and nurses, and it can be done in two years. If they didn't save up money oh well..", 
        "threadID": "672198221_5480010422001", 
        "time": "2009-05-22 17:04:00", 
        "title": "The News \"talking heads\" speculate...", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by strobelvets: HHmmmm. How many more lay offs? CNN, the democratic station, mentioned about 493000 retirees could be impacted. Will this be enough to push unemployment numbers to depression levels? What are the ramifications while China and Russia lick their chops? They should go back to school and learn another trade. We need accountants and nurses, and it can be done in two years. If they didn't save up money oh well.. LOL...I have a degree in accounting as did my Father...ain't helping much...go fish...", 
        "intTime": 20090522, 
        "postID": 6, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Originally posted by strobelvets: HHmmmm. How many more lay offs? CNN, the democratic station, mentioned about 493000 retirees could be impacted. Will this be enough to push unemployment numbers to depression levels? What are the ramifications while China and Russia lick their chops? They should go back to school and learn another trade. We need accountants and nurses, and it can be done in two years. If they didn't save up money oh well..", 
        "reply": " LOL...I have a degree in accounting as did my Father...ain't helping much...go fish...", 
        "threadID": "672198221_5480010422001", 
        "time": "2009-05-22 17:05:00", 
        "title": "The News \"talking heads\" speculate...", 
        "userID": "strobelvets"
    }, 
    {
        "content": "Some on this board seem to feel that, \"So what if half the country is unemployed? Let the market work things out.\" These are people who aren't very old... Dave", 
        "intTime": 20090522, 
        "postID": 7, 
        "quote": "", 
        "reply": "Some on this board seem to feel that, \"So what if half the country is unemployed? Let the market work things out.\" These are people who aren't very old... Dave", 
        "threadID": "672198221_5480010422001", 
        "time": "2009-05-22 17:38:00", 
        "title": "The News \"talking heads\" speculate...", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: Some on this board seem to feel that, \"So what if half the country is unemployed? Let the market work things out.\" These are people who aren't very old... Dave Dave, Another super post by you. Spot on! Jack", 
        "intTime": 20090522, 
        "postID": 8, 
        "quote": "Originally posted by Grachus: Some on this board seem to feel that, \"So what if half the country is unemployed? Let the market work things out.\" These are people who aren't very old... Dave", 
        "reply": " Dave, Another super post by you. Spot on! Jack", 
        "threadID": "672198221_5480010422001", 
        "time": "2009-05-22 17:53:00", 
        "title": "The News \"talking heads\" speculate...", 
        "userID": "jackhunter1"
    }, 
    {
        "content": "quote: Originally posted by Grachus: Some on this board seem to feel that, \"So what if half the country is unemployed? Let the market work things out.\" These are people who aren't very old... Dave So these young people should foot the bill for their lack of foresight? Some planned, many didn't....As far as i'm concerned there are alot of cans that need recyling and windshields that need cleaning. I've made mistakes myself, but I can assure you those lessons were learned and I won't be hoping someone in the future bails me out.", 
        "intTime": 20090522, 
        "postID": 9, 
        "quote": "Originally posted by Grachus: Some on this board seem to feel that, \"So what if half the country is unemployed? Let the market work things out.\" These are people who aren't very old... Dave", 
        "reply": " So these young people should foot the bill for their lack of foresight? Some planned, many didn't....As far as i'm concerned there are alot of cans that need recyling and windshields that need cleaning. I've made mistakes myself, but I can assure you those lessons were learned and I won't be hoping someone in the future bails me out.", 
        "threadID": "672198221_5480010422001", 
        "time": "2009-05-22 18:09:00", 
        "title": "The News \"talking heads\" speculate...", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by Grachus: Some on this board seem to feel that, \"So what if half the country is unemployed? Let the market work things out.\" These are people who aren't very old... Dave So these young people should foot the bill for their lack of foresight? Some planned, many didn't....As far as i'm concerned there are alot of cans that need recyling and windshields that need cleaning. I've made mistakes myself, but I can assure you those lessons were learned and I won't be hoping someone in the future bails me out. I find this a strange argument. Are we a country? A society? Is it, \"We the People,\" or is it, \"Screw you Jack, I got mine.\" So what mistakes did the people who worked in a clothing store make when their company closed up because no one has money to buy their goods? My Mother used to laugh and tell me that I made a BIG MISTAKE, when I \"decided\" to be born to a poor family and not a rich one. The market is a funny thing, and while you wait around a year or two for a \"correction,\" you can die laughing about it. Dave", 
        "intTime": 20090522, 
        "postID": 10, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Originally posted by Grachus: Some on this board seem to feel that, \"So what if half the country is unemployed? Let the market work things out.\" These are people who aren't very old... Dave So these young people should foot the bill for their lack of foresight? Some planned, many didn't....As far as i'm concerned there are alot of cans that need recyling and windshields that need cleaning. I've made mistakes myself, but I can assure you those lessons were learned and I won't be hoping someone in the future bails me out.", 
        "reply": " I find this a strange argument. Are we a country? A society? Is it, \"We the People,\" or is it, \"Screw you Jack, I got mine.\" So what mistakes did the people who worked in a clothing store make when their company closed up because no one has money to buy their goods? My Mother used to laugh and tell me that I made a BIG MISTAKE, when I \"decided\" to be born to a poor family and not a rich one. The market is a funny thing, and while you wait around a year or two for a \"correction,\" you can die laughing about it. Dave", 
        "threadID": "672198221_5480010422001", 
        "time": "2009-05-22 18:15:00", 
        "title": "The News \"talking heads\" speculate...", 
        "userID": "Grachus"
    }, 
    {
        "content": "I had no idea we were all required to sacrifice a \"little bit\" so someone else can have a job. No one is guaranteed anything, life isn't fair. Its, \"Life, Liberty and the PURSUIT of happiness.\" Not guarantee.", 
        "intTime": 20090522, 
        "postID": 11, 
        "quote": "", 
        "reply": "I had no idea we were all required to sacrifice a \"little bit\" so someone else can have a job. No one is guaranteed anything, life isn't fair. Its, \"Life, Liberty and the PURSUIT of happiness.\" Not guarantee.", 
        "threadID": "672198221_5480010422001", 
        "time": "2009-05-22 18:27:00", 
        "title": "The News \"talking heads\" speculate...", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: I had no idea we were all required to sacrifice a \"little bit\" so someone else can have a job. No one is guaranteed anything, life isn't fair. Its, \"Life, Liberty and the PURSUIT of happiness.\" Not guarantee. Back in pioneer days, if your house burned down, the neighbors would come from miles around to rebuild it for you. I ain't schiten you hear, that's what they did. In todays world, you lose your job and apartment, and you just plain drop out of the radar. You disappear, and neighbors will ask each other, \"What happened to the Jensen family? Haven't seem them in months?\" Well, in the thirties, during the Great Depression the government stepped in an filled the gap. Mind you, I'm not blamming the neighbors of this \"Jensen family,\" that's just the way a complex and modern society functions. But YOU sitting there muttering about (pardon the quotes), \"Well the market decides,\" and \"no body said life is fair,\" are in fact saying that those neighbors back in pioneer times were the biggest jackasses that ever walked the face of the earth. Man don't you get it? We're all in the same boat, and it has painted on it's sides, The United States of America. If we can't \"rebuild the neighbors house,\" at least we shouldn't sit on the sidelines and shoot the people who are rebuilding it. Dave", 
        "intTime": 20090522, 
        "postID": 12, 
        "quote": "Originally posted by Irwin_R_Schyster: I had no idea we were all required to sacrifice a \"little bit\" so someone else can have a job. No one is guaranteed anything, life isn't fair. Its, \"Life, Liberty and the PURSUIT of happiness.\" Not guarantee.", 
        "reply": " Back in pioneer days, if your house burned down, the neighbors would come from miles around to rebuild it for you. I ain't schiten you hear, that's what they did. In todays world, you lose your job and apartment, and you just plain drop out of the radar. You disappear, and neighbors will ask each other, \"What happened to the Jensen family? Haven't seem them in months?\" Well, in the thirties, during the Great Depression the government stepped in an filled the gap. Mind you, I'm not blamming the neighbors of this \"Jensen family,\" that's just the way a complex and modern society functions. But YOU sitting there muttering about (pardon the quotes), \"Well the market decides,\" and \"no body said life is fair,\" are in fact saying that those neighbors back in pioneer times were the biggest jackasses that ever walked the face of the earth. Man don't you get it? We're all in the same boat, and it has painted on it's sides, The United States of America. If we can't \"rebuild the neighbors house,\" at least we shouldn't sit on the sidelines and shoot the people who are rebuilding it. Dave", 
        "threadID": "672198221_5480010422001", 
        "time": "2009-05-22 18:42:00", 
        "title": "The News \"talking heads\" speculate...", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by Grachus: Some on this board seem to feel that, \"So what if half the country is unemployed? Let the market work things out.\" These are people who aren't very old... Dave So these young people should foot the bill for their lack of foresight? Some planned, many didn't....As far as i'm concerned there are alot of cans that need recyling and windshields that need cleaning. I've made mistakes myself, but I can assure you those lessons were learned and I won't be hoping someone in the future bails me out. Already past the future", 
        "intTime": 20090522, 
        "postID": 13, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Originally posted by Grachus: Some on this board seem to feel that, \"So what if half the country is unemployed? Let the market work things out.\" These are people who aren't very old... Dave So these young people should foot the bill for their lack of foresight? Some planned, many didn't....As far as i'm concerned there are alot of cans that need recyling and windshields that need cleaning. I've made mistakes myself, but I can assure you those lessons were learned and I won't be hoping someone in the future bails me out.", 
        "reply": " Already past the future", 
        "threadID": "672198221_5480010422001", 
        "time": "2009-05-22 18:43:00", 
        "title": "The News \"talking heads\" speculate...", 
        "userID": "6486143"
    }, 
    {
        "content": "quote: Originally posted by strobelvets: HHmmmm. How many more lay offs? CNN, the democratic station, mentioned about 493000 retirees could be impacted. Will this be enough to push unemployment numbers to depression levels? What are the ramifications while China and Russia lick their chops? ...not sure either of them are in position to lick their chops...last I heard we are a very important PART OF China's economy and stability and last I heard Russia has been in dire straights since the oil price dropped....but a good depression might get this country back on track.... Already past the future", 
        "intTime": 20090522, 
        "postID": 14, 
        "quote": "Originally posted by strobelvets: HHmmmm. How many more lay offs? CNN, the democratic station, mentioned about 493000 retirees could be impacted. Will this be enough to push unemployment numbers to depression levels? What are the ramifications while China and Russia lick their chops?", 
        "reply": " ...not sure either of them are in position to lick their chops...last I heard we are a very important PART OF China's economy and stability and last I heard Russia has been in dire straights since the oil price dropped....but a good depression might get this country back on track.... Already past the future", 
        "threadID": "672198221_5480010422001", 
        "time": "2009-05-22 18:47:00", 
        "title": "The News \"talking heads\" speculate...", 
        "userID": "6486143"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: I had no idea we were all required to sacrifice a \"little bit\" so someone else can have a job. No one is guaranteed anything, life isn't fair. Its, \"Life, Liberty and the PURSUIT of happiness.\" Not guarantee. Already past the future", 
        "intTime": 20090522, 
        "postID": 15, 
        "quote": "Originally posted by Irwin_R_Schyster: I had no idea we were all required to sacrifice a \"little bit\" so someone else can have a job. No one is guaranteed anything, life isn't fair. Its, \"Life, Liberty and the PURSUIT of happiness.\" Not guarantee.", 
        "reply": " Already past the future", 
        "threadID": "672198221_5480010422001", 
        "time": "2009-05-22 18:48:00", 
        "title": "The News \"talking heads\" speculate...", 
        "userID": "6486143"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by Irwin_R_Schyster: I had no idea we were all required to sacrifice a \"little bit\" so someone else can have a job. No one is guaranteed anything, life isn't fair. Its, \"Life, Liberty and the PURSUIT of happiness.\" Not guarantee. Back in pioneer days, if your house burned down, the neighbors would come from miles around to rebuild it for you. I ain't schiten you hear, that's what they did. In todays world, you lose your job and apartment, and you just plain drop out of the radar. You disappear, and neighbors will ask each other, \"What happened to the Jensen family? Haven't seem them in months?\" Well, in the thirties, during the Great Depression the government stepped in an filled the gap. Mind you, I'm not blamming the neighbors of this \"Jensen family,\" that's just the way a complex and modern society functions. But YOU sitting there muttering about (pardon the quotes), \"Well the market decides,\" and \"no body said life is fair,\" are in fact saying that those neighbors back in pioneer times were the biggest jackasses that ever walked the face of the earth. Man don't you get it? We're all in the same boat, and it has painted on it's sides, The United States of America. If we can't \"rebuild the neighbors house,\" at least we shouldn't sit on the sidelines and shoot the people who are rebuilding it. Dave The people \"rebuilding it\" are taxing me and everyone else to do so, that is not our problem. Sorry dave, what you and liberals alike are prescribing is full blown socialism.", 
        "intTime": 20090522, 
        "postID": 16, 
        "quote": "Originally posted by Grachus: quote: Originally posted by Irwin_R_Schyster: I had no idea we were all required to sacrifice a \"little bit\" so someone else can have a job. No one is guaranteed anything, life isn't fair. Its, \"Life, Liberty and the PURSUIT of happiness.\" Not guarantee. Back in pioneer days, if your house burned down, the neighbors would come from miles around to rebuild it for you. I ain't schiten you hear, that's what they did. In todays world, you lose your job and apartment, and you just plain drop out of the radar. You disappear, and neighbors will ask each other, \"What happened to the Jensen family? Haven't seem them in months?\" Well, in the thirties, during the Great Depression the government stepped in an filled the gap. Mind you, I'm not blamming the neighbors of this \"Jensen family,\" that's just the way a complex and modern society functions. But YOU sitting there muttering about (pardon the quotes), \"Well the market decides,\" and \"no body said life is fair,\" are in fact saying that those neighbors back in pioneer times were the biggest jackasses that ever walked the face of the earth. Man don't you get it? We're all in the same boat, and it has painted on it's sides, The United States of America. If we can't \"rebuild the neighbors house,\" at least we shouldn't sit on the sidelines and shoot the people who are rebuilding it. Dave", 
        "reply": " The people \"rebuilding it\" are taxing me and everyone else to do so, that is not our problem. Sorry dave, what you and liberals alike are prescribing is full blown socialism.", 
        "threadID": "672198221_5480010422001", 
        "time": "2009-05-22 18:52:00", 
        "title": "The News \"talking heads\" speculate...", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by Grachus: quote: Originally posted by Irwin_R_Schyster: I had no idea we were all required to sacrifice a \"little bit\" so someone else can have a job. No one is guaranteed anything, life isn't fair. Its, \"Life, Liberty and the PURSUIT of happiness.\" Not guarantee. Back in pioneer days, if your house burned down, the neighbors would come from miles around to rebuild it for you. I ain't schiten you hear, that's what they did. In todays world, you lose your job and apartment, and you just plain drop out of the radar. You disappear, and neighbors will ask each other, \"What happened to the Jensen family? Haven't seem them in months?\" Well, in the thirties, during the Great Depression the government stepped in an filled the gap. Mind you, I'm not blamming the neighbors of this \"Jensen family,\" that's just the way a complex and modern society functions. But YOU sitting there muttering about (pardon the quotes), \"Well the market decides,\" and \"no body said life is fair,\" are in fact saying that those neighbors back in pioneer times were the biggest jackasses that ever walked the face of the earth. Man don't you get it? We're all in the same boat, and it has painted on it's sides, The United States of America. If we can't \"rebuild the neighbors house,\" at least we shouldn't sit on the sidelines and shoot the people who are rebuilding it. Dave The people \"rebuilding it\" are taxing me and everyone else to do so, that is not our problem. Sorry dave, what you and liberals alike are prescribing is full blown socialism. Already past the future", 
        "intTime": 20090522, 
        "postID": 17, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Originally posted by Grachus: quote: Originally posted by Irwin_R_Schyster: I had no idea we were all required to sacrifice a \"little bit\" so someone else can have a job. No one is guaranteed anything, life isn't fair. Its, \"Life, Liberty and the PURSUIT of happiness.\" Not guarantee. Back in pioneer days, if your house burned down, the neighbors would come from miles around to rebuild it for you. I ain't schiten you hear, that's what they did. In todays world, you lose your job and apartment, and you just plain drop out of the radar. You disappear, and neighbors will ask each other, \"What happened to the Jensen family? Haven't seem them in months?\" Well, in the thirties, during the Great Depression the government stepped in an filled the gap. Mind you, I'm not blamming the neighbors of this \"Jensen family,\" that's just the way a complex and modern society functions. But YOU sitting there muttering about (pardon the quotes), \"Well the market decides,\" and \"no body said life is fair,\" are in fact saying that those neighbors back in pioneer times were the biggest jackasses that ever walked the face of the earth. Man don't you get it? We're all in the same boat, and it has painted on it's sides, The United States of America. If we can't \"rebuild the neighbors house,\" at least we shouldn't sit on the sidelines and shoot the people who are rebuilding it. Dave The people \"rebuilding it\" are taxing me and everyone else to do so, that is not our problem. Sorry dave, what you and liberals alike are prescribing is full blown socialism.", 
        "reply": " Already past the future", 
        "threadID": "672198221_5480010422001", 
        "time": "2009-05-22 19:00:00", 
        "title": "The News \"talking heads\" speculate...", 
        "userID": "6486143"
    }, 
    {
        "content": "My personal belief is, that as usual, the truth of the matter lies between the diametrically opposed poles. What was intended under Roosevelt was a safety net for working persons who had experienced some calamity impacting their livelihood. Over the years, this became a welfare democracy...intent upon everything , up to and incuding, rectifying so called social injustices. Many of these programs incentivize Folks to stay on socialist like hand outs... What We are facing now is different...as the economy tanks, many are becoming unemployed who have worked their whole lives, supported their families, and paid their mortgages. Many are now expending what is left of their retirement funds and savings to keep their homes....and search for employment. It also appears that Government is expending \"future\" dollars to bail out entities that arent market driven...and investing in public works which arent improving the lot of many people. Under this current situation...the question remains...how may unemployed workers will constitute an actual depression? We need to focus on business stimulus and availability of capital in this regard. Howm many supppliers and contractors do you think the GM bankruptcy will impact???", 
        "intTime": 20090523, 
        "postID": 18, 
        "quote": "", 
        "reply": "My personal belief is, that as usual, the truth of the matter lies between the diametrically opposed poles. What was intended under Roosevelt was a safety net for working persons who had experienced some calamity impacting their livelihood. Over the years, this became a welfare democracy...intent upon everything , up to and incuding, rectifying so called social injustices. Many of these programs incentivize Folks to stay on socialist like hand outs... What We are facing now is different...as the economy tanks, many are becoming unemployed who have worked their whole lives, supported their families, and paid their mortgages. Many are now expending what is left of their retirement funds and savings to keep their homes....and search for employment. It also appears that Government is expending \"future\" dollars to bail out entities that arent market driven...and investing in public works which arent improving the lot of many people. Under this current situation...the question remains...how may unemployed workers will constitute an actual depression? We need to focus on business stimulus and availability of capital in this regard. Howm many supppliers and contractors do you think the GM bankruptcy will impact???", 
        "threadID": "672198221_5480010422001", 
        "time": "2009-05-23 14:08:00", 
        "title": "The News \"talking heads\" speculate...", 
        "userID": "strobelvets"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by Irwin_R_Schyster: I had no idea we were all required to sacrifice a \"little bit\" so someone else can have a job. No one is guaranteed anything, life isn't fair. Its, \"Life, Liberty and the PURSUIT of happiness.\" Not guarantee. Back in pioneer days, if your house burned down, the neighbors would come from miles around to rebuild it for you. I ain't schiten you hear, that's what they did. In todays world, you lose your job and apartment, and you just plain drop out of the radar. You disappear, and neighbors will ask each other, \"What happened to the Jensen family? Haven't seem them in months?\" Well, in the thirties, during the Great Depression the government stepped in an filled the gap. Mind you, I'm not blamming the neighbors of this \"Jensen family,\" that's just the way a complex and modern society functions. But YOU sitting there muttering about (pardon the quotes), \"Well the market decides,\" and \"no body said life is fair,\" are in fact saying that those neighbors back in pioneer times were the biggest jackasses that ever walked the face of the earth. Man don't you get it? We're all in the same boat, and it has painted on it's sides, The United States of America. If we can't \"rebuild the neighbors house,\" at least we shouldn't sit on the sidelines and shoot the people who are rebuilding it. Dave Dave that's exactly what I have been trying to tell some of these knuckle heads but they do not get it. We are neighbors whether we live right next door to each other or not. That is why I try to show them that by treating all people the way you would want to be treated is the right way for this country. That entails everything from giving PAID vacations to your employees to walking across the street and asking the neighbor that does live right beside you for assistance. But this new far right bunch of neo-anti-neighbor-anti-fellow-American citizenship republicans we got are out for themselves and themselves alone. Not to mention they place a dollar bill over all else. No wonder we have no family values and fall way short of Americans being good neighbors to each other which can all be attributed to many of the troubles we have in this nation...then they turn around and wonder what happen. They cry when someone suggest giving working people a vacation or giving them decent wages to live off of, but yet they rant and whine when they see themselves sinking because THEY made bad financial decisions like putting extra money in a gambling fund called 401k or gambling in another fund called STOCKS. Some of you should be flat out busted or broke but no, MY tax money went to save some of your sorry hides and then you turn around and argue against passing the good along to a fellow American in the form of a paid vacation for employees. Pure ridiculous. But like I said in the other thread, it does not matter because right now government is on the side of labor this go around, the middle man will not parish as much as some of you hoped would. As for GM, they will go bankrupt but they will not be gone. This bankruptcy will hurt ALLOT of retired people as well as workers, if fact it will more than likely cause a huge wave across this nation..but hey as long as the CEOs make their millions in pay and bonuses every, it's not greed and its' A ok. GM will restructure and it will go on. Unfortunetly, there the only restructuring many retired and current GM workers will get is directions to the food line and shelters. I will belive this until the day I die. If Americans wages had even somewhat kept up with the cost of everything else, the bank failures and all the others failures would not had happened or would not have even matter. The Reps destroyed this country people..do not ever trust them again in the whitehouse. \"Now hear this, Brace for Impact\"", 
        "intTime": 20090523, 
        "postID": 19, 
        "quote": "Originally posted by Grachus: quote: Originally posted by Irwin_R_Schyster: I had no idea we were all required to sacrifice a \"little bit\" so someone else can have a job. No one is guaranteed anything, life isn't fair. Its, \"Life, Liberty and the PURSUIT of happiness.\" Not guarantee. Back in pioneer days, if your house burned down, the neighbors would come from miles around to rebuild it for you. I ain't schiten you hear, that's what they did. In todays world, you lose your job and apartment, and you just plain drop out of the radar. You disappear, and neighbors will ask each other, \"What happened to the Jensen family? Haven't seem them in months?\" Well, in the thirties, during the Great Depression the government stepped in an filled the gap. Mind you, I'm not blamming the neighbors of this \"Jensen family,\" that's just the way a complex and modern society functions. But YOU sitting there muttering about (pardon the quotes), \"Well the market decides,\" and \"no body said life is fair,\" are in fact saying that those neighbors back in pioneer times were the biggest jackasses that ever walked the face of the earth. Man don't you get it? We're all in the same boat, and it has painted on it's sides, The United States of America. If we can't \"rebuild the neighbors house,\" at least we shouldn't sit on the sidelines and shoot the people who are rebuilding it. Dave", 
        "reply": " Dave that's exactly what I have been trying to tell some of these knuckle heads but they do not get it. We are neighbors whether we live right next door to each other or not. That is why I try to show them that by treating all people the way you would want to be treated is the right way for this country. That entails everything from giving PAID vacations to your employees to walking across the street and asking the neighbor that does live right beside you for assistance. But this new far right bunch of neo-anti-neighbor-anti-fellow-American citizenship republicans we got are out for themselves and themselves alone. Not to mention they place a dollar bill over all else. No wonder we have no family values and fall way short of Americans being good neighbors to each other which can all be attributed to many of the troubles we have in this nation...then they turn around and wonder what happen. They cry when someone suggest giving working people a vacation or giving them decent wages to live off of, but yet they rant and whine when they see themselves sinking because THEY made bad financial decisions like putting extra money in a gambling fund called 401k or gambling in another fund called STOCKS. Some of you should be flat out busted or broke but no, MY tax money went to save some of your sorry hides and then you turn around and argue against passing the good along to a fellow American in the form of a paid vacation for employees. Pure ridiculous. But like I said in the other thread, it does not matter because right now government is on the side of labor this go around, the middle man will not parish as much as some of you hoped would. As for GM, they will go bankrupt but they will not be gone. This bankruptcy will hurt ALLOT of retired people as well as workers, if fact it will more than likely cause a huge wave across this nation..but hey as long as the CEOs make their millions in pay and bonuses every, it's not greed and its' A ok. GM will restructure and it will go on. Unfortunetly, there the only restructuring many retired and current GM workers will get is directions to the food line and shelters. I will belive this until the day I die. If Americans wages had even somewhat kept up with the cost of everything else, the bank failures and all the others failures would not had happened or would not have even matter. The Reps destroyed this country people..do not ever trust them again in the whitehouse. \"Now hear this, Brace for Impact\"", 
        "threadID": "672198221_5480010422001", 
        "time": "2009-05-23 14:47:00", 
        "title": "The News \"talking heads\" speculate...", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Is it, \"We the People,\" or is it, \"Screw you Jack, I got mine.\" We the people = Democrats Screw you Jack, I got mine = The New Republicans", 
        "intTime": 20090523, 
        "postID": 20, 
        "quote": "Is it, \"We the People,\" or is it, \"Screw you Jack, I got mine.\"", 
        "reply": " We the people = Democrats Screw you Jack, I got mine = The New Republicans", 
        "threadID": "672198221_5480010422001", 
        "time": "2009-05-23 15:05:00", 
        "title": "The News \"talking heads\" speculate...", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "That General Motors might be forced to declare BANKRUPTCY by June 1st, 2009!?! What do you think the ramifications might be???", 
        "intTime": 20090522, 
        "postID": 21, 
        "quote": "", 
        "reply": "That General Motors might be forced to declare BANKRUPTCY by June 1st, 2009!?! What do you think the ramifications might be???", 
        "threadID": "672198221_5480010422001", 
        "time": "2009-05-22 16:16:00", 
        "title": "The News \"talking heads\" speculate...", 
        "userID": "strobelvets"
    }, 
    {
        "content": "quote: Originally posted by strobelvets: That General Motors might be forced to declare BANKRUPTCY by June 1st, 2009!?! What do you think the ramifications might be??? We'll have a decent Automaker in the US now: Toyota, and cheap Camaros", 
        "intTime": 20090522, 
        "postID": 22, 
        "quote": "Originally posted by strobelvets: That General Motors might be forced to declare BANKRUPTCY by June 1st, 2009!?! What do you think the ramifications might be???", 
        "reply": " We'll have a decent Automaker in the US now: Toyota, and cheap Camaros", 
        "threadID": "672198221_5480010422001", 
        "time": "2009-05-22 16:30:00", 
        "title": "The News \"talking heads\" speculate...", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by strobelvets: That General Motors might be forced to declare BANKRUPTCY by June 1st, 2009!?! What do you think the ramifications might be??? We'll have a decent Automaker in the US now: Toyota, and cheap Camaros Already past the future", 
        "intTime": 20090522, 
        "postID": 23, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Originally posted by strobelvets: That General Motors might be forced to declare BANKRUPTCY by June 1st, 2009!?! What do you think the ramifications might be??? We'll have a decent Automaker in the US now: Toyota, and cheap Camaros", 
        "reply": " Already past the future", 
        "threadID": "672198221_5480010422001", 
        "time": "2009-05-22 16:49:00", 
        "title": "The News \"talking heads\" speculate...", 
        "userID": "6486143"
    }, 
    {
        "content": "HHmmmm. How many more lay offs? CNN, the democratic station, mentioned about 493000 retirees could be impacted. Will this be enough to push unemployment numbers to depression levels? What are the ramifications while China and Russia lick their chops?", 
        "intTime": 20090522, 
        "postID": 24, 
        "quote": "", 
        "reply": "HHmmmm. How many more lay offs? CNN, the democratic station, mentioned about 493000 retirees could be impacted. Will this be enough to push unemployment numbers to depression levels? What are the ramifications while China and Russia lick their chops?", 
        "threadID": "672198221_5480010422001", 
        "time": "2009-05-22 17:01:00", 
        "title": "The News \"talking heads\" speculate...", 
        "userID": "strobelvets"
    }, 
    {
        "content": "quote: Originally posted by strobelvets: HHmmmm. How many more lay offs? CNN, the democratic station, mentioned about 493000 retirees could be impacted. Will this be enough to push unemployment numbers to depression levels? What are the ramifications while China and Russia lick their chops? They should go back to school and learn another trade. We need accountants and nurses, and it can be done in two years. If they didn't save up money oh well..", 
        "intTime": 20090522, 
        "postID": 25, 
        "quote": "Originally posted by strobelvets: HHmmmm. How many more lay offs? CNN, the democratic station, mentioned about 493000 retirees could be impacted. Will this be enough to push unemployment numbers to depression levels? What are the ramifications while China and Russia lick their chops?", 
        "reply": " They should go back to school and learn another trade. We need accountants and nurses, and it can be done in two years. If they didn't save up money oh well..", 
        "threadID": "672198221_5480010422001", 
        "time": "2009-05-22 17:04:00", 
        "title": "The News \"talking heads\" speculate...", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by strobelvets: HHmmmm. How many more lay offs? CNN, the democratic station, mentioned about 493000 retirees could be impacted. Will this be enough to push unemployment numbers to depression levels? What are the ramifications while China and Russia lick their chops? They should go back to school and learn another trade. We need accountants and nurses, and it can be done in two years. If they didn't save up money oh well.. LOL...I have a degree in accounting as did my Father...ain't helping much...go fish...", 
        "intTime": 20090522, 
        "postID": 26, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Originally posted by strobelvets: HHmmmm. How many more lay offs? CNN, the democratic station, mentioned about 493000 retirees could be impacted. Will this be enough to push unemployment numbers to depression levels? What are the ramifications while China and Russia lick their chops? They should go back to school and learn another trade. We need accountants and nurses, and it can be done in two years. If they didn't save up money oh well..", 
        "reply": " LOL...I have a degree in accounting as did my Father...ain't helping much...go fish...", 
        "threadID": "672198221_5480010422001", 
        "time": "2009-05-22 17:05:00", 
        "title": "The News \"talking heads\" speculate...", 
        "userID": "strobelvets"
    }, 
    {
        "content": "Some on this board seem to feel that, \"So what if half the country is unemployed? Let the market work things out.\" These are people who aren't very old... Dave", 
        "intTime": 20090522, 
        "postID": 27, 
        "quote": "", 
        "reply": "Some on this board seem to feel that, \"So what if half the country is unemployed? Let the market work things out.\" These are people who aren't very old... Dave", 
        "threadID": "672198221_5480010422001", 
        "time": "2009-05-22 17:38:00", 
        "title": "The News \"talking heads\" speculate...", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: Some on this board seem to feel that, \"So what if half the country is unemployed? Let the market work things out.\" These are people who aren't very old... Dave Dave, Another super post by you. Spot on! Jack", 
        "intTime": 20090522, 
        "postID": 28, 
        "quote": "Originally posted by Grachus: Some on this board seem to feel that, \"So what if half the country is unemployed? Let the market work things out.\" These are people who aren't very old... Dave", 
        "reply": " Dave, Another super post by you. Spot on! Jack", 
        "threadID": "672198221_5480010422001", 
        "time": "2009-05-22 17:53:00", 
        "title": "The News \"talking heads\" speculate...", 
        "userID": "jackhunter1"
    }, 
    {
        "content": "quote: Originally posted by Grachus: Some on this board seem to feel that, \"So what if half the country is unemployed? Let the market work things out.\" These are people who aren't very old... Dave So these young people should foot the bill for their lack of foresight? Some planned, many didn't....As far as i'm concerned there are alot of cans that need recyling and windshields that need cleaning. I've made mistakes myself, but I can assure you those lessons were learned and I won't be hoping someone in the future bails me out.", 
        "intTime": 20090522, 
        "postID": 29, 
        "quote": "Originally posted by Grachus: Some on this board seem to feel that, \"So what if half the country is unemployed? Let the market work things out.\" These are people who aren't very old... Dave", 
        "reply": " So these young people should foot the bill for their lack of foresight? Some planned, many didn't....As far as i'm concerned there are alot of cans that need recyling and windshields that need cleaning. I've made mistakes myself, but I can assure you those lessons were learned and I won't be hoping someone in the future bails me out.", 
        "threadID": "672198221_5480010422001", 
        "time": "2009-05-22 18:09:00", 
        "title": "The News \"talking heads\" speculate...", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by Grachus: Some on this board seem to feel that, \"So what if half the country is unemployed? Let the market work things out.\" These are people who aren't very old... Dave So these young people should foot the bill for their lack of foresight? Some planned, many didn't....As far as i'm concerned there are alot of cans that need recyling and windshields that need cleaning. I've made mistakes myself, but I can assure you those lessons were learned and I won't be hoping someone in the future bails me out. I find this a strange argument. Are we a country? A society? Is it, \"We the People,\" or is it, \"Screw you Jack, I got mine.\" So what mistakes did the people who worked in a clothing store make when their company closed up because no one has money to buy their goods? My Mother used to laugh and tell me that I made a BIG MISTAKE, when I \"decided\" to be born to a poor family and not a rich one. The market is a funny thing, and while you wait around a year or two for a \"correction,\" you can die laughing about it. Dave", 
        "intTime": 20090522, 
        "postID": 30, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Originally posted by Grachus: Some on this board seem to feel that, \"So what if half the country is unemployed? Let the market work things out.\" These are people who aren't very old... Dave So these young people should foot the bill for their lack of foresight? Some planned, many didn't....As far as i'm concerned there are alot of cans that need recyling and windshields that need cleaning. I've made mistakes myself, but I can assure you those lessons were learned and I won't be hoping someone in the future bails me out.", 
        "reply": " I find this a strange argument. Are we a country? A society? Is it, \"We the People,\" or is it, \"Screw you Jack, I got mine.\" So what mistakes did the people who worked in a clothing store make when their company closed up because no one has money to buy their goods? My Mother used to laugh and tell me that I made a BIG MISTAKE, when I \"decided\" to be born to a poor family and not a rich one. The market is a funny thing, and while you wait around a year or two for a \"correction,\" you can die laughing about it. Dave", 
        "threadID": "672198221_5480010422001", 
        "time": "2009-05-22 18:15:00", 
        "title": "The News \"talking heads\" speculate...", 
        "userID": "Grachus"
    }, 
    {
        "content": "I had no idea we were all required to sacrifice a \"little bit\" so someone else can have a job. No one is guaranteed anything, life isn't fair. Its, \"Life, Liberty and the PURSUIT of happiness.\" Not guarantee.", 
        "intTime": 20090522, 
        "postID": 31, 
        "quote": "", 
        "reply": "I had no idea we were all required to sacrifice a \"little bit\" so someone else can have a job. No one is guaranteed anything, life isn't fair. Its, \"Life, Liberty and the PURSUIT of happiness.\" Not guarantee.", 
        "threadID": "672198221_5480010422001", 
        "time": "2009-05-22 18:27:00", 
        "title": "The News \"talking heads\" speculate...", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: I had no idea we were all required to sacrifice a \"little bit\" so someone else can have a job. No one is guaranteed anything, life isn't fair. Its, \"Life, Liberty and the PURSUIT of happiness.\" Not guarantee. Back in pioneer days, if your house burned down, the neighbors would come from miles around to rebuild it for you. I ain't schiten you hear, that's what they did. In todays world, you lose your job and apartment, and you just plain drop out of the radar. You disappear, and neighbors will ask each other, \"What happened to the Jensen family? Haven't seem them in months?\" Well, in the thirties, during the Great Depression the government stepped in an filled the gap. Mind you, I'm not blamming the neighbors of this \"Jensen family,\" that's just the way a complex and modern society functions. But YOU sitting there muttering about (pardon the quotes), \"Well the market decides,\" and \"no body said life is fair,\" are in fact saying that those neighbors back in pioneer times were the biggest jackasses that ever walked the face of the earth. Man don't you get it? We're all in the same boat, and it has painted on it's sides, The United States of America. If we can't \"rebuild the neighbors house,\" at least we shouldn't sit on the sidelines and shoot the people who are rebuilding it. Dave", 
        "intTime": 20090522, 
        "postID": 32, 
        "quote": "Originally posted by Irwin_R_Schyster: I had no idea we were all required to sacrifice a \"little bit\" so someone else can have a job. No one is guaranteed anything, life isn't fair. Its, \"Life, Liberty and the PURSUIT of happiness.\" Not guarantee.", 
        "reply": " Back in pioneer days, if your house burned down, the neighbors would come from miles around to rebuild it for you. I ain't schiten you hear, that's what they did. In todays world, you lose your job and apartment, and you just plain drop out of the radar. You disappear, and neighbors will ask each other, \"What happened to the Jensen family? Haven't seem them in months?\" Well, in the thirties, during the Great Depression the government stepped in an filled the gap. Mind you, I'm not blamming the neighbors of this \"Jensen family,\" that's just the way a complex and modern society functions. But YOU sitting there muttering about (pardon the quotes), \"Well the market decides,\" and \"no body said life is fair,\" are in fact saying that those neighbors back in pioneer times were the biggest jackasses that ever walked the face of the earth. Man don't you get it? We're all in the same boat, and it has painted on it's sides, The United States of America. If we can't \"rebuild the neighbors house,\" at least we shouldn't sit on the sidelines and shoot the people who are rebuilding it. Dave", 
        "threadID": "672198221_5480010422001", 
        "time": "2009-05-22 18:42:00", 
        "title": "The News \"talking heads\" speculate...", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by Grachus: Some on this board seem to feel that, \"So what if half the country is unemployed? Let the market work things out.\" These are people who aren't very old... Dave So these young people should foot the bill for their lack of foresight? Some planned, many didn't....As far as i'm concerned there are alot of cans that need recyling and windshields that need cleaning. I've made mistakes myself, but I can assure you those lessons were learned and I won't be hoping someone in the future bails me out. Already past the future", 
        "intTime": 20090522, 
        "postID": 33, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Originally posted by Grachus: Some on this board seem to feel that, \"So what if half the country is unemployed? Let the market work things out.\" These are people who aren't very old... Dave So these young people should foot the bill for their lack of foresight? Some planned, many didn't....As far as i'm concerned there are alot of cans that need recyling and windshields that need cleaning. I've made mistakes myself, but I can assure you those lessons were learned and I won't be hoping someone in the future bails me out.", 
        "reply": " Already past the future", 
        "threadID": "672198221_5480010422001", 
        "time": "2009-05-22 18:43:00", 
        "title": "The News \"talking heads\" speculate...", 
        "userID": "6486143"
    }, 
    {
        "content": "quote: Originally posted by strobelvets: HHmmmm. How many more lay offs? CNN, the democratic station, mentioned about 493000 retirees could be impacted. Will this be enough to push unemployment numbers to depression levels? What are the ramifications while China and Russia lick their chops? ...not sure either of them are in position to lick their chops...last I heard we are a very important PART OF China's economy and stability and last I heard Russia has been in dire straights since the oil price dropped....but a good depression might get this country back on track.... Already past the future", 
        "intTime": 20090522, 
        "postID": 34, 
        "quote": "Originally posted by strobelvets: HHmmmm. How many more lay offs? CNN, the democratic station, mentioned about 493000 retirees could be impacted. Will this be enough to push unemployment numbers to depression levels? What are the ramifications while China and Russia lick their chops?", 
        "reply": " ...not sure either of them are in position to lick their chops...last I heard we are a very important PART OF China's economy and stability and last I heard Russia has been in dire straights since the oil price dropped....but a good depression might get this country back on track.... Already past the future", 
        "threadID": "672198221_5480010422001", 
        "time": "2009-05-22 18:47:00", 
        "title": "The News \"talking heads\" speculate...", 
        "userID": "6486143"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: I had no idea we were all required to sacrifice a \"little bit\" so someone else can have a job. No one is guaranteed anything, life isn't fair. Its, \"Life, Liberty and the PURSUIT of happiness.\" Not guarantee. Already past the future", 
        "intTime": 20090522, 
        "postID": 35, 
        "quote": "Originally posted by Irwin_R_Schyster: I had no idea we were all required to sacrifice a \"little bit\" so someone else can have a job. No one is guaranteed anything, life isn't fair. Its, \"Life, Liberty and the PURSUIT of happiness.\" Not guarantee.", 
        "reply": " Already past the future", 
        "threadID": "672198221_5480010422001", 
        "time": "2009-05-22 18:48:00", 
        "title": "The News \"talking heads\" speculate...", 
        "userID": "6486143"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by Irwin_R_Schyster: I had no idea we were all required to sacrifice a \"little bit\" so someone else can have a job. No one is guaranteed anything, life isn't fair. Its, \"Life, Liberty and the PURSUIT of happiness.\" Not guarantee. Back in pioneer days, if your house burned down, the neighbors would come from miles around to rebuild it for you. I ain't schiten you hear, that's what they did. In todays world, you lose your job and apartment, and you just plain drop out of the radar. You disappear, and neighbors will ask each other, \"What happened to the Jensen family? Haven't seem them in months?\" Well, in the thirties, during the Great Depression the government stepped in an filled the gap. Mind you, I'm not blamming the neighbors of this \"Jensen family,\" that's just the way a complex and modern society functions. But YOU sitting there muttering about (pardon the quotes), \"Well the market decides,\" and \"no body said life is fair,\" are in fact saying that those neighbors back in pioneer times were the biggest jackasses that ever walked the face of the earth. Man don't you get it? We're all in the same boat, and it has painted on it's sides, The United States of America. If we can't \"rebuild the neighbors house,\" at least we shouldn't sit on the sidelines and shoot the people who are rebuilding it. Dave The people \"rebuilding it\" are taxing me and everyone else to do so, that is not our problem. Sorry dave, what you and liberals alike are prescribing is full blown socialism.", 
        "intTime": 20090522, 
        "postID": 36, 
        "quote": "Originally posted by Grachus: quote: Originally posted by Irwin_R_Schyster: I had no idea we were all required to sacrifice a \"little bit\" so someone else can have a job. No one is guaranteed anything, life isn't fair. Its, \"Life, Liberty and the PURSUIT of happiness.\" Not guarantee. Back in pioneer days, if your house burned down, the neighbors would come from miles around to rebuild it for you. I ain't schiten you hear, that's what they did. In todays world, you lose your job and apartment, and you just plain drop out of the radar. You disappear, and neighbors will ask each other, \"What happened to the Jensen family? Haven't seem them in months?\" Well, in the thirties, during the Great Depression the government stepped in an filled the gap. Mind you, I'm not blamming the neighbors of this \"Jensen family,\" that's just the way a complex and modern society functions. But YOU sitting there muttering about (pardon the quotes), \"Well the market decides,\" and \"no body said life is fair,\" are in fact saying that those neighbors back in pioneer times were the biggest jackasses that ever walked the face of the earth. Man don't you get it? We're all in the same boat, and it has painted on it's sides, The United States of America. If we can't \"rebuild the neighbors house,\" at least we shouldn't sit on the sidelines and shoot the people who are rebuilding it. Dave", 
        "reply": " The people \"rebuilding it\" are taxing me and everyone else to do so, that is not our problem. Sorry dave, what you and liberals alike are prescribing is full blown socialism.", 
        "threadID": "672198221_5480010422001", 
        "time": "2009-05-22 18:52:00", 
        "title": "The News \"talking heads\" speculate...", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by Grachus: quote: Originally posted by Irwin_R_Schyster: I had no idea we were all required to sacrifice a \"little bit\" so someone else can have a job. No one is guaranteed anything, life isn't fair. Its, \"Life, Liberty and the PURSUIT of happiness.\" Not guarantee. Back in pioneer days, if your house burned down, the neighbors would come from miles around to rebuild it for you. I ain't schiten you hear, that's what they did. In todays world, you lose your job and apartment, and you just plain drop out of the radar. You disappear, and neighbors will ask each other, \"What happened to the Jensen family? Haven't seem them in months?\" Well, in the thirties, during the Great Depression the government stepped in an filled the gap. Mind you, I'm not blamming the neighbors of this \"Jensen family,\" that's just the way a complex and modern society functions. But YOU sitting there muttering about (pardon the quotes), \"Well the market decides,\" and \"no body said life is fair,\" are in fact saying that those neighbors back in pioneer times were the biggest jackasses that ever walked the face of the earth. Man don't you get it? We're all in the same boat, and it has painted on it's sides, The United States of America. If we can't \"rebuild the neighbors house,\" at least we shouldn't sit on the sidelines and shoot the people who are rebuilding it. Dave The people \"rebuilding it\" are taxing me and everyone else to do so, that is not our problem. Sorry dave, what you and liberals alike are prescribing is full blown socialism. Already past the future", 
        "intTime": 20090522, 
        "postID": 37, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Originally posted by Grachus: quote: Originally posted by Irwin_R_Schyster: I had no idea we were all required to sacrifice a \"little bit\" so someone else can have a job. No one is guaranteed anything, life isn't fair. Its, \"Life, Liberty and the PURSUIT of happiness.\" Not guarantee. Back in pioneer days, if your house burned down, the neighbors would come from miles around to rebuild it for you. I ain't schiten you hear, that's what they did. In todays world, you lose your job and apartment, and you just plain drop out of the radar. You disappear, and neighbors will ask each other, \"What happened to the Jensen family? Haven't seem them in months?\" Well, in the thirties, during the Great Depression the government stepped in an filled the gap. Mind you, I'm not blamming the neighbors of this \"Jensen family,\" that's just the way a complex and modern society functions. But YOU sitting there muttering about (pardon the quotes), \"Well the market decides,\" and \"no body said life is fair,\" are in fact saying that those neighbors back in pioneer times were the biggest jackasses that ever walked the face of the earth. Man don't you get it? We're all in the same boat, and it has painted on it's sides, The United States of America. If we can't \"rebuild the neighbors house,\" at least we shouldn't sit on the sidelines and shoot the people who are rebuilding it. Dave The people \"rebuilding it\" are taxing me and everyone else to do so, that is not our problem. Sorry dave, what you and liberals alike are prescribing is full blown socialism.", 
        "reply": " Already past the future", 
        "threadID": "672198221_5480010422001", 
        "time": "2009-05-22 19:00:00", 
        "title": "The News \"talking heads\" speculate...", 
        "userID": "6486143"
    }, 
    {
        "content": "My personal belief is, that as usual, the truth of the matter lies between the diametrically opposed poles. What was intended under Roosevelt was a safety net for working persons who had experienced some calamity impacting their livelihood. Over the years, this became a welfare democracy...intent upon everything , up to and incuding, rectifying so called social injustices. Many of these programs incentivize Folks to stay on socialist like hand outs... What We are facing now is different...as the economy tanks, many are becoming unemployed who have worked their whole lives, supported their families, and paid their mortgages. Many are now expending what is left of their retirement funds and savings to keep their homes....and search for employment. It also appears that Government is expending \"future\" dollars to bail out entities that arent market driven...and investing in public works which arent improving the lot of many people. Under this current situation...the question remains...how may unemployed workers will constitute an actual depression? We need to focus on business stimulus and availability of capital in this regard. Howm many supppliers and contractors do you think the GM bankruptcy will impact???", 
        "intTime": 20090523, 
        "postID": 38, 
        "quote": "", 
        "reply": "My personal belief is, that as usual, the truth of the matter lies between the diametrically opposed poles. What was intended under Roosevelt was a safety net for working persons who had experienced some calamity impacting their livelihood. Over the years, this became a welfare democracy...intent upon everything , up to and incuding, rectifying so called social injustices. Many of these programs incentivize Folks to stay on socialist like hand outs... What We are facing now is different...as the economy tanks, many are becoming unemployed who have worked their whole lives, supported their families, and paid their mortgages. Many are now expending what is left of their retirement funds and savings to keep their homes....and search for employment. It also appears that Government is expending \"future\" dollars to bail out entities that arent market driven...and investing in public works which arent improving the lot of many people. Under this current situation...the question remains...how may unemployed workers will constitute an actual depression? We need to focus on business stimulus and availability of capital in this regard. Howm many supppliers and contractors do you think the GM bankruptcy will impact???", 
        "threadID": "672198221_5480010422001", 
        "time": "2009-05-23 14:08:00", 
        "title": "The News \"talking heads\" speculate...", 
        "userID": "strobelvets"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by Irwin_R_Schyster: I had no idea we were all required to sacrifice a \"little bit\" so someone else can have a job. No one is guaranteed anything, life isn't fair. Its, \"Life, Liberty and the PURSUIT of happiness.\" Not guarantee. Back in pioneer days, if your house burned down, the neighbors would come from miles around to rebuild it for you. I ain't schiten you hear, that's what they did. In todays world, you lose your job and apartment, and you just plain drop out of the radar. You disappear, and neighbors will ask each other, \"What happened to the Jensen family? Haven't seem them in months?\" Well, in the thirties, during the Great Depression the government stepped in an filled the gap. Mind you, I'm not blamming the neighbors of this \"Jensen family,\" that's just the way a complex and modern society functions. But YOU sitting there muttering about (pardon the quotes), \"Well the market decides,\" and \"no body said life is fair,\" are in fact saying that those neighbors back in pioneer times were the biggest jackasses that ever walked the face of the earth. Man don't you get it? We're all in the same boat, and it has painted on it's sides, The United States of America. If we can't \"rebuild the neighbors house,\" at least we shouldn't sit on the sidelines and shoot the people who are rebuilding it. Dave Dave that's exactly what I have been trying to tell some of these knuckle heads but they do not get it. We are neighbors whether we live right next door to each other or not. That is why I try to show them that by treating all people the way you would want to be treated is the right way for this country. That entails everything from giving PAID vacations to your employees to walking across the street and asking the neighbor that does live right beside you for assistance. But this new far right bunch of neo-anti-neighbor-anti-fellow-American citizenship republicans we got are out for themselves and themselves alone. Not to mention they place a dollar bill over all else. No wonder we have no family values and fall way short of Americans being good neighbors to each other which can all be attributed to many of the troubles we have in this nation...then they turn around and wonder what happen. They cry when someone suggest giving working people a vacation or giving them decent wages to live off of, but yet they rant and whine when they see themselves sinking because THEY made bad financial decisions like putting extra money in a gambling fund called 401k or gambling in another fund called STOCKS. Some of you should be flat out busted or broke but no, MY tax money went to save some of your sorry hides and then you turn around and argue against passing the good along to a fellow American in the form of a paid vacation for employees. Pure ridiculous. But like I said in the other thread, it does not matter because right now government is on the side of labor this go around, the middle man will not parish as much as some of you hoped would. As for GM, they will go bankrupt but they will not be gone. This bankruptcy will hurt ALLOT of retired people as well as workers, if fact it will more than likely cause a huge wave across this nation..but hey as long as the CEOs make their millions in pay and bonuses every, it's not greed and its' A ok. GM will restructure and it will go on. Unfortunetly, there the only restructuring many retired and current GM workers will get is directions to the food line and shelters. I will belive this until the day I die. If Americans wages had even somewhat kept up with the cost of everything else, the bank failures and all the others failures would not had happened or would not have even matter. The Reps destroyed this country people..do not ever trust them again in the whitehouse. \"Now hear this, Brace for Impact\"", 
        "intTime": 20090523, 
        "postID": 39, 
        "quote": "Originally posted by Grachus: quote: Originally posted by Irwin_R_Schyster: I had no idea we were all required to sacrifice a \"little bit\" so someone else can have a job. No one is guaranteed anything, life isn't fair. Its, \"Life, Liberty and the PURSUIT of happiness.\" Not guarantee. Back in pioneer days, if your house burned down, the neighbors would come from miles around to rebuild it for you. I ain't schiten you hear, that's what they did. In todays world, you lose your job and apartment, and you just plain drop out of the radar. You disappear, and neighbors will ask each other, \"What happened to the Jensen family? Haven't seem them in months?\" Well, in the thirties, during the Great Depression the government stepped in an filled the gap. Mind you, I'm not blamming the neighbors of this \"Jensen family,\" that's just the way a complex and modern society functions. But YOU sitting there muttering about (pardon the quotes), \"Well the market decides,\" and \"no body said life is fair,\" are in fact saying that those neighbors back in pioneer times were the biggest jackasses that ever walked the face of the earth. Man don't you get it? We're all in the same boat, and it has painted on it's sides, The United States of America. If we can't \"rebuild the neighbors house,\" at least we shouldn't sit on the sidelines and shoot the people who are rebuilding it. Dave", 
        "reply": " Dave that's exactly what I have been trying to tell some of these knuckle heads but they do not get it. We are neighbors whether we live right next door to each other or not. That is why I try to show them that by treating all people the way you would want to be treated is the right way for this country. That entails everything from giving PAID vacations to your employees to walking across the street and asking the neighbor that does live right beside you for assistance. But this new far right bunch of neo-anti-neighbor-anti-fellow-American citizenship republicans we got are out for themselves and themselves alone. Not to mention they place a dollar bill over all else. No wonder we have no family values and fall way short of Americans being good neighbors to each other which can all be attributed to many of the troubles we have in this nation...then they turn around and wonder what happen. They cry when someone suggest giving working people a vacation or giving them decent wages to live off of, but yet they rant and whine when they see themselves sinking because THEY made bad financial decisions like putting extra money in a gambling fund called 401k or gambling in another fund called STOCKS. Some of you should be flat out busted or broke but no, MY tax money went to save some of your sorry hides and then you turn around and argue against passing the good along to a fellow American in the form of a paid vacation for employees. Pure ridiculous. But like I said in the other thread, it does not matter because right now government is on the side of labor this go around, the middle man will not parish as much as some of you hoped would. As for GM, they will go bankrupt but they will not be gone. This bankruptcy will hurt ALLOT of retired people as well as workers, if fact it will more than likely cause a huge wave across this nation..but hey as long as the CEOs make their millions in pay and bonuses every, it's not greed and its' A ok. GM will restructure and it will go on. Unfortunetly, there the only restructuring many retired and current GM workers will get is directions to the food line and shelters. I will belive this until the day I die. If Americans wages had even somewhat kept up with the cost of everything else, the bank failures and all the others failures would not had happened or would not have even matter. The Reps destroyed this country people..do not ever trust them again in the whitehouse. \"Now hear this, Brace for Impact\"", 
        "threadID": "672198221_5480010422001", 
        "time": "2009-05-23 14:47:00", 
        "title": "The News \"talking heads\" speculate...", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Is it, \"We the People,\" or is it, \"Screw you Jack, I got mine.\" We the people = Democrats Screw you Jack, I got mine = The New Republicans", 
        "intTime": 20090523, 
        "postID": 40, 
        "quote": "Is it, \"We the People,\" or is it, \"Screw you Jack, I got mine.\"", 
        "reply": " We the people = Democrats Screw you Jack, I got mine = The New Republicans", 
        "threadID": "672198221_5480010422001", 
        "time": "2009-05-23 15:05:00", 
        "title": "The News \"talking heads\" speculate...", 
        "userID": "crackerjacks61"
    }
]