[
    {
        "content": "From the Long War Journal... quote: Excerpt 1 The US launched a covert airstrike against a Taliban safe house in Pakistan's Taliban-controlled tribal agency of South Waziristan. The US targeted a Taliban compound with an airstrike in the lawless tribal agency of South Waziristan, killing between five to ten terrorists. A swarm of unmanned Predator attack aircraft fired four missiles at a compound run by Taliban forces loyal to Baituallah Mehsud in the town of Sararogha, a US intelligence official told The Long War Journal. The official would not disclose the name of the Taliban or al Qaeda operatives targeted in the operation. The number killed is unclear, according to initial reports from Pakistan. \"Officials claimed 10 Taliban had been killed, a deputy Taliban commander said five were killed, the political administration claimed nine Taliban were killed, while tribesmen claimed they had counted 25 bodies,\" Daily Times reported. quote: Excerpt 2 Baitullah Mehsud leads alliance against the Pakistani government and the West Today's strike is the eighth recorded attack against camps and compounds in Baitullah's tribal areas. Baitullah is the leader of the Tehrik-e-Taliban, or the Movement of the Taliban in Pakistan, a group established in December of 2007 to unite disparate Taliban groups in Pakistan's northwest. The Tehrik-e-Taliban has led the insurgency and conducted many of the terror attacks against the Pakistani government. In February, Baitullah put aside tribal rivalries and joined forces with senior Taliban leaders Hafiz Gul Bahadar and Mullah Nazir in February of this year to form the Council of United Mujahideen. The three leaders said they \"united according to the wishes of Mujahideen leaders like Mullah Muhammad Omar and Sheikh Osama bin Laden.\"", 
        "intTime": 20090510, 
        "postID": 1, 
        "quote": "Excerpt 1 The US launched a covert airstrike against a Taliban safe house in Pakistan's Taliban-controlled tribal agency of South Waziristan. The US targeted a Taliban compound with an airstrike in the lawless tribal agency of South Waziristan, killing between five to ten terrorists. A swarm of unmanned Predator attack aircraft fired four missiles at a compound run by Taliban forces loyal to Baituallah Mehsud in the town of Sararogha, a US intelligence official told The Long War Journal. The official would not disclose the name of the Taliban or al Qaeda operatives targeted in the operation. The number killed is unclear, according to initial reports from Pakistan. \"Officials claimed 10 Taliban had been killed, a deputy Taliban commander said five were killed, the political administration claimed nine Taliban were killed, while tribesmen claimed they had counted 25 bodies,\" Daily Times reported.", 
        "reply": "From the Long War Journal...  quote: Excerpt 2 Baitullah Mehsud leads alliance against the Pakistani government and the West Today's strike is the eighth recorded attack against camps and compounds in Baitullah's tribal areas. Baitullah is the leader of the Tehrik-e-Taliban, or the Movement of the Taliban in Pakistan, a group established in December of 2007 to unite disparate Taliban groups in Pakistan's northwest. The Tehrik-e-Taliban has led the insurgency and conducted many of the terror attacks against the Pakistani government. In February, Baitullah put aside tribal rivalries and joined forces with senior Taliban leaders Hafiz Gul Bahadar and Mullah Nazir in February of this year to form the Council of United Mujahideen. The three leaders said they \"united according to the wishes of Mujahideen leaders like Mullah Muhammad Omar and Sheikh Osama bin Laden.\"", 
        "threadID": "672198221_7630069222001", 
        "time": "2009-05-10 09:01:00", 
        "title": "US strike targets Baitullah Mehsud territory in South Waziristan", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "It sure seems like we are conducting a lot more attacks against the Taliban lately, either that or it is finally being reported.", 
        "intTime": 20090510, 
        "postID": 2, 
        "quote": "", 
        "reply": "It sure seems like we are conducting a lot more attacks against the Taliban lately, either that or it is finally being reported.", 
        "threadID": "672198221_7630069222001", 
        "time": "2009-05-10 11:33:00", 
        "title": "US strike targets Baitullah Mehsud territory in South Waziristan", 
        "userID": "qsam6"
    }, 
    {
        "content": "Pakistan parliament is not even in session. As the blind leading the blind they're unable to function as the case has been since gaining independence 60 years ago. As war wages a hours drive from the Capital they continue to worry over Judges to be reinstated and Drone support from NATO, this while their leaders are calling for international assistance. Almost a comedy routine of who's on first. Musharaff was far from perfect but the Taliban would have never confronted him in this manner. \"A new national outcry against militancy seems to have even overshadowed complaints of violations of Pakistan’s sovereignty by anti-militant missile strikes into the Federally Administered Tribal Areas by US drones\". \"http://www.dawn.com/wps/wcm/connect/dawn-content-library/dawn/news/pakistan/05-parliament-set-to-debate-swat-operation-01 Tomorrows headlines: \"http://www.dawn.com/wps/wcm/connect/dawn-content-library/dawn/news/home/", 
        "intTime": 20090510, 
        "postID": 3, 
        "quote": "", 
        "reply": "Pakistan parliament is not even in session. As the blind leading the blind they're unable to function as the case has been since gaining independence 60 years ago. As war wages a hours drive from the Capital they continue to worry over Judges to be reinstated and Drone support from NATO, this while their leaders are calling for international assistance. Almost a comedy routine of who's on first. Musharaff was far from perfect but the Taliban would have never confronted him in this manner. \"A new national outcry against militancy seems to have even overshadowed complaints of violations of Pakistan’s sovereignty by anti-militant missile strikes into the Federally Administered Tribal Areas by US drones\". \"http://www.dawn.com/wps/wcm/connect/dawn-content-library/dawn/news/pakistan/05-parliament-set-to-debate-swat-operation-01 Tomorrows headlines: \"http://www.dawn.com/wps/wcm/connect/dawn-content-library/dawn/news/home/", 
        "threadID": "672198221_7630069222001", 
        "time": "2009-05-10 14:56:00", 
        "title": "US strike targets Baitullah Mehsud territory in South Waziristan", 
        "userID": "rayevinsonsr"
    }
]