[
    {
        "content": "The DOW is in deep doo doo. As expected, it opened -132 points, dropping us below 7,000. This isn't good, guys. History dictates that it is going to drop significantly more. This is the \"invisible line\" investors speak of when they decide to pull their diversities and pursue more liquid assets, specifically in commodity futures and precious metals. I admit that I don't know a whole bunch about it, but I know enough that the hair on the back of my neck is standing up a little this morning. What are you going to do? Pull out or ride it out? It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090302, 
        "postID": 1, 
        "quote": "", 
        "reply": "The DOW is in deep doo doo. As expected, it opened -132 points, dropping us below 7,000. This isn't good, guys. History dictates that it is going to drop significantly more. This is the \"invisible line\" investors speak of when they decide to pull their diversities and pursue more liquid assets, specifically in commodity futures and precious metals. I admit that I don't know a whole bunch about it, but I know enough that the hair on the back of my neck is standing up a little this morning. What are you going to do? Pull out or ride it out? It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "672198221_1720066612001", 
        "time": "2009-03-02 06:38:00", 
        "title": "Below 7,000 for the first time since 1987", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "Everyone I know who was short-selling stocks in October trying to cash in on the slump and over-leveraging themselves should be broke by now. Good. But in all seriousness, this is pretty bad for the overall economy.", 
        "intTime": 20090302, 
        "postID": 2, 
        "quote": "", 
        "reply": "Everyone I know who was short-selling stocks in October trying to cash in on the slump and over-leveraging themselves should be broke by now. Good. But in all seriousness, this is pretty bad for the overall economy.", 
        "threadID": "672198221_1720066612001", 
        "time": "2009-03-02 06:42:00", 
        "title": "Below 7,000 for the first time since 1987", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "The democrats may fool most of the people and Obama may talk a good game but the facts and truth of the matter is the stock market deals with numbers. The stock market is neither partisan nor bipartisan. People are taking their money out of the market and others simply are not investing into it. Do you think they are trying to tell us something? Why aren't we listening?", 
        "intTime": 20090302, 
        "postID": 3, 
        "quote": "", 
        "reply": "The democrats may fool most of the people and Obama may talk a good game but the facts and truth of the matter is the stock market deals with numbers. The stock market is neither partisan nor bipartisan. People are taking their money out of the market and others simply are not investing into it. Do you think they are trying to tell us something? Why aren't we listening?", 
        "threadID": "672198221_1720066612001", 
        "time": "2009-03-02 06:58:00", 
        "title": "Below 7,000 for the first time since 1987", 
        "userID": "Duster6"
    }, 
    {
        "content": "The markets have lost over 50% of their value since Obama became the presumptive nominee for the democratic party. They continue to respond negatively to Obama's march to socialism and government takeover. \"The World's Finest\"", 
        "intTime": 20090302, 
        "postID": 4, 
        "quote": "", 
        "reply": "The markets have lost over 50% of their value since Obama became the presumptive nominee for the democratic party. They continue to respond negatively to Obama's march to socialism and government takeover. \"The World's Finest\"", 
        "threadID": "672198221_1720066612001", 
        "time": "2009-03-02 07:10:00", 
        "title": "Below 7,000 for the first time since 1987", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: The markets have lost over 50% of their value since Obama became the presumptive nominee for the democratic party. Your logic is awful. I mean, Bush was still President until January. You definitely make some of the most outright biased posts on this board. Blaming the fall from October to January on a man who was a Senator? Wasn't McCain a favorite to win the election in the early months? Argh.", 
        "intTime": 20090302, 
        "postID": 5, 
        "quote": "Originally posted by Kegler300: The markets have lost over 50% of their value since Obama became the presumptive nominee for the democratic party.", 
        "reply": " Your logic is awful. I mean, Bush was still President until January. You definitely make some of the most outright biased posts on this board. Blaming the fall from October to January on a man who was a Senator? Wasn't McCain a favorite to win the election in the early months? Argh.", 
        "threadID": "672198221_1720066612001", 
        "time": "2009-03-02 07:15:00", 
        "title": "Below 7,000 for the first time since 1987", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "I called it, guessed 6500 yeasterday... We'll see - - Wandering and Wondering", 
        "intTime": 20090302, 
        "postID": 6, 
        "quote": "", 
        "reply": "I called it, guessed 6500 yeasterday... We'll see - - Wandering and Wondering", 
        "threadID": "672198221_1720066612001", 
        "time": "2009-03-02 07:16:00", 
        "title": "Below 7,000 for the first time since 1987", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by Duster6: The democrats may fool most of the people and Obama may talk a good game but the facts and truth of the matter is the stock market deals with numbers. The stock market is neither partisan nor bipartisan. People are taking their money out of the market and others simply are not investing into it. Do you think they are trying to tell us something? Why aren't we listening? The stock market is a religion - it is faith based. When faith declines, attendance follows. FOX (Megyn Kelley) is stating that the latest $300 billion AIG bailout is the speculative force behind the drop, though she doesn't cite any sources I am personally familiar with. It does makes sense, though, given that Friday was all over the place at its close. I don't have any stocks and a VERY small 401(k) (which is all long-term anyway), so it affects me only in the job market. But I sure do feel bad for those with large portfolios. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090302, 
        "postID": 7, 
        "quote": "Originally posted by Duster6: The democrats may fool most of the people and Obama may talk a good game but the facts and truth of the matter is the stock market deals with numbers. The stock market is neither partisan nor bipartisan. People are taking their money out of the market and others simply are not investing into it. Do you think they are trying to tell us something? Why aren't we listening?", 
        "reply": " The stock market is a religion - it is faith based. When faith declines, attendance follows. FOX (Megyn Kelley) is stating that the latest $300 billion AIG bailout is the speculative force behind the drop, though she doesn't cite any sources I am personally familiar with. It does makes sense, though, given that Friday was all over the place at its close. I don't have any stocks and a VERY small 401(k) (which is all long-term anyway), so it affects me only in the job market. But I sure do feel bad for those with large portfolios. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "672198221_1720066612001", 
        "time": "2009-03-02 07:19:00", 
        "title": "Below 7,000 for the first time since 1987", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Originally posted by greywolfghost: I called it, guessed 6500 yeasterday... We'll see - - We're at 6,900 right now. It'll steady there a bit, and by close paper will once again start flinging to determine tomorrow's opening. These are frightening times for many people. I hope you're wrong, I really do. But I'd wager that you're very close in your prediction. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090302, 
        "postID": 8, 
        "quote": "Originally posted by greywolfghost: I called it, guessed 6500 yeasterday... We'll see - -", 
        "reply": " We're at 6,900 right now. It'll steady there a bit, and by close paper will once again start flinging to determine tomorrow's opening. These are frightening times for many people. I hope you're wrong, I really do. But I'd wager that you're very close in your prediction. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "672198221_1720066612001", 
        "time": "2009-03-02 07:22:00", 
        "title": "Below 7,000 for the first time since 1987", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Originally posted by FollowMeInfantry: quote: Originally posted by Duster6: The democrats may fool most of the people and Obama may talk a good game but the facts and truth of the matter is the stock market deals with numbers. The stock market is neither partisan nor bipartisan. People are taking their money out of the market and others simply are not investing into it. Do you think they are trying to tell us something? Why aren't we listening? The stock market is a religion - it is faith based. When faith declines, attendance follows. FOX (Megyn Kelley) is stating that the latest $300 billion AIG bailout is the speculative force behind the drop, though she doesn't cite any sources I am personally familiar with. It does makes sense, though, given that Friday was all over the place at its close. I don't have any stocks and a VERY small 401(k) (which is all long-term anyway), so it affects me only in the job market. But I sure do feel bad for those with large portfolios. Excellent analogy!! !! The worship of money (is) the root of all (Madoff ) EVIL!! and misery and war and death follow thereafter - - Wandering and Wondering", 
        "intTime": 20090302, 
        "postID": 9, 
        "quote": "Originally posted by FollowMeInfantry: quote: Originally posted by Duster6: The democrats may fool most of the people and Obama may talk a good game but the facts and truth of the matter is the stock market deals with numbers. The stock market is neither partisan nor bipartisan. People are taking their money out of the market and others simply are not investing into it. Do you think they are trying to tell us something? Why aren't we listening? The stock market is a religion - it is faith based. When faith declines, attendance follows. FOX (Megyn Kelley) is stating that the latest $300 billion AIG bailout is the speculative force behind the drop, though she doesn't cite any sources I am personally familiar with. It does makes sense, though, given that Friday was all over the place at its close. I don't have any stocks and a VERY small 401(k) (which is all long-term anyway), so it affects me only in the job market. But I sure do feel bad for those with large portfolios.", 
        "reply": " Excellent analogy!! !! The worship of money (is) the root of all (Madoff ) EVIL!! and misery and war and death follow thereafter - - Wandering and Wondering", 
        "threadID": "672198221_1720066612001", 
        "time": "2009-03-02 07:22:00", 
        "title": "Below 7,000 for the first time since 1987", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "AIG is back at the plate, er trough, again to-day looking for its third bailout. The company that was 'too big to fail' needs another infusion of your cash. Question is, where is all the cash going ... it's pretty apparently not into circulation. On the bright side, if this keeps up, the dollar is going to have to be devalued - then listen to those sitting of piles of paper start howling. Forget gold, there's an untapped market in tin cups and patriotic pencils out there.", 
        "intTime": 20090302, 
        "postID": 10, 
        "quote": "", 
        "reply": "AIG is back at the plate, er trough, again to-day looking for its third bailout. The company that was 'too big to fail' needs another infusion of your cash. Question is, where is all the cash going ... it's pretty apparently not into circulation. On the bright side, if this keeps up, the dollar is going to have to be devalued - then listen to those sitting of piles of paper start howling. Forget gold, there's an untapped market in tin cups and patriotic pencils out there.", 
        "threadID": "672198221_1720066612001", 
        "time": "2009-03-02 07:23:00", 
        "title": "Below 7,000 for the first time since 1987", 
        "userID": "popsiq"
    }, 
    {
        "content": "Kind of makes you glad the democrats won out when Bush wanted to turn Social Security into a \"thrift savings plan\", huh? (Not a newbie -- new screen name for 1welderswife.)", 
        "intTime": 20090302, 
        "postID": 11, 
        "quote": "", 
        "reply": "Kind of makes you glad the democrats won out when Bush wanted to turn Social Security into a \"thrift savings plan\", huh? (Not a newbie -- new screen name for 1welderswife.)", 
        "threadID": "672198221_1720066612001", 
        "time": "2009-03-02 07:40:00", 
        "title": "Below 7,000 for the first time since 1987", 
        "userID": "1WW"
    }, 
    {
        "content": "quote: Originally posted by popsiq: AIG is back at the plate, er trough, again to-day looking for its third bailout. The company that was 'too big to fail' needs another infusion of your cash. Question is, where is all the cash going ... it's pretty apparently not into circulation. On the bright side, if this keeps up, the dollar is going to have to be devalued - then listen to those sitting of piles of paper start howling. Forget gold, there's an untapped market in tin cups and patriotic pencils out there. LMAO! So funny, but so VERY true! Where the hell do we draw the line? You know what I think? I think the military, including us, deserves a bailout. To hell with the banks and their million dollar vacations. If anyone deserves a vacation, it is our troops. Where the hell IS all that money going? That's a great question. Apparently Wall Street doesn't know, either, or they wouldn't be bailing themselves out by pulling their money and reinvesting in liquidity outside of paper. There is no way to fix this without devaluing the dollar, which is just going to kill the banks even more as their capital hedging is in the Euro Dollar. Sigh... I am so confused... It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090302, 
        "postID": 12, 
        "quote": "Originally posted by popsiq: AIG is back at the plate, er trough, again to-day looking for its third bailout. The company that was 'too big to fail' needs another infusion of your cash. Question is, where is all the cash going ... it's pretty apparently not into circulation. On the bright side, if this keeps up, the dollar is going to have to be devalued - then listen to those sitting of piles of paper start howling. Forget gold, there's an untapped market in tin cups and patriotic pencils out there.", 
        "reply": " LMAO! So funny, but so VERY true! Where the hell do we draw the line? You know what I think? I think the military, including us, deserves a bailout. To hell with the banks and their million dollar vacations. If anyone deserves a vacation, it is our troops. Where the hell IS all that money going? That's a great question. Apparently Wall Street doesn't know, either, or they wouldn't be bailing themselves out by pulling their money and reinvesting in liquidity outside of paper. There is no way to fix this without devaluing the dollar, which is just going to kill the banks even more as their capital hedging is in the Euro Dollar. Sigh... I am so confused... It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "672198221_1720066612001", 
        "time": "2009-03-02 07:43:00", 
        "title": "Below 7,000 for the first time since 1987", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Originally posted by 1WW: Kind of makes you glad the democrats won out when Bush wanted to turn Social Security into a \"thrift savings plan\", huh? (Not a newbie -- new screen name for 1welderswife.) Let's not spin this political, babe. This was coming for a long time, and it wouldn't have mattered what moniker following a name warmed the seat behind the decision desk. As a conservative, I hate to admit that this is where capitalism fails in its own way. We've all heard the adage of the rich getting richer and the poor getting poorer. For 30 years we've been eliminating the middle class. People are scared to talk about balance, because it makes the welfare demographic get a damn job while it forces wages to compensate so that CEO's aren't making $500 million a year while their employees struggle to buy groceries. Everyone thinks their way is better. Including me - heh. But we're going to have to pull together at some point or we're all going to continue to suffer. The local construction company is going to have to lower their profit margins on the promise that the local investor will buy the final product for a reasonable rate. Then they can hire people who will then have money to spend to stimulate the growth, promoting new jobs. Do that enough, the economy will fix itself just through pure confidence in the STABILITY of the dollar. That's what we're lacking and that's why the market has tanked. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090302, 
        "postID": 13, 
        "quote": "Originally posted by 1WW: Kind of makes you glad the democrats won out when Bush wanted to turn Social Security into a \"thrift savings plan\", huh? (Not a newbie -- new screen name for 1welderswife.)", 
        "reply": " Let's not spin this political, babe. This was coming for a long time, and it wouldn't have mattered what moniker following a name warmed the seat behind the decision desk. As a conservative, I hate to admit that this is where capitalism fails in its own way. We've all heard the adage of the rich getting richer and the poor getting poorer. For 30 years we've been eliminating the middle class. People are scared to talk about balance, because it makes the welfare demographic get a damn job while it forces wages to compensate so that CEO's aren't making $500 million a year while their employees struggle to buy groceries. Everyone thinks their way is better. Including me - heh. But we're going to have to pull together at some point or we're all going to continue to suffer. The local construction company is going to have to lower their profit margins on the promise that the local investor will buy the final product for a reasonable rate. Then they can hire people who will then have money to spend to stimulate the growth, promoting new jobs. Do that enough, the economy will fix itself just through pure confidence in the STABILITY of the dollar. That's what we're lacking and that's why the market has tanked. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "672198221_1720066612001", 
        "time": "2009-03-02 07:51:00", 
        "title": "Below 7,000 for the first time since 1987", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Originally posted by FollowMeInfantry: quote: Originally posted by 1WW: Kind of makes you glad the democrats won out when Bush wanted to turn Social Security into a \"thrift savings plan\", huh? (Not a newbie -- new screen name for 1welderswife.) Let's not spin this political, babe. This was coming for a long time, and it wouldn't have mattered what moniker following a name warmed the seat behind the decision desk. As a conservative, I hate to admit that this is where capitalism fails in its own way. We've all heard the adage of the rich getting richer and the poor getting poorer. For 30 years we've been eliminating the middle class. People are scared to talk about balance, because it makes the welfare demographic get a damn job while it forces wages to compensate so that CEO's aren't making $500 million a year while their employees struggle to buy groceries. Everyone thinks their way is better. Including me - heh. But we're going to have to pull together at some point or we're all going to continue to suffer. The local construction company is going to have to lower their profit margins on the promise that the local investor will buy the final product for a reasonable rate. Then they can hire people who will then have money to spend to stimulate the growth, promoting new jobs. Do that enough, the economy will fix itself just through pure confidence in the STABILITY of the dollar. That's what we're lacking and that's why the market has tanked. Great wordsmithing, babe. As always. But instead of couching my comment as a rhetorical question, I'll address it as a true one: Aren't you glad the democrats won out when Bush wanted to turn Social Security into a \"thrift savings plan\"?", 
        "intTime": 20090302, 
        "postID": 14, 
        "quote": "Originally posted by FollowMeInfantry: quote: Originally posted by 1WW: Kind of makes you glad the democrats won out when Bush wanted to turn Social Security into a \"thrift savings plan\", huh? (Not a newbie -- new screen name for 1welderswife.) Let's not spin this political, babe. This was coming for a long time, and it wouldn't have mattered what moniker following a name warmed the seat behind the decision desk. As a conservative, I hate to admit that this is where capitalism fails in its own way. We've all heard the adage of the rich getting richer and the poor getting poorer. For 30 years we've been eliminating the middle class. People are scared to talk about balance, because it makes the welfare demographic get a damn job while it forces wages to compensate so that CEO's aren't making $500 million a year while their employees struggle to buy groceries. Everyone thinks their way is better. Including me - heh. But we're going to have to pull together at some point or we're all going to continue to suffer. The local construction company is going to have to lower their profit margins on the promise that the local investor will buy the final product for a reasonable rate. Then they can hire people who will then have money to spend to stimulate the growth, promoting new jobs. Do that enough, the economy will fix itself just through pure confidence in the STABILITY of the dollar. That's what we're lacking and that's why the market has tanked.", 
        "reply": " Great wordsmithing, babe. As always. But instead of couching my comment as a rhetorical question, I'll address it as a true one: Aren't you glad the democrats won out when Bush wanted to turn Social Security into a \"thrift savings plan\"?", 
        "threadID": "672198221_1720066612001", 
        "time": "2009-03-02 08:04:00", 
        "title": "Below 7,000 for the first time since 1987", 
        "userID": "1WW"
    }, 
    {
        "content": "quote: Aren't you glad the democrats won out when Bush wanted to turn Social Security into a \"thrift savings plan\"? Not particularly. Since the proposal only called for privatizing (not a particularly apt word but that's what was used) a relatively small portion of SS, and at that on a voluntary basis and with a fixed selection of investment choices, it would have been a \"good thing\" IMHO for the long term. It would have had no impact on those currently drawing SS and would be building low cost, high potential portfolios for those with an investment window outside 5-10 years. I'd far rather see that than Congress continue to borrow the SS surplus and spend it out ... knowing full well they have no hope of ever repaying the trust fund the trillions that are currently owed it. Oddly, and much to my surprise, President Obama proposed private savings accounts in conjunction with SS reform in his speech to Congress last week. I thought Speaker Pelosi was going to collapse.", 
        "intTime": 20090302, 
        "postID": 15, 
        "quote": "Aren't you glad the democrats won out when Bush wanted to turn Social Security into a \"thrift savings plan\"?", 
        "reply": " Not particularly. Since the proposal only called for privatizing (not a particularly apt word but that's what was used) a relatively small portion of SS, and at that on a voluntary basis and with a fixed selection of investment choices, it would have been a \"good thing\" IMHO for the long term. It would have had no impact on those currently drawing SS and would be building low cost, high potential portfolios for those with an investment window outside 5-10 years. I'd far rather see that than Congress continue to borrow the SS surplus and spend it out ... knowing full well they have no hope of ever repaying the trust fund the trillions that are currently owed it. Oddly, and much to my surprise, President Obama proposed private savings accounts in conjunction with SS reform in his speech to Congress last week. I thought Speaker Pelosi was going to collapse.", 
        "threadID": "672198221_1720066612001", 
        "time": "2009-03-02 08:23:00", 
        "title": "Below 7,000 for the first time since 1987", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by Kegler300: The markets have lost over 50% of their value since Obama became the presumptive nominee for the democratic party. Your logic is awful. I mean, Bush was still President until January. You definitely make some of the most outright biased posts on this board. Blaming the fall from October to January on a man who was a Senator? Wasn't McCain a favorite to win the election in the early months? Argh. No he wasn't favored. I am not in the stock market thank goodness. I've also thought of the stock market as being an overall barometer of a number of things. Comsumer confidence; confidence in the government; confidence in security issues both interal and international. How can anyone, including the stock market act any differently to the massive debt we will have if all of the democrats plans are passed! I heard somewhere this weekend that we have are fingers in the dike but it's collapsing around us. I'll admit I'm not the greatest economics expert but my confidence in what's happening in congress or the white house has never been lower! What physcal responsibility is obama talking about? As far as the continued blasting of President Bush, the markets react for what they believe exists but the greater emphasis is on what the future holds in store for us.", 
        "intTime": 20090302, 
        "postID": 16, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by Kegler300: The markets have lost over 50% of their value since Obama became the presumptive nominee for the democratic party. Your logic is awful. I mean, Bush was still President until January. You definitely make some of the most outright biased posts on this board. Blaming the fall from October to January on a man who was a Senator? Wasn't McCain a favorite to win the election in the early months? Argh.", 
        "reply": " No he wasn't favored. I am not in the stock market thank goodness. I've also thought of the stock market as being an overall barometer of a number of things. Comsumer confidence; confidence in the government; confidence in security issues both interal and international. How can anyone, including the stock market act any differently to the massive debt we will have if all of the democrats plans are passed! I heard somewhere this weekend that we have are fingers in the dike but it's collapsing around us. I'll admit I'm not the greatest economics expert but my confidence in what's happening in congress or the white house has never been lower! What physcal responsibility is obama talking about? As far as the continued blasting of President Bush, the markets react for what they believe exists but the greater emphasis is on what the future holds in store for us.", 
        "threadID": "672198221_1720066612001", 
        "time": "2009-03-02 08:29:00", 
        "title": "Below 7,000 for the first time since 1987", 
        "userID": "busnrete8"
    }, 
    {
        "content": "quote: Originally posted by I_M_Qwerty: I thought Speaker Pelosi was going to collapse. I wish she would. She and the president are not on the same page on quite a few issues.", 
        "intTime": 20090302, 
        "postID": 17, 
        "quote": "Originally posted by I_M_Qwerty: I thought Speaker Pelosi was going to collapse.", 
        "reply": " I wish she would. She and the president are not on the same page on quite a few issues.", 
        "threadID": "672198221_1720066612001", 
        "time": "2009-03-02 08:39:00", 
        "title": "Below 7,000 for the first time since 1987", 
        "userID": "1WW"
    }, 
    {
        "content": "quote: Originally posted by 1WW: quote: Originally posted by I_M_Qwerty: I thought Speaker Pelosi was going to collapse. I wish she would. She and the president are not on the same page on quite a few issues. While we disagree on some things, we've at least that much in common. While I disagree with POTUS 44 on some issues, I agree on a goodly number of other ones. As I've mentioned before, I think the greatest challenge to his agenda ... and responsible leadership ... is going to settle out to be the far left in his own party, particularly the House leadership. I rather doubt he was privately very happy with the stimulus bill, for example. Infrastructure ended up getting a relatively paltry 58 billion ... barely a dent in the backlog. Like your \"1WW\" BTW ... have used it in addressing you a few times before and am glad to see it now has legitimacy! Regards -", 
        "intTime": 20090302, 
        "postID": 18, 
        "quote": "Originally posted by 1WW: quote: Originally posted by I_M_Qwerty: I thought Speaker Pelosi was going to collapse. I wish she would. She and the president are not on the same page on quite a few issues.", 
        "reply": " While we disagree on some things, we've at least that much in common. While I disagree with POTUS 44 on some issues, I agree on a goodly number of other ones. As I've mentioned before, I think the greatest challenge to his agenda ... and responsible leadership ... is going to settle out to be the far left in his own party, particularly the House leadership. I rather doubt he was privately very happy with the stimulus bill, for example. Infrastructure ended up getting a relatively paltry 58 billion ... barely a dent in the backlog. Like your \"1WW\" BTW ... have used it in addressing you a few times before and am glad to see it now has legitimacy! Regards -", 
        "threadID": "672198221_1720066612001", 
        "time": "2009-03-02 08:53:00", 
        "title": "Below 7,000 for the first time since 1987", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "Ride it out. Once all the crap is burned off, things will be fine. Hang on.", 
        "intTime": 20090302, 
        "postID": 19, 
        "quote": "", 
        "reply": "Ride it out. Once all the crap is burned off, things will be fine. Hang on.", 
        "threadID": "672198221_1720066612001", 
        "time": "2009-03-02 08:57:00", 
        "title": "Below 7,000 for the first time since 1987", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by 1WW: Great wordsmithing, babe. As always. But instead of couching my comment as a rhetorical question, I'll address it as a true one: Aren't you glad the democrats won out when Bush wanted to turn Social Security into a \"thrift savings plan\"? I offered no direct retort as the question is irrelevant. The stock market, now below 6,800, is not reacting to Mr. Bush's theory of Social Security reform. It is the atypical leftist approach to sway the discussion benefits by interjecting a tangent that is not only a red herring fallacy, but that detracts from the focus. Had I wanted to discuss Social Security reform's impact on the NYSE, I would have done so. As much as I love you, some days I sure could slap the crap out of you. (This is going to cost me a few nights on the couch, isn't it?) But I'm your Huckleberry. The stock market is an entity of its own accord. It reacts to outside influence to survive, and it retreats where necessary. As my friend I_M_Qwerty so astutely points out, the proposed deft re-management of the Social Security system was more akin to your 401(k) than it was any government control. Like your 401, SS funds would have been invested by experts in their field given the current expected rate of return and based on its marginal risk for breakeven. Where the bell curve begins to hedge, T-Bills are utilized (or similar). It's all about speculation. This doesn't scare investors as it is flexible, there is accountability, and long-term investments are almost always a surety. It differs from the current bailout packages in that the stability of the international dollar is now in question. Banks leverage against foreign funds to protect their capital, whereas the proposed changes to SS would not have. When you \"give\" money to a bank, you are, in essence, loaning money to your best friend that just lost all his money at the Blackjack table for the 5th time this week. If you have 5 friends and 1 needs $100 to pay his cable bill, how likely are you and the other 4 to each kick in a $20 bill if that friend in need wasted all his money instead of paying his bill? That is the stock market. And that is their reaction to the bank bailouts. But SS reform was different. While it was indeed irresponsibly managed and spent, the idea was to change money handlers. That is, you may be willing to commit your $20 to your friend, but only if you pay his bill for him or you use his responsible mother and give HER the money. In other words, one is about accountability for funding. That was the SS reformat. The other is faith that money won't be used irresponsibly by the same friend that abused it before. That is a bailout that occurs twice. So, they are not the same -- not by a long shot -- and investors have lost faith in the money handlers and are choosing to pay their own bills. And those leveraged against their investments, the smaller investors, are paying the price as confidence erodes, which drives the circle that is both consumer confidence and consumer spending. The dollar value tanks, so while you're still paying 99 cents for a loaf or bread, that 99 cents-by-effort-dollar yesterday is now $1.50-by-effort-dollar today. And people stop buying bread unless they have to. Are you baiting me, sweetie? It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090302, 
        "postID": 20, 
        "quote": "Originally posted by 1WW: Great wordsmithing, babe. As always. But instead of couching my comment as a rhetorical question, I'll address it as a true one: Aren't you glad the democrats won out when Bush wanted to turn Social Security into a \"thrift savings plan\"?", 
        "reply": " I offered no direct retort as the question is irrelevant. The stock market, now below 6,800, is not reacting to Mr. Bush's theory of Social Security reform. It is the atypical leftist approach to sway the discussion benefits by interjecting a tangent that is not only a red herring fallacy, but that detracts from the focus. Had I wanted to discuss Social Security reform's impact on the NYSE, I would have done so. As much as I love you, some days I sure could slap the crap out of you. (This is going to cost me a few nights on the couch, isn't it?) But I'm your Huckleberry. The stock market is an entity of its own accord. It reacts to outside influence to survive, and it retreats where necessary. As my friend I_M_Qwerty so astutely points out, the proposed deft re-management of the Social Security system was more akin to your 401(k) than it was any government control. Like your 401, SS funds would have been invested by experts in their field given the current expected rate of return and based on its marginal risk for breakeven. Where the bell curve begins to hedge, T-Bills are utilized (or similar). It's all about speculation. This doesn't scare investors as it is flexible, there is accountability, and long-term investments are almost always a surety. It differs from the current bailout packages in that the stability of the international dollar is now in question. Banks leverage against foreign funds to protect their capital, whereas the proposed changes to SS would not have. When you \"give\" money to a bank, you are, in essence, loaning money to your best friend that just lost all his money at the Blackjack table for the 5th time this week. If you have 5 friends and 1 needs $100 to pay his cable bill, how likely are you and the other 4 to each kick in a $20 bill if that friend in need wasted all his money instead of paying his bill? That is the stock market. And that is their reaction to the bank bailouts. But SS reform was different. While it was indeed irresponsibly managed and spent, the idea was to change money handlers. That is, you may be willing to commit your $20 to your friend, but only if you pay his bill for him or you use his responsible mother and give HER the money. In other words, one is about accountability for funding. That was the SS reformat. The other is faith that money won't be used irresponsibly by the same friend that abused it before. That is a bailout that occurs twice. So, they are not the same -- not by a long shot -- and investors have lost faith in the money handlers and are choosing to pay their own bills. And those leveraged against their investments, the smaller investors, are paying the price as confidence erodes, which drives the circle that is both consumer confidence and consumer spending. The dollar value tanks, so while you're still paying 99 cents for a loaf or bread, that 99 cents-by-effort-dollar yesterday is now $1.50-by-effort-dollar today. And people stop buying bread unless they have to. Are you baiting me, sweetie? It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "672198221_1720066612001", 
        "time": "2009-03-02 09:01:00", 
        "title": "Below 7,000 for the first time since 1987", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "The DOW is in deep doo doo. As expected, it opened -132 points, dropping us below 7,000. This isn't good, guys. History dictates that it is going to drop significantly more. This is the \"invisible line\" investors speak of when they decide to pull their diversities and pursue more liquid assets, specifically in commodity futures and precious metals. I admit that I don't know a whole bunch about it, but I know enough that the hair on the back of my neck is standing up a little this morning. What are you going to do? Pull out or ride it out? It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090302, 
        "postID": 21, 
        "quote": "", 
        "reply": "The DOW is in deep doo doo. As expected, it opened -132 points, dropping us below 7,000. This isn't good, guys. History dictates that it is going to drop significantly more. This is the \"invisible line\" investors speak of when they decide to pull their diversities and pursue more liquid assets, specifically in commodity futures and precious metals. I admit that I don't know a whole bunch about it, but I know enough that the hair on the back of my neck is standing up a little this morning. What are you going to do? Pull out or ride it out? It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "672198221_1720066612001", 
        "time": "2009-03-02 06:38:00", 
        "title": "Below 7,000 for the first time since 1987", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "Everyone I know who was short-selling stocks in October trying to cash in on the slump and over-leveraging themselves should be broke by now. Good. But in all seriousness, this is pretty bad for the overall economy.", 
        "intTime": 20090302, 
        "postID": 22, 
        "quote": "", 
        "reply": "Everyone I know who was short-selling stocks in October trying to cash in on the slump and over-leveraging themselves should be broke by now. Good. But in all seriousness, this is pretty bad for the overall economy.", 
        "threadID": "672198221_1720066612001", 
        "time": "2009-03-02 06:42:00", 
        "title": "Below 7,000 for the first time since 1987", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "The democrats may fool most of the people and Obama may talk a good game but the facts and truth of the matter is the stock market deals with numbers. The stock market is neither partisan nor bipartisan. People are taking their money out of the market and others simply are not investing into it. Do you think they are trying to tell us something? Why aren't we listening?", 
        "intTime": 20090302, 
        "postID": 23, 
        "quote": "", 
        "reply": "The democrats may fool most of the people and Obama may talk a good game but the facts and truth of the matter is the stock market deals with numbers. The stock market is neither partisan nor bipartisan. People are taking their money out of the market and others simply are not investing into it. Do you think they are trying to tell us something? Why aren't we listening?", 
        "threadID": "672198221_1720066612001", 
        "time": "2009-03-02 06:58:00", 
        "title": "Below 7,000 for the first time since 1987", 
        "userID": "Duster6"
    }, 
    {
        "content": "The markets have lost over 50% of their value since Obama became the presumptive nominee for the democratic party. They continue to respond negatively to Obama's march to socialism and government takeover. \"The World's Finest\"", 
        "intTime": 20090302, 
        "postID": 24, 
        "quote": "", 
        "reply": "The markets have lost over 50% of their value since Obama became the presumptive nominee for the democratic party. They continue to respond negatively to Obama's march to socialism and government takeover. \"The World's Finest\"", 
        "threadID": "672198221_1720066612001", 
        "time": "2009-03-02 07:10:00", 
        "title": "Below 7,000 for the first time since 1987", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: The markets have lost over 50% of their value since Obama became the presumptive nominee for the democratic party. Your logic is awful. I mean, Bush was still President until January. You definitely make some of the most outright biased posts on this board. Blaming the fall from October to January on a man who was a Senator? Wasn't McCain a favorite to win the election in the early months? Argh.", 
        "intTime": 20090302, 
        "postID": 25, 
        "quote": "Originally posted by Kegler300: The markets have lost over 50% of their value since Obama became the presumptive nominee for the democratic party.", 
        "reply": " Your logic is awful. I mean, Bush was still President until January. You definitely make some of the most outright biased posts on this board. Blaming the fall from October to January on a man who was a Senator? Wasn't McCain a favorite to win the election in the early months? Argh.", 
        "threadID": "672198221_1720066612001", 
        "time": "2009-03-02 07:15:00", 
        "title": "Below 7,000 for the first time since 1987", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "I called it, guessed 6500 yeasterday... We'll see - - Wandering and Wondering", 
        "intTime": 20090302, 
        "postID": 26, 
        "quote": "", 
        "reply": "I called it, guessed 6500 yeasterday... We'll see - - Wandering and Wondering", 
        "threadID": "672198221_1720066612001", 
        "time": "2009-03-02 07:16:00", 
        "title": "Below 7,000 for the first time since 1987", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by Duster6: The democrats may fool most of the people and Obama may talk a good game but the facts and truth of the matter is the stock market deals with numbers. The stock market is neither partisan nor bipartisan. People are taking their money out of the market and others simply are not investing into it. Do you think they are trying to tell us something? Why aren't we listening? The stock market is a religion - it is faith based. When faith declines, attendance follows. FOX (Megyn Kelley) is stating that the latest $300 billion AIG bailout is the speculative force behind the drop, though she doesn't cite any sources I am personally familiar with. It does makes sense, though, given that Friday was all over the place at its close. I don't have any stocks and a VERY small 401(k) (which is all long-term anyway), so it affects me only in the job market. But I sure do feel bad for those with large portfolios. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090302, 
        "postID": 27, 
        "quote": "Originally posted by Duster6: The democrats may fool most of the people and Obama may talk a good game but the facts and truth of the matter is the stock market deals with numbers. The stock market is neither partisan nor bipartisan. People are taking their money out of the market and others simply are not investing into it. Do you think they are trying to tell us something? Why aren't we listening?", 
        "reply": " The stock market is a religion - it is faith based. When faith declines, attendance follows. FOX (Megyn Kelley) is stating that the latest $300 billion AIG bailout is the speculative force behind the drop, though she doesn't cite any sources I am personally familiar with. It does makes sense, though, given that Friday was all over the place at its close. I don't have any stocks and a VERY small 401(k) (which is all long-term anyway), so it affects me only in the job market. But I sure do feel bad for those with large portfolios. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "672198221_1720066612001", 
        "time": "2009-03-02 07:19:00", 
        "title": "Below 7,000 for the first time since 1987", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Originally posted by greywolfghost: I called it, guessed 6500 yeasterday... We'll see - - We're at 6,900 right now. It'll steady there a bit, and by close paper will once again start flinging to determine tomorrow's opening. These are frightening times for many people. I hope you're wrong, I really do. But I'd wager that you're very close in your prediction. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090302, 
        "postID": 28, 
        "quote": "Originally posted by greywolfghost: I called it, guessed 6500 yeasterday... We'll see - -", 
        "reply": " We're at 6,900 right now. It'll steady there a bit, and by close paper will once again start flinging to determine tomorrow's opening. These are frightening times for many people. I hope you're wrong, I really do. But I'd wager that you're very close in your prediction. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "672198221_1720066612001", 
        "time": "2009-03-02 07:22:00", 
        "title": "Below 7,000 for the first time since 1987", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Originally posted by FollowMeInfantry: quote: Originally posted by Duster6: The democrats may fool most of the people and Obama may talk a good game but the facts and truth of the matter is the stock market deals with numbers. The stock market is neither partisan nor bipartisan. People are taking their money out of the market and others simply are not investing into it. Do you think they are trying to tell us something? Why aren't we listening? The stock market is a religion - it is faith based. When faith declines, attendance follows. FOX (Megyn Kelley) is stating that the latest $300 billion AIG bailout is the speculative force behind the drop, though she doesn't cite any sources I am personally familiar with. It does makes sense, though, given that Friday was all over the place at its close. I don't have any stocks and a VERY small 401(k) (which is all long-term anyway), so it affects me only in the job market. But I sure do feel bad for those with large portfolios. Excellent analogy!! !! The worship of money (is) the root of all (Madoff ) EVIL!! and misery and war and death follow thereafter - - Wandering and Wondering", 
        "intTime": 20090302, 
        "postID": 29, 
        "quote": "Originally posted by FollowMeInfantry: quote: Originally posted by Duster6: The democrats may fool most of the people and Obama may talk a good game but the facts and truth of the matter is the stock market deals with numbers. The stock market is neither partisan nor bipartisan. People are taking their money out of the market and others simply are not investing into it. Do you think they are trying to tell us something? Why aren't we listening? The stock market is a religion - it is faith based. When faith declines, attendance follows. FOX (Megyn Kelley) is stating that the latest $300 billion AIG bailout is the speculative force behind the drop, though she doesn't cite any sources I am personally familiar with. It does makes sense, though, given that Friday was all over the place at its close. I don't have any stocks and a VERY small 401(k) (which is all long-term anyway), so it affects me only in the job market. But I sure do feel bad for those with large portfolios.", 
        "reply": " Excellent analogy!! !! The worship of money (is) the root of all (Madoff ) EVIL!! and misery and war and death follow thereafter - - Wandering and Wondering", 
        "threadID": "672198221_1720066612001", 
        "time": "2009-03-02 07:22:00", 
        "title": "Below 7,000 for the first time since 1987", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "AIG is back at the plate, er trough, again to-day looking for its third bailout. The company that was 'too big to fail' needs another infusion of your cash. Question is, where is all the cash going ... it's pretty apparently not into circulation. On the bright side, if this keeps up, the dollar is going to have to be devalued - then listen to those sitting of piles of paper start howling. Forget gold, there's an untapped market in tin cups and patriotic pencils out there.", 
        "intTime": 20090302, 
        "postID": 30, 
        "quote": "", 
        "reply": "AIG is back at the plate, er trough, again to-day looking for its third bailout. The company that was 'too big to fail' needs another infusion of your cash. Question is, where is all the cash going ... it's pretty apparently not into circulation. On the bright side, if this keeps up, the dollar is going to have to be devalued - then listen to those sitting of piles of paper start howling. Forget gold, there's an untapped market in tin cups and patriotic pencils out there.", 
        "threadID": "672198221_1720066612001", 
        "time": "2009-03-02 07:23:00", 
        "title": "Below 7,000 for the first time since 1987", 
        "userID": "popsiq"
    }, 
    {
        "content": "Kind of makes you glad the democrats won out when Bush wanted to turn Social Security into a \"thrift savings plan\", huh? (Not a newbie -- new screen name for 1welderswife.)", 
        "intTime": 20090302, 
        "postID": 31, 
        "quote": "", 
        "reply": "Kind of makes you glad the democrats won out when Bush wanted to turn Social Security into a \"thrift savings plan\", huh? (Not a newbie -- new screen name for 1welderswife.)", 
        "threadID": "672198221_1720066612001", 
        "time": "2009-03-02 07:40:00", 
        "title": "Below 7,000 for the first time since 1987", 
        "userID": "1WW"
    }, 
    {
        "content": "quote: Originally posted by popsiq: AIG is back at the plate, er trough, again to-day looking for its third bailout. The company that was 'too big to fail' needs another infusion of your cash. Question is, where is all the cash going ... it's pretty apparently not into circulation. On the bright side, if this keeps up, the dollar is going to have to be devalued - then listen to those sitting of piles of paper start howling. Forget gold, there's an untapped market in tin cups and patriotic pencils out there. LMAO! So funny, but so VERY true! Where the hell do we draw the line? You know what I think? I think the military, including us, deserves a bailout. To hell with the banks and their million dollar vacations. If anyone deserves a vacation, it is our troops. Where the hell IS all that money going? That's a great question. Apparently Wall Street doesn't know, either, or they wouldn't be bailing themselves out by pulling their money and reinvesting in liquidity outside of paper. There is no way to fix this without devaluing the dollar, which is just going to kill the banks even more as their capital hedging is in the Euro Dollar. Sigh... I am so confused... It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090302, 
        "postID": 32, 
        "quote": "Originally posted by popsiq: AIG is back at the plate, er trough, again to-day looking for its third bailout. The company that was 'too big to fail' needs another infusion of your cash. Question is, where is all the cash going ... it's pretty apparently not into circulation. On the bright side, if this keeps up, the dollar is going to have to be devalued - then listen to those sitting of piles of paper start howling. Forget gold, there's an untapped market in tin cups and patriotic pencils out there.", 
        "reply": " LMAO! So funny, but so VERY true! Where the hell do we draw the line? You know what I think? I think the military, including us, deserves a bailout. To hell with the banks and their million dollar vacations. If anyone deserves a vacation, it is our troops. Where the hell IS all that money going? That's a great question. Apparently Wall Street doesn't know, either, or they wouldn't be bailing themselves out by pulling their money and reinvesting in liquidity outside of paper. There is no way to fix this without devaluing the dollar, which is just going to kill the banks even more as their capital hedging is in the Euro Dollar. Sigh... I am so confused... It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "672198221_1720066612001", 
        "time": "2009-03-02 07:43:00", 
        "title": "Below 7,000 for the first time since 1987", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Originally posted by 1WW: Kind of makes you glad the democrats won out when Bush wanted to turn Social Security into a \"thrift savings plan\", huh? (Not a newbie -- new screen name for 1welderswife.) Let's not spin this political, babe. This was coming for a long time, and it wouldn't have mattered what moniker following a name warmed the seat behind the decision desk. As a conservative, I hate to admit that this is where capitalism fails in its own way. We've all heard the adage of the rich getting richer and the poor getting poorer. For 30 years we've been eliminating the middle class. People are scared to talk about balance, because it makes the welfare demographic get a damn job while it forces wages to compensate so that CEO's aren't making $500 million a year while their employees struggle to buy groceries. Everyone thinks their way is better. Including me - heh. But we're going to have to pull together at some point or we're all going to continue to suffer. The local construction company is going to have to lower their profit margins on the promise that the local investor will buy the final product for a reasonable rate. Then they can hire people who will then have money to spend to stimulate the growth, promoting new jobs. Do that enough, the economy will fix itself just through pure confidence in the STABILITY of the dollar. That's what we're lacking and that's why the market has tanked. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090302, 
        "postID": 33, 
        "quote": "Originally posted by 1WW: Kind of makes you glad the democrats won out when Bush wanted to turn Social Security into a \"thrift savings plan\", huh? (Not a newbie -- new screen name for 1welderswife.)", 
        "reply": " Let's not spin this political, babe. This was coming for a long time, and it wouldn't have mattered what moniker following a name warmed the seat behind the decision desk. As a conservative, I hate to admit that this is where capitalism fails in its own way. We've all heard the adage of the rich getting richer and the poor getting poorer. For 30 years we've been eliminating the middle class. People are scared to talk about balance, because it makes the welfare demographic get a damn job while it forces wages to compensate so that CEO's aren't making $500 million a year while their employees struggle to buy groceries. Everyone thinks their way is better. Including me - heh. But we're going to have to pull together at some point or we're all going to continue to suffer. The local construction company is going to have to lower their profit margins on the promise that the local investor will buy the final product for a reasonable rate. Then they can hire people who will then have money to spend to stimulate the growth, promoting new jobs. Do that enough, the economy will fix itself just through pure confidence in the STABILITY of the dollar. That's what we're lacking and that's why the market has tanked. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "672198221_1720066612001", 
        "time": "2009-03-02 07:51:00", 
        "title": "Below 7,000 for the first time since 1987", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Originally posted by FollowMeInfantry: quote: Originally posted by 1WW: Kind of makes you glad the democrats won out when Bush wanted to turn Social Security into a \"thrift savings plan\", huh? (Not a newbie -- new screen name for 1welderswife.) Let's not spin this political, babe. This was coming for a long time, and it wouldn't have mattered what moniker following a name warmed the seat behind the decision desk. As a conservative, I hate to admit that this is where capitalism fails in its own way. We've all heard the adage of the rich getting richer and the poor getting poorer. For 30 years we've been eliminating the middle class. People are scared to talk about balance, because it makes the welfare demographic get a damn job while it forces wages to compensate so that CEO's aren't making $500 million a year while their employees struggle to buy groceries. Everyone thinks their way is better. Including me - heh. But we're going to have to pull together at some point or we're all going to continue to suffer. The local construction company is going to have to lower their profit margins on the promise that the local investor will buy the final product for a reasonable rate. Then they can hire people who will then have money to spend to stimulate the growth, promoting new jobs. Do that enough, the economy will fix itself just through pure confidence in the STABILITY of the dollar. That's what we're lacking and that's why the market has tanked. Great wordsmithing, babe. As always. But instead of couching my comment as a rhetorical question, I'll address it as a true one: Aren't you glad the democrats won out when Bush wanted to turn Social Security into a \"thrift savings plan\"?", 
        "intTime": 20090302, 
        "postID": 34, 
        "quote": "Originally posted by FollowMeInfantry: quote: Originally posted by 1WW: Kind of makes you glad the democrats won out when Bush wanted to turn Social Security into a \"thrift savings plan\", huh? (Not a newbie -- new screen name for 1welderswife.) Let's not spin this political, babe. This was coming for a long time, and it wouldn't have mattered what moniker following a name warmed the seat behind the decision desk. As a conservative, I hate to admit that this is where capitalism fails in its own way. We've all heard the adage of the rich getting richer and the poor getting poorer. For 30 years we've been eliminating the middle class. People are scared to talk about balance, because it makes the welfare demographic get a damn job while it forces wages to compensate so that CEO's aren't making $500 million a year while their employees struggle to buy groceries. Everyone thinks their way is better. Including me - heh. But we're going to have to pull together at some point or we're all going to continue to suffer. The local construction company is going to have to lower their profit margins on the promise that the local investor will buy the final product for a reasonable rate. Then they can hire people who will then have money to spend to stimulate the growth, promoting new jobs. Do that enough, the economy will fix itself just through pure confidence in the STABILITY of the dollar. That's what we're lacking and that's why the market has tanked.", 
        "reply": " Great wordsmithing, babe. As always. But instead of couching my comment as a rhetorical question, I'll address it as a true one: Aren't you glad the democrats won out when Bush wanted to turn Social Security into a \"thrift savings plan\"?", 
        "threadID": "672198221_1720066612001", 
        "time": "2009-03-02 08:04:00", 
        "title": "Below 7,000 for the first time since 1987", 
        "userID": "1WW"
    }, 
    {
        "content": "quote: Aren't you glad the democrats won out when Bush wanted to turn Social Security into a \"thrift savings plan\"? Not particularly. Since the proposal only called for privatizing (not a particularly apt word but that's what was used) a relatively small portion of SS, and at that on a voluntary basis and with a fixed selection of investment choices, it would have been a \"good thing\" IMHO for the long term. It would have had no impact on those currently drawing SS and would be building low cost, high potential portfolios for those with an investment window outside 5-10 years. I'd far rather see that than Congress continue to borrow the SS surplus and spend it out ... knowing full well they have no hope of ever repaying the trust fund the trillions that are currently owed it. Oddly, and much to my surprise, President Obama proposed private savings accounts in conjunction with SS reform in his speech to Congress last week. I thought Speaker Pelosi was going to collapse.", 
        "intTime": 20090302, 
        "postID": 35, 
        "quote": "Aren't you glad the democrats won out when Bush wanted to turn Social Security into a \"thrift savings plan\"?", 
        "reply": " Not particularly. Since the proposal only called for privatizing (not a particularly apt word but that's what was used) a relatively small portion of SS, and at that on a voluntary basis and with a fixed selection of investment choices, it would have been a \"good thing\" IMHO for the long term. It would have had no impact on those currently drawing SS and would be building low cost, high potential portfolios for those with an investment window outside 5-10 years. I'd far rather see that than Congress continue to borrow the SS surplus and spend it out ... knowing full well they have no hope of ever repaying the trust fund the trillions that are currently owed it. Oddly, and much to my surprise, President Obama proposed private savings accounts in conjunction with SS reform in his speech to Congress last week. I thought Speaker Pelosi was going to collapse.", 
        "threadID": "672198221_1720066612001", 
        "time": "2009-03-02 08:23:00", 
        "title": "Below 7,000 for the first time since 1987", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by Kegler300: The markets have lost over 50% of their value since Obama became the presumptive nominee for the democratic party. Your logic is awful. I mean, Bush was still President until January. You definitely make some of the most outright biased posts on this board. Blaming the fall from October to January on a man who was a Senator? Wasn't McCain a favorite to win the election in the early months? Argh. No he wasn't favored. I am not in the stock market thank goodness. I've also thought of the stock market as being an overall barometer of a number of things. Comsumer confidence; confidence in the government; confidence in security issues both interal and international. How can anyone, including the stock market act any differently to the massive debt we will have if all of the democrats plans are passed! I heard somewhere this weekend that we have are fingers in the dike but it's collapsing around us. I'll admit I'm not the greatest economics expert but my confidence in what's happening in congress or the white house has never been lower! What physcal responsibility is obama talking about? As far as the continued blasting of President Bush, the markets react for what they believe exists but the greater emphasis is on what the future holds in store for us.", 
        "intTime": 20090302, 
        "postID": 36, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by Kegler300: The markets have lost over 50% of their value since Obama became the presumptive nominee for the democratic party. Your logic is awful. I mean, Bush was still President until January. You definitely make some of the most outright biased posts on this board. Blaming the fall from October to January on a man who was a Senator? Wasn't McCain a favorite to win the election in the early months? Argh.", 
        "reply": " No he wasn't favored. I am not in the stock market thank goodness. I've also thought of the stock market as being an overall barometer of a number of things. Comsumer confidence; confidence in the government; confidence in security issues both interal and international. How can anyone, including the stock market act any differently to the massive debt we will have if all of the democrats plans are passed! I heard somewhere this weekend that we have are fingers in the dike but it's collapsing around us. I'll admit I'm not the greatest economics expert but my confidence in what's happening in congress or the white house has never been lower! What physcal responsibility is obama talking about? As far as the continued blasting of President Bush, the markets react for what they believe exists but the greater emphasis is on what the future holds in store for us.", 
        "threadID": "672198221_1720066612001", 
        "time": "2009-03-02 08:29:00", 
        "title": "Below 7,000 for the first time since 1987", 
        "userID": "busnrete8"
    }, 
    {
        "content": "quote: Originally posted by I_M_Qwerty: I thought Speaker Pelosi was going to collapse. I wish she would. She and the president are not on the same page on quite a few issues.", 
        "intTime": 20090302, 
        "postID": 37, 
        "quote": "Originally posted by I_M_Qwerty: I thought Speaker Pelosi was going to collapse.", 
        "reply": " I wish she would. She and the president are not on the same page on quite a few issues.", 
        "threadID": "672198221_1720066612001", 
        "time": "2009-03-02 08:39:00", 
        "title": "Below 7,000 for the first time since 1987", 
        "userID": "1WW"
    }, 
    {
        "content": "quote: Originally posted by 1WW: quote: Originally posted by I_M_Qwerty: I thought Speaker Pelosi was going to collapse. I wish she would. She and the president are not on the same page on quite a few issues. While we disagree on some things, we've at least that much in common. While I disagree with POTUS 44 on some issues, I agree on a goodly number of other ones. As I've mentioned before, I think the greatest challenge to his agenda ... and responsible leadership ... is going to settle out to be the far left in his own party, particularly the House leadership. I rather doubt he was privately very happy with the stimulus bill, for example. Infrastructure ended up getting a relatively paltry 58 billion ... barely a dent in the backlog. Like your \"1WW\" BTW ... have used it in addressing you a few times before and am glad to see it now has legitimacy! Regards -", 
        "intTime": 20090302, 
        "postID": 38, 
        "quote": "Originally posted by 1WW: quote: Originally posted by I_M_Qwerty: I thought Speaker Pelosi was going to collapse. I wish she would. She and the president are not on the same page on quite a few issues.", 
        "reply": " While we disagree on some things, we've at least that much in common. While I disagree with POTUS 44 on some issues, I agree on a goodly number of other ones. As I've mentioned before, I think the greatest challenge to his agenda ... and responsible leadership ... is going to settle out to be the far left in his own party, particularly the House leadership. I rather doubt he was privately very happy with the stimulus bill, for example. Infrastructure ended up getting a relatively paltry 58 billion ... barely a dent in the backlog. Like your \"1WW\" BTW ... have used it in addressing you a few times before and am glad to see it now has legitimacy! Regards -", 
        "threadID": "672198221_1720066612001", 
        "time": "2009-03-02 08:53:00", 
        "title": "Below 7,000 for the first time since 1987", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "Ride it out. Once all the crap is burned off, things will be fine. Hang on.", 
        "intTime": 20090302, 
        "postID": 39, 
        "quote": "", 
        "reply": "Ride it out. Once all the crap is burned off, things will be fine. Hang on.", 
        "threadID": "672198221_1720066612001", 
        "time": "2009-03-02 08:57:00", 
        "title": "Below 7,000 for the first time since 1987", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by 1WW: Great wordsmithing, babe. As always. But instead of couching my comment as a rhetorical question, I'll address it as a true one: Aren't you glad the democrats won out when Bush wanted to turn Social Security into a \"thrift savings plan\"? I offered no direct retort as the question is irrelevant. The stock market, now below 6,800, is not reacting to Mr. Bush's theory of Social Security reform. It is the atypical leftist approach to sway the discussion benefits by interjecting a tangent that is not only a red herring fallacy, but that detracts from the focus. Had I wanted to discuss Social Security reform's impact on the NYSE, I would have done so. As much as I love you, some days I sure could slap the crap out of you. (This is going to cost me a few nights on the couch, isn't it?) But I'm your Huckleberry. The stock market is an entity of its own accord. It reacts to outside influence to survive, and it retreats where necessary. As my friend I_M_Qwerty so astutely points out, the proposed deft re-management of the Social Security system was more akin to your 401(k) than it was any government control. Like your 401, SS funds would have been invested by experts in their field given the current expected rate of return and based on its marginal risk for breakeven. Where the bell curve begins to hedge, T-Bills are utilized (or similar). It's all about speculation. This doesn't scare investors as it is flexible, there is accountability, and long-term investments are almost always a surety. It differs from the current bailout packages in that the stability of the international dollar is now in question. Banks leverage against foreign funds to protect their capital, whereas the proposed changes to SS would not have. When you \"give\" money to a bank, you are, in essence, loaning money to your best friend that just lost all his money at the Blackjack table for the 5th time this week. If you have 5 friends and 1 needs $100 to pay his cable bill, how likely are you and the other 4 to each kick in a $20 bill if that friend in need wasted all his money instead of paying his bill? That is the stock market. And that is their reaction to the bank bailouts. But SS reform was different. While it was indeed irresponsibly managed and spent, the idea was to change money handlers. That is, you may be willing to commit your $20 to your friend, but only if you pay his bill for him or you use his responsible mother and give HER the money. In other words, one is about accountability for funding. That was the SS reformat. The other is faith that money won't be used irresponsibly by the same friend that abused it before. That is a bailout that occurs twice. So, they are not the same -- not by a long shot -- and investors have lost faith in the money handlers and are choosing to pay their own bills. And those leveraged against their investments, the smaller investors, are paying the price as confidence erodes, which drives the circle that is both consumer confidence and consumer spending. The dollar value tanks, so while you're still paying 99 cents for a loaf or bread, that 99 cents-by-effort-dollar yesterday is now $1.50-by-effort-dollar today. And people stop buying bread unless they have to. Are you baiting me, sweetie? It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090302, 
        "postID": 40, 
        "quote": "Originally posted by 1WW: Great wordsmithing, babe. As always. But instead of couching my comment as a rhetorical question, I'll address it as a true one: Aren't you glad the democrats won out when Bush wanted to turn Social Security into a \"thrift savings plan\"?", 
        "reply": " I offered no direct retort as the question is irrelevant. The stock market, now below 6,800, is not reacting to Mr. Bush's theory of Social Security reform. It is the atypical leftist approach to sway the discussion benefits by interjecting a tangent that is not only a red herring fallacy, but that detracts from the focus. Had I wanted to discuss Social Security reform's impact on the NYSE, I would have done so. As much as I love you, some days I sure could slap the crap out of you. (This is going to cost me a few nights on the couch, isn't it?) But I'm your Huckleberry. The stock market is an entity of its own accord. It reacts to outside influence to survive, and it retreats where necessary. As my friend I_M_Qwerty so astutely points out, the proposed deft re-management of the Social Security system was more akin to your 401(k) than it was any government control. Like your 401, SS funds would have been invested by experts in their field given the current expected rate of return and based on its marginal risk for breakeven. Where the bell curve begins to hedge, T-Bills are utilized (or similar). It's all about speculation. This doesn't scare investors as it is flexible, there is accountability, and long-term investments are almost always a surety. It differs from the current bailout packages in that the stability of the international dollar is now in question. Banks leverage against foreign funds to protect their capital, whereas the proposed changes to SS would not have. When you \"give\" money to a bank, you are, in essence, loaning money to your best friend that just lost all his money at the Blackjack table for the 5th time this week. If you have 5 friends and 1 needs $100 to pay his cable bill, how likely are you and the other 4 to each kick in a $20 bill if that friend in need wasted all his money instead of paying his bill? That is the stock market. And that is their reaction to the bank bailouts. But SS reform was different. While it was indeed irresponsibly managed and spent, the idea was to change money handlers. That is, you may be willing to commit your $20 to your friend, but only if you pay his bill for him or you use his responsible mother and give HER the money. In other words, one is about accountability for funding. That was the SS reformat. The other is faith that money won't be used irresponsibly by the same friend that abused it before. That is a bailout that occurs twice. So, they are not the same -- not by a long shot -- and investors have lost faith in the money handlers and are choosing to pay their own bills. And those leveraged against their investments, the smaller investors, are paying the price as confidence erodes, which drives the circle that is both consumer confidence and consumer spending. The dollar value tanks, so while you're still paying 99 cents for a loaf or bread, that 99 cents-by-effort-dollar yesterday is now $1.50-by-effort-dollar today. And people stop buying bread unless they have to. Are you baiting me, sweetie? It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "672198221_1720066612001", 
        "time": "2009-03-02 09:01:00", 
        "title": "Below 7,000 for the first time since 1987", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "The DOW is in deep doo doo. As expected, it opened -132 points, dropping us below 7,000. This isn't good, guys. History dictates that it is going to drop significantly more. This is the \"invisible line\" investors speak of when they decide to pull their diversities and pursue more liquid assets, specifically in commodity futures and precious metals. I admit that I don't know a whole bunch about it, but I know enough that the hair on the back of my neck is standing up a little this morning. What are you going to do? Pull out or ride it out? It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090302, 
        "postID": 41, 
        "quote": "", 
        "reply": "The DOW is in deep doo doo. As expected, it opened -132 points, dropping us below 7,000. This isn't good, guys. History dictates that it is going to drop significantly more. This is the \"invisible line\" investors speak of when they decide to pull their diversities and pursue more liquid assets, specifically in commodity futures and precious metals. I admit that I don't know a whole bunch about it, but I know enough that the hair on the back of my neck is standing up a little this morning. What are you going to do? Pull out or ride it out? It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "672198221_1720066612001", 
        "time": "2009-03-02 06:38:00", 
        "title": "Below 7,000 for the first time since 1987", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "Everyone I know who was short-selling stocks in October trying to cash in on the slump and over-leveraging themselves should be broke by now. Good. But in all seriousness, this is pretty bad for the overall economy.", 
        "intTime": 20090302, 
        "postID": 42, 
        "quote": "", 
        "reply": "Everyone I know who was short-selling stocks in October trying to cash in on the slump and over-leveraging themselves should be broke by now. Good. But in all seriousness, this is pretty bad for the overall economy.", 
        "threadID": "672198221_1720066612001", 
        "time": "2009-03-02 06:42:00", 
        "title": "Below 7,000 for the first time since 1987", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "The democrats may fool most of the people and Obama may talk a good game but the facts and truth of the matter is the stock market deals with numbers. The stock market is neither partisan nor bipartisan. People are taking their money out of the market and others simply are not investing into it. Do you think they are trying to tell us something? Why aren't we listening?", 
        "intTime": 20090302, 
        "postID": 43, 
        "quote": "", 
        "reply": "The democrats may fool most of the people and Obama may talk a good game but the facts and truth of the matter is the stock market deals with numbers. The stock market is neither partisan nor bipartisan. People are taking their money out of the market and others simply are not investing into it. Do you think they are trying to tell us something? Why aren't we listening?", 
        "threadID": "672198221_1720066612001", 
        "time": "2009-03-02 06:58:00", 
        "title": "Below 7,000 for the first time since 1987", 
        "userID": "Duster6"
    }, 
    {
        "content": "The markets have lost over 50% of their value since Obama became the presumptive nominee for the democratic party. They continue to respond negatively to Obama's march to socialism and government takeover. \"The World's Finest\"", 
        "intTime": 20090302, 
        "postID": 44, 
        "quote": "", 
        "reply": "The markets have lost over 50% of their value since Obama became the presumptive nominee for the democratic party. They continue to respond negatively to Obama's march to socialism and government takeover. \"The World's Finest\"", 
        "threadID": "672198221_1720066612001", 
        "time": "2009-03-02 07:10:00", 
        "title": "Below 7,000 for the first time since 1987", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: The markets have lost over 50% of their value since Obama became the presumptive nominee for the democratic party. Your logic is awful. I mean, Bush was still President until January. You definitely make some of the most outright biased posts on this board. Blaming the fall from October to January on a man who was a Senator? Wasn't McCain a favorite to win the election in the early months? Argh.", 
        "intTime": 20090302, 
        "postID": 45, 
        "quote": "Originally posted by Kegler300: The markets have lost over 50% of their value since Obama became the presumptive nominee for the democratic party.", 
        "reply": " Your logic is awful. I mean, Bush was still President until January. You definitely make some of the most outright biased posts on this board. Blaming the fall from October to January on a man who was a Senator? Wasn't McCain a favorite to win the election in the early months? Argh.", 
        "threadID": "672198221_1720066612001", 
        "time": "2009-03-02 07:15:00", 
        "title": "Below 7,000 for the first time since 1987", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "I called it, guessed 6500 yeasterday... We'll see - - Wandering and Wondering", 
        "intTime": 20090302, 
        "postID": 46, 
        "quote": "", 
        "reply": "I called it, guessed 6500 yeasterday... We'll see - - Wandering and Wondering", 
        "threadID": "672198221_1720066612001", 
        "time": "2009-03-02 07:16:00", 
        "title": "Below 7,000 for the first time since 1987", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by Duster6: The democrats may fool most of the people and Obama may talk a good game but the facts and truth of the matter is the stock market deals with numbers. The stock market is neither partisan nor bipartisan. People are taking their money out of the market and others simply are not investing into it. Do you think they are trying to tell us something? Why aren't we listening? The stock market is a religion - it is faith based. When faith declines, attendance follows. FOX (Megyn Kelley) is stating that the latest $300 billion AIG bailout is the speculative force behind the drop, though she doesn't cite any sources I am personally familiar with. It does makes sense, though, given that Friday was all over the place at its close. I don't have any stocks and a VERY small 401(k) (which is all long-term anyway), so it affects me only in the job market. But I sure do feel bad for those with large portfolios. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090302, 
        "postID": 47, 
        "quote": "Originally posted by Duster6: The democrats may fool most of the people and Obama may talk a good game but the facts and truth of the matter is the stock market deals with numbers. The stock market is neither partisan nor bipartisan. People are taking their money out of the market and others simply are not investing into it. Do you think they are trying to tell us something? Why aren't we listening?", 
        "reply": " The stock market is a religion - it is faith based. When faith declines, attendance follows. FOX (Megyn Kelley) is stating that the latest $300 billion AIG bailout is the speculative force behind the drop, though she doesn't cite any sources I am personally familiar with. It does makes sense, though, given that Friday was all over the place at its close. I don't have any stocks and a VERY small 401(k) (which is all long-term anyway), so it affects me only in the job market. But I sure do feel bad for those with large portfolios. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "672198221_1720066612001", 
        "time": "2009-03-02 07:19:00", 
        "title": "Below 7,000 for the first time since 1987", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Originally posted by greywolfghost: I called it, guessed 6500 yeasterday... We'll see - - We're at 6,900 right now. It'll steady there a bit, and by close paper will once again start flinging to determine tomorrow's opening. These are frightening times for many people. I hope you're wrong, I really do. But I'd wager that you're very close in your prediction. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090302, 
        "postID": 48, 
        "quote": "Originally posted by greywolfghost: I called it, guessed 6500 yeasterday... We'll see - -", 
        "reply": " We're at 6,900 right now. It'll steady there a bit, and by close paper will once again start flinging to determine tomorrow's opening. These are frightening times for many people. I hope you're wrong, I really do. But I'd wager that you're very close in your prediction. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "672198221_1720066612001", 
        "time": "2009-03-02 07:22:00", 
        "title": "Below 7,000 for the first time since 1987", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Originally posted by FollowMeInfantry: quote: Originally posted by Duster6: The democrats may fool most of the people and Obama may talk a good game but the facts and truth of the matter is the stock market deals with numbers. The stock market is neither partisan nor bipartisan. People are taking their money out of the market and others simply are not investing into it. Do you think they are trying to tell us something? Why aren't we listening? The stock market is a religion - it is faith based. When faith declines, attendance follows. FOX (Megyn Kelley) is stating that the latest $300 billion AIG bailout is the speculative force behind the drop, though she doesn't cite any sources I am personally familiar with. It does makes sense, though, given that Friday was all over the place at its close. I don't have any stocks and a VERY small 401(k) (which is all long-term anyway), so it affects me only in the job market. But I sure do feel bad for those with large portfolios. Excellent analogy!! !! The worship of money (is) the root of all (Madoff ) EVIL!! and misery and war and death follow thereafter - - Wandering and Wondering", 
        "intTime": 20090302, 
        "postID": 49, 
        "quote": "Originally posted by FollowMeInfantry: quote: Originally posted by Duster6: The democrats may fool most of the people and Obama may talk a good game but the facts and truth of the matter is the stock market deals with numbers. The stock market is neither partisan nor bipartisan. People are taking their money out of the market and others simply are not investing into it. Do you think they are trying to tell us something? Why aren't we listening? The stock market is a religion - it is faith based. When faith declines, attendance follows. FOX (Megyn Kelley) is stating that the latest $300 billion AIG bailout is the speculative force behind the drop, though she doesn't cite any sources I am personally familiar with. It does makes sense, though, given that Friday was all over the place at its close. I don't have any stocks and a VERY small 401(k) (which is all long-term anyway), so it affects me only in the job market. But I sure do feel bad for those with large portfolios.", 
        "reply": " Excellent analogy!! !! The worship of money (is) the root of all (Madoff ) EVIL!! and misery and war and death follow thereafter - - Wandering and Wondering", 
        "threadID": "672198221_1720066612001", 
        "time": "2009-03-02 07:22:00", 
        "title": "Below 7,000 for the first time since 1987", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "AIG is back at the plate, er trough, again to-day looking for its third bailout. The company that was 'too big to fail' needs another infusion of your cash. Question is, where is all the cash going ... it's pretty apparently not into circulation. On the bright side, if this keeps up, the dollar is going to have to be devalued - then listen to those sitting of piles of paper start howling. Forget gold, there's an untapped market in tin cups and patriotic pencils out there.", 
        "intTime": 20090302, 
        "postID": 50, 
        "quote": "", 
        "reply": "AIG is back at the plate, er trough, again to-day looking for its third bailout. The company that was 'too big to fail' needs another infusion of your cash. Question is, where is all the cash going ... it's pretty apparently not into circulation. On the bright side, if this keeps up, the dollar is going to have to be devalued - then listen to those sitting of piles of paper start howling. Forget gold, there's an untapped market in tin cups and patriotic pencils out there.", 
        "threadID": "672198221_1720066612001", 
        "time": "2009-03-02 07:23:00", 
        "title": "Below 7,000 for the first time since 1987", 
        "userID": "popsiq"
    }, 
    {
        "content": "Kind of makes you glad the democrats won out when Bush wanted to turn Social Security into a \"thrift savings plan\", huh? (Not a newbie -- new screen name for 1welderswife.)", 
        "intTime": 20090302, 
        "postID": 51, 
        "quote": "", 
        "reply": "Kind of makes you glad the democrats won out when Bush wanted to turn Social Security into a \"thrift savings plan\", huh? (Not a newbie -- new screen name for 1welderswife.)", 
        "threadID": "672198221_1720066612001", 
        "time": "2009-03-02 07:40:00", 
        "title": "Below 7,000 for the first time since 1987", 
        "userID": "1WW"
    }, 
    {
        "content": "quote: Originally posted by popsiq: AIG is back at the plate, er trough, again to-day looking for its third bailout. The company that was 'too big to fail' needs another infusion of your cash. Question is, where is all the cash going ... it's pretty apparently not into circulation. On the bright side, if this keeps up, the dollar is going to have to be devalued - then listen to those sitting of piles of paper start howling. Forget gold, there's an untapped market in tin cups and patriotic pencils out there. LMAO! So funny, but so VERY true! Where the hell do we draw the line? You know what I think? I think the military, including us, deserves a bailout. To hell with the banks and their million dollar vacations. If anyone deserves a vacation, it is our troops. Where the hell IS all that money going? That's a great question. Apparently Wall Street doesn't know, either, or they wouldn't be bailing themselves out by pulling their money and reinvesting in liquidity outside of paper. There is no way to fix this without devaluing the dollar, which is just going to kill the banks even more as their capital hedging is in the Euro Dollar. Sigh... I am so confused... It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090302, 
        "postID": 52, 
        "quote": "Originally posted by popsiq: AIG is back at the plate, er trough, again to-day looking for its third bailout. The company that was 'too big to fail' needs another infusion of your cash. Question is, where is all the cash going ... it's pretty apparently not into circulation. On the bright side, if this keeps up, the dollar is going to have to be devalued - then listen to those sitting of piles of paper start howling. Forget gold, there's an untapped market in tin cups and patriotic pencils out there.", 
        "reply": " LMAO! So funny, but so VERY true! Where the hell do we draw the line? You know what I think? I think the military, including us, deserves a bailout. To hell with the banks and their million dollar vacations. If anyone deserves a vacation, it is our troops. Where the hell IS all that money going? That's a great question. Apparently Wall Street doesn't know, either, or they wouldn't be bailing themselves out by pulling their money and reinvesting in liquidity outside of paper. There is no way to fix this without devaluing the dollar, which is just going to kill the banks even more as their capital hedging is in the Euro Dollar. Sigh... I am so confused... It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "672198221_1720066612001", 
        "time": "2009-03-02 07:43:00", 
        "title": "Below 7,000 for the first time since 1987", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Originally posted by 1WW: Kind of makes you glad the democrats won out when Bush wanted to turn Social Security into a \"thrift savings plan\", huh? (Not a newbie -- new screen name for 1welderswife.) Let's not spin this political, babe. This was coming for a long time, and it wouldn't have mattered what moniker following a name warmed the seat behind the decision desk. As a conservative, I hate to admit that this is where capitalism fails in its own way. We've all heard the adage of the rich getting richer and the poor getting poorer. For 30 years we've been eliminating the middle class. People are scared to talk about balance, because it makes the welfare demographic get a damn job while it forces wages to compensate so that CEO's aren't making $500 million a year while their employees struggle to buy groceries. Everyone thinks their way is better. Including me - heh. But we're going to have to pull together at some point or we're all going to continue to suffer. The local construction company is going to have to lower their profit margins on the promise that the local investor will buy the final product for a reasonable rate. Then they can hire people who will then have money to spend to stimulate the growth, promoting new jobs. Do that enough, the economy will fix itself just through pure confidence in the STABILITY of the dollar. That's what we're lacking and that's why the market has tanked. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090302, 
        "postID": 53, 
        "quote": "Originally posted by 1WW: Kind of makes you glad the democrats won out when Bush wanted to turn Social Security into a \"thrift savings plan\", huh? (Not a newbie -- new screen name for 1welderswife.)", 
        "reply": " Let's not spin this political, babe. This was coming for a long time, and it wouldn't have mattered what moniker following a name warmed the seat behind the decision desk. As a conservative, I hate to admit that this is where capitalism fails in its own way. We've all heard the adage of the rich getting richer and the poor getting poorer. For 30 years we've been eliminating the middle class. People are scared to talk about balance, because it makes the welfare demographic get a damn job while it forces wages to compensate so that CEO's aren't making $500 million a year while their employees struggle to buy groceries. Everyone thinks their way is better. Including me - heh. But we're going to have to pull together at some point or we're all going to continue to suffer. The local construction company is going to have to lower their profit margins on the promise that the local investor will buy the final product for a reasonable rate. Then they can hire people who will then have money to spend to stimulate the growth, promoting new jobs. Do that enough, the economy will fix itself just through pure confidence in the STABILITY of the dollar. That's what we're lacking and that's why the market has tanked. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "672198221_1720066612001", 
        "time": "2009-03-02 07:51:00", 
        "title": "Below 7,000 for the first time since 1987", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Originally posted by FollowMeInfantry: quote: Originally posted by 1WW: Kind of makes you glad the democrats won out when Bush wanted to turn Social Security into a \"thrift savings plan\", huh? (Not a newbie -- new screen name for 1welderswife.) Let's not spin this political, babe. This was coming for a long time, and it wouldn't have mattered what moniker following a name warmed the seat behind the decision desk. As a conservative, I hate to admit that this is where capitalism fails in its own way. We've all heard the adage of the rich getting richer and the poor getting poorer. For 30 years we've been eliminating the middle class. People are scared to talk about balance, because it makes the welfare demographic get a damn job while it forces wages to compensate so that CEO's aren't making $500 million a year while their employees struggle to buy groceries. Everyone thinks their way is better. Including me - heh. But we're going to have to pull together at some point or we're all going to continue to suffer. The local construction company is going to have to lower their profit margins on the promise that the local investor will buy the final product for a reasonable rate. Then they can hire people who will then have money to spend to stimulate the growth, promoting new jobs. Do that enough, the economy will fix itself just through pure confidence in the STABILITY of the dollar. That's what we're lacking and that's why the market has tanked. Great wordsmithing, babe. As always. But instead of couching my comment as a rhetorical question, I'll address it as a true one: Aren't you glad the democrats won out when Bush wanted to turn Social Security into a \"thrift savings plan\"?", 
        "intTime": 20090302, 
        "postID": 54, 
        "quote": "Originally posted by FollowMeInfantry: quote: Originally posted by 1WW: Kind of makes you glad the democrats won out when Bush wanted to turn Social Security into a \"thrift savings plan\", huh? (Not a newbie -- new screen name for 1welderswife.) Let's not spin this political, babe. This was coming for a long time, and it wouldn't have mattered what moniker following a name warmed the seat behind the decision desk. As a conservative, I hate to admit that this is where capitalism fails in its own way. We've all heard the adage of the rich getting richer and the poor getting poorer. For 30 years we've been eliminating the middle class. People are scared to talk about balance, because it makes the welfare demographic get a damn job while it forces wages to compensate so that CEO's aren't making $500 million a year while their employees struggle to buy groceries. Everyone thinks their way is better. Including me - heh. But we're going to have to pull together at some point or we're all going to continue to suffer. The local construction company is going to have to lower their profit margins on the promise that the local investor will buy the final product for a reasonable rate. Then they can hire people who will then have money to spend to stimulate the growth, promoting new jobs. Do that enough, the economy will fix itself just through pure confidence in the STABILITY of the dollar. That's what we're lacking and that's why the market has tanked.", 
        "reply": " Great wordsmithing, babe. As always. But instead of couching my comment as a rhetorical question, I'll address it as a true one: Aren't you glad the democrats won out when Bush wanted to turn Social Security into a \"thrift savings plan\"?", 
        "threadID": "672198221_1720066612001", 
        "time": "2009-03-02 08:04:00", 
        "title": "Below 7,000 for the first time since 1987", 
        "userID": "1WW"
    }, 
    {
        "content": "quote: Aren't you glad the democrats won out when Bush wanted to turn Social Security into a \"thrift savings plan\"? Not particularly. Since the proposal only called for privatizing (not a particularly apt word but that's what was used) a relatively small portion of SS, and at that on a voluntary basis and with a fixed selection of investment choices, it would have been a \"good thing\" IMHO for the long term. It would have had no impact on those currently drawing SS and would be building low cost, high potential portfolios for those with an investment window outside 5-10 years. I'd far rather see that than Congress continue to borrow the SS surplus and spend it out ... knowing full well they have no hope of ever repaying the trust fund the trillions that are currently owed it. Oddly, and much to my surprise, President Obama proposed private savings accounts in conjunction with SS reform in his speech to Congress last week. I thought Speaker Pelosi was going to collapse.", 
        "intTime": 20090302, 
        "postID": 55, 
        "quote": "Aren't you glad the democrats won out when Bush wanted to turn Social Security into a \"thrift savings plan\"?", 
        "reply": " Not particularly. Since the proposal only called for privatizing (not a particularly apt word but that's what was used) a relatively small portion of SS, and at that on a voluntary basis and with a fixed selection of investment choices, it would have been a \"good thing\" IMHO for the long term. It would have had no impact on those currently drawing SS and would be building low cost, high potential portfolios for those with an investment window outside 5-10 years. I'd far rather see that than Congress continue to borrow the SS surplus and spend it out ... knowing full well they have no hope of ever repaying the trust fund the trillions that are currently owed it. Oddly, and much to my surprise, President Obama proposed private savings accounts in conjunction with SS reform in his speech to Congress last week. I thought Speaker Pelosi was going to collapse.", 
        "threadID": "672198221_1720066612001", 
        "time": "2009-03-02 08:23:00", 
        "title": "Below 7,000 for the first time since 1987", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by Kegler300: The markets have lost over 50% of their value since Obama became the presumptive nominee for the democratic party. Your logic is awful. I mean, Bush was still President until January. You definitely make some of the most outright biased posts on this board. Blaming the fall from October to January on a man who was a Senator? Wasn't McCain a favorite to win the election in the early months? Argh. No he wasn't favored. I am not in the stock market thank goodness. I've also thought of the stock market as being an overall barometer of a number of things. Comsumer confidence; confidence in the government; confidence in security issues both interal and international. How can anyone, including the stock market act any differently to the massive debt we will have if all of the democrats plans are passed! I heard somewhere this weekend that we have are fingers in the dike but it's collapsing around us. I'll admit I'm not the greatest economics expert but my confidence in what's happening in congress or the white house has never been lower! What physcal responsibility is obama talking about? As far as the continued blasting of President Bush, the markets react for what they believe exists but the greater emphasis is on what the future holds in store for us.", 
        "intTime": 20090302, 
        "postID": 56, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by Kegler300: The markets have lost over 50% of their value since Obama became the presumptive nominee for the democratic party. Your logic is awful. I mean, Bush was still President until January. You definitely make some of the most outright biased posts on this board. Blaming the fall from October to January on a man who was a Senator? Wasn't McCain a favorite to win the election in the early months? Argh.", 
        "reply": " No he wasn't favored. I am not in the stock market thank goodness. I've also thought of the stock market as being an overall barometer of a number of things. Comsumer confidence; confidence in the government; confidence in security issues both interal and international. How can anyone, including the stock market act any differently to the massive debt we will have if all of the democrats plans are passed! I heard somewhere this weekend that we have are fingers in the dike but it's collapsing around us. I'll admit I'm not the greatest economics expert but my confidence in what's happening in congress or the white house has never been lower! What physcal responsibility is obama talking about? As far as the continued blasting of President Bush, the markets react for what they believe exists but the greater emphasis is on what the future holds in store for us.", 
        "threadID": "672198221_1720066612001", 
        "time": "2009-03-02 08:29:00", 
        "title": "Below 7,000 for the first time since 1987", 
        "userID": "busnrete8"
    }, 
    {
        "content": "quote: Originally posted by I_M_Qwerty: I thought Speaker Pelosi was going to collapse. I wish she would. She and the president are not on the same page on quite a few issues.", 
        "intTime": 20090302, 
        "postID": 57, 
        "quote": "Originally posted by I_M_Qwerty: I thought Speaker Pelosi was going to collapse.", 
        "reply": " I wish she would. She and the president are not on the same page on quite a few issues.", 
        "threadID": "672198221_1720066612001", 
        "time": "2009-03-02 08:39:00", 
        "title": "Below 7,000 for the first time since 1987", 
        "userID": "1WW"
    }, 
    {
        "content": "quote: Originally posted by 1WW: quote: Originally posted by I_M_Qwerty: I thought Speaker Pelosi was going to collapse. I wish she would. She and the president are not on the same page on quite a few issues. While we disagree on some things, we've at least that much in common. While I disagree with POTUS 44 on some issues, I agree on a goodly number of other ones. As I've mentioned before, I think the greatest challenge to his agenda ... and responsible leadership ... is going to settle out to be the far left in his own party, particularly the House leadership. I rather doubt he was privately very happy with the stimulus bill, for example. Infrastructure ended up getting a relatively paltry 58 billion ... barely a dent in the backlog. Like your \"1WW\" BTW ... have used it in addressing you a few times before and am glad to see it now has legitimacy! Regards -", 
        "intTime": 20090302, 
        "postID": 58, 
        "quote": "Originally posted by 1WW: quote: Originally posted by I_M_Qwerty: I thought Speaker Pelosi was going to collapse. I wish she would. She and the president are not on the same page on quite a few issues.", 
        "reply": " While we disagree on some things, we've at least that much in common. While I disagree with POTUS 44 on some issues, I agree on a goodly number of other ones. As I've mentioned before, I think the greatest challenge to his agenda ... and responsible leadership ... is going to settle out to be the far left in his own party, particularly the House leadership. I rather doubt he was privately very happy with the stimulus bill, for example. Infrastructure ended up getting a relatively paltry 58 billion ... barely a dent in the backlog. Like your \"1WW\" BTW ... have used it in addressing you a few times before and am glad to see it now has legitimacy! Regards -", 
        "threadID": "672198221_1720066612001", 
        "time": "2009-03-02 08:53:00", 
        "title": "Below 7,000 for the first time since 1987", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "Ride it out. Once all the crap is burned off, things will be fine. Hang on.", 
        "intTime": 20090302, 
        "postID": 59, 
        "quote": "", 
        "reply": "Ride it out. Once all the crap is burned off, things will be fine. Hang on.", 
        "threadID": "672198221_1720066612001", 
        "time": "2009-03-02 08:57:00", 
        "title": "Below 7,000 for the first time since 1987", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by 1WW: Great wordsmithing, babe. As always. But instead of couching my comment as a rhetorical question, I'll address it as a true one: Aren't you glad the democrats won out when Bush wanted to turn Social Security into a \"thrift savings plan\"? I offered no direct retort as the question is irrelevant. The stock market, now below 6,800, is not reacting to Mr. Bush's theory of Social Security reform. It is the atypical leftist approach to sway the discussion benefits by interjecting a tangent that is not only a red herring fallacy, but that detracts from the focus. Had I wanted to discuss Social Security reform's impact on the NYSE, I would have done so. As much as I love you, some days I sure could slap the crap out of you. (This is going to cost me a few nights on the couch, isn't it?) But I'm your Huckleberry. The stock market is an entity of its own accord. It reacts to outside influence to survive, and it retreats where necessary. As my friend I_M_Qwerty so astutely points out, the proposed deft re-management of the Social Security system was more akin to your 401(k) than it was any government control. Like your 401, SS funds would have been invested by experts in their field given the current expected rate of return and based on its marginal risk for breakeven. Where the bell curve begins to hedge, T-Bills are utilized (or similar). It's all about speculation. This doesn't scare investors as it is flexible, there is accountability, and long-term investments are almost always a surety. It differs from the current bailout packages in that the stability of the international dollar is now in question. Banks leverage against foreign funds to protect their capital, whereas the proposed changes to SS would not have. When you \"give\" money to a bank, you are, in essence, loaning money to your best friend that just lost all his money at the Blackjack table for the 5th time this week. If you have 5 friends and 1 needs $100 to pay his cable bill, how likely are you and the other 4 to each kick in a $20 bill if that friend in need wasted all his money instead of paying his bill? That is the stock market. And that is their reaction to the bank bailouts. But SS reform was different. While it was indeed irresponsibly managed and spent, the idea was to change money handlers. That is, you may be willing to commit your $20 to your friend, but only if you pay his bill for him or you use his responsible mother and give HER the money. In other words, one is about accountability for funding. That was the SS reformat. The other is faith that money won't be used irresponsibly by the same friend that abused it before. That is a bailout that occurs twice. So, they are not the same -- not by a long shot -- and investors have lost faith in the money handlers and are choosing to pay their own bills. And those leveraged against their investments, the smaller investors, are paying the price as confidence erodes, which drives the circle that is both consumer confidence and consumer spending. The dollar value tanks, so while you're still paying 99 cents for a loaf or bread, that 99 cents-by-effort-dollar yesterday is now $1.50-by-effort-dollar today. And people stop buying bread unless they have to. Are you baiting me, sweetie? It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090302, 
        "postID": 60, 
        "quote": "Originally posted by 1WW: Great wordsmithing, babe. As always. But instead of couching my comment as a rhetorical question, I'll address it as a true one: Aren't you glad the democrats won out when Bush wanted to turn Social Security into a \"thrift savings plan\"?", 
        "reply": " I offered no direct retort as the question is irrelevant. The stock market, now below 6,800, is not reacting to Mr. Bush's theory of Social Security reform. It is the atypical leftist approach to sway the discussion benefits by interjecting a tangent that is not only a red herring fallacy, but that detracts from the focus. Had I wanted to discuss Social Security reform's impact on the NYSE, I would have done so. As much as I love you, some days I sure could slap the crap out of you. (This is going to cost me a few nights on the couch, isn't it?) But I'm your Huckleberry. The stock market is an entity of its own accord. It reacts to outside influence to survive, and it retreats where necessary. As my friend I_M_Qwerty so astutely points out, the proposed deft re-management of the Social Security system was more akin to your 401(k) than it was any government control. Like your 401, SS funds would have been invested by experts in their field given the current expected rate of return and based on its marginal risk for breakeven. Where the bell curve begins to hedge, T-Bills are utilized (or similar). It's all about speculation. This doesn't scare investors as it is flexible, there is accountability, and long-term investments are almost always a surety. It differs from the current bailout packages in that the stability of the international dollar is now in question. Banks leverage against foreign funds to protect their capital, whereas the proposed changes to SS would not have. When you \"give\" money to a bank, you are, in essence, loaning money to your best friend that just lost all his money at the Blackjack table for the 5th time this week. If you have 5 friends and 1 needs $100 to pay his cable bill, how likely are you and the other 4 to each kick in a $20 bill if that friend in need wasted all his money instead of paying his bill? That is the stock market. And that is their reaction to the bank bailouts. But SS reform was different. While it was indeed irresponsibly managed and spent, the idea was to change money handlers. That is, you may be willing to commit your $20 to your friend, but only if you pay his bill for him or you use his responsible mother and give HER the money. In other words, one is about accountability for funding. That was the SS reformat. The other is faith that money won't be used irresponsibly by the same friend that abused it before. That is a bailout that occurs twice. So, they are not the same -- not by a long shot -- and investors have lost faith in the money handlers and are choosing to pay their own bills. And those leveraged against their investments, the smaller investors, are paying the price as confidence erodes, which drives the circle that is both consumer confidence and consumer spending. The dollar value tanks, so while you're still paying 99 cents for a loaf or bread, that 99 cents-by-effort-dollar yesterday is now $1.50-by-effort-dollar today. And people stop buying bread unless they have to. Are you baiting me, sweetie? It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "672198221_1720066612001", 
        "time": "2009-03-02 09:01:00", 
        "title": "Below 7,000 for the first time since 1987", 
        "userID": "FollowMeInfantry"
    }
]