[
    {
        "content": "They Love Wal Marts They hate the idea of Electronic Health Records - Obama's plan. Guess what? Walmart want to do just that.... \"http://www.iht.com/articles/2009/03/11/business/11record.php\" Of course the ONLY reason Walmart wants to do this is to save money. They can not enslave any more employees so they are looking outside the box. Walmart. Save Money. Shop Worse. Treat employees Like Doo Doo", 
        "intTime": 20090311, 
        "postID": 1, 
        "quote": "", 
        "reply": "They Love Wal Marts They hate the idea of Electronic Health Records - Obama's plan. Guess what? Walmart want to do just that.... \"http://www.iht.com/articles/2009/03/11/business/11record.php\" Of course the ONLY reason Walmart wants to do this is to save money. They can not enslave any more employees so they are looking outside the box. Walmart. Save Money. Shop Worse. Treat employees Like Doo Doo", 
        "threadID": "672198221_4130085712001", 
        "time": "2009-03-11 15:12:00", 
        "title": "A Catach 22 For Conservatives", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "Not sure I folllow where the \"catch 22\" is... perhaps you could elucidate further? Are you saying the fact that the private sector (Wal Mart) knows how to do things better than gov't does is bad? Are you saying Wal Mart should be condemned for offering its own health care clinics to help people? Electronic records aren't by nature good or bad. They're just different than paper copies. It's not the COMPUTER Conservatives are leery of.. it's the access to what the records CONTAIN that we don't care for. The same would be true of access to paper records... Again, I must commend you crackerjack! You keep sending us these WONDERFULLY inspirational tidbits on how things aren't so bad after all! Please keep sending us these warm, caring bits of Pro-Conservative news that is sorely lacking in the mainstream media. It truly warms my heart to see how well Sarah Palin is doing in Alaska and that Wal Mart is taking such good care of people, lowering the costs of medical care and records while opening clinics in its stores to assist poor folks. \"Common sense isn't.\"", 
        "intTime": 20090311, 
        "postID": 2, 
        "quote": "", 
        "reply": "Not sure I folllow where the \"catch 22\" is... perhaps you could elucidate further? Are you saying the fact that the private sector (Wal Mart) knows how to do things better than gov't does is bad? Are you saying Wal Mart should be condemned for offering its own health care clinics to help people? Electronic records aren't by nature good or bad. They're just different than paper copies. It's not the COMPUTER Conservatives are leery of.. it's the access to what the records CONTAIN that we don't care for. The same would be true of access to paper records... Again, I must commend you crackerjack! You keep sending us these WONDERFULLY inspirational tidbits on how things aren't so bad after all! Please keep sending us these warm, caring bits of Pro-Conservative news that is sorely lacking in the mainstream media. It truly warms my heart to see how well Sarah Palin is doing in Alaska and that Wal Mart is taking such good care of people, lowering the costs of medical care and records while opening clinics in its stores to assist poor folks. \"Common sense isn't.\"", 
        "threadID": "672198221_4130085712001", 
        "time": "2009-03-11 15:38:00", 
        "title": "A Catach 22 For Conservatives", 
        "userID": "Gladewalker"
    }, 
    {
        "content": "All I hear everyday in the news, on the radio in this forum and others is how big a disaster it would be to go electronic on medical records and the same Conservative talk show and news articles say how great Wal Mart is. The catch 22 is Wal mart going electronic on the med records. What a clash and how are they going to argue those points together? Of course they won't since it's now a Wal Mart idea it will be a great plan and not an Obama disaster. Give me a break.", 
        "intTime": 20090311, 
        "postID": 3, 
        "quote": "", 
        "reply": "All I hear everyday in the news, on the radio in this forum and others is how big a disaster it would be to go electronic on medical records and the same Conservative talk show and news articles say how great Wal Mart is. The catch 22 is Wal mart going electronic on the med records. What a clash and how are they going to argue those points together? Of course they won't since it's now a Wal Mart idea it will be a great plan and not an Obama disaster. Give me a break.", 
        "threadID": "672198221_4130085712001", 
        "time": "2009-03-11 16:10:00", 
        "title": "A Catach 22 For Conservatives", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "The VAST MAJORITY of medical practices have their records electronically stored. Mine does and has for YEARS, EVEN SENDS PRESCRIPTIONS BY EMAIL and FAX (THO the druggest inevatibely denies getting them even when I've told him I watched the transmission and no mailerdeamon feedback AND seen the fax confirmation print out). The thing we object to is government ACCESS to our records. Please note that it is clear that Mr. Obama agrees as he has NOT made his records available to us, has he? He works for US you know! No, my information is at least as confidential as his, and that I demand remain so, the government has no business crawling about in our business.", 
        "intTime": 20090311, 
        "postID": 4, 
        "quote": "", 
        "reply": "The VAST MAJORITY of medical practices have their records electronically stored. Mine does and has for YEARS, EVEN SENDS PRESCRIPTIONS BY EMAIL and FAX (THO the druggest inevatibely denies getting them even when I've told him I watched the transmission and no mailerdeamon feedback AND seen the fax confirmation print out). The thing we object to is government ACCESS to our records. Please note that it is clear that Mr. Obama agrees as he has NOT made his records available to us, has he? He works for US you know! No, my information is at least as confidential as his, and that I demand remain so, the government has no business crawling about in our business.", 
        "threadID": "672198221_4130085712001", 
        "time": "2009-03-11 16:20:00", 
        "title": "A Catach 22 For Conservatives", 
        "userID": "peter3_1"
    }, 
    {
        "content": "Good point peter. I am all for electronic. everything. I use to think that the PC age would have done away with the \"stone tablet and chisel\" of paper and pencils..seems to have only made it worse. As far as government access, asa long as the companies like Google are out to prosper off your info, I think the G is the least of our worries in that area.", 
        "intTime": 20090311, 
        "postID": 5, 
        "quote": "", 
        "reply": "Good point peter. I am all for electronic. everything. I use to think that the PC age would have done away with the \"stone tablet and chisel\" of paper and pencils..seems to have only made it worse. As far as government access, asa long as the companies like Google are out to prosper off your info, I think the G is the least of our worries in that area.", 
        "threadID": "672198221_4130085712001", 
        "time": "2009-03-11 16:41:00", 
        "title": "A Catach 22 For Conservatives", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: All I hear everyday in the news, on the radio in this forum and others is how big a disaster it would be to go electronic on medical records and the same Conservative talk show and news articles say how great Wal Mart is. The catch 22 is Wal mart going electronic on the med records. What a clash and how are they going to argue those points together? Of course they won't since it's now a Wal Mart idea it will be a great plan and not an Obama disaster. Give me a break. What show are you referring to if I may ask... and may not get an answer?. I do not have a problem with the VA going electronic because I was not forced to sign my name on the contract. I do not have problems with private companies going electronic as long they do not sell, trade or the gov takes the info. I do have a problem with tax money being spent to pay a private company to do so unless there is a profit to be made. In my opinion there are differences in how Pres Obama and friends want to go about doing it...and why.", 
        "intTime": 20090311, 
        "postID": 6, 
        "quote": "All I hear everyday in the news, on the radio in this forum and others is how big a disaster it would be to go electronic on medical records and the same Conservative talk show and news articles say how great Wal Mart is. The catch 22 is Wal mart going electronic on the med records. What a clash and how are they going to argue those points together? Of course they won't since it's now a Wal Mart idea it will be a great plan and not an Obama disaster. Give me a break.", 
        "reply": " What show are you referring to if I may ask... and may not get an answer?. I do not have a problem with the VA going electronic because I was not forced to sign my name on the contract. I do not have problems with private companies going electronic as long they do not sell, trade or the gov takes the info. I do have a problem with tax money being spent to pay a private company to do so unless there is a profit to be made. In my opinion there are differences in how Pres Obama and friends want to go about doing it...and why.", 
        "threadID": "672198221_4130085712001", 
        "time": "2009-03-11 17:00:00", 
        "title": "A Catach 22 For Conservatives", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: All I hear everyday in the news, on the radio in this forum and others is how big a disaster it would be to go electronic on medical records and the same Conservative talk show and news articles say how great Wal Mart is. The catch 22 is Wal mart going electronic on the med records. What a clash and how are they going to argue those points together? Of course they won't since it's now a Wal Mart idea it will be a great plan and not an Obama disaster. Give me a break. Just wondering? Have the military going to a digital database for medical records been beat to death here on mil.com yet? If not, why not? Military Medical Records Go Paperless Story Number: NNS050627-02 Release Date: 6/27/2005 11:23:00 AM By Ellen Maurer, National Naval Medical Center Public Affairs BETHESDA, Md. (NNS) -- A Defense Department initiative to transition patient records from paper to a new digital health care database is scheduled to begin at the National Naval Medical Center Sept. 18. The new system, known as the Composite Health Care System II (CHCSII), is an upgraded version of the original CHCS program used by military health care providers for more than a decade. CHCSII will allow medical personnel to enter patient information directly into an electronic medical record without needing to first handwrite the record of the visit. CHCSII will maintain the digital information in a centralized database, creating a comprehensive, life-long, computer-based patient record for each and every military health beneficiary. Furthermore, since the program acts as a database, hospital functions like laboratory, radiology and pathology test results will be faster. CHCSII will also improve patient safety through automatic alerts of potential allergic reactions and drug-to-drug interactions. \"CHCSII implementation at our medical center is an exciting endeavor that will keep our staff functioning on the cutting edge of technology,\" said Capt. Mark Olesen, National Naval Medical Center's deputy commander. \"This is a great change for our staff and patients, because it propels us into the future of medicine, which is a world of immediate digital access, virtually unlimited and everlasting information storage capacity, and world-wide connectivity.\" Although CHCSII will not immediately eliminate the use of paper records, as hospital officials point out, it is the first step toward a more efficient and integrated Navy Medicine. \"The Navy currently maintains more than 500 military treatment facilities throughout the fleet; each with their own paper records keeping department. CHCSII will connect us all to each other with the click of a keypad,\" said Capt. Kenneth Senn, CHCSII project officer at the hospital. \"Eventually, after CHCSII is implemented worldwide, a sick or injured Sailor treated on a ship halfway around the world can be transferred to Bethesda and all of his medical information is accessible -- even if he didn't have time to grab his paper record.\" While the new system will benefit Navy Medicine, CHCSII is not a sea service specific initiative and is, in fact, designed to improve joint military medical operations. Proponents of the program have said CHCSII will improve interoperability between the branch services' health care systems through the use of one centralized system instead of the current separate medical structures for each branch. \"Enterprise-wide implementation of this system will support the commitment of the Defense Department to conduct population health management throughout the [Military Health System],\" Senn said. Bethesda is not the first site to transition to CHCSII. Several other military medical facilities have already undergone implantation, including Naval Medical Center Portsmouth. Naval Medical Center San Diego is currently in its CHCSII implementation process. Bethesda's phase-in of CHCSII, which starts this fall, will involve installation of new computer systems and software in all of the hospital's outpatient clinics. The new program will also require hands-on and lecture training for all clinicians who currently work with patients or paper records. \"[The hospital] does have a plan for an extended training period during this transition,\" said Steve Kelley, a CHCSII training project coordinator with the Staff Education and Training department. \"This training is not only mandatory, it is essential to knowing how to effectively and efficiently use this new electronic medical records technology.\" Navy article. Also, doctors, at least at the clinic I use, are now required to input patients visits themselves now via computer. No more speaking into the recorders and then having your medical records updated via a transcriptionist. Any one else that uses clinics noticed this?", 
        "intTime": 20090311, 
        "postID": 7, 
        "quote": "Originally posted by crackerjacks61: All I hear everyday in the news, on the radio in this forum and others is how big a disaster it would be to go electronic on medical records and the same Conservative talk show and news articles say how great Wal Mart is. The catch 22 is Wal mart going electronic on the med records. What a clash and how are they going to argue those points together? Of course they won't since it's now a Wal Mart idea it will be a great plan and not an Obama disaster. Give me a break.", 
        "reply": " Just wondering? Have the military going to a digital database for medical records been beat to death here on mil.com yet? If not, why not? Military Medical Records Go Paperless Story Number: NNS050627-02 Release Date: 6/27/2005 11:23:00 AM By Ellen Maurer, National Naval Medical Center Public Affairs BETHESDA, Md. (NNS) -- A Defense Department initiative to transition patient records from paper to a new digital health care database is scheduled to begin at the National Naval Medical Center Sept. 18. The new system, known as the Composite Health Care System II (CHCSII), is an upgraded version of the original CHCS program used by military health care providers for more than a decade. CHCSII will allow medical personnel to enter patient information directly into an electronic medical record without needing to first handwrite the record of the visit. CHCSII will maintain the digital information in a centralized database, creating a comprehensive, life-long, computer-based patient record for each and every military health beneficiary. Furthermore, since the program acts as a database, hospital functions like laboratory, radiology and pathology test results will be faster. CHCSII will also improve patient safety through automatic alerts of potential allergic reactions and drug-to-drug interactions. \"CHCSII implementation at our medical center is an exciting endeavor that will keep our staff functioning on the cutting edge of technology,\" said Capt. Mark Olesen, National Naval Medical Center's deputy commander. \"This is a great change for our staff and patients, because it propels us into the future of medicine, which is a world of immediate digital access, virtually unlimited and everlasting information storage capacity, and world-wide connectivity.\" Although CHCSII will not immediately eliminate the use of paper records, as hospital officials point out, it is the first step toward a more efficient and integrated Navy Medicine. \"The Navy currently maintains more than 500 military treatment facilities throughout the fleet; each with their own paper records keeping department. CHCSII will connect us all to each other with the click of a keypad,\" said Capt. Kenneth Senn, CHCSII project officer at the hospital. \"Eventually, after CHCSII is implemented worldwide, a sick or injured Sailor treated on a ship halfway around the world can be transferred to Bethesda and all of his medical information is accessible -- even if he didn't have time to grab his paper record.\" While the new system will benefit Navy Medicine, CHCSII is not a sea service specific initiative and is, in fact, designed to improve joint military medical operations. Proponents of the program have said CHCSII will improve interoperability between the branch services' health care systems through the use of one centralized system instead of the current separate medical structures for each branch. \"Enterprise-wide implementation of this system will support the commitment of the Defense Department to conduct population health management throughout the [Military Health System],\" Senn said. Bethesda is not the first site to transition to CHCSII. Several other military medical facilities have already undergone implantation, including Naval Medical Center Portsmouth. Naval Medical Center San Diego is currently in its CHCSII implementation process. Bethesda's phase-in of CHCSII, which starts this fall, will involve installation of new computer systems and software in all of the hospital's outpatient clinics. The new program will also require hands-on and lecture training for all clinicians who currently work with patients or paper records. \"[The hospital] does have a plan for an extended training period during this transition,\" said Steve Kelley, a CHCSII training project coordinator with the Staff Education and Training department. \"This training is not only mandatory, it is essential to knowing how to effectively and efficiently use this new electronic medical records technology.\" Navy article. Also, doctors, at least at the clinic I use, are now required to input patients visits themselves now via computer. No more speaking into the recorders and then having your medical records updated via a transcriptionist. Any one else that uses clinics noticed this?", 
        "threadID": "672198221_4130085712001", 
        "time": "2009-03-11 17:16:00", 
        "title": "A Catach 22 For Conservatives", 
        "userID": "jdksfcret"
    }, 
    {
        "content": "This thread gives new meaning to the term \"d i l d o\". How the plans of one private corporation correlate to the actions of the federal government is a leap of logic that would do Evel Knievel proud.", 
        "intTime": 20090311, 
        "postID": 8, 
        "quote": "", 
        "reply": "This thread gives new meaning to the term \"d i l d o\". How the plans of one private corporation correlate to the actions of the federal government is a leap of logic that would do Evel Knievel proud.", 
        "threadID": "672198221_4130085712001", 
        "time": "2009-03-11 18:54:00", 
        "title": "A Catach 22 For Conservatives", 
        "userID": "adminnco1"
    }, 
    {
        "content": "All this fear mongering from the right about a medical record database was notably absent, when Bush signed an executive order establishing this database in 2004: quote: In 2004, the President issued an Executive Order establishing the position of the National Coordinator for Health Information Technology within the Office of the Secretary of HHS. The primary purpose of this position is to aid the Secretary of HHS in achieving the President’s Goal for most Americans to have access to an interoperable electronic medical record by 2014. http://www.hhs.gov/healthit/onc/background/ quote: Executive Order: Incentives for the Use of Health Information Technology and Establishing the Position of the National Health Information Technology Coordinator Sec. 2. Policy. In fulfilling its responsibilities, the work of the National Coordinator shall be consistent with a vision of developing a nationwide interoperable health information technology infrastructure that: (a) Ensures that appropriate information to guide medical decisions is available at the time and place of care; (b) Improves health care quality, reduces medical errors, and advances the delivery of appropriate, evidence-based medical care; (c) Reduces health care costs resulting from inefficiency, medical errors, inappropriate care, and incomplete information; (d) Promotes a more effective marketplace, greater competition, and increased choice through the wider availability of accurate information on health care costs, quality, and outcomes; (e) Improves the coordination of care and information among hospitals, laboratories, physician offices, and other ambulatory care providers through an effective infrastructure for the secure and authorized exchange of health care information; and (f) Ensures that patients' individually identifiable health information is secure and protected. Sec. 3. Responsibilities of the National Health Information Technology Coordinator. (a) The National Coordinator shall, to the extent permitted by law, develop, maintain, and direct the implementation of a strategic plan to guide the nationwide implementation of interoperable health information technology in both the public and private health care sectors that will reduce medical errors, improve quality, and produce greater value for health care expenditures. The National Coordinator shall report to the Secretary regarding progress on the development and implementation of the strategic plan within 90 days after the National Coordinator begins operations and periodically thereafter. The plan shall: (i) Advance the development, adoption, and implementation of health care information technology standards nationally through collaboration among public and private interests, and consistent with current efforts to set health information technology standards for use by the Federal Government; (ii) Ensure that key technical, scientific, economic, and other issues affecting the public and private adoption of health information technology are addressed; (iii) Evaluate evidence on the benefits and costs of interoperable health information technology and assess to whom these benefits and costs accrue; (iv) Address privacy and security issues related to interoperable health information technology and recommend methods to ensure appropriate authorization, authentication, and encryption of data for transmission over the Internet; (v) Not assume or rely upon additional Federal resources or spending to accomplish adoption of interoperable health information technology; and (vi) Include measurable outcome goals. Full transcript here: \"http://web.archive.org/web/20080306071457/www.whitehouse.gov/news/releases/2004/04/20040427-4.html\"", 
        "intTime": 20090311, 
        "postID": 9, 
        "quote": "In 2004, the President issued an Executive Order establishing the position of the National Coordinator for Health Information Technology within the Office of the Secretary of HHS. The primary purpose of this position is to aid the Secretary of HHS in achieving the President’s Goal for most Americans to have access to an interoperable electronic medical record by 2014. http://www.hhs.gov/healthit/onc/background/", 
        "reply": "All this fear mongering from the right about a medical record database was notably absent, when Bush signed an executive order establishing this database in 2004:  quote: Executive Order: Incentives for the Use of Health Information Technology and Establishing the Position of the National Health Information Technology Coordinator Sec. 2. Policy. In fulfilling its responsibilities, the work of the National Coordinator shall be consistent with a vision of developing a nationwide interoperable health information technology infrastructure that: (a) Ensures that appropriate information to guide medical decisions is available at the time and place of care; (b) Improves health care quality, reduces medical errors, and advances the delivery of appropriate, evidence-based medical care; (c) Reduces health care costs resulting from inefficiency, medical errors, inappropriate care, and incomplete information; (d) Promotes a more effective marketplace, greater competition, and increased choice through the wider availability of accurate information on health care costs, quality, and outcomes; (e) Improves the coordination of care and information among hospitals, laboratories, physician offices, and other ambulatory care providers through an effective infrastructure for the secure and authorized exchange of health care information; and (f) Ensures that patients' individually identifiable health information is secure and protected. Sec. 3. Responsibilities of the National Health Information Technology Coordinator. (a) The National Coordinator shall, to the extent permitted by law, develop, maintain, and direct the implementation of a strategic plan to guide the nationwide implementation of interoperable health information technology in both the public and private health care sectors that will reduce medical errors, improve quality, and produce greater value for health care expenditures. The National Coordinator shall report to the Secretary regarding progress on the development and implementation of the strategic plan within 90 days after the National Coordinator begins operations and periodically thereafter. The plan shall: (i) Advance the development, adoption, and implementation of health care information technology standards nationally through collaboration among public and private interests, and consistent with current efforts to set health information technology standards for use by the Federal Government; (ii) Ensure that key technical, scientific, economic, and other issues affecting the public and private adoption of health information technology are addressed; (iii) Evaluate evidence on the benefits and costs of interoperable health information technology and assess to whom these benefits and costs accrue; (iv) Address privacy and security issues related to interoperable health information technology and recommend methods to ensure appropriate authorization, authentication, and encryption of data for transmission over the Internet; (v) Not assume or rely upon additional Federal resources or spending to accomplish adoption of interoperable health information technology; and (vi) Include measurable outcome goals. Full transcript here: \"http://web.archive.org/web/20080306071457/www.whitehouse.gov/news/releases/2004/04/20040427-4.html\"", 
        "threadID": "672198221_4130085712001", 
        "time": "2009-03-11 19:13:00", 
        "title": "A Catach 22 For Conservatives", 
        "userID": "Esample1"
    }, 
    {
        "content": "quote: Originally posted by esample1: All this fear mongering from the right about a medical record database was notably absent, when Bush signed an executive order establishing this database in 2004: quote: In 2004, the President issued an Executive Order establishing the position of the National Coordinator for Health Information Technology within the Office of the Secretary of HHS. The primary purpose of this position is to aid the Secretary of HHS in achieving the President’s Goal for most Americans to have access to an interoperable electronic medical record by 2014. http://www.hhs.gov/healthit/onc/background/ quote: Executive Order: Incentives for the Use of Health Information Technology and Establishing the Position of the National Health Information Technology Coordinator Sec. 2. Policy. In fulfilling its responsibilities, the work of the National Coordinator shall be consistent with a vision of developing a nationwide interoperable health information technology infrastructure that: (a) Ensures that appropriate information to guide medical decisions is available at the time and place of care; (b) Improves health care quality, reduces medical errors, and advances the delivery of appropriate, evidence-based medical care; (c) Reduces health care costs resulting from inefficiency, medical errors, inappropriate care, and incomplete information; (d) Promotes a more effective marketplace, greater competition, and increased choice through the wider availability of accurate information on health care costs, quality, and outcomes; (e) Improves the coordination of care and information among hospitals, laboratories, physician offices, and other ambulatory care providers through an effective infrastructure for the secure and authorized exchange of health care information; and (f) Ensures that patients' individually identifiable health information is secure and protected. Sec. 3. Responsibilities of the National Health Information Technology Coordinator. (a) The National Coordinator shall, to the extent permitted by law, develop, maintain, and direct the implementation of a strategic plan to guide the nationwide implementation of interoperable health information technology in both the public and private health care sectors that will reduce medical errors, improve quality, and produce greater value for health care expenditures. The National Coordinator shall report to the Secretary regarding progress on the development and implementation of the strategic plan within 90 days after the National Coordinator begins operations and periodically thereafter. The plan shall: (i) Advance the development, adoption, and implementation of health care information technology standards nationally through collaboration among public and private interests, and consistent with current efforts to set health information technology standards for use by the Federal Government; (ii) Ensure that key technical, scientific, economic, and other issues affecting the public and private adoption of health information technology are addressed; (iii) Evaluate evidence on the benefits and costs of interoperable health information technology and assess to whom these benefits and costs accrue; (iv) Address privacy and security issues related to interoperable health information technology and recommend methods to ensure appropriate authorization, authentication, and encryption of data for transmission over the Internet; (v) Not assume or rely upon additional Federal resources or spending to accomplish adoption of interoperable health information technology; and (vi) Include measurable outcome goals. Full transcript here: \"http://web.archive.org/web/20080306071457/www.whitehouse.gov/news/releases/2004/04/20040427-4.html\" But, but, but, that was then, this is now.", 
        "intTime": 20090311, 
        "postID": 10, 
        "quote": "Originally posted by esample1: All this fear mongering from the right about a medical record database was notably absent, when Bush signed an executive order establishing this database in 2004: quote: In 2004, the President issued an Executive Order establishing the position of the National Coordinator for Health Information Technology within the Office of the Secretary of HHS. The primary purpose of this position is to aid the Secretary of HHS in achieving the President’s Goal for most Americans to have access to an interoperable electronic medical record by 2014. http://www.hhs.gov/healthit/onc/background/ quote: Executive Order: Incentives for the Use of Health Information Technology and Establishing the Position of the National Health Information Technology Coordinator Sec. 2. Policy. In fulfilling its responsibilities, the work of the National Coordinator shall be consistent with a vision of developing a nationwide interoperable health information technology infrastructure that: (a) Ensures that appropriate information to guide medical decisions is available at the time and place of care; (b) Improves health care quality, reduces medical errors, and advances the delivery of appropriate, evidence-based medical care; (c) Reduces health care costs resulting from inefficiency, medical errors, inappropriate care, and incomplete information; (d) Promotes a more effective marketplace, greater competition, and increased choice through the wider availability of accurate information on health care costs, quality, and outcomes; (e) Improves the coordination of care and information among hospitals, laboratories, physician offices, and other ambulatory care providers through an effective infrastructure for the secure and authorized exchange of health care information; and (f) Ensures that patients' individually identifiable health information is secure and protected. Sec. 3. Responsibilities of the National Health Information Technology Coordinator. (a) The National Coordinator shall, to the extent permitted by law, develop, maintain, and direct the implementation of a strategic plan to guide the nationwide implementation of interoperable health information technology in both the public and private health care sectors that will reduce medical errors, improve quality, and produce greater value for health care expenditures. The National Coordinator shall report to the Secretary regarding progress on the development and implementation of the strategic plan within 90 days after the National Coordinator begins operations and periodically thereafter. The plan shall: (i) Advance the development, adoption, and implementation of health care information technology standards nationally through collaboration among public and private interests, and consistent with current efforts to set health information technology standards for use by the Federal Government; (ii) Ensure that key technical, scientific, economic, and other issues affecting the public and private adoption of health information technology are addressed; (iii) Evaluate evidence on the benefits and costs of interoperable health information technology and assess to whom these benefits and costs accrue; (iv) Address privacy and security issues related to interoperable health information technology and recommend methods to ensure appropriate authorization, authentication, and encryption of data for transmission over the Internet; (v) Not assume or rely upon additional Federal resources or spending to accomplish adoption of interoperable health information technology; and (vi) Include measurable outcome goals. Full transcript here: \"http://web.archive.org/web/20080306071457/www.whitehouse.gov/news/releases/2004/04/20040427-4.html\"", 
        "reply": " But, but, but, that was then, this is now.", 
        "threadID": "672198221_4130085712001", 
        "time": "2009-03-11 20:16:00", 
        "title": "A Catach 22 For Conservatives", 
        "userID": "jdksfcret"
    }, 
    {
        "content": "Electronic records are faster and a great way to keep records. However it must be all backed up with paper records. Electronic records subject to redundancy and loss. Databases can be accessed, altered, lost completely,and we all know what happens to electronic components in the event od EMPs they fry. So we actually need both. Computer data bases can be manipulated and actually be slower since they are very exacting machines. For example mail in speeding or traffic tickets can be slowed and manipulated by sending in a dollar more than your fine. The machine cannot close the file or assign any points to your license till everything is exact. That could take years and cause errors in the system and keep your insurance rates from increasing or in the event of another speeding ticket the revocation of your license since the records would show no prior points.", 
        "intTime": 20090311, 
        "postID": 11, 
        "quote": "", 
        "reply": "Electronic records are faster and a great way to keep records. However it must be all backed up with paper records. Electronic records subject to redundancy and loss. Databases can be accessed, altered, lost completely,and we all know what happens to electronic components in the event od EMPs they fry. So we actually need both. Computer data bases can be manipulated and actually be slower since they are very exacting machines. For example mail in speeding or traffic tickets can be slowed and manipulated by sending in a dollar more than your fine. The machine cannot close the file or assign any points to your license till everything is exact. That could take years and cause errors in the system and keep your insurance rates from increasing or in the event of another speeding ticket the revocation of your license since the records would show no prior points.", 
        "threadID": "672198221_4130085712001", 
        "time": "2009-03-11 22:48:00", 
        "title": "A Catach 22 For Conservatives", 
        "userID": "john2x"
    }, 
    {
        "content": "Yeah, what he said.", 
        "intTime": 20090311, 
        "postID": 12, 
        "quote": "", 
        "reply": "Yeah, what he said.", 
        "threadID": "672198221_4130085712001", 
        "time": "2009-03-11 23:08:00", 
        "title": "A Catach 22 For Conservatives", 
        "userID": "10Tenths"
    }, 
    {
        "content": "The VA has been putting everyones medical records on computers for years. This is all part of the big picture. The federal Gov't controls everything and everybody. In the future everybody will be known to everybody.", 
        "intTime": 20090312, 
        "postID": 13, 
        "quote": "", 
        "reply": "The VA has been putting everyones medical records on computers for years. This is all part of the big picture. The federal Gov't controls everything and everybody. In the future everybody will be known to everybody.", 
        "threadID": "672198221_4130085712001", 
        "time": "2009-03-12 04:14:00", 
        "title": "A Catach 22 For Conservatives", 
        "userID": "Duster6"
    }, 
    {
        "content": "The \"Beast\" will need to know everything about you so you can buy, sell, trade, etc... \"The World's Finest\"", 
        "intTime": 20090312, 
        "postID": 14, 
        "quote": "", 
        "reply": "The \"Beast\" will need to know everything about you so you can buy, sell, trade, etc... \"The World's Finest\"", 
        "threadID": "672198221_4130085712001", 
        "time": "2009-03-12 05:15:00", 
        "title": "A Catach 22 For Conservatives", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by Gladewalker: Not sure I folllow where the \"catch 22\" is... perhaps you could elucidate further? Are you saying the fact that the private sector (Wal Mart) knows how to do things better than gov't does is bad? Are you saying Wal Mart should be condemned for offering its own health care clinics to help people? Electronic records aren't by nature good or bad. They're just different than paper copies. It's not the COMPUTER Conservatives are leery of.. it's the access to what the records CONTAIN that we don't care for. The same would be true of access to paper records... Again, I must commend you crackerjack! You keep sending us these WONDERFULLY inspirational tidbits on how things aren't so bad after all! Please keep sending us these warm, caring bits of Pro-Conservative news that is sorely lacking in the mainstream media. It truly warms my heart to see how well Sarah Palin is doing in Alaska and that Wal Mart is taking such good care of people, lowering the costs of medical care and records while opening clinics in its stores to assist poor folks. . You just sent him to reread the book. BTW, it's spelled Catch! I don't know what a 'Catach' is!", 
        "intTime": 20090312, 
        "postID": 15, 
        "quote": "Originally posted by Gladewalker: Not sure I folllow where the \"catch 22\" is... perhaps you could elucidate further? Are you saying the fact that the private sector (Wal Mart) knows how to do things better than gov't does is bad? Are you saying Wal Mart should be condemned for offering its own health care clinics to help people? Electronic records aren't by nature good or bad. They're just different than paper copies. It's not the COMPUTER Conservatives are leery of.. it's the access to what the records CONTAIN that we don't care for. The same would be true of access to paper records... Again, I must commend you crackerjack! You keep sending us these WONDERFULLY inspirational tidbits on how things aren't so bad after all! Please keep sending us these warm, caring bits of Pro-Conservative news that is sorely lacking in the mainstream media. It truly warms my heart to see how well Sarah Palin is doing in Alaska and that Wal Mart is taking such good care of people, lowering the costs of medical care and records while opening clinics in its stores to assist poor folks.", 
        "reply": " . You just sent him to reread the book. BTW, it's spelled Catch! I don't know what a 'Catach' is!", 
        "threadID": "672198221_4130085712001", 
        "time": "2009-03-12 06:39:00", 
        "title": "A Catach 22 For Conservatives", 
        "userID": "busnrete8"
    }, 
    {
        "content": "Wait...since when was liking Wal-Mart a conservative trait? How, exactly, did the conservatives end up with the low-class stereotype? Remember the show Family Ties, and Michael J. Fox's character? I thought that's what a Republican stereotype was supposed to be. Somehow, Democrats are for the poor, while Republicans are for the rich, except that the Democrat voters are the best of society, while the Republican voters are gutter trash. Somehow that doesn't add up. Anyway, as far as our health records being in a national government database, yeah, I'm against it. Once the government finds out that I smoke (cigarettes), I will be denied mandatory medical care, for the good of the community.", 
        "intTime": 20090312, 
        "postID": 16, 
        "quote": "", 
        "reply": "Wait...since when was liking Wal-Mart a conservative trait? How, exactly, did the conservatives end up with the low-class stereotype? Remember the show Family Ties, and Michael J. Fox's character? I thought that's what a Republican stereotype was supposed to be. Somehow, Democrats are for the poor, while Republicans are for the rich, except that the Democrat voters are the best of society, while the Republican voters are gutter trash. Somehow that doesn't add up. Anyway, as far as our health records being in a national government database, yeah, I'm against it. Once the government finds out that I smoke (cigarettes), I will be denied mandatory medical care, for the good of the community.", 
        "threadID": "672198221_4130085712001", 
        "time": "2009-03-12 07:52:00", 
        "title": "A Catach 22 For Conservatives", 
        "userID": "Philhelm"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: All I hear everyday in the news, on the radio in this forum and others is how big a disaster it would be to go electronic on medical records and the same Conservative talk show and news articles say how great Wal Mart is. The catch 22 is Wal mart going electronic on the med records. What a clash and how are they going to argue those points together? Of course they won't since it's now a Wal Mart idea it will be a great plan and not an Obama disaster. Give me a break. It's about PRIVACY issues CJ. For anyone to say otherwise in BS. Look how many times electronic records are ABUSED in Gov. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090312, 
        "postID": 17, 
        "quote": "Originally posted by crackerjacks61: All I hear everyday in the news, on the radio in this forum and others is how big a disaster it would be to go electronic on medical records and the same Conservative talk show and news articles say how great Wal Mart is. The catch 22 is Wal mart going electronic on the med records. What a clash and how are they going to argue those points together? Of course they won't since it's now a Wal Mart idea it will be a great plan and not an Obama disaster. Give me a break.", 
        "reply": " It's about PRIVACY issues CJ. For anyone to say otherwise in BS. Look how many times electronic records are ABUSED in Gov. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_4130085712001", 
        "time": "2009-03-12 07:59:00", 
        "title": "A Catach 22 For Conservatives", 
        "userID": "L0A1"
    }, 
    {
        "content": "I didn't support Bush's big gov't schemes any more than Obama's. Dang someone needs to teach y'all the difference between a Republican, a Neo-Con and a Conservative. (And Bush was/is in the second category with Obama...) \"Common sense isn't.\"", 
        "intTime": 20090315, 
        "postID": 18, 
        "quote": "", 
        "reply": "I didn't support Bush's big gov't schemes any more than Obama's. Dang someone needs to teach y'all the difference between a Republican, a Neo-Con and a Conservative. (And Bush was/is in the second category with Obama...) \"Common sense isn't.\"", 
        "threadID": "672198221_4130085712001", 
        "time": "2009-03-15 18:49:00", 
        "title": "A Catach 22 For Conservatives", 
        "userID": "Gladewalker"
    }
]