[
    {
        "content": "From the army times, First Lady praises military women Will First Lady Michelle Obama have military women in for tea at the White House? That challenge was laid down Tuesday by retired Army Brig. Gen. Wilma Vaught at an event marking the start of Women’s History Month at the Women In Military Service For America Memorial at Arlington National Cemetery. “Do they still serve tea in the White House?” she asked. “And if they serve tea at the White House, are there any service women who would be willing to go?” Most of the more than 150 people in the audience were military women, and virtually all of them cheered and raised their hands. “You’re all invited. I think that’s an excellent idea,” Obama said, singling out one of her staff members who would be the point person. The First Lady praised the women’s memorial, and the women it honors who are serving and have served around the world. She included those who have been wounded, and those who have lost their lives in service. “I can’t think of a better way to begin Women’s History Month than coming here to the women’s memorial at Arlington National Cemetery to honor our nation’s service women,” she said. Vaught noted that in making service members and families a priority, Obama is following in the footsteps of Eleanor Roosevelt. If not for Roosevelt’s intervention with her husband President Franklin Roosevelt, women might not have been able to serve in the military, Vaught said. And Eleanor Roosevelt “frequently had service women in for tea at the White House,” which many women veterans of World War II have cited as their most memorable experience, Vaught said. Read full article at ... >http://www.armytimes.com/news/2009/03/military_michelleobama_women_030309w/", 
        "intTime": 20090304, 
        "postID": 1, 
        "quote": "", 
        "reply": "From the army times, First Lady praises military women Will First Lady Michelle Obama have military women in for tea at the White House? That challenge was laid down Tuesday by retired Army Brig. Gen. Wilma Vaught at an event marking the start of Women’s History Month at the Women In Military Service For America Memorial at Arlington National Cemetery. “Do they still serve tea in the White House?” she asked. “And if they serve tea at the White House, are there any service women who would be willing to go?” Most of the more than 150 people in the audience were military women, and virtually all of them cheered and raised their hands. “You’re all invited. I think that’s an excellent idea,” Obama said, singling out one of her staff members who would be the point person. The First Lady praised the women’s memorial, and the women it honors who are serving and have served around the world. She included those who have been wounded, and those who have lost their lives in service. “I can’t think of a better way to begin Women’s History Month than coming here to the women’s memorial at Arlington National Cemetery to honor our nation’s service women,” she said. Vaught noted that in making service members and families a priority, Obama is following in the footsteps of Eleanor Roosevelt. If not for Roosevelt’s intervention with her husband President Franklin Roosevelt, women might not have been able to serve in the military, Vaught said. And Eleanor Roosevelt “frequently had service women in for tea at the White House,” which many women veterans of World War II have cited as their most memorable experience, Vaught said. Read full article at ... >http://www.armytimes.com/news/2009/03/military_michelleobama_women_030309w/", 
        "threadID": "672198221_2980088612001", 
        "time": "2009-03-04 10:28:00", 
        "title": "First Lady praises military women", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "Wow, people really want the Obamas to be like the Roosevelts. Obama had already been compared to FDR, and now his wife is being compared to Eleanor. The media must have a real hard on for the thought of a New New Deal. As far as the article itself, it's nothing more than wartime lip service. Now that her husband is President she can be proud of her nation. What a fair-weather friend she is.", 
        "intTime": 20090304, 
        "postID": 2, 
        "quote": "", 
        "reply": "Wow, people really want the Obamas to be like the Roosevelts. Obama had already been compared to FDR, and now his wife is being compared to Eleanor. The media must have a real hard on for the thought of a New New Deal. As far as the article itself, it's nothing more than wartime lip service. Now that her husband is President she can be proud of her nation. What a fair-weather friend she is.", 
        "threadID": "672198221_2980088612001", 
        "time": "2009-03-04 10:48:00", 
        "title": "First Lady praises military women", 
        "userID": "Philhelm"
    }, 
    {
        "content": "Excellent cause, excellent work Mrs. Obama. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090304, 
        "postID": 3, 
        "quote": "", 
        "reply": "Excellent cause, excellent work Mrs. Obama. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_2980088612001", 
        "time": "2009-03-04 11:58:00", 
        "title": "First Lady praises military women", 
        "userID": "jack_flats"
    }, 
    {
        "content": "Does that mean she is now proud of her country?", 
        "intTime": 20090304, 
        "postID": 4, 
        "quote": "", 
        "reply": "Does that mean she is now proud of her country?", 
        "threadID": "672198221_2980088612001", 
        "time": "2009-03-04 12:13:00", 
        "title": "First Lady praises military women", 
        "userID": "KSHAYMAN"
    }, 
    {
        "content": "Minor detail: Wilma Vaught is a retired AF Brigadier General, not Army. We get snippy when our service branches are not described correctly. (Wonder of she was a \"retired Rear Admiral [Lower Half]\" in the Navy Times?)", 
        "intTime": 20090304, 
        "postID": 5, 
        "quote": "", 
        "reply": "Minor detail: Wilma Vaught is a retired AF Brigadier General, not Army. We get snippy when our service branches are not described correctly. (Wonder of she was a \"retired Rear Admiral [Lower Half]\" in the Navy Times?)", 
        "threadID": "672198221_2980088612001", 
        "time": "2009-03-04 12:24:00", 
        "title": "First Lady praises military women", 
        "userID": "Cider33_Alpha"
    }, 
    {
        "content": "quote: Originally posted by Philhelm: Wow, people really want the Obamas to be like the Roosevelts. Obama had already been compared to FDR, and now his wife is being compared to Eleanor. The media must have a real hard on for the thought of a New New Deal. As far as the article itself, it's nothing more than wartime lip service. Now that her husband is President she can be proud of her nation. What a fair-weather friend she is. If she didn't say anything to support service members, you'd slam her for not supporting the troops. And when she does make a supportive statement and positive gesture, you call it lip service. For people with your perspective, nothing will be good enough and nothing will make you happy. It must be a miserable life to see everything so negatively.", 
        "intTime": 20090304, 
        "postID": 6, 
        "quote": "Originally posted by Philhelm: Wow, people really want the Obamas to be like the Roosevelts. Obama had already been compared to FDR, and now his wife is being compared to Eleanor. The media must have a real hard on for the thought of a New New Deal. As far as the article itself, it's nothing more than wartime lip service. Now that her husband is President she can be proud of her nation. What a fair-weather friend she is.", 
        "reply": " If she didn't say anything to support service members, you'd slam her for not supporting the troops. And when she does make a supportive statement and positive gesture, you call it lip service. For people with your perspective, nothing will be good enough and nothing will make you happy. It must be a miserable life to see everything so negatively.", 
        "threadID": "672198221_2980088612001", 
        "time": "2009-03-04 12:32:00", 
        "title": "First Lady praises military women", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "quote: Originally posted by Whirled_Peas: quote: Originally posted by Philhelm: Wow, people really want the Obamas to be like the Roosevelts. Obama had already been compared to FDR, and now his wife is being compared to Eleanor. The media must have a real hard on for the thought of a New New Deal. As far as the article itself, it's nothing more than wartime lip service. Now that her husband is President she can be proud of her nation. What a fair-weather friend she is. If she didn't say anything to support service members, you'd slam her for not supporting the troops. And when she does make a supportive statement and positive gesture, you call it lip service. For people with your perspective, nothing will be good enough and nothing will make you happy. It must be a miserable life to see everything so negatively. While I agree with your comment in its entirety, I have a hard time reconciling the second part of it with your comment on the military divorce thread. It would seem that on any given issue, some of us tend to look at it negatively, others positively ... and neither consistently.", 
        "intTime": 20090304, 
        "postID": 7, 
        "quote": "Originally posted by Whirled_Peas: quote: Originally posted by Philhelm: Wow, people really want the Obamas to be like the Roosevelts. Obama had already been compared to FDR, and now his wife is being compared to Eleanor. The media must have a real hard on for the thought of a New New Deal. As far as the article itself, it's nothing more than wartime lip service. Now that her husband is President she can be proud of her nation. What a fair-weather friend she is. If she didn't say anything to support service members, you'd slam her for not supporting the troops. And when she does make a supportive statement and positive gesture, you call it lip service. For people with your perspective, nothing will be good enough and nothing will make you happy. It must be a miserable life to see everything so negatively.", 
        "reply": " While I agree with your comment in its entirety, I have a hard time reconciling the second part of it with your comment on the military divorce thread. It would seem that on any given issue, some of us tend to look at it negatively, others positively ... and neither consistently.", 
        "threadID": "672198221_2980088612001", 
        "time": "2009-03-04 13:15:00", 
        "title": "First Lady praises military women", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Originally posted by Whirled_Peas: quote: Originally posted by Philhelm: Wow, people really want the Obamas to be like the Roosevelts. Obama had already been compared to FDR, and now his wife is being compared to Eleanor. The media must have a real hard on for the thought of a New New Deal. As far as the article itself, it's nothing more than wartime lip service. Now that her husband is President she can be proud of her nation. What a fair-weather friend she is. If she didn't say anything to support service members, you'd slam her for not supporting the troops. And when she does make a supportive statement and positive gesture, you call it lip service. For people with your perspective, nothing will be good enough and nothing will make you happy. It must be a miserable life to see everything so negatively. Whenever you make an assumption, you make an azz out of you and umption. Seriously though, you assume too much, and you don't even try to counter my argument. So, are you saying it isn't lip service? Isn't military support usually lip service anyway (Yes, I realize she's not a politician, but she's still playing the game)? While I'll concede that the \"proud of her nation\" statement gets overplayed, it is still funny, and I will continue to use it when appropriate. On the other hand, perhaps she spoke with her heart when she put her foot in her mouth. In either case, I'm sure she loves her country now that her husband is President. To sum up, I'd prefer her not to play lipservice to the troops, so you're assumption is false. I have more respect for people who do and say what they mean, rather than playing political games. As much as I love my country, and always have, unlike our First Lady , in some respects I am glad that I am no longer actively serving in the military (although, I am in the IRR presently), since I feel that we are being used as political capital at this point. I hope people here don't misunderstand me on this issue. I feel that if we are to go to war, we go there to win. Use me to kill the enemy or assist others to do so, but don't use me as political capital. I'm not against the war, but at this point, if I were to be sent back, I would feel that it would be for nothing, fully expecting the dagger of Congress to be plunged in our backs for political gain whenever it is convenient for them to do so.", 
        "intTime": 20090304, 
        "postID": 8, 
        "quote": "Originally posted by Whirled_Peas: quote: Originally posted by Philhelm: Wow, people really want the Obamas to be like the Roosevelts. Obama had already been compared to FDR, and now his wife is being compared to Eleanor. The media must have a real hard on for the thought of a New New Deal. As far as the article itself, it's nothing more than wartime lip service. Now that her husband is President she can be proud of her nation. What a fair-weather friend she is. If she didn't say anything to support service members, you'd slam her for not supporting the troops. And when she does make a supportive statement and positive gesture, you call it lip service. For people with your perspective, nothing will be good enough and nothing will make you happy. It must be a miserable life to see everything so negatively.", 
        "reply": " Whenever you make an assumption, you make an azz out of you and umption. Seriously though, you assume too much, and you don't even try to counter my argument. So, are you saying it isn't lip service? Isn't military support usually lip service anyway (Yes, I realize she's not a politician, but she's still playing the game)? While I'll concede that the \"proud of her nation\" statement gets overplayed, it is still funny, and I will continue to use it when appropriate. On the other hand, perhaps she spoke with her heart when she put her foot in her mouth. In either case, I'm sure she loves her country now that her husband is President. To sum up, I'd prefer her not to play lipservice to the troops, so you're assumption is false. I have more respect for people who do and say what they mean, rather than playing political games. As much as I love my country, and always have, unlike our First Lady , in some respects I am glad that I am no longer actively serving in the military (although, I am in the IRR presently), since I feel that we are being used as political capital at this point. I hope people here don't misunderstand me on this issue. I feel that if we are to go to war, we go there to win. Use me to kill the enemy or assist others to do so, but don't use me as political capital. I'm not against the war, but at this point, if I were to be sent back, I would feel that it would be for nothing, fully expecting the dagger of Congress to be plunged in our backs for political gain whenever it is convenient for them to do so.", 
        "threadID": "672198221_2980088612001", 
        "time": "2009-03-04 13:44:00", 
        "title": "First Lady praises military women", 
        "userID": "Philhelm"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: Excellent cause, excellent work Mrs. Obama. Jackflats, Well said! Ditto for me. Jack", 
        "intTime": 20090304, 
        "postID": 9, 
        "quote": "Originally posted by jack_flats: Excellent cause, excellent work Mrs. Obama.", 
        "reply": " Jackflats, Well said! Ditto for me. Jack", 
        "threadID": "672198221_2980088612001", 
        "time": "2009-03-04 16:23:00", 
        "title": "First Lady praises military women", 
        "userID": "jackhunter1"
    }, 
    {
        "content": "quote: Originally posted by Whirled_Peas: quote: Originally posted by Philhelm: Wow, people really want the Obamas to be like the Roosevelts. Obama had already been compared to FDR, and now his wife is being compared to Eleanor. The media must have a real hard on for the thought of a New New Deal. As far as the article itself, it's nothing more than wartime lip service. Now that her husband is President she can be proud of her nation. What a fair-weather friend she is. If she didn't say anything to support service members, you'd slam her for not supporting the troops. And when she does make a supportive statement and positive gesture, you call it lip service. For people with your perspective, nothing will be good enough and nothing will make you happy. It must be a miserable life to see everything so negatively. It's not a matter of being negative but rather of not being duped. Having someone go around and read prepared speeches is hardly supportive of anything or anyone; it's just reading prepared speeches, no more, no less.", 
        "intTime": 20090304, 
        "postID": 10, 
        "quote": "Originally posted by Whirled_Peas: quote: Originally posted by Philhelm: Wow, people really want the Obamas to be like the Roosevelts. Obama had already been compared to FDR, and now his wife is being compared to Eleanor. The media must have a real hard on for the thought of a New New Deal. As far as the article itself, it's nothing more than wartime lip service. Now that her husband is President she can be proud of her nation. What a fair-weather friend she is. If she didn't say anything to support service members, you'd slam her for not supporting the troops. And when she does make a supportive statement and positive gesture, you call it lip service. For people with your perspective, nothing will be good enough and nothing will make you happy. It must be a miserable life to see everything so negatively.", 
        "reply": " It's not a matter of being negative but rather of not being duped. Having someone go around and read prepared speeches is hardly supportive of anything or anyone; it's just reading prepared speeches, no more, no less.", 
        "threadID": "672198221_2980088612001", 
        "time": "2009-03-04 18:48:00", 
        "title": "First Lady praises military women", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by Whirled_Peas: quote: Originally posted by Philhelm: Wow, people really want the Obamas to be like the Roosevelts. Obama had already been compared to FDR, and now his wife is being compared to Eleanor. The media must have a real hard on for the thought of a New New Deal. As far as the article itself, it's nothing more than wartime lip service. Now that her husband is President she can be proud of her nation. What a fair-weather friend she is. If she didn't say anything to support service members, you'd slam her for not supporting the troops. And when she does make a supportive statement and positive gesture, you call it lip service. For people with your perspective, nothing will be good enough and nothing will make you happy. It must be a miserable life to see everything so negatively. It's not a matter of being negative but rather of not being duped. Having someone go around and read prepared speeches is hardly supportive of anything or anyone; it's just reading prepared speeches, no more, no less. While her speech was, I assume, prepared, her response to the suggestion was not. What, are you brain dead?", 
        "intTime": 20090304, 
        "postID": 11, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by Whirled_Peas: quote: Originally posted by Philhelm: Wow, people really want the Obamas to be like the Roosevelts. Obama had already been compared to FDR, and now his wife is being compared to Eleanor. The media must have a real hard on for the thought of a New New Deal. As far as the article itself, it's nothing more than wartime lip service. Now that her husband is President she can be proud of her nation. What a fair-weather friend she is. If she didn't say anything to support service members, you'd slam her for not supporting the troops. And when she does make a supportive statement and positive gesture, you call it lip service. For people with your perspective, nothing will be good enough and nothing will make you happy. It must be a miserable life to see everything so negatively. It's not a matter of being negative but rather of not being duped. Having someone go around and read prepared speeches is hardly supportive of anything or anyone; it's just reading prepared speeches, no more, no less.", 
        "reply": " While her speech was, I assume, prepared, her response to the suggestion was not. What, are you brain dead?", 
        "threadID": "672198221_2980088612001", 
        "time": "2009-03-04 18:59:00", 
        "title": "First Lady praises military women", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by Whirled_Peas: quote: Originally posted by Philhelm: Wow, people really want the Obamas to be like the Roosevelts. Obama had already been compared to FDR, and now his wife is being compared to Eleanor. The media must have a real hard on for the thought of a New New Deal. As far as the article itself, it's nothing more than wartime lip service. Now that her husband is President she can be proud of her nation. What a fair-weather friend she is. If she didn't say anything to support service members, you'd slam her for not supporting the troops. And when she does make a supportive statement and positive gesture, you call it lip service. For people with your perspective, nothing will be good enough and nothing will make you happy. It must be a miserable life to see everything so negatively. On the contrary, it's not a miserable life except for the fact of a misguided policy on economics and mountains of debt we'll likely never recover from. Other then that, who said she was finally proud of her country? Nawww, I would call it 'lip service' as you say. I'd call it condescending and patronizing! Cut out the swine smell money, the study of bees and grape genetics money and I would agree with you.", 
        "intTime": 20090304, 
        "postID": 12, 
        "quote": "Originally posted by Whirled_Peas: quote: Originally posted by Philhelm: Wow, people really want the Obamas to be like the Roosevelts. Obama had already been compared to FDR, and now his wife is being compared to Eleanor. The media must have a real hard on for the thought of a New New Deal. As far as the article itself, it's nothing more than wartime lip service. Now that her husband is President she can be proud of her nation. What a fair-weather friend she is. If she didn't say anything to support service members, you'd slam her for not supporting the troops. And when she does make a supportive statement and positive gesture, you call it lip service. For people with your perspective, nothing will be good enough and nothing will make you happy. It must be a miserable life to see everything so negatively.", 
        "reply": " On the contrary, it's not a miserable life except for the fact of a misguided policy on economics and mountains of debt we'll likely never recover from. Other then that, who said she was finally proud of her country? Nawww, I would call it 'lip service' as you say. I'd call it condescending and patronizing! Cut out the swine smell money, the study of bees and grape genetics money and I would agree with you.", 
        "threadID": "672198221_2980088612001", 
        "time": "2009-03-04 19:18:00", 
        "title": "First Lady praises military women", 
        "userID": "busnrete8"
    }, 
    {
        "content": "quote: Originally posted by busnrete8: quote: Originally posted by Whirled_Peas: quote: Originally posted by Philhelm: Wow, people really want the Obamas to be like the Roosevelts. Obama had already been compared to FDR, and now his wife is being compared to Eleanor. The media must have a real hard on for the thought of a New New Deal. As far as the article itself, it's nothing more than wartime lip service. Now that her husband is President she can be proud of her nation. What a fair-weather friend she is. If she didn't say anything to support service members, you'd slam her for not supporting the troops. And when she does make a supportive statement and positive gesture, you call it lip service. For people with your perspective, nothing will be good enough and nothing will make you happy. It must be a miserable life to see everything so negatively. On the contrary, it's not a miserable life except for the fact of a misguided policy on economics and mountains of debt we'll likely never recover from. Other then that, who said she was finally proud of her country? Nawww, I would call it 'lip service' as you say. I'd call it condescending and patronizing! Cut out the swine smell money, the study of bees and grape genetics money and I would agree with you. Funny, Your new Republican spokesman mentioned volcano monitoring as pork. Those of us who live on the \"ring of fire\" don't exactly look at it that way. By the way, your beloved Palin governs a state on that self-same ring of fire. Bet she is a big backer of funds to the USGS.", 
        "intTime": 20090304, 
        "postID": 13, 
        "quote": "Originally posted by busnrete8: quote: Originally posted by Whirled_Peas: quote: Originally posted by Philhelm: Wow, people really want the Obamas to be like the Roosevelts. Obama had already been compared to FDR, and now his wife is being compared to Eleanor. The media must have a real hard on for the thought of a New New Deal. As far as the article itself, it's nothing more than wartime lip service. Now that her husband is President she can be proud of her nation. What a fair-weather friend she is. If she didn't say anything to support service members, you'd slam her for not supporting the troops. And when she does make a supportive statement and positive gesture, you call it lip service. For people with your perspective, nothing will be good enough and nothing will make you happy. It must be a miserable life to see everything so negatively. On the contrary, it's not a miserable life except for the fact of a misguided policy on economics and mountains of debt we'll likely never recover from. Other then that, who said she was finally proud of her country? Nawww, I would call it 'lip service' as you say. I'd call it condescending and patronizing! Cut out the swine smell money, the study of bees and grape genetics money and I would agree with you.", 
        "reply": " Funny, Your new Republican spokesman mentioned volcano monitoring as pork. Those of us who live on the \"ring of fire\" don't exactly look at it that way. By the way, your beloved Palin governs a state on that self-same ring of fire. Bet she is a big backer of funds to the USGS.", 
        "threadID": "672198221_2980088612001", 
        "time": "2009-03-04 19:22:00", 
        "title": "First Lady praises military women", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by Ol_Doc: quote: Originally posted by adminnco1: quote: Originally posted by Whirled_Peas: quote: Originally posted by Philhelm: Wow, people really want the Obamas to be like the Roosevelts. Obama had already been compared to FDR, and now his wife is being compared to Eleanor. The media must have a real hard on for the thought of a New New Deal. As far as the article itself, it's nothing more than wartime lip service. Now that her husband is President she can be proud of her nation. What a fair-weather friend she is. If she didn't say anything to support service members, you'd slam her for not supporting the troops. And when she does make a supportive statement and positive gesture, you call it lip service. For people with your perspective, nothing will be good enough and nothing will make you happy. It must be a miserable life to see everything so negatively. It's not a matter of being negative but rather of not being duped. Having someone go around and read prepared speeches is hardly supportive of anything or anyone; it's just reading prepared speeches, no more, no less. While her speech was, I assume, prepared, her response to the suggestion was not. What, are you brain dead? I think it was more like what we in education call \"the dog and pony show.\" Or in other words a very nice kodak moment. \"They love our milk and honey but they preach about some other way of living When you’re running down my country, Hoss you’re walking on the fighting side of me\" - - Merle Haggard", 
        "intTime": 20090304, 
        "postID": 14, 
        "quote": "Originally posted by Ol_Doc: quote: Originally posted by adminnco1: quote: Originally posted by Whirled_Peas: quote: Originally posted by Philhelm: Wow, people really want the Obamas to be like the Roosevelts. Obama had already been compared to FDR, and now his wife is being compared to Eleanor. The media must have a real hard on for the thought of a New New Deal. As far as the article itself, it's nothing more than wartime lip service. Now that her husband is President she can be proud of her nation. What a fair-weather friend she is. If she didn't say anything to support service members, you'd slam her for not supporting the troops. And when she does make a supportive statement and positive gesture, you call it lip service. For people with your perspective, nothing will be good enough and nothing will make you happy. It must be a miserable life to see everything so negatively. It's not a matter of being negative but rather of not being duped. Having someone go around and read prepared speeches is hardly supportive of anything or anyone; it's just reading prepared speeches, no more, no less. While her speech was, I assume, prepared, her response to the suggestion was not. What, are you brain dead?", 
        "reply": " I think it was more like what we in education call \"the dog and pony show.\" Or in other words a very nice kodak moment. \"They love our milk and honey but they preach about some other way of living When you’re running down my country, Hoss you’re walking on the fighting side of me\" - - Merle Haggard", 
        "threadID": "672198221_2980088612001", 
        "time": "2009-03-04 19:24:00", 
        "title": "First Lady praises military women", 
        "userID": "aggie_swife"
    }, 
    {
        "content": "I was not happy about her comment \"for the first time in my life, I am really proud of my country' but I think she knows she made a mistake and have we all not made a few in our time? Time will tell if the Obama's are really behind the military and their families but for now I want to hope that they are. I think they more than anyone will now have a new found respect for our military. They now have access to information on what is really going on behind the smoke and mirrors and just how much we depend on our military, just how much they do for us, and just how much they do without. I am hoping this will wake the Obama's up and they can wake up their party and our country as to just how much we need to respect and support our military.", 
        "intTime": 20090304, 
        "postID": 15, 
        "quote": "", 
        "reply": "I was not happy about her comment \"for the first time in my life, I am really proud of my country' but I think she knows she made a mistake and have we all not made a few in our time? Time will tell if the Obama's are really behind the military and their families but for now I want to hope that they are. I think they more than anyone will now have a new found respect for our military. They now have access to information on what is really going on behind the smoke and mirrors and just how much we depend on our military, just how much they do for us, and just how much they do without. I am hoping this will wake the Obama's up and they can wake up their party and our country as to just how much we need to respect and support our military.", 
        "threadID": "672198221_2980088612001", 
        "time": "2009-03-04 20:00:00", 
        "title": "First Lady praises military women", 
        "userID": "usa_girl"
    }, 
    {
        "content": "quote: Originally posted by Ol_Doc: quote: Originally posted by adminnco1: quote: Originally posted by Whirled_Peas: quote: Originally posted by Philhelm: Wow, people really want the Obamas to be like the Roosevelts. Obama had already been compared to FDR, and now his wife is being compared to Eleanor. The media must have a real hard on for the thought of a New New Deal. As far as the article itself, it's nothing more than wartime lip service. Now that her husband is President she can be proud of her nation. What a fair-weather friend she is. If she didn't say anything to support service members, you'd slam her for not supporting the troops. And when she does make a supportive statement and positive gesture, you call it lip service. For people with your perspective, nothing will be good enough and nothing will make you happy. It must be a miserable life to see everything so negatively. It's not a matter of being negative but rather of not being duped. Having someone go around and read prepared speeches is hardly supportive of anything or anyone; it's just reading prepared speeches, no more, no less. While her speech was, I assume, prepared, her response to the suggestion was not. What, are you brain dead? There you go, projecting again.", 
        "intTime": 20090305, 
        "postID": 16, 
        "quote": "Originally posted by Ol_Doc: quote: Originally posted by adminnco1: quote: Originally posted by Whirled_Peas: quote: Originally posted by Philhelm: Wow, people really want the Obamas to be like the Roosevelts. Obama had already been compared to FDR, and now his wife is being compared to Eleanor. The media must have a real hard on for the thought of a New New Deal. As far as the article itself, it's nothing more than wartime lip service. Now that her husband is President she can be proud of her nation. What a fair-weather friend she is. If she didn't say anything to support service members, you'd slam her for not supporting the troops. And when she does make a supportive statement and positive gesture, you call it lip service. For people with your perspective, nothing will be good enough and nothing will make you happy. It must be a miserable life to see everything so negatively. It's not a matter of being negative but rather of not being duped. Having someone go around and read prepared speeches is hardly supportive of anything or anyone; it's just reading prepared speeches, no more, no less. While her speech was, I assume, prepared, her response to the suggestion was not. What, are you brain dead?", 
        "reply": " There you go, projecting again.", 
        "threadID": "672198221_2980088612001", 
        "time": "2009-03-05 02:15:00", 
        "title": "First Lady praises military women", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by Philhelm: As much as I love my country, and always have, unlike our First Lady , Ugh. I just rolled my eyes straight out of my head.", 
        "intTime": 20090305, 
        "postID": 17, 
        "quote": "Originally posted by Philhelm: As much as I love my country, and always have, unlike our First Lady ,", 
        "reply": " Ugh. I just rolled my eyes straight out of my head.", 
        "threadID": "672198221_2980088612001", 
        "time": "2009-03-05 04:49:00", 
        "title": "First Lady praises military women", 
        "userID": "mrmixitup"
    }
]