[
    {
        "content": "If there were any new high profile prisoners captured in the past six years, there would have been an announcement – like when the Bush Administration announced the capture of Khalid Shaikh Mohammed and Abu Zubaydah. Dick Cheney says that since the Obama Administration does not use “enhanced interrogation techniques” that the country is “less safe” and that such a policy opens America to further attacks. Who does he want the Obama Administration to torture to make us safer? CIA Director Hayden, under the Bush Administration, testified before Congress in February 2008 that “enhanced interrogation techniques” had not been used since 2003. So what Cheney is saying is that since President Obama no longer allows the tactics that the Bush has NOT used since 2003, that the country is less safe. It does not make sense, but the bushies cling to whatever Dick says, even if it makes no sense. By the way, the Obama Administration is continuing the surveillance of communications within the United States, they are just following the law and using the FISA Court for oversight, AS REQUIRED BY LAW, is the only difference. So when Cheney says “when you get rid of enhanced interrogation techniques, for example, or the terrorist surveillance program, you reduce the intelligence flow to the intelligence community” THAT IS A LIE.", 
        "intTime": 20090514, 
        "postID": 1, 
        "quote": "", 
        "reply": "If there were any new high profile prisoners captured in the past six years, there would have been an announcement – like when the Bush Administration announced the capture of Khalid Shaikh Mohammed and Abu Zubaydah. Dick Cheney says that since the Obama Administration does not use “enhanced interrogation techniques” that the country is “less safe” and that such a policy opens America to further attacks. Who does he want the Obama Administration to torture to make us safer? CIA Director Hayden, under the Bush Administration, testified before Congress in February 2008 that “enhanced interrogation techniques” had not been used since 2003. So what Cheney is saying is that since President Obama no longer allows the tactics that the Bush has NOT used since 2003, that the country is less safe. It does not make sense, but the bushies cling to whatever Dick says, even if it makes no sense. By the way, the Obama Administration is continuing the surveillance of communications within the United States, they are just following the law and using the FISA Court for oversight, AS REQUIRED BY LAW, is the only difference. So when Cheney says “when you get rid of enhanced interrogation techniques, for example, or the terrorist surveillance program, you reduce the intelligence flow to the intelligence community” THAT IS A LIE.", 
        "threadID": "672198221_5070043322001", 
        "time": "2009-05-14 22:19:00", 
        "title": "Who does Cheney want tortured now?", 
        "userID": "xerello"
    }, 
    {
        "content": "xerello, you don't get it. The point is that by announcing to the world that we will not used enhanced interrogation techniques Mr. Obama has weakened the U.S.A. in several ways. He has told the world we have been committing crimes against prisoners whether that is true or not. He is telling terrorists and allies who mistake compassion for weakness that we will not even use the minimal techniques we have used in the past in order to obtain information that might save American lives he ties our intelligence operatives hands behind their backs by preventing them from using such techniques to obtain vital information from any terrorist captured in the future regardless of what information he might have. These techniques were not used willy-nilly against every prisoner we had in custody. They were only used in very specific cases under strict medical supervision when there was tangible evidence that a particular terrorist held information that was harmful to innocent citizens.", 
        "intTime": 20090515, 
        "postID": 2, 
        "quote": "", 
        "reply": "xerello, you don't get it. The point is that by announcing to the world that we will not used enhanced interrogation techniques Mr. Obama has weakened the U.S.A. in several ways. He has told the world we have been committing crimes against prisoners whether that is true or not. He is telling terrorists and allies who mistake compassion for weakness that we will not even use the minimal techniques we have used in the past in order to obtain information that might save American lives he ties our intelligence operatives hands behind their backs by preventing them from using such techniques to obtain vital information from any terrorist captured in the future regardless of what information he might have. These techniques were not used willy-nilly against every prisoner we had in custody. They were only used in very specific cases under strict medical supervision when there was tangible evidence that a particular terrorist held information that was harmful to innocent citizens.", 
        "threadID": "672198221_5070043322001", 
        "time": "2009-05-15 03:12:00", 
        "title": "Who does Cheney want tortured now?", 
        "userID": "M123Driver"
    }, 
    {
        "content": "Even if there was close medical supervision and very specific circumstances, torture is torture any way you put it. Torture shoudl not be allowed, and those who authorized it should be prosecuted to the fullest extent of the law, even if I have to locate people from left wing fringe groups, and get them into Harvard law school by being a dead-ringer and take the LSAT for them so they can get the highest possible score, AND do all their term papers producing A grade work on the only condition they become prosecutors and prosecute Cheney, and all others who authorized torture. If this is the only kind of way that America will prosecute the ones who authorized torture (private citizens being dead-ringers for compassionaate Ivy league candidates who want justice), and gain back the respect of the world community, than America is not the country I came of age thinking it was. Again, torture should not be allowed to be policy. Because maybe the next time, there will be budget cuts and there won't be money available for medical experts to watch the torturer's every move. There won't be time for the torturers to find \"very specific\" instances. Nobody can ever be sure if anybody is going to have the incentive or the resources to conduct such full scale investigations, as to weed out the real terrorists who know things. As long as torture is allowed, you open the door wide for anything to happen. quote: Originally posted by M123Driver: xerello, you don't get it. The point is that by announcing to the world that we will not used enhanced interrogation techniques Mr. Obama has weakened the U.S.A. in several ways. He has told the world we have been committing crimes against prisoners whether that is true or not. He is telling terrorists and allies who mistake compassion for weakness that we will not even use the minimal techniques we have used in the past in order to obtain information that might save American lives he ties our intelligence operatives hands behind their backs by preventing them from using such techniques to obtain vital information from any terrorist captured in the future regardless of what information he might have. These techniques were not used willy-nilly against every prisoner we had in custody. They were only used in very specific cases under strict medical supervision when there was tangible evidence that a particular terrorist held information that was harmful to innocent citizens. This message has been edited. Last edited by: cybercafe, Fri 15 May 2009 04:21 AM", 
        "intTime": 20090515, 
        "postID": 3, 
        "quote": "Originally posted by M123Driver: xerello, you don't get it. The point is that by announcing to the world that we will not used enhanced interrogation techniques Mr. Obama has weakened the U.S.A. in several ways. He has told the world we have been committing crimes against prisoners whether that is true or not. He is telling terrorists and allies who mistake compassion for weakness that we will not even use the minimal techniques we have used in the past in order to obtain information that might save American lives he ties our intelligence operatives hands behind their backs by preventing them from using such techniques to obtain vital information from any terrorist captured in the future regardless of what information he might have. These techniques were not used willy-nilly against every prisoner we had in custody. They were only used in very specific cases under strict medical supervision when there was tangible evidence that a particular terrorist held information that was harmful to innocent citizens.", 
        "reply": "Even if there was close medical supervision and very specific circumstances, torture is torture any way you put it. Torture shoudl not be allowed, and those who authorized it should be prosecuted to the fullest extent of the law, even if I have to locate people from left wing fringe groups, and get them into Harvard law school by being a dead-ringer and take the LSAT for them so they can get the highest possible score, AND do all their term papers producing A grade work on the only condition they become prosecutors and prosecute Cheney, and all others who authorized torture. If this is the only kind of way that America will prosecute the ones who authorized torture (private citizens being dead-ringers for compassionaate Ivy league candidates who want justice), and gain back the respect of the world community, than America is not the country I came of age thinking it was. Again, torture should not be allowed to be policy. Because maybe the next time, there will be budget cuts and there won't be money available for medical experts to watch the torturer's every move. There won't be time for the torturers to find \"very specific\" instances. Nobody can ever be sure if anybody is going to have the incentive or the resources to conduct such full scale investigations, as to weed out the real terrorists who know things. As long as torture is allowed, you open the door wide for anything to happen.  This message has been edited. Last edited by: cybercafe, Fri 15 May 2009 04:21 AM", 
        "threadID": "672198221_5070043322001", 
        "time": "2009-05-15 03:49:00", 
        "title": "Who does Cheney want tortured now?", 
        "userID": "cybercafe"
    }, 
    {
        "content": "quote: Who does he want the Obama Administration to torture to make us safer? ....at the moment Nancy would come to mind for both Dick and Barry... Already past the future", 
        "intTime": 20090515, 
        "postID": 4, 
        "quote": "Who does he want the Obama Administration to torture to make us safer?", 
        "reply": " ....at the moment Nancy would come to mind for both Dick and Barry... Already past the future", 
        "threadID": "672198221_5070043322001", 
        "time": "2009-05-15 03:52:00", 
        "title": "Who does Cheney want tortured now?", 
        "userID": "6486143"
    }, 
    {
        "content": "We all get tortured every time Deadeye Dick opens his mouth. He makes nails on the chalkboard sound good.", 
        "intTime": 20090515, 
        "postID": 5, 
        "quote": "", 
        "reply": "We all get tortured every time Deadeye Dick opens his mouth. He makes nails on the chalkboard sound good.", 
        "threadID": "672198221_5070043322001", 
        "time": "2009-05-15 04:43:00", 
        "title": "Who does Cheney want tortured now?", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by xerello: If there were any new high profile prisoners captured in the past six years, there would have been an announcement – like when the Bush Administration announced the capture of Khalid Shaikh Mohammed and Abu Zubaydah. Dick Cheney says that since the Obama Administration does not use “enhanced interrogation techniques” that the country is “less safe” and that such a policy opens America to further attacks. Who does he want the Obama Administration to torture to make us safer? CIA Director Hayden, under the Bush Administration, testified before Congress in February 2008 that “enhanced interrogation techniques” had not been used since 2003. So what Cheney is saying is that since President Obama no longer allows the tactics that the Bush has NOT used since 2003, that the country is less safe. It does not make sense, but the bushies cling to whatever Dick says, even if it makes no sense. By the way, the Obama Administration is continuing the surveillance of communications within the United States, they are just following the law and using the FISA Court for oversight, AS REQUIRED BY LAW, is the only difference. So when Cheney says “when you get rid of enhanced interrogation techniques, for example, or the terrorist surveillance program, you reduce the intelligence flow to the intelligence community” THAT IS A LIE. Hes arguing to keep the option on the table. I know that must be hard for you to understand.", 
        "intTime": 20090515, 
        "postID": 6, 
        "quote": "Originally posted by xerello: If there were any new high profile prisoners captured in the past six years, there would have been an announcement – like when the Bush Administration announced the capture of Khalid Shaikh Mohammed and Abu Zubaydah. Dick Cheney says that since the Obama Administration does not use “enhanced interrogation techniques” that the country is “less safe” and that such a policy opens America to further attacks. Who does he want the Obama Administration to torture to make us safer? CIA Director Hayden, under the Bush Administration, testified before Congress in February 2008 that “enhanced interrogation techniques” had not been used since 2003. So what Cheney is saying is that since President Obama no longer allows the tactics that the Bush has NOT used since 2003, that the country is less safe. It does not make sense, but the bushies cling to whatever Dick says, even if it makes no sense. By the way, the Obama Administration is continuing the surveillance of communications within the United States, they are just following the law and using the FISA Court for oversight, AS REQUIRED BY LAW, is the only difference. So when Cheney says “when you get rid of enhanced interrogation techniques, for example, or the terrorist surveillance program, you reduce the intelligence flow to the intelligence community” THAT IS A LIE.", 
        "reply": " Hes arguing to keep the option on the table. I know that must be hard for you to understand.", 
        "threadID": "672198221_5070043322001", 
        "time": "2009-05-15 05:42:00", 
        "title": "Who does Cheney want tortured now?", 
        "userID": "NickBrand"
    }, 
    {
        "content": "I think the real question about water boarding should be \"If we had water boarded Dick H Cheney and bush while they were lying about WMD could we have saved over 4000 thousand American lives\"?", 
        "intTime": 20090515, 
        "postID": 7, 
        "quote": "", 
        "reply": "I think the real question about water boarding should be \"If we had water boarded Dick H Cheney and bush while they were lying about WMD could we have saved over 4000 thousand American lives\"?", 
        "threadID": "672198221_5070043322001", 
        "time": "2009-05-15 06:09:00", 
        "title": "Who does Cheney want tortured now?", 
        "userID": "6837602"
    }, 
    {
        "content": "IS the OP doing an Op Ed or is there a news article along with the commentary, this is 'In The News'.", 
        "intTime": 20090515, 
        "postID": 8, 
        "quote": "", 
        "reply": "IS the OP doing an Op Ed or is there a news article along with the commentary, this is 'In The News'.", 
        "threadID": "672198221_5070043322001", 
        "time": "2009-05-15 07:10:00", 
        "title": "Who does Cheney want tortured now?", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by 6837602: I think the real question about water boarding should be \"If we had water boarded Dick H Cheney and bush while they were lying about WMD could we have saved over 4000 thousand American lives\"? Only if you water boarded various national spy agancies, the UN Security Council & the Clinton Administration, along with a few Senate & Congressional committees.", 
        "intTime": 20090515, 
        "postID": 9, 
        "quote": "Originally posted by 6837602: I think the real question about water boarding should be \"If we had water boarded Dick H Cheney and bush while they were lying about WMD could we have saved over 4000 thousand American lives\"?", 
        "reply": " Only if you water boarded various national spy agancies, the UN Security Council & the Clinton Administration, along with a few Senate & Congressional committees.", 
        "threadID": "672198221_5070043322001", 
        "time": "2009-05-15 07:12:00", 
        "title": "Who does Cheney want tortured now?", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by 67NOV: IS the OP doing an Op Ed or is there a news article along with the commentary, this is 'In The News'. Cheney is all over the news covering his azz. Google Cheney, memo and you will get thousands of news links.", 
        "intTime": 20090515, 
        "postID": 10, 
        "quote": "Originally posted by 67NOV: IS the OP doing an Op Ed or is there a news article along with the commentary, this is 'In The News'.", 
        "reply": " Cheney is all over the news covering his azz. Google Cheney, memo and you will get thousands of news links.", 
        "threadID": "672198221_5070043322001", 
        "time": "2009-05-15 07:57:00", 
        "title": "Who does Cheney want tortured now?", 
        "userID": "xerello"
    }, 
    {
        "content": "quote: Originally posted by xerello: So when Cheney says “when you get rid of enhanced interrogation techniques, for example, or the terrorist surveillance program, you reduce the intelligence flow to the intelligence community” THAT IS A LIE. quote: Originally posted by NickBrand: Hes arguing to keep the option on the table. I know that must be hard for you to understand. How can you keep a crime as an option on the table? More or less like saying when I argue with someone over a parking space, killing them should be an option on the table. We never had that option before, never had it on the table. What other options you want on the table? Gas warfare? Biological weapons? Dave", 
        "intTime": 20090515, 
        "postID": 11, 
        "quote": "Originally posted by xerello: So when Cheney says “when you get rid of enhanced interrogation techniques, for example, or the terrorist surveillance program, you reduce the intelligence flow to the intelligence community” THAT IS A LIE.", 
        "reply": " quote: Originally posted by NickBrand: Hes arguing to keep the option on the table. I know that must be hard for you to understand. How can you keep a crime as an option on the table? More or less like saying when I argue with someone over a parking space, killing them should be an option on the table. We never had that option before, never had it on the table. What other options you want on the table? Gas warfare? Biological weapons? Dave", 
        "threadID": "672198221_5070043322001", 
        "time": "2009-05-15 09:23:00", 
        "title": "Who does Cheney want tortured now?", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by xerello: quote: Originally posted by 67NOV: IS the OP doing an Op Ed or is there a news article along with the commentary, this is 'In The News'. Cheney is all over the news covering his azz. Google Cheney, memo and you will get thousands of news links. As OP that's your job, otherwise this should be in 'point/counter-point'.", 
        "intTime": 20090515, 
        "postID": 12, 
        "quote": "Originally posted by xerello: quote: Originally posted by 67NOV: IS the OP doing an Op Ed or is there a news article along with the commentary, this is 'In The News'. Cheney is all over the news covering his azz. Google Cheney, memo and you will get thousands of news links.", 
        "reply": " As OP that's your job, otherwise this should be in 'point/counter-point'.", 
        "threadID": "672198221_5070043322001", 
        "time": "2009-05-15 10:01:00", 
        "title": "Who does Cheney want tortured now?", 
        "userID": "67NOV"
    }, 
    {
        "content": "Bush did not lie about WMD's in Iraq, You better get your facts correct before you post. It was Clinton, Kerry and Democrats would said Iraq had WMD's long before Bush was even President...So get your facts correct before you posts untruths... Those same people (except for one) NEVER told Bush anything different when he took office. So when 9/11 happen, it was a open plate for Bush. If Bush lied, then it was that he repeated Clinton, Kerry and democrats lies... Now if I was Cheney I would water board Clinton, Kerry ( a few extra times ) and all the members of the democrat party that said Iraq had WMD's...Before Bush was President..Wow, just thought of something, does that include Clinton's wife? after all she did vote to go into Iraq, so she must have agree to Iraq having WMD's also...a family affair I see.", 
        "intTime": 20090515, 
        "postID": 13, 
        "quote": "", 
        "reply": "Bush did not lie about WMD's in Iraq, You better get your facts correct before you post. It was Clinton, Kerry and Democrats would said Iraq had WMD's long before Bush was even President...So get your facts correct before you posts untruths... Those same people (except for one) NEVER told Bush anything different when he took office. So when 9/11 happen, it was a open plate for Bush. If Bush lied, then it was that he repeated Clinton, Kerry and democrats lies... Now if I was Cheney I would water board Clinton, Kerry ( a few extra times ) and all the members of the democrat party that said Iraq had WMD's...Before Bush was President..Wow, just thought of something, does that include Clinton's wife? after all she did vote to go into Iraq, so she must have agree to Iraq having WMD's also...a family affair I see.", 
        "threadID": "672198221_5070043322001", 
        "time": "2009-05-15 10:05:00", 
        "title": "Who does Cheney want tortured now?", 
        "userID": "dman1948"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by xerello: So when Cheney says “when you get rid of enhanced interrogation techniques, for example, or the terrorist surveillance program, you reduce the intelligence flow to the intelligence community” THAT IS A LIE. quote: Originally posted by NickBrand: Hes arguing to keep the option on the table. I know that must be hard for you to understand. How can you keep a crime as an option on the table? More or less like saying when I argue with someone over a parking space, killing them should be an option on the table. We never had that option before, never had it on the table. What other options you want on the table? Gas warfare? Biological weapons? Dave That's complete B.S. The option has always been there whether or not politicians knew it was going on and turned a blind is another story. Churchill said English never tortured during WWII but in fact they did. He didn't give a crap whether or not Nazis were tortured or not as long as the information that was vital to the winning of the war was good. That is a historical fact. If you think this country hasn't used nefarious methods throughout our history to gain intel your drinking to much kool-aid. By either turning these people over to some other government to do the torture for us ie Rendition or doing it ourselves it makes absolutely no difference as long as we get the information we are looking for. It's been done and whether or not that changes will remain to be seen. Honestly I could give two shiits whether or not those people were waterboarded or tortured. What I care about is the American people's defense and the safety of this country's innocent civilians. I wouldn't condone the use of any of those techniques on a simple matter of robbery or anything else but I would condone it if the lives of thousands of this countries civilians were on the line because of an impending attack. That's my own opinion on the matter and when it comes to my family and their saftey I'm willing to use whatever is necessary to tend to their safety. You obviously differ in that opinion which is your right and I respect that.", 
        "intTime": 20090515, 
        "postID": 14, 
        "quote": "Originally posted by Grachus: quote: Originally posted by xerello: So when Cheney says “when you get rid of enhanced interrogation techniques, for example, or the terrorist surveillance program, you reduce the intelligence flow to the intelligence community” THAT IS A LIE. quote: Originally posted by NickBrand: Hes arguing to keep the option on the table. I know that must be hard for you to understand. How can you keep a crime as an option on the table? More or less like saying when I argue with someone over a parking space, killing them should be an option on the table. We never had that option before, never had it on the table. What other options you want on the table? Gas warfare? Biological weapons? Dave", 
        "reply": " That's complete B.S. The option has always been there whether or not politicians knew it was going on and turned a blind is another story. Churchill said English never tortured during WWII but in fact they did. He didn't give a crap whether or not Nazis were tortured or not as long as the information that was vital to the winning of the war was good. That is a historical fact. If you think this country hasn't used nefarious methods throughout our history to gain intel your drinking to much kool-aid. By either turning these people over to some other government to do the torture for us ie Rendition or doing it ourselves it makes absolutely no difference as long as we get the information we are looking for. It's been done and whether or not that changes will remain to be seen. Honestly I could give two shiits whether or not those people were waterboarded or tortured. What I care about is the American people's defense and the safety of this country's innocent civilians. I wouldn't condone the use of any of those techniques on a simple matter of robbery or anything else but I would condone it if the lives of thousands of this countries civilians were on the line because of an impending attack. That's my own opinion on the matter and when it comes to my family and their saftey I'm willing to use whatever is necessary to tend to their safety. You obviously differ in that opinion which is your right and I respect that.", 
        "threadID": "672198221_5070043322001", 
        "time": "2009-05-15 10:20:00", 
        "title": "Who does Cheney want tortured now?", 
        "userID": "NickBrand"
    }, 
    {
        "content": "quote: Originally posted by NickBrand: quote: Originally posted by Grachus: quote: Originally posted by xerello: So when Cheney says “when you get rid of enhanced interrogation techniques, for example, or the terrorist surveillance program, you reduce the intelligence flow to the intelligence community” THAT IS A LIE. quote: Originally posted by NickBrand: Hes arguing to keep the option on the table. I know that must be hard for you to understand. How can you keep a crime as an option on the table? More or less like saying when I argue with someone over a parking space, killing them should be an option on the table. We never had that option before, never had it on the table. What other options you want on the table? Gas warfare? Biological weapons? Dave That's complete B.S. The option has always been there whether or not politicians knew it was going on and turned a blind is another story. Churchill said English never tortured during WWII but in fact they did. He didn't give a crap whether or not Nazis were tortured or not as long as the information that was vital to the winning of the war was good. That is a historical fact. If you think this country hasn't used nefarious methods throughout our history to gain intel your drinking to much kool-aid. By either turning these people over to some other government to do the torture for us ie Rendition or doing it ourselves it makes absolutely no difference as long as we get the information we are looking for. It's been done and whether or not that changes will remain to be seen. Honestly I could give two shiits whether or not those people were waterboarded or tortured. What I care about is the American people's defense and the safety of this country's innocent civilians. I wouldn't condone the use of any of those techniques on a simple matter of robbery or anything else but I would condone it if the lives of thousands of this countries civilians were on the line because of an impending attack. That's my own opinion on the matter and when it comes to my family and their saftey I'm willing to use whatever is necessary to tend to their safety. You obviously differ in that opinion which is your right and I respect that. Churchill used torture? How about Mother Teresa? Got any proof? \"http://blogs.abcnews.com/politicalpunch/2009/05/what-was-church.html\" Dave", 
        "intTime": 20090515, 
        "postID": 15, 
        "quote": "Originally posted by NickBrand: quote: Originally posted by Grachus: quote: Originally posted by xerello: So when Cheney says “when you get rid of enhanced interrogation techniques, for example, or the terrorist surveillance program, you reduce the intelligence flow to the intelligence community” THAT IS A LIE. quote: Originally posted by NickBrand: Hes arguing to keep the option on the table. I know that must be hard for you to understand. How can you keep a crime as an option on the table? More or less like saying when I argue with someone over a parking space, killing them should be an option on the table. We never had that option before, never had it on the table. What other options you want on the table? Gas warfare? Biological weapons? Dave That's complete B.S. The option has always been there whether or not politicians knew it was going on and turned a blind is another story. Churchill said English never tortured during WWII but in fact they did. He didn't give a crap whether or not Nazis were tortured or not as long as the information that was vital to the winning of the war was good. That is a historical fact. If you think this country hasn't used nefarious methods throughout our history to gain intel your drinking to much kool-aid. By either turning these people over to some other government to do the torture for us ie Rendition or doing it ourselves it makes absolutely no difference as long as we get the information we are looking for. It's been done and whether or not that changes will remain to be seen. Honestly I could give two shiits whether or not those people were waterboarded or tortured. What I care about is the American people's defense and the safety of this country's innocent civilians. I wouldn't condone the use of any of those techniques on a simple matter of robbery or anything else but I would condone it if the lives of thousands of this countries civilians were on the line because of an impending attack. That's my own opinion on the matter and when it comes to my family and their saftey I'm willing to use whatever is necessary to tend to their safety. You obviously differ in that opinion which is your right and I respect that.", 
        "reply": " Churchill used torture? How about Mother Teresa? Got any proof? \"http://blogs.abcnews.com/politicalpunch/2009/05/what-was-church.html\" Dave", 
        "threadID": "672198221_5070043322001", 
        "time": "2009-05-15 10:32:00", 
        "title": "Who does Cheney want tortured now?", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by M123Driver: xerello, you don't get it. The point is that by announcing to the world that we will not used enhanced interrogation techniques Mr. Obama has weakened the U.S.A. in several ways. He has told the world we have been committing crimes against prisoners whether that is true or not. He is telling terrorists and allies who mistake compassion for weakness that we will not even use the minimal techniques we have used in the past in order to obtain information that might save American lives he ties our intelligence operatives hands behind their backs by preventing them from using such techniques to obtain vital information from any terrorist captured in the future regardless of what information he might have. These techniques were not used willy-nilly against every prisoner we had in custody. They were only used in very specific cases under strict medical supervision when there was tangible evidence that a particular terrorist held information that was harmful to innocent citizens. President Obama did not tell the world that crimes had been committed against prisoners, the Bush Administration did. Dick Cheney has admitted that he approved waterboarding, CIA Director Hayden admitted in testimony to Congress that prisoners have been waterboarded and President Bush himself admitted in May 2008 that waterboarding has been used on prisoners. The world knew about the waterboarding long before President Obama was elected. It is not true that interrogation techniques - interrogation methods that professional interrogators insist are EFFECTIVE in getting information from even hard-core al Qaeda are still available for use. It is true that the government no longer hires contractors to torture people. As the FBI agent testified before Congress, al-Qaeda members are trained to be prepared for the type of torture they would get if they were captured in Saudi Arabia or Egypt – even the Bush Administration did not go that far. So they are well prepared for anything that American torturers can dish out. It is a false argument that the memos provided information that helps the enemy to prepare for what might happen if they are captured by American forces. Contrary to what Rush or Hannity told you, the memos do not describe the torture methods used by CIA contractors. What they cannot prepare for is being outsmarted by a professional interrogator who will not even threaten physical torture. But this is not a is torture legal or effective or neccessary thread. Cheney claims that since waterboarding and other torture techniques are no longer used, America is less safe. The question is – how can one reach the conclusion that because no one is being tortured right now, American is less safe from attack?", 
        "intTime": 20090515, 
        "postID": 16, 
        "quote": "Originally posted by M123Driver: xerello, you don't get it. The point is that by announcing to the world that we will not used enhanced interrogation techniques Mr. Obama has weakened the U.S.A. in several ways. He has told the world we have been committing crimes against prisoners whether that is true or not. He is telling terrorists and allies who mistake compassion for weakness that we will not even use the minimal techniques we have used in the past in order to obtain information that might save American lives he ties our intelligence operatives hands behind their backs by preventing them from using such techniques to obtain vital information from any terrorist captured in the future regardless of what information he might have. These techniques were not used willy-nilly against every prisoner we had in custody. They were only used in very specific cases under strict medical supervision when there was tangible evidence that a particular terrorist held information that was harmful to innocent citizens.", 
        "reply": " President Obama did not tell the world that crimes had been committed against prisoners, the Bush Administration did. Dick Cheney has admitted that he approved waterboarding, CIA Director Hayden admitted in testimony to Congress that prisoners have been waterboarded and President Bush himself admitted in May 2008 that waterboarding has been used on prisoners. The world knew about the waterboarding long before President Obama was elected. It is not true that interrogation techniques - interrogation methods that professional interrogators insist are EFFECTIVE in getting information from even hard-core al Qaeda are still available for use. It is true that the government no longer hires contractors to torture people. As the FBI agent testified before Congress, al-Qaeda members are trained to be prepared for the type of torture they would get if they were captured in Saudi Arabia or Egypt – even the Bush Administration did not go that far. So they are well prepared for anything that American torturers can dish out. It is a false argument that the memos provided information that helps the enemy to prepare for what might happen if they are captured by American forces. Contrary to what Rush or Hannity told you, the memos do not describe the torture methods used by CIA contractors. What they cannot prepare for is being outsmarted by a professional interrogator who will not even threaten physical torture. But this is not a is torture legal or effective or neccessary thread. Cheney claims that since waterboarding and other torture techniques are no longer used, America is less safe. The question is – how can one reach the conclusion that because no one is being tortured right now, American is less safe from attack?", 
        "threadID": "672198221_5070043322001", 
        "time": "2009-05-15 10:47:00", 
        "title": "Who does Cheney want tortured now?", 
        "userID": "xerello"
    }, 
    {
        "content": "quote: Originally posted by 67NOV: quote: Originally posted by xerello: quote: Originally posted by 67NOV: IS the OP doing an Op Ed or is there a news article along with the commentary, this is 'In The News'. Cheney is all over the news covering his azz. Google Cheney, memo and you will get thousands of news links. As OP that's your job, otherwise this should be in 'point/counter-point'. >http://www.upi.com/Top_News/2009/05/12/Cheney-defends-Bush-anti-terror-policies/UPI-36011242173364/ >http://www.cqpolitics.com/wmspage.cfm?docID=news-000003114272 Now will you answer the question of the thread? quote: Who does Cheney want the Obama Administration to torture to make us safer?", 
        "intTime": 20090515, 
        "postID": 17, 
        "quote": "Originally posted by 67NOV: quote: Originally posted by xerello: quote: Originally posted by 67NOV: IS the OP doing an Op Ed or is there a news article along with the commentary, this is 'In The News'. Cheney is all over the news covering his azz. Google Cheney, memo and you will get thousands of news links. As OP that's your job, otherwise this should be in 'point/counter-point'.", 
        "reply": " >http://www.upi.com/Top_News/2009/05/12/Cheney-defends-Bush-anti-terror-policies/UPI-36011242173364/ >http://www.cqpolitics.com/wmspage.cfm?docID=news-000003114272 Now will you answer the question of the thread? quote: Who does Cheney want the Obama Administration to torture to make us safer?", 
        "threadID": "672198221_5070043322001", 
        "time": "2009-05-15 10:57:00", 
        "title": "Who does Cheney want tortured now?", 
        "userID": "xerello"
    }, 
    {
        "content": "quote: Originally posted by xerello: Now will you answer the question of the thread? quote: Who does Cheney want the Obama Administration to torture to make us safer? Guilty of ball busting. To the question, it would depend on who is in custody, what they are suspected of, etc. I don't think \"Darth\" Cheney wants to go around, willy-nilly waterboarding folks for schits & gigles. Use it when deemed necesary.", 
        "intTime": 20090515, 
        "postID": 18, 
        "quote": "Originally posted by xerello: Now will you answer the question of the thread? quote: Who does Cheney want the Obama Administration to torture to make us safer?", 
        "reply": " Guilty of ball busting. To the question, it would depend on who is in custody, what they are suspected of, etc. I don't think \"Darth\" Cheney wants to go around, willy-nilly waterboarding folks for schits & gigles. Use it when deemed necesary.", 
        "threadID": "672198221_5070043322001", 
        "time": "2009-05-15 11:06:00", 
        "title": "Who does Cheney want tortured now?", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by Grachus: Churchill used torture? How about Mother Teresa? Got any proof? \"http://blogs.abcnews.com/politicalpunch/2009/05/what-was-church.html\" Dave try npr.com there was a discussion about this on the May 1st edition of \"All Things Considered\" show.", 
        "intTime": 20090515, 
        "postID": 19, 
        "quote": "Originally posted by Grachus: Churchill used torture? How about Mother Teresa? Got any proof? \"http://blogs.abcnews.com/politicalpunch/2009/05/what-was-church.html\" Dave", 
        "reply": " try npr.com there was a discussion about this on the May 1st edition of \"All Things Considered\" show.", 
        "threadID": "672198221_5070043322001", 
        "time": "2009-05-15 11:10:00", 
        "title": "Who does Cheney want tortured now?", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by NickBrand: quote: Originally posted by Grachus: quote: Originally posted by xerello: So when Cheney says “when you get rid of enhanced interrogation techniques, for example, or the terrorist surveillance program, you reduce the intelligence flow to the intelligence community” THAT IS A LIE. quote: Originally posted by NickBrand: Hes arguing to keep the option on the table. I know that must be hard for you to understand. How can you keep a crime as an option on the table? More or less like saying when I argue with someone over a parking space, killing them should be an option on the table. We never had that option before, never had it on the table. What other options you want on the table? Gas warfare? Biological weapons? Dave That's complete B.S. The option has always been there whether or not politicians knew it was going on and turned a blind is another story. Churchill said English never tortured during WWII but in fact they did. He didn't give a crap whether or not Nazis were tortured or not as long as the information that was vital to the winning of the war was good. That is a historical fact. If you think this country hasn't used nefarious methods throughout our history to gain intel your drinking to much kool-aid. By either turning these people over to some other government to do the torture for us ie Rendition or doing it ourselves it makes absolutely no difference as long as we get the information we are looking for. It's been done and whether or not that changes will remain to be seen. Honestly I could give two shiits whether or not those people were waterboarded or tortured. What I care about is the American people's defense and the safety of this country's innocent civilians. I wouldn't condone the use of any of those techniques on a simple matter of robbery or anything else but I would condone it if the lives of thousands of this countries civilians were on the line because of an impending attack. That's my own opinion on the matter and when it comes to my family and their saftey I'm willing to use whatever is necessary to tend to their safety. You obviously differ in that opinion which is your right and I respect that. Churchill used torture? How about Mother Teresa? Got any proof? \"http://blogs.abcnews.com/politicalpunch/2009/05/what-was-church.html\" Dave Heres after a quick google search on that topic \"http://www.politico.com/blogs/bensmith/0409/Obama_and_Churchill.html\" \"http://www.mail-archive.com/futurework@fes.uwaterloo.ca/msg02350.html\" Churchill in a quote. \" In wartime the truth is so important it must be cloaked in a body guard of lies\".", 
        "intTime": 20090515, 
        "postID": 20, 
        "quote": "Originally posted by Grachus: quote: Originally posted by NickBrand: quote: Originally posted by Grachus: quote: Originally posted by xerello: So when Cheney says “when you get rid of enhanced interrogation techniques, for example, or the terrorist surveillance program, you reduce the intelligence flow to the intelligence community” THAT IS A LIE. quote: Originally posted by NickBrand: Hes arguing to keep the option on the table. I know that must be hard for you to understand. How can you keep a crime as an option on the table? More or less like saying when I argue with someone over a parking space, killing them should be an option on the table. We never had that option before, never had it on the table. What other options you want on the table? Gas warfare? Biological weapons? Dave That's complete B.S. The option has always been there whether or not politicians knew it was going on and turned a blind is another story. Churchill said English never tortured during WWII but in fact they did. He didn't give a crap whether or not Nazis were tortured or not as long as the information that was vital to the winning of the war was good. That is a historical fact. If you think this country hasn't used nefarious methods throughout our history to gain intel your drinking to much kool-aid. By either turning these people over to some other government to do the torture for us ie Rendition or doing it ourselves it makes absolutely no difference as long as we get the information we are looking for. It's been done and whether or not that changes will remain to be seen. Honestly I could give two shiits whether or not those people were waterboarded or tortured. What I care about is the American people's defense and the safety of this country's innocent civilians. I wouldn't condone the use of any of those techniques on a simple matter of robbery or anything else but I would condone it if the lives of thousands of this countries civilians were on the line because of an impending attack. That's my own opinion on the matter and when it comes to my family and their saftey I'm willing to use whatever is necessary to tend to their safety. You obviously differ in that opinion which is your right and I respect that. Churchill used torture? How about Mother Teresa? Got any proof? \"http://blogs.abcnews.com/politicalpunch/2009/05/what-was-church.html\" Dave", 
        "reply": " Heres after a quick google search on that topic \"http://www.politico.com/blogs/bensmith/0409/Obama_and_Churchill.html\" \"http://www.mail-archive.com/futurework@fes.uwaterloo.ca/msg02350.html\" Churchill in a quote. \" In wartime the truth is so important it must be cloaked in a body guard of lies\".", 
        "threadID": "672198221_5070043322001", 
        "time": "2009-05-15 11:15:00", 
        "title": "Who does Cheney want tortured now?", 
        "userID": "NickBrand"
    }, 
    {
        "content": "If there were any new high profile prisoners captured in the past six years, there would have been an announcement – like when the Bush Administration announced the capture of Khalid Shaikh Mohammed and Abu Zubaydah. Dick Cheney says that since the Obama Administration does not use “enhanced interrogation techniques” that the country is “less safe” and that such a policy opens America to further attacks. Who does he want the Obama Administration to torture to make us safer? CIA Director Hayden, under the Bush Administration, testified before Congress in February 2008 that “enhanced interrogation techniques” had not been used since 2003. So what Cheney is saying is that since President Obama no longer allows the tactics that the Bush has NOT used since 2003, that the country is less safe. It does not make sense, but the bushies cling to whatever Dick says, even if it makes no sense. By the way, the Obama Administration is continuing the surveillance of communications within the United States, they are just following the law and using the FISA Court for oversight, AS REQUIRED BY LAW, is the only difference. So when Cheney says “when you get rid of enhanced interrogation techniques, for example, or the terrorist surveillance program, you reduce the intelligence flow to the intelligence community” THAT IS A LIE.", 
        "intTime": 20090514, 
        "postID": 21, 
        "quote": "", 
        "reply": "If there were any new high profile prisoners captured in the past six years, there would have been an announcement – like when the Bush Administration announced the capture of Khalid Shaikh Mohammed and Abu Zubaydah. Dick Cheney says that since the Obama Administration does not use “enhanced interrogation techniques” that the country is “less safe” and that such a policy opens America to further attacks. Who does he want the Obama Administration to torture to make us safer? CIA Director Hayden, under the Bush Administration, testified before Congress in February 2008 that “enhanced interrogation techniques” had not been used since 2003. So what Cheney is saying is that since President Obama no longer allows the tactics that the Bush has NOT used since 2003, that the country is less safe. It does not make sense, but the bushies cling to whatever Dick says, even if it makes no sense. By the way, the Obama Administration is continuing the surveillance of communications within the United States, they are just following the law and using the FISA Court for oversight, AS REQUIRED BY LAW, is the only difference. So when Cheney says “when you get rid of enhanced interrogation techniques, for example, or the terrorist surveillance program, you reduce the intelligence flow to the intelligence community” THAT IS A LIE.", 
        "threadID": "672198221_5070043322001", 
        "time": "2009-05-14 22:19:00", 
        "title": "Who does Cheney want tortured now?", 
        "userID": "xerello"
    }, 
    {
        "content": "xerello, you don't get it. The point is that by announcing to the world that we will not used enhanced interrogation techniques Mr. Obama has weakened the U.S.A. in several ways. He has told the world we have been committing crimes against prisoners whether that is true or not. He is telling terrorists and allies who mistake compassion for weakness that we will not even use the minimal techniques we have used in the past in order to obtain information that might save American lives he ties our intelligence operatives hands behind their backs by preventing them from using such techniques to obtain vital information from any terrorist captured in the future regardless of what information he might have. These techniques were not used willy-nilly against every prisoner we had in custody. They were only used in very specific cases under strict medical supervision when there was tangible evidence that a particular terrorist held information that was harmful to innocent citizens.", 
        "intTime": 20090515, 
        "postID": 22, 
        "quote": "", 
        "reply": "xerello, you don't get it. The point is that by announcing to the world that we will not used enhanced interrogation techniques Mr. Obama has weakened the U.S.A. in several ways. He has told the world we have been committing crimes against prisoners whether that is true or not. He is telling terrorists and allies who mistake compassion for weakness that we will not even use the minimal techniques we have used in the past in order to obtain information that might save American lives he ties our intelligence operatives hands behind their backs by preventing them from using such techniques to obtain vital information from any terrorist captured in the future regardless of what information he might have. These techniques were not used willy-nilly against every prisoner we had in custody. They were only used in very specific cases under strict medical supervision when there was tangible evidence that a particular terrorist held information that was harmful to innocent citizens.", 
        "threadID": "672198221_5070043322001", 
        "time": "2009-05-15 03:12:00", 
        "title": "Who does Cheney want tortured now?", 
        "userID": "M123Driver"
    }, 
    {
        "content": "Even if there was close medical supervision and very specific circumstances, torture is torture any way you put it. Torture shoudl not be allowed, and those who authorized it should be prosecuted to the fullest extent of the law, even if I have to locate people from left wing fringe groups, and get them into Harvard law school by being a dead-ringer and take the LSAT for them so they can get the highest possible score, AND do all their term papers producing A grade work on the only condition they become prosecutors and prosecute Cheney, and all others who authorized torture. If this is the only kind of way that America will prosecute the ones who authorized torture (private citizens being dead-ringers for compassionaate Ivy league candidates who want justice), and gain back the respect of the world community, than America is not the country I came of age thinking it was. Again, torture should not be allowed to be policy. Because maybe the next time, there will be budget cuts and there won't be money available for medical experts to watch the torturer's every move. There won't be time for the torturers to find \"very specific\" instances. Nobody can ever be sure if anybody is going to have the incentive or the resources to conduct such full scale investigations, as to weed out the real terrorists who know things. As long as torture is allowed, you open the door wide for anything to happen. quote: Originally posted by M123Driver: xerello, you don't get it. The point is that by announcing to the world that we will not used enhanced interrogation techniques Mr. Obama has weakened the U.S.A. in several ways. He has told the world we have been committing crimes against prisoners whether that is true or not. He is telling terrorists and allies who mistake compassion for weakness that we will not even use the minimal techniques we have used in the past in order to obtain information that might save American lives he ties our intelligence operatives hands behind their backs by preventing them from using such techniques to obtain vital information from any terrorist captured in the future regardless of what information he might have. These techniques were not used willy-nilly against every prisoner we had in custody. They were only used in very specific cases under strict medical supervision when there was tangible evidence that a particular terrorist held information that was harmful to innocent citizens. This message has been edited. Last edited by: cybercafe, Fri 15 May 2009 04:21 AM", 
        "intTime": 20090515, 
        "postID": 23, 
        "quote": "Originally posted by M123Driver: xerello, you don't get it. The point is that by announcing to the world that we will not used enhanced interrogation techniques Mr. Obama has weakened the U.S.A. in several ways. He has told the world we have been committing crimes against prisoners whether that is true or not. He is telling terrorists and allies who mistake compassion for weakness that we will not even use the minimal techniques we have used in the past in order to obtain information that might save American lives he ties our intelligence operatives hands behind their backs by preventing them from using such techniques to obtain vital information from any terrorist captured in the future regardless of what information he might have. These techniques were not used willy-nilly against every prisoner we had in custody. They were only used in very specific cases under strict medical supervision when there was tangible evidence that a particular terrorist held information that was harmful to innocent citizens.", 
        "reply": "Even if there was close medical supervision and very specific circumstances, torture is torture any way you put it. Torture shoudl not be allowed, and those who authorized it should be prosecuted to the fullest extent of the law, even if I have to locate people from left wing fringe groups, and get them into Harvard law school by being a dead-ringer and take the LSAT for them so they can get the highest possible score, AND do all their term papers producing A grade work on the only condition they become prosecutors and prosecute Cheney, and all others who authorized torture. If this is the only kind of way that America will prosecute the ones who authorized torture (private citizens being dead-ringers for compassionaate Ivy league candidates who want justice), and gain back the respect of the world community, than America is not the country I came of age thinking it was. Again, torture should not be allowed to be policy. Because maybe the next time, there will be budget cuts and there won't be money available for medical experts to watch the torturer's every move. There won't be time for the torturers to find \"very specific\" instances. Nobody can ever be sure if anybody is going to have the incentive or the resources to conduct such full scale investigations, as to weed out the real terrorists who know things. As long as torture is allowed, you open the door wide for anything to happen.  This message has been edited. Last edited by: cybercafe, Fri 15 May 2009 04:21 AM", 
        "threadID": "672198221_5070043322001", 
        "time": "2009-05-15 03:49:00", 
        "title": "Who does Cheney want tortured now?", 
        "userID": "cybercafe"
    }, 
    {
        "content": "quote: Who does he want the Obama Administration to torture to make us safer? ....at the moment Nancy would come to mind for both Dick and Barry... Already past the future", 
        "intTime": 20090515, 
        "postID": 24, 
        "quote": "Who does he want the Obama Administration to torture to make us safer?", 
        "reply": " ....at the moment Nancy would come to mind for both Dick and Barry... Already past the future", 
        "threadID": "672198221_5070043322001", 
        "time": "2009-05-15 03:52:00", 
        "title": "Who does Cheney want tortured now?", 
        "userID": "6486143"
    }, 
    {
        "content": "We all get tortured every time Deadeye Dick opens his mouth. He makes nails on the chalkboard sound good.", 
        "intTime": 20090515, 
        "postID": 25, 
        "quote": "", 
        "reply": "We all get tortured every time Deadeye Dick opens his mouth. He makes nails on the chalkboard sound good.", 
        "threadID": "672198221_5070043322001", 
        "time": "2009-05-15 04:43:00", 
        "title": "Who does Cheney want tortured now?", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by xerello: If there were any new high profile prisoners captured in the past six years, there would have been an announcement – like when the Bush Administration announced the capture of Khalid Shaikh Mohammed and Abu Zubaydah. Dick Cheney says that since the Obama Administration does not use “enhanced interrogation techniques” that the country is “less safe” and that such a policy opens America to further attacks. Who does he want the Obama Administration to torture to make us safer? CIA Director Hayden, under the Bush Administration, testified before Congress in February 2008 that “enhanced interrogation techniques” had not been used since 2003. So what Cheney is saying is that since President Obama no longer allows the tactics that the Bush has NOT used since 2003, that the country is less safe. It does not make sense, but the bushies cling to whatever Dick says, even if it makes no sense. By the way, the Obama Administration is continuing the surveillance of communications within the United States, they are just following the law and using the FISA Court for oversight, AS REQUIRED BY LAW, is the only difference. So when Cheney says “when you get rid of enhanced interrogation techniques, for example, or the terrorist surveillance program, you reduce the intelligence flow to the intelligence community” THAT IS A LIE. Hes arguing to keep the option on the table. I know that must be hard for you to understand.", 
        "intTime": 20090515, 
        "postID": 26, 
        "quote": "Originally posted by xerello: If there were any new high profile prisoners captured in the past six years, there would have been an announcement – like when the Bush Administration announced the capture of Khalid Shaikh Mohammed and Abu Zubaydah. Dick Cheney says that since the Obama Administration does not use “enhanced interrogation techniques” that the country is “less safe” and that such a policy opens America to further attacks. Who does he want the Obama Administration to torture to make us safer? CIA Director Hayden, under the Bush Administration, testified before Congress in February 2008 that “enhanced interrogation techniques” had not been used since 2003. So what Cheney is saying is that since President Obama no longer allows the tactics that the Bush has NOT used since 2003, that the country is less safe. It does not make sense, but the bushies cling to whatever Dick says, even if it makes no sense. By the way, the Obama Administration is continuing the surveillance of communications within the United States, they are just following the law and using the FISA Court for oversight, AS REQUIRED BY LAW, is the only difference. So when Cheney says “when you get rid of enhanced interrogation techniques, for example, or the terrorist surveillance program, you reduce the intelligence flow to the intelligence community” THAT IS A LIE.", 
        "reply": " Hes arguing to keep the option on the table. I know that must be hard for you to understand.", 
        "threadID": "672198221_5070043322001", 
        "time": "2009-05-15 05:42:00", 
        "title": "Who does Cheney want tortured now?", 
        "userID": "NickBrand"
    }, 
    {
        "content": "I think the real question about water boarding should be \"If we had water boarded Dick H Cheney and bush while they were lying about WMD could we have saved over 4000 thousand American lives\"?", 
        "intTime": 20090515, 
        "postID": 27, 
        "quote": "", 
        "reply": "I think the real question about water boarding should be \"If we had water boarded Dick H Cheney and bush while they were lying about WMD could we have saved over 4000 thousand American lives\"?", 
        "threadID": "672198221_5070043322001", 
        "time": "2009-05-15 06:09:00", 
        "title": "Who does Cheney want tortured now?", 
        "userID": "6837602"
    }, 
    {
        "content": "IS the OP doing an Op Ed or is there a news article along with the commentary, this is 'In The News'.", 
        "intTime": 20090515, 
        "postID": 28, 
        "quote": "", 
        "reply": "IS the OP doing an Op Ed or is there a news article along with the commentary, this is 'In The News'.", 
        "threadID": "672198221_5070043322001", 
        "time": "2009-05-15 07:10:00", 
        "title": "Who does Cheney want tortured now?", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by 6837602: I think the real question about water boarding should be \"If we had water boarded Dick H Cheney and bush while they were lying about WMD could we have saved over 4000 thousand American lives\"? Only if you water boarded various national spy agancies, the UN Security Council & the Clinton Administration, along with a few Senate & Congressional committees.", 
        "intTime": 20090515, 
        "postID": 29, 
        "quote": "Originally posted by 6837602: I think the real question about water boarding should be \"If we had water boarded Dick H Cheney and bush while they were lying about WMD could we have saved over 4000 thousand American lives\"?", 
        "reply": " Only if you water boarded various national spy agancies, the UN Security Council & the Clinton Administration, along with a few Senate & Congressional committees.", 
        "threadID": "672198221_5070043322001", 
        "time": "2009-05-15 07:12:00", 
        "title": "Who does Cheney want tortured now?", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by 67NOV: IS the OP doing an Op Ed or is there a news article along with the commentary, this is 'In The News'. Cheney is all over the news covering his azz. Google Cheney, memo and you will get thousands of news links.", 
        "intTime": 20090515, 
        "postID": 30, 
        "quote": "Originally posted by 67NOV: IS the OP doing an Op Ed or is there a news article along with the commentary, this is 'In The News'.", 
        "reply": " Cheney is all over the news covering his azz. Google Cheney, memo and you will get thousands of news links.", 
        "threadID": "672198221_5070043322001", 
        "time": "2009-05-15 07:57:00", 
        "title": "Who does Cheney want tortured now?", 
        "userID": "xerello"
    }, 
    {
        "content": "quote: Originally posted by xerello: So when Cheney says “when you get rid of enhanced interrogation techniques, for example, or the terrorist surveillance program, you reduce the intelligence flow to the intelligence community” THAT IS A LIE. quote: Originally posted by NickBrand: Hes arguing to keep the option on the table. I know that must be hard for you to understand. How can you keep a crime as an option on the table? More or less like saying when I argue with someone over a parking space, killing them should be an option on the table. We never had that option before, never had it on the table. What other options you want on the table? Gas warfare? Biological weapons? Dave", 
        "intTime": 20090515, 
        "postID": 31, 
        "quote": "Originally posted by xerello: So when Cheney says “when you get rid of enhanced interrogation techniques, for example, or the terrorist surveillance program, you reduce the intelligence flow to the intelligence community” THAT IS A LIE.", 
        "reply": " quote: Originally posted by NickBrand: Hes arguing to keep the option on the table. I know that must be hard for you to understand. How can you keep a crime as an option on the table? More or less like saying when I argue with someone over a parking space, killing them should be an option on the table. We never had that option before, never had it on the table. What other options you want on the table? Gas warfare? Biological weapons? Dave", 
        "threadID": "672198221_5070043322001", 
        "time": "2009-05-15 09:23:00", 
        "title": "Who does Cheney want tortured now?", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by xerello: quote: Originally posted by 67NOV: IS the OP doing an Op Ed or is there a news article along with the commentary, this is 'In The News'. Cheney is all over the news covering his azz. Google Cheney, memo and you will get thousands of news links. As OP that's your job, otherwise this should be in 'point/counter-point'.", 
        "intTime": 20090515, 
        "postID": 32, 
        "quote": "Originally posted by xerello: quote: Originally posted by 67NOV: IS the OP doing an Op Ed or is there a news article along with the commentary, this is 'In The News'. Cheney is all over the news covering his azz. Google Cheney, memo and you will get thousands of news links.", 
        "reply": " As OP that's your job, otherwise this should be in 'point/counter-point'.", 
        "threadID": "672198221_5070043322001", 
        "time": "2009-05-15 10:01:00", 
        "title": "Who does Cheney want tortured now?", 
        "userID": "67NOV"
    }, 
    {
        "content": "Bush did not lie about WMD's in Iraq, You better get your facts correct before you post. It was Clinton, Kerry and Democrats would said Iraq had WMD's long before Bush was even President...So get your facts correct before you posts untruths... Those same people (except for one) NEVER told Bush anything different when he took office. So when 9/11 happen, it was a open plate for Bush. If Bush lied, then it was that he repeated Clinton, Kerry and democrats lies... Now if I was Cheney I would water board Clinton, Kerry ( a few extra times ) and all the members of the democrat party that said Iraq had WMD's...Before Bush was President..Wow, just thought of something, does that include Clinton's wife? after all she did vote to go into Iraq, so she must have agree to Iraq having WMD's also...a family affair I see.", 
        "intTime": 20090515, 
        "postID": 33, 
        "quote": "", 
        "reply": "Bush did not lie about WMD's in Iraq, You better get your facts correct before you post. It was Clinton, Kerry and Democrats would said Iraq had WMD's long before Bush was even President...So get your facts correct before you posts untruths... Those same people (except for one) NEVER told Bush anything different when he took office. So when 9/11 happen, it was a open plate for Bush. If Bush lied, then it was that he repeated Clinton, Kerry and democrats lies... Now if I was Cheney I would water board Clinton, Kerry ( a few extra times ) and all the members of the democrat party that said Iraq had WMD's...Before Bush was President..Wow, just thought of something, does that include Clinton's wife? after all she did vote to go into Iraq, so she must have agree to Iraq having WMD's also...a family affair I see.", 
        "threadID": "672198221_5070043322001", 
        "time": "2009-05-15 10:05:00", 
        "title": "Who does Cheney want tortured now?", 
        "userID": "dman1948"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by xerello: So when Cheney says “when you get rid of enhanced interrogation techniques, for example, or the terrorist surveillance program, you reduce the intelligence flow to the intelligence community” THAT IS A LIE. quote: Originally posted by NickBrand: Hes arguing to keep the option on the table. I know that must be hard for you to understand. How can you keep a crime as an option on the table? More or less like saying when I argue with someone over a parking space, killing them should be an option on the table. We never had that option before, never had it on the table. What other options you want on the table? Gas warfare? Biological weapons? Dave That's complete B.S. The option has always been there whether or not politicians knew it was going on and turned a blind is another story. Churchill said English never tortured during WWII but in fact they did. He didn't give a crap whether or not Nazis were tortured or not as long as the information that was vital to the winning of the war was good. That is a historical fact. If you think this country hasn't used nefarious methods throughout our history to gain intel your drinking to much kool-aid. By either turning these people over to some other government to do the torture for us ie Rendition or doing it ourselves it makes absolutely no difference as long as we get the information we are looking for. It's been done and whether or not that changes will remain to be seen. Honestly I could give two shiits whether or not those people were waterboarded or tortured. What I care about is the American people's defense and the safety of this country's innocent civilians. I wouldn't condone the use of any of those techniques on a simple matter of robbery or anything else but I would condone it if the lives of thousands of this countries civilians were on the line because of an impending attack. That's my own opinion on the matter and when it comes to my family and their saftey I'm willing to use whatever is necessary to tend to their safety. You obviously differ in that opinion which is your right and I respect that.", 
        "intTime": 20090515, 
        "postID": 34, 
        "quote": "Originally posted by Grachus: quote: Originally posted by xerello: So when Cheney says “when you get rid of enhanced interrogation techniques, for example, or the terrorist surveillance program, you reduce the intelligence flow to the intelligence community” THAT IS A LIE. quote: Originally posted by NickBrand: Hes arguing to keep the option on the table. I know that must be hard for you to understand. How can you keep a crime as an option on the table? More or less like saying when I argue with someone over a parking space, killing them should be an option on the table. We never had that option before, never had it on the table. What other options you want on the table? Gas warfare? Biological weapons? Dave", 
        "reply": " That's complete B.S. The option has always been there whether or not politicians knew it was going on and turned a blind is another story. Churchill said English never tortured during WWII but in fact they did. He didn't give a crap whether or not Nazis were tortured or not as long as the information that was vital to the winning of the war was good. That is a historical fact. If you think this country hasn't used nefarious methods throughout our history to gain intel your drinking to much kool-aid. By either turning these people over to some other government to do the torture for us ie Rendition or doing it ourselves it makes absolutely no difference as long as we get the information we are looking for. It's been done and whether or not that changes will remain to be seen. Honestly I could give two shiits whether or not those people were waterboarded or tortured. What I care about is the American people's defense and the safety of this country's innocent civilians. I wouldn't condone the use of any of those techniques on a simple matter of robbery or anything else but I would condone it if the lives of thousands of this countries civilians were on the line because of an impending attack. That's my own opinion on the matter and when it comes to my family and their saftey I'm willing to use whatever is necessary to tend to their safety. You obviously differ in that opinion which is your right and I respect that.", 
        "threadID": "672198221_5070043322001", 
        "time": "2009-05-15 10:20:00", 
        "title": "Who does Cheney want tortured now?", 
        "userID": "NickBrand"
    }, 
    {
        "content": "quote: Originally posted by NickBrand: quote: Originally posted by Grachus: quote: Originally posted by xerello: So when Cheney says “when you get rid of enhanced interrogation techniques, for example, or the terrorist surveillance program, you reduce the intelligence flow to the intelligence community” THAT IS A LIE. quote: Originally posted by NickBrand: Hes arguing to keep the option on the table. I know that must be hard for you to understand. How can you keep a crime as an option on the table? More or less like saying when I argue with someone over a parking space, killing them should be an option on the table. We never had that option before, never had it on the table. What other options you want on the table? Gas warfare? Biological weapons? Dave That's complete B.S. The option has always been there whether or not politicians knew it was going on and turned a blind is another story. Churchill said English never tortured during WWII but in fact they did. He didn't give a crap whether or not Nazis were tortured or not as long as the information that was vital to the winning of the war was good. That is a historical fact. If you think this country hasn't used nefarious methods throughout our history to gain intel your drinking to much kool-aid. By either turning these people over to some other government to do the torture for us ie Rendition or doing it ourselves it makes absolutely no difference as long as we get the information we are looking for. It's been done and whether or not that changes will remain to be seen. Honestly I could give two shiits whether or not those people were waterboarded or tortured. What I care about is the American people's defense and the safety of this country's innocent civilians. I wouldn't condone the use of any of those techniques on a simple matter of robbery or anything else but I would condone it if the lives of thousands of this countries civilians were on the line because of an impending attack. That's my own opinion on the matter and when it comes to my family and their saftey I'm willing to use whatever is necessary to tend to their safety. You obviously differ in that opinion which is your right and I respect that. Churchill used torture? How about Mother Teresa? Got any proof? \"http://blogs.abcnews.com/politicalpunch/2009/05/what-was-church.html\" Dave", 
        "intTime": 20090515, 
        "postID": 35, 
        "quote": "Originally posted by NickBrand: quote: Originally posted by Grachus: quote: Originally posted by xerello: So when Cheney says “when you get rid of enhanced interrogation techniques, for example, or the terrorist surveillance program, you reduce the intelligence flow to the intelligence community” THAT IS A LIE. quote: Originally posted by NickBrand: Hes arguing to keep the option on the table. I know that must be hard for you to understand. How can you keep a crime as an option on the table? More or less like saying when I argue with someone over a parking space, killing them should be an option on the table. We never had that option before, never had it on the table. What other options you want on the table? Gas warfare? Biological weapons? Dave That's complete B.S. The option has always been there whether or not politicians knew it was going on and turned a blind is another story. Churchill said English never tortured during WWII but in fact they did. He didn't give a crap whether or not Nazis were tortured or not as long as the information that was vital to the winning of the war was good. That is a historical fact. If you think this country hasn't used nefarious methods throughout our history to gain intel your drinking to much kool-aid. By either turning these people over to some other government to do the torture for us ie Rendition or doing it ourselves it makes absolutely no difference as long as we get the information we are looking for. It's been done and whether or not that changes will remain to be seen. Honestly I could give two shiits whether or not those people were waterboarded or tortured. What I care about is the American people's defense and the safety of this country's innocent civilians. I wouldn't condone the use of any of those techniques on a simple matter of robbery or anything else but I would condone it if the lives of thousands of this countries civilians were on the line because of an impending attack. That's my own opinion on the matter and when it comes to my family and their saftey I'm willing to use whatever is necessary to tend to their safety. You obviously differ in that opinion which is your right and I respect that.", 
        "reply": " Churchill used torture? How about Mother Teresa? Got any proof? \"http://blogs.abcnews.com/politicalpunch/2009/05/what-was-church.html\" Dave", 
        "threadID": "672198221_5070043322001", 
        "time": "2009-05-15 10:32:00", 
        "title": "Who does Cheney want tortured now?", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by M123Driver: xerello, you don't get it. The point is that by announcing to the world that we will not used enhanced interrogation techniques Mr. Obama has weakened the U.S.A. in several ways. He has told the world we have been committing crimes against prisoners whether that is true or not. He is telling terrorists and allies who mistake compassion for weakness that we will not even use the minimal techniques we have used in the past in order to obtain information that might save American lives he ties our intelligence operatives hands behind their backs by preventing them from using such techniques to obtain vital information from any terrorist captured in the future regardless of what information he might have. These techniques were not used willy-nilly against every prisoner we had in custody. They were only used in very specific cases under strict medical supervision when there was tangible evidence that a particular terrorist held information that was harmful to innocent citizens. President Obama did not tell the world that crimes had been committed against prisoners, the Bush Administration did. Dick Cheney has admitted that he approved waterboarding, CIA Director Hayden admitted in testimony to Congress that prisoners have been waterboarded and President Bush himself admitted in May 2008 that waterboarding has been used on prisoners. The world knew about the waterboarding long before President Obama was elected. It is not true that interrogation techniques - interrogation methods that professional interrogators insist are EFFECTIVE in getting information from even hard-core al Qaeda are still available for use. It is true that the government no longer hires contractors to torture people. As the FBI agent testified before Congress, al-Qaeda members are trained to be prepared for the type of torture they would get if they were captured in Saudi Arabia or Egypt – even the Bush Administration did not go that far. So they are well prepared for anything that American torturers can dish out. It is a false argument that the memos provided information that helps the enemy to prepare for what might happen if they are captured by American forces. Contrary to what Rush or Hannity told you, the memos do not describe the torture methods used by CIA contractors. What they cannot prepare for is being outsmarted by a professional interrogator who will not even threaten physical torture. But this is not a is torture legal or effective or neccessary thread. Cheney claims that since waterboarding and other torture techniques are no longer used, America is less safe. The question is – how can one reach the conclusion that because no one is being tortured right now, American is less safe from attack?", 
        "intTime": 20090515, 
        "postID": 36, 
        "quote": "Originally posted by M123Driver: xerello, you don't get it. The point is that by announcing to the world that we will not used enhanced interrogation techniques Mr. Obama has weakened the U.S.A. in several ways. He has told the world we have been committing crimes against prisoners whether that is true or not. He is telling terrorists and allies who mistake compassion for weakness that we will not even use the minimal techniques we have used in the past in order to obtain information that might save American lives he ties our intelligence operatives hands behind their backs by preventing them from using such techniques to obtain vital information from any terrorist captured in the future regardless of what information he might have. These techniques were not used willy-nilly against every prisoner we had in custody. They were only used in very specific cases under strict medical supervision when there was tangible evidence that a particular terrorist held information that was harmful to innocent citizens.", 
        "reply": " President Obama did not tell the world that crimes had been committed against prisoners, the Bush Administration did. Dick Cheney has admitted that he approved waterboarding, CIA Director Hayden admitted in testimony to Congress that prisoners have been waterboarded and President Bush himself admitted in May 2008 that waterboarding has been used on prisoners. The world knew about the waterboarding long before President Obama was elected. It is not true that interrogation techniques - interrogation methods that professional interrogators insist are EFFECTIVE in getting information from even hard-core al Qaeda are still available for use. It is true that the government no longer hires contractors to torture people. As the FBI agent testified before Congress, al-Qaeda members are trained to be prepared for the type of torture they would get if they were captured in Saudi Arabia or Egypt – even the Bush Administration did not go that far. So they are well prepared for anything that American torturers can dish out. It is a false argument that the memos provided information that helps the enemy to prepare for what might happen if they are captured by American forces. Contrary to what Rush or Hannity told you, the memos do not describe the torture methods used by CIA contractors. What they cannot prepare for is being outsmarted by a professional interrogator who will not even threaten physical torture. But this is not a is torture legal or effective or neccessary thread. Cheney claims that since waterboarding and other torture techniques are no longer used, America is less safe. The question is – how can one reach the conclusion that because no one is being tortured right now, American is less safe from attack?", 
        "threadID": "672198221_5070043322001", 
        "time": "2009-05-15 10:47:00", 
        "title": "Who does Cheney want tortured now?", 
        "userID": "xerello"
    }, 
    {
        "content": "quote: Originally posted by 67NOV: quote: Originally posted by xerello: quote: Originally posted by 67NOV: IS the OP doing an Op Ed or is there a news article along with the commentary, this is 'In The News'. Cheney is all over the news covering his azz. Google Cheney, memo and you will get thousands of news links. As OP that's your job, otherwise this should be in 'point/counter-point'. >http://www.upi.com/Top_News/2009/05/12/Cheney-defends-Bush-anti-terror-policies/UPI-36011242173364/ >http://www.cqpolitics.com/wmspage.cfm?docID=news-000003114272 Now will you answer the question of the thread? quote: Who does Cheney want the Obama Administration to torture to make us safer?", 
        "intTime": 20090515, 
        "postID": 37, 
        "quote": "Originally posted by 67NOV: quote: Originally posted by xerello: quote: Originally posted by 67NOV: IS the OP doing an Op Ed or is there a news article along with the commentary, this is 'In The News'. Cheney is all over the news covering his azz. Google Cheney, memo and you will get thousands of news links. As OP that's your job, otherwise this should be in 'point/counter-point'.", 
        "reply": " >http://www.upi.com/Top_News/2009/05/12/Cheney-defends-Bush-anti-terror-policies/UPI-36011242173364/ >http://www.cqpolitics.com/wmspage.cfm?docID=news-000003114272 Now will you answer the question of the thread? quote: Who does Cheney want the Obama Administration to torture to make us safer?", 
        "threadID": "672198221_5070043322001", 
        "time": "2009-05-15 10:57:00", 
        "title": "Who does Cheney want tortured now?", 
        "userID": "xerello"
    }, 
    {
        "content": "quote: Originally posted by xerello: Now will you answer the question of the thread? quote: Who does Cheney want the Obama Administration to torture to make us safer? Guilty of ball busting. To the question, it would depend on who is in custody, what they are suspected of, etc. I don't think \"Darth\" Cheney wants to go around, willy-nilly waterboarding folks for schits & gigles. Use it when deemed necesary.", 
        "intTime": 20090515, 
        "postID": 38, 
        "quote": "Originally posted by xerello: Now will you answer the question of the thread? quote: Who does Cheney want the Obama Administration to torture to make us safer?", 
        "reply": " Guilty of ball busting. To the question, it would depend on who is in custody, what they are suspected of, etc. I don't think \"Darth\" Cheney wants to go around, willy-nilly waterboarding folks for schits & gigles. Use it when deemed necesary.", 
        "threadID": "672198221_5070043322001", 
        "time": "2009-05-15 11:06:00", 
        "title": "Who does Cheney want tortured now?", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by Grachus: Churchill used torture? How about Mother Teresa? Got any proof? \"http://blogs.abcnews.com/politicalpunch/2009/05/what-was-church.html\" Dave try npr.com there was a discussion about this on the May 1st edition of \"All Things Considered\" show.", 
        "intTime": 20090515, 
        "postID": 39, 
        "quote": "Originally posted by Grachus: Churchill used torture? How about Mother Teresa? Got any proof? \"http://blogs.abcnews.com/politicalpunch/2009/05/what-was-church.html\" Dave", 
        "reply": " try npr.com there was a discussion about this on the May 1st edition of \"All Things Considered\" show.", 
        "threadID": "672198221_5070043322001", 
        "time": "2009-05-15 11:10:00", 
        "title": "Who does Cheney want tortured now?", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by NickBrand: quote: Originally posted by Grachus: quote: Originally posted by xerello: So when Cheney says “when you get rid of enhanced interrogation techniques, for example, or the terrorist surveillance program, you reduce the intelligence flow to the intelligence community” THAT IS A LIE. quote: Originally posted by NickBrand: Hes arguing to keep the option on the table. I know that must be hard for you to understand. How can you keep a crime as an option on the table? More or less like saying when I argue with someone over a parking space, killing them should be an option on the table. We never had that option before, never had it on the table. What other options you want on the table? Gas warfare? Biological weapons? Dave That's complete B.S. The option has always been there whether or not politicians knew it was going on and turned a blind is another story. Churchill said English never tortured during WWII but in fact they did. He didn't give a crap whether or not Nazis were tortured or not as long as the information that was vital to the winning of the war was good. That is a historical fact. If you think this country hasn't used nefarious methods throughout our history to gain intel your drinking to much kool-aid. By either turning these people over to some other government to do the torture for us ie Rendition or doing it ourselves it makes absolutely no difference as long as we get the information we are looking for. It's been done and whether or not that changes will remain to be seen. Honestly I could give two shiits whether or not those people were waterboarded or tortured. What I care about is the American people's defense and the safety of this country's innocent civilians. I wouldn't condone the use of any of those techniques on a simple matter of robbery or anything else but I would condone it if the lives of thousands of this countries civilians were on the line because of an impending attack. That's my own opinion on the matter and when it comes to my family and their saftey I'm willing to use whatever is necessary to tend to their safety. You obviously differ in that opinion which is your right and I respect that. Churchill used torture? How about Mother Teresa? Got any proof? \"http://blogs.abcnews.com/politicalpunch/2009/05/what-was-church.html\" Dave Heres after a quick google search on that topic \"http://www.politico.com/blogs/bensmith/0409/Obama_and_Churchill.html\" \"http://www.mail-archive.com/futurework@fes.uwaterloo.ca/msg02350.html\" Churchill in a quote. \" In wartime the truth is so important it must be cloaked in a body guard of lies\".", 
        "intTime": 20090515, 
        "postID": 40, 
        "quote": "Originally posted by Grachus: quote: Originally posted by NickBrand: quote: Originally posted by Grachus: quote: Originally posted by xerello: So when Cheney says “when you get rid of enhanced interrogation techniques, for example, or the terrorist surveillance program, you reduce the intelligence flow to the intelligence community” THAT IS A LIE. quote: Originally posted by NickBrand: Hes arguing to keep the option on the table. I know that must be hard for you to understand. How can you keep a crime as an option on the table? More or less like saying when I argue with someone over a parking space, killing them should be an option on the table. We never had that option before, never had it on the table. What other options you want on the table? Gas warfare? Biological weapons? Dave That's complete B.S. The option has always been there whether or not politicians knew it was going on and turned a blind is another story. Churchill said English never tortured during WWII but in fact they did. He didn't give a crap whether or not Nazis were tortured or not as long as the information that was vital to the winning of the war was good. That is a historical fact. If you think this country hasn't used nefarious methods throughout our history to gain intel your drinking to much kool-aid. By either turning these people over to some other government to do the torture for us ie Rendition or doing it ourselves it makes absolutely no difference as long as we get the information we are looking for. It's been done and whether or not that changes will remain to be seen. Honestly I could give two shiits whether or not those people were waterboarded or tortured. What I care about is the American people's defense and the safety of this country's innocent civilians. I wouldn't condone the use of any of those techniques on a simple matter of robbery or anything else but I would condone it if the lives of thousands of this countries civilians were on the line because of an impending attack. That's my own opinion on the matter and when it comes to my family and their saftey I'm willing to use whatever is necessary to tend to their safety. You obviously differ in that opinion which is your right and I respect that. Churchill used torture? How about Mother Teresa? Got any proof? \"http://blogs.abcnews.com/politicalpunch/2009/05/what-was-church.html\" Dave", 
        "reply": " Heres after a quick google search on that topic \"http://www.politico.com/blogs/bensmith/0409/Obama_and_Churchill.html\" \"http://www.mail-archive.com/futurework@fes.uwaterloo.ca/msg02350.html\" Churchill in a quote. \" In wartime the truth is so important it must be cloaked in a body guard of lies\".", 
        "threadID": "672198221_5070043322001", 
        "time": "2009-05-15 11:15:00", 
        "title": "Who does Cheney want tortured now?", 
        "userID": "NickBrand"
    }, 
    {
        "content": "If there were any new high profile prisoners captured in the past six years, there would have been an announcement – like when the Bush Administration announced the capture of Khalid Shaikh Mohammed and Abu Zubaydah. Dick Cheney says that since the Obama Administration does not use “enhanced interrogation techniques” that the country is “less safe” and that such a policy opens America to further attacks. Who does he want the Obama Administration to torture to make us safer? CIA Director Hayden, under the Bush Administration, testified before Congress in February 2008 that “enhanced interrogation techniques” had not been used since 2003. So what Cheney is saying is that since President Obama no longer allows the tactics that the Bush has NOT used since 2003, that the country is less safe. It does not make sense, but the bushies cling to whatever Dick says, even if it makes no sense. By the way, the Obama Administration is continuing the surveillance of communications within the United States, they are just following the law and using the FISA Court for oversight, AS REQUIRED BY LAW, is the only difference. So when Cheney says “when you get rid of enhanced interrogation techniques, for example, or the terrorist surveillance program, you reduce the intelligence flow to the intelligence community” THAT IS A LIE.", 
        "intTime": 20090514, 
        "postID": 41, 
        "quote": "", 
        "reply": "If there were any new high profile prisoners captured in the past six years, there would have been an announcement – like when the Bush Administration announced the capture of Khalid Shaikh Mohammed and Abu Zubaydah. Dick Cheney says that since the Obama Administration does not use “enhanced interrogation techniques” that the country is “less safe” and that such a policy opens America to further attacks. Who does he want the Obama Administration to torture to make us safer? CIA Director Hayden, under the Bush Administration, testified before Congress in February 2008 that “enhanced interrogation techniques” had not been used since 2003. So what Cheney is saying is that since President Obama no longer allows the tactics that the Bush has NOT used since 2003, that the country is less safe. It does not make sense, but the bushies cling to whatever Dick says, even if it makes no sense. By the way, the Obama Administration is continuing the surveillance of communications within the United States, they are just following the law and using the FISA Court for oversight, AS REQUIRED BY LAW, is the only difference. So when Cheney says “when you get rid of enhanced interrogation techniques, for example, or the terrorist surveillance program, you reduce the intelligence flow to the intelligence community” THAT IS A LIE.", 
        "threadID": "672198221_5070043322001", 
        "time": "2009-05-14 22:19:00", 
        "title": "Who does Cheney want tortured now?", 
        "userID": "xerello"
    }, 
    {
        "content": "xerello, you don't get it. The point is that by announcing to the world that we will not used enhanced interrogation techniques Mr. Obama has weakened the U.S.A. in several ways. He has told the world we have been committing crimes against prisoners whether that is true or not. He is telling terrorists and allies who mistake compassion for weakness that we will not even use the minimal techniques we have used in the past in order to obtain information that might save American lives he ties our intelligence operatives hands behind their backs by preventing them from using such techniques to obtain vital information from any terrorist captured in the future regardless of what information he might have. These techniques were not used willy-nilly against every prisoner we had in custody. They were only used in very specific cases under strict medical supervision when there was tangible evidence that a particular terrorist held information that was harmful to innocent citizens.", 
        "intTime": 20090515, 
        "postID": 42, 
        "quote": "", 
        "reply": "xerello, you don't get it. The point is that by announcing to the world that we will not used enhanced interrogation techniques Mr. Obama has weakened the U.S.A. in several ways. He has told the world we have been committing crimes against prisoners whether that is true or not. He is telling terrorists and allies who mistake compassion for weakness that we will not even use the minimal techniques we have used in the past in order to obtain information that might save American lives he ties our intelligence operatives hands behind their backs by preventing them from using such techniques to obtain vital information from any terrorist captured in the future regardless of what information he might have. These techniques were not used willy-nilly against every prisoner we had in custody. They were only used in very specific cases under strict medical supervision when there was tangible evidence that a particular terrorist held information that was harmful to innocent citizens.", 
        "threadID": "672198221_5070043322001", 
        "time": "2009-05-15 03:12:00", 
        "title": "Who does Cheney want tortured now?", 
        "userID": "M123Driver"
    }, 
    {
        "content": "Even if there was close medical supervision and very specific circumstances, torture is torture any way you put it. Torture shoudl not be allowed, and those who authorized it should be prosecuted to the fullest extent of the law, even if I have to locate people from left wing fringe groups, and get them into Harvard law school by being a dead-ringer and take the LSAT for them so they can get the highest possible score, AND do all their term papers producing A grade work on the only condition they become prosecutors and prosecute Cheney, and all others who authorized torture. If this is the only kind of way that America will prosecute the ones who authorized torture (private citizens being dead-ringers for compassionaate Ivy league candidates who want justice), and gain back the respect of the world community, than America is not the country I came of age thinking it was. Again, torture should not be allowed to be policy. Because maybe the next time, there will be budget cuts and there won't be money available for medical experts to watch the torturer's every move. There won't be time for the torturers to find \"very specific\" instances. Nobody can ever be sure if anybody is going to have the incentive or the resources to conduct such full scale investigations, as to weed out the real terrorists who know things. As long as torture is allowed, you open the door wide for anything to happen. quote: Originally posted by M123Driver: xerello, you don't get it. The point is that by announcing to the world that we will not used enhanced interrogation techniques Mr. Obama has weakened the U.S.A. in several ways. He has told the world we have been committing crimes against prisoners whether that is true or not. He is telling terrorists and allies who mistake compassion for weakness that we will not even use the minimal techniques we have used in the past in order to obtain information that might save American lives he ties our intelligence operatives hands behind their backs by preventing them from using such techniques to obtain vital information from any terrorist captured in the future regardless of what information he might have. These techniques were not used willy-nilly against every prisoner we had in custody. They were only used in very specific cases under strict medical supervision when there was tangible evidence that a particular terrorist held information that was harmful to innocent citizens. This message has been edited. Last edited by: cybercafe, Fri 15 May 2009 04:21 AM", 
        "intTime": 20090515, 
        "postID": 43, 
        "quote": "Originally posted by M123Driver: xerello, you don't get it. The point is that by announcing to the world that we will not used enhanced interrogation techniques Mr. Obama has weakened the U.S.A. in several ways. He has told the world we have been committing crimes against prisoners whether that is true or not. He is telling terrorists and allies who mistake compassion for weakness that we will not even use the minimal techniques we have used in the past in order to obtain information that might save American lives he ties our intelligence operatives hands behind their backs by preventing them from using such techniques to obtain vital information from any terrorist captured in the future regardless of what information he might have. These techniques were not used willy-nilly against every prisoner we had in custody. They were only used in very specific cases under strict medical supervision when there was tangible evidence that a particular terrorist held information that was harmful to innocent citizens.", 
        "reply": "Even if there was close medical supervision and very specific circumstances, torture is torture any way you put it. Torture shoudl not be allowed, and those who authorized it should be prosecuted to the fullest extent of the law, even if I have to locate people from left wing fringe groups, and get them into Harvard law school by being a dead-ringer and take the LSAT for them so they can get the highest possible score, AND do all their term papers producing A grade work on the only condition they become prosecutors and prosecute Cheney, and all others who authorized torture. If this is the only kind of way that America will prosecute the ones who authorized torture (private citizens being dead-ringers for compassionaate Ivy league candidates who want justice), and gain back the respect of the world community, than America is not the country I came of age thinking it was. Again, torture should not be allowed to be policy. Because maybe the next time, there will be budget cuts and there won't be money available for medical experts to watch the torturer's every move. There won't be time for the torturers to find \"very specific\" instances. Nobody can ever be sure if anybody is going to have the incentive or the resources to conduct such full scale investigations, as to weed out the real terrorists who know things. As long as torture is allowed, you open the door wide for anything to happen.  This message has been edited. Last edited by: cybercafe, Fri 15 May 2009 04:21 AM", 
        "threadID": "672198221_5070043322001", 
        "time": "2009-05-15 03:49:00", 
        "title": "Who does Cheney want tortured now?", 
        "userID": "cybercafe"
    }, 
    {
        "content": "quote: Who does he want the Obama Administration to torture to make us safer? ....at the moment Nancy would come to mind for both Dick and Barry... Already past the future", 
        "intTime": 20090515, 
        "postID": 44, 
        "quote": "Who does he want the Obama Administration to torture to make us safer?", 
        "reply": " ....at the moment Nancy would come to mind for both Dick and Barry... Already past the future", 
        "threadID": "672198221_5070043322001", 
        "time": "2009-05-15 03:52:00", 
        "title": "Who does Cheney want tortured now?", 
        "userID": "6486143"
    }, 
    {
        "content": "We all get tortured every time Deadeye Dick opens his mouth. He makes nails on the chalkboard sound good.", 
        "intTime": 20090515, 
        "postID": 45, 
        "quote": "", 
        "reply": "We all get tortured every time Deadeye Dick opens his mouth. He makes nails on the chalkboard sound good.", 
        "threadID": "672198221_5070043322001", 
        "time": "2009-05-15 04:43:00", 
        "title": "Who does Cheney want tortured now?", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by xerello: If there were any new high profile prisoners captured in the past six years, there would have been an announcement – like when the Bush Administration announced the capture of Khalid Shaikh Mohammed and Abu Zubaydah. Dick Cheney says that since the Obama Administration does not use “enhanced interrogation techniques” that the country is “less safe” and that such a policy opens America to further attacks. Who does he want the Obama Administration to torture to make us safer? CIA Director Hayden, under the Bush Administration, testified before Congress in February 2008 that “enhanced interrogation techniques” had not been used since 2003. So what Cheney is saying is that since President Obama no longer allows the tactics that the Bush has NOT used since 2003, that the country is less safe. It does not make sense, but the bushies cling to whatever Dick says, even if it makes no sense. By the way, the Obama Administration is continuing the surveillance of communications within the United States, they are just following the law and using the FISA Court for oversight, AS REQUIRED BY LAW, is the only difference. So when Cheney says “when you get rid of enhanced interrogation techniques, for example, or the terrorist surveillance program, you reduce the intelligence flow to the intelligence community” THAT IS A LIE. Hes arguing to keep the option on the table. I know that must be hard for you to understand.", 
        "intTime": 20090515, 
        "postID": 46, 
        "quote": "Originally posted by xerello: If there were any new high profile prisoners captured in the past six years, there would have been an announcement – like when the Bush Administration announced the capture of Khalid Shaikh Mohammed and Abu Zubaydah. Dick Cheney says that since the Obama Administration does not use “enhanced interrogation techniques” that the country is “less safe” and that such a policy opens America to further attacks. Who does he want the Obama Administration to torture to make us safer? CIA Director Hayden, under the Bush Administration, testified before Congress in February 2008 that “enhanced interrogation techniques” had not been used since 2003. So what Cheney is saying is that since President Obama no longer allows the tactics that the Bush has NOT used since 2003, that the country is less safe. It does not make sense, but the bushies cling to whatever Dick says, even if it makes no sense. By the way, the Obama Administration is continuing the surveillance of communications within the United States, they are just following the law and using the FISA Court for oversight, AS REQUIRED BY LAW, is the only difference. So when Cheney says “when you get rid of enhanced interrogation techniques, for example, or the terrorist surveillance program, you reduce the intelligence flow to the intelligence community” THAT IS A LIE.", 
        "reply": " Hes arguing to keep the option on the table. I know that must be hard for you to understand.", 
        "threadID": "672198221_5070043322001", 
        "time": "2009-05-15 05:42:00", 
        "title": "Who does Cheney want tortured now?", 
        "userID": "NickBrand"
    }, 
    {
        "content": "I think the real question about water boarding should be \"If we had water boarded Dick H Cheney and bush while they were lying about WMD could we have saved over 4000 thousand American lives\"?", 
        "intTime": 20090515, 
        "postID": 47, 
        "quote": "", 
        "reply": "I think the real question about water boarding should be \"If we had water boarded Dick H Cheney and bush while they were lying about WMD could we have saved over 4000 thousand American lives\"?", 
        "threadID": "672198221_5070043322001", 
        "time": "2009-05-15 06:09:00", 
        "title": "Who does Cheney want tortured now?", 
        "userID": "6837602"
    }, 
    {
        "content": "IS the OP doing an Op Ed or is there a news article along with the commentary, this is 'In The News'.", 
        "intTime": 20090515, 
        "postID": 48, 
        "quote": "", 
        "reply": "IS the OP doing an Op Ed or is there a news article along with the commentary, this is 'In The News'.", 
        "threadID": "672198221_5070043322001", 
        "time": "2009-05-15 07:10:00", 
        "title": "Who does Cheney want tortured now?", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by 6837602: I think the real question about water boarding should be \"If we had water boarded Dick H Cheney and bush while they were lying about WMD could we have saved over 4000 thousand American lives\"? Only if you water boarded various national spy agancies, the UN Security Council & the Clinton Administration, along with a few Senate & Congressional committees.", 
        "intTime": 20090515, 
        "postID": 49, 
        "quote": "Originally posted by 6837602: I think the real question about water boarding should be \"If we had water boarded Dick H Cheney and bush while they were lying about WMD could we have saved over 4000 thousand American lives\"?", 
        "reply": " Only if you water boarded various national spy agancies, the UN Security Council & the Clinton Administration, along with a few Senate & Congressional committees.", 
        "threadID": "672198221_5070043322001", 
        "time": "2009-05-15 07:12:00", 
        "title": "Who does Cheney want tortured now?", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by 67NOV: IS the OP doing an Op Ed or is there a news article along with the commentary, this is 'In The News'. Cheney is all over the news covering his azz. Google Cheney, memo and you will get thousands of news links.", 
        "intTime": 20090515, 
        "postID": 50, 
        "quote": "Originally posted by 67NOV: IS the OP doing an Op Ed or is there a news article along with the commentary, this is 'In The News'.", 
        "reply": " Cheney is all over the news covering his azz. Google Cheney, memo and you will get thousands of news links.", 
        "threadID": "672198221_5070043322001", 
        "time": "2009-05-15 07:57:00", 
        "title": "Who does Cheney want tortured now?", 
        "userID": "xerello"
    }, 
    {
        "content": "quote: Originally posted by xerello: So when Cheney says “when you get rid of enhanced interrogation techniques, for example, or the terrorist surveillance program, you reduce the intelligence flow to the intelligence community” THAT IS A LIE. quote: Originally posted by NickBrand: Hes arguing to keep the option on the table. I know that must be hard for you to understand. How can you keep a crime as an option on the table? More or less like saying when I argue with someone over a parking space, killing them should be an option on the table. We never had that option before, never had it on the table. What other options you want on the table? Gas warfare? Biological weapons? Dave", 
        "intTime": 20090515, 
        "postID": 51, 
        "quote": "Originally posted by xerello: So when Cheney says “when you get rid of enhanced interrogation techniques, for example, or the terrorist surveillance program, you reduce the intelligence flow to the intelligence community” THAT IS A LIE.", 
        "reply": " quote: Originally posted by NickBrand: Hes arguing to keep the option on the table. I know that must be hard for you to understand. How can you keep a crime as an option on the table? More or less like saying when I argue with someone over a parking space, killing them should be an option on the table. We never had that option before, never had it on the table. What other options you want on the table? Gas warfare? Biological weapons? Dave", 
        "threadID": "672198221_5070043322001", 
        "time": "2009-05-15 09:23:00", 
        "title": "Who does Cheney want tortured now?", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by xerello: quote: Originally posted by 67NOV: IS the OP doing an Op Ed or is there a news article along with the commentary, this is 'In The News'. Cheney is all over the news covering his azz. Google Cheney, memo and you will get thousands of news links. As OP that's your job, otherwise this should be in 'point/counter-point'.", 
        "intTime": 20090515, 
        "postID": 52, 
        "quote": "Originally posted by xerello: quote: Originally posted by 67NOV: IS the OP doing an Op Ed or is there a news article along with the commentary, this is 'In The News'. Cheney is all over the news covering his azz. Google Cheney, memo and you will get thousands of news links.", 
        "reply": " As OP that's your job, otherwise this should be in 'point/counter-point'.", 
        "threadID": "672198221_5070043322001", 
        "time": "2009-05-15 10:01:00", 
        "title": "Who does Cheney want tortured now?", 
        "userID": "67NOV"
    }, 
    {
        "content": "Bush did not lie about WMD's in Iraq, You better get your facts correct before you post. It was Clinton, Kerry and Democrats would said Iraq had WMD's long before Bush was even President...So get your facts correct before you posts untruths... Those same people (except for one) NEVER told Bush anything different when he took office. So when 9/11 happen, it was a open plate for Bush. If Bush lied, then it was that he repeated Clinton, Kerry and democrats lies... Now if I was Cheney I would water board Clinton, Kerry ( a few extra times ) and all the members of the democrat party that said Iraq had WMD's...Before Bush was President..Wow, just thought of something, does that include Clinton's wife? after all she did vote to go into Iraq, so she must have agree to Iraq having WMD's also...a family affair I see.", 
        "intTime": 20090515, 
        "postID": 53, 
        "quote": "", 
        "reply": "Bush did not lie about WMD's in Iraq, You better get your facts correct before you post. It was Clinton, Kerry and Democrats would said Iraq had WMD's long before Bush was even President...So get your facts correct before you posts untruths... Those same people (except for one) NEVER told Bush anything different when he took office. So when 9/11 happen, it was a open plate for Bush. If Bush lied, then it was that he repeated Clinton, Kerry and democrats lies... Now if I was Cheney I would water board Clinton, Kerry ( a few extra times ) and all the members of the democrat party that said Iraq had WMD's...Before Bush was President..Wow, just thought of something, does that include Clinton's wife? after all she did vote to go into Iraq, so she must have agree to Iraq having WMD's also...a family affair I see.", 
        "threadID": "672198221_5070043322001", 
        "time": "2009-05-15 10:05:00", 
        "title": "Who does Cheney want tortured now?", 
        "userID": "dman1948"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by xerello: So when Cheney says “when you get rid of enhanced interrogation techniques, for example, or the terrorist surveillance program, you reduce the intelligence flow to the intelligence community” THAT IS A LIE. quote: Originally posted by NickBrand: Hes arguing to keep the option on the table. I know that must be hard for you to understand. How can you keep a crime as an option on the table? More or less like saying when I argue with someone over a parking space, killing them should be an option on the table. We never had that option before, never had it on the table. What other options you want on the table? Gas warfare? Biological weapons? Dave That's complete B.S. The option has always been there whether or not politicians knew it was going on and turned a blind is another story. Churchill said English never tortured during WWII but in fact they did. He didn't give a crap whether or not Nazis were tortured or not as long as the information that was vital to the winning of the war was good. That is a historical fact. If you think this country hasn't used nefarious methods throughout our history to gain intel your drinking to much kool-aid. By either turning these people over to some other government to do the torture for us ie Rendition or doing it ourselves it makes absolutely no difference as long as we get the information we are looking for. It's been done and whether or not that changes will remain to be seen. Honestly I could give two shiits whether or not those people were waterboarded or tortured. What I care about is the American people's defense and the safety of this country's innocent civilians. I wouldn't condone the use of any of those techniques on a simple matter of robbery or anything else but I would condone it if the lives of thousands of this countries civilians were on the line because of an impending attack. That's my own opinion on the matter and when it comes to my family and their saftey I'm willing to use whatever is necessary to tend to their safety. You obviously differ in that opinion which is your right and I respect that.", 
        "intTime": 20090515, 
        "postID": 54, 
        "quote": "Originally posted by Grachus: quote: Originally posted by xerello: So when Cheney says “when you get rid of enhanced interrogation techniques, for example, or the terrorist surveillance program, you reduce the intelligence flow to the intelligence community” THAT IS A LIE. quote: Originally posted by NickBrand: Hes arguing to keep the option on the table. I know that must be hard for you to understand. How can you keep a crime as an option on the table? More or less like saying when I argue with someone over a parking space, killing them should be an option on the table. We never had that option before, never had it on the table. What other options you want on the table? Gas warfare? Biological weapons? Dave", 
        "reply": " That's complete B.S. The option has always been there whether or not politicians knew it was going on and turned a blind is another story. Churchill said English never tortured during WWII but in fact they did. He didn't give a crap whether or not Nazis were tortured or not as long as the information that was vital to the winning of the war was good. That is a historical fact. If you think this country hasn't used nefarious methods throughout our history to gain intel your drinking to much kool-aid. By either turning these people over to some other government to do the torture for us ie Rendition or doing it ourselves it makes absolutely no difference as long as we get the information we are looking for. It's been done and whether or not that changes will remain to be seen. Honestly I could give two shiits whether or not those people were waterboarded or tortured. What I care about is the American people's defense and the safety of this country's innocent civilians. I wouldn't condone the use of any of those techniques on a simple matter of robbery or anything else but I would condone it if the lives of thousands of this countries civilians were on the line because of an impending attack. That's my own opinion on the matter and when it comes to my family and their saftey I'm willing to use whatever is necessary to tend to their safety. You obviously differ in that opinion which is your right and I respect that.", 
        "threadID": "672198221_5070043322001", 
        "time": "2009-05-15 10:20:00", 
        "title": "Who does Cheney want tortured now?", 
        "userID": "NickBrand"
    }, 
    {
        "content": "quote: Originally posted by NickBrand: quote: Originally posted by Grachus: quote: Originally posted by xerello: So when Cheney says “when you get rid of enhanced interrogation techniques, for example, or the terrorist surveillance program, you reduce the intelligence flow to the intelligence community” THAT IS A LIE. quote: Originally posted by NickBrand: Hes arguing to keep the option on the table. I know that must be hard for you to understand. How can you keep a crime as an option on the table? More or less like saying when I argue with someone over a parking space, killing them should be an option on the table. We never had that option before, never had it on the table. What other options you want on the table? Gas warfare? Biological weapons? Dave That's complete B.S. The option has always been there whether or not politicians knew it was going on and turned a blind is another story. Churchill said English never tortured during WWII but in fact they did. He didn't give a crap whether or not Nazis were tortured or not as long as the information that was vital to the winning of the war was good. That is a historical fact. If you think this country hasn't used nefarious methods throughout our history to gain intel your drinking to much kool-aid. By either turning these people over to some other government to do the torture for us ie Rendition or doing it ourselves it makes absolutely no difference as long as we get the information we are looking for. It's been done and whether or not that changes will remain to be seen. Honestly I could give two shiits whether or not those people were waterboarded or tortured. What I care about is the American people's defense and the safety of this country's innocent civilians. I wouldn't condone the use of any of those techniques on a simple matter of robbery or anything else but I would condone it if the lives of thousands of this countries civilians were on the line because of an impending attack. That's my own opinion on the matter and when it comes to my family and their saftey I'm willing to use whatever is necessary to tend to their safety. You obviously differ in that opinion which is your right and I respect that. Churchill used torture? How about Mother Teresa? Got any proof? \"http://blogs.abcnews.com/politicalpunch/2009/05/what-was-church.html\" Dave", 
        "intTime": 20090515, 
        "postID": 55, 
        "quote": "Originally posted by NickBrand: quote: Originally posted by Grachus: quote: Originally posted by xerello: So when Cheney says “when you get rid of enhanced interrogation techniques, for example, or the terrorist surveillance program, you reduce the intelligence flow to the intelligence community” THAT IS A LIE. quote: Originally posted by NickBrand: Hes arguing to keep the option on the table. I know that must be hard for you to understand. How can you keep a crime as an option on the table? More or less like saying when I argue with someone over a parking space, killing them should be an option on the table. We never had that option before, never had it on the table. What other options you want on the table? Gas warfare? Biological weapons? Dave That's complete B.S. The option has always been there whether or not politicians knew it was going on and turned a blind is another story. Churchill said English never tortured during WWII but in fact they did. He didn't give a crap whether or not Nazis were tortured or not as long as the information that was vital to the winning of the war was good. That is a historical fact. If you think this country hasn't used nefarious methods throughout our history to gain intel your drinking to much kool-aid. By either turning these people over to some other government to do the torture for us ie Rendition or doing it ourselves it makes absolutely no difference as long as we get the information we are looking for. It's been done and whether or not that changes will remain to be seen. Honestly I could give two shiits whether or not those people were waterboarded or tortured. What I care about is the American people's defense and the safety of this country's innocent civilians. I wouldn't condone the use of any of those techniques on a simple matter of robbery or anything else but I would condone it if the lives of thousands of this countries civilians were on the line because of an impending attack. That's my own opinion on the matter and when it comes to my family and their saftey I'm willing to use whatever is necessary to tend to their safety. You obviously differ in that opinion which is your right and I respect that.", 
        "reply": " Churchill used torture? How about Mother Teresa? Got any proof? \"http://blogs.abcnews.com/politicalpunch/2009/05/what-was-church.html\" Dave", 
        "threadID": "672198221_5070043322001", 
        "time": "2009-05-15 10:32:00", 
        "title": "Who does Cheney want tortured now?", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by M123Driver: xerello, you don't get it. The point is that by announcing to the world that we will not used enhanced interrogation techniques Mr. Obama has weakened the U.S.A. in several ways. He has told the world we have been committing crimes against prisoners whether that is true or not. He is telling terrorists and allies who mistake compassion for weakness that we will not even use the minimal techniques we have used in the past in order to obtain information that might save American lives he ties our intelligence operatives hands behind their backs by preventing them from using such techniques to obtain vital information from any terrorist captured in the future regardless of what information he might have. These techniques were not used willy-nilly against every prisoner we had in custody. They were only used in very specific cases under strict medical supervision when there was tangible evidence that a particular terrorist held information that was harmful to innocent citizens. President Obama did not tell the world that crimes had been committed against prisoners, the Bush Administration did. Dick Cheney has admitted that he approved waterboarding, CIA Director Hayden admitted in testimony to Congress that prisoners have been waterboarded and President Bush himself admitted in May 2008 that waterboarding has been used on prisoners. The world knew about the waterboarding long before President Obama was elected. It is not true that interrogation techniques - interrogation methods that professional interrogators insist are EFFECTIVE in getting information from even hard-core al Qaeda are still available for use. It is true that the government no longer hires contractors to torture people. As the FBI agent testified before Congress, al-Qaeda members are trained to be prepared for the type of torture they would get if they were captured in Saudi Arabia or Egypt – even the Bush Administration did not go that far. So they are well prepared for anything that American torturers can dish out. It is a false argument that the memos provided information that helps the enemy to prepare for what might happen if they are captured by American forces. Contrary to what Rush or Hannity told you, the memos do not describe the torture methods used by CIA contractors. What they cannot prepare for is being outsmarted by a professional interrogator who will not even threaten physical torture. But this is not a is torture legal or effective or neccessary thread. Cheney claims that since waterboarding and other torture techniques are no longer used, America is less safe. The question is – how can one reach the conclusion that because no one is being tortured right now, American is less safe from attack?", 
        "intTime": 20090515, 
        "postID": 56, 
        "quote": "Originally posted by M123Driver: xerello, you don't get it. The point is that by announcing to the world that we will not used enhanced interrogation techniques Mr. Obama has weakened the U.S.A. in several ways. He has told the world we have been committing crimes against prisoners whether that is true or not. He is telling terrorists and allies who mistake compassion for weakness that we will not even use the minimal techniques we have used in the past in order to obtain information that might save American lives he ties our intelligence operatives hands behind their backs by preventing them from using such techniques to obtain vital information from any terrorist captured in the future regardless of what information he might have. These techniques were not used willy-nilly against every prisoner we had in custody. They were only used in very specific cases under strict medical supervision when there was tangible evidence that a particular terrorist held information that was harmful to innocent citizens.", 
        "reply": " President Obama did not tell the world that crimes had been committed against prisoners, the Bush Administration did. Dick Cheney has admitted that he approved waterboarding, CIA Director Hayden admitted in testimony to Congress that prisoners have been waterboarded and President Bush himself admitted in May 2008 that waterboarding has been used on prisoners. The world knew about the waterboarding long before President Obama was elected. It is not true that interrogation techniques - interrogation methods that professional interrogators insist are EFFECTIVE in getting information from even hard-core al Qaeda are still available for use. It is true that the government no longer hires contractors to torture people. As the FBI agent testified before Congress, al-Qaeda members are trained to be prepared for the type of torture they would get if they were captured in Saudi Arabia or Egypt – even the Bush Administration did not go that far. So they are well prepared for anything that American torturers can dish out. It is a false argument that the memos provided information that helps the enemy to prepare for what might happen if they are captured by American forces. Contrary to what Rush or Hannity told you, the memos do not describe the torture methods used by CIA contractors. What they cannot prepare for is being outsmarted by a professional interrogator who will not even threaten physical torture. But this is not a is torture legal or effective or neccessary thread. Cheney claims that since waterboarding and other torture techniques are no longer used, America is less safe. The question is – how can one reach the conclusion that because no one is being tortured right now, American is less safe from attack?", 
        "threadID": "672198221_5070043322001", 
        "time": "2009-05-15 10:47:00", 
        "title": "Who does Cheney want tortured now?", 
        "userID": "xerello"
    }, 
    {
        "content": "quote: Originally posted by 67NOV: quote: Originally posted by xerello: quote: Originally posted by 67NOV: IS the OP doing an Op Ed or is there a news article along with the commentary, this is 'In The News'. Cheney is all over the news covering his azz. Google Cheney, memo and you will get thousands of news links. As OP that's your job, otherwise this should be in 'point/counter-point'. >http://www.upi.com/Top_News/2009/05/12/Cheney-defends-Bush-anti-terror-policies/UPI-36011242173364/ >http://www.cqpolitics.com/wmspage.cfm?docID=news-000003114272 Now will you answer the question of the thread? quote: Who does Cheney want the Obama Administration to torture to make us safer?", 
        "intTime": 20090515, 
        "postID": 57, 
        "quote": "Originally posted by 67NOV: quote: Originally posted by xerello: quote: Originally posted by 67NOV: IS the OP doing an Op Ed or is there a news article along with the commentary, this is 'In The News'. Cheney is all over the news covering his azz. Google Cheney, memo and you will get thousands of news links. As OP that's your job, otherwise this should be in 'point/counter-point'.", 
        "reply": " >http://www.upi.com/Top_News/2009/05/12/Cheney-defends-Bush-anti-terror-policies/UPI-36011242173364/ >http://www.cqpolitics.com/wmspage.cfm?docID=news-000003114272 Now will you answer the question of the thread? quote: Who does Cheney want the Obama Administration to torture to make us safer?", 
        "threadID": "672198221_5070043322001", 
        "time": "2009-05-15 10:57:00", 
        "title": "Who does Cheney want tortured now?", 
        "userID": "xerello"
    }, 
    {
        "content": "quote: Originally posted by xerello: Now will you answer the question of the thread? quote: Who does Cheney want the Obama Administration to torture to make us safer? Guilty of ball busting. To the question, it would depend on who is in custody, what they are suspected of, etc. I don't think \"Darth\" Cheney wants to go around, willy-nilly waterboarding folks for schits & gigles. Use it when deemed necesary.", 
        "intTime": 20090515, 
        "postID": 58, 
        "quote": "Originally posted by xerello: Now will you answer the question of the thread? quote: Who does Cheney want the Obama Administration to torture to make us safer?", 
        "reply": " Guilty of ball busting. To the question, it would depend on who is in custody, what they are suspected of, etc. I don't think \"Darth\" Cheney wants to go around, willy-nilly waterboarding folks for schits & gigles. Use it when deemed necesary.", 
        "threadID": "672198221_5070043322001", 
        "time": "2009-05-15 11:06:00", 
        "title": "Who does Cheney want tortured now?", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by Grachus: Churchill used torture? How about Mother Teresa? Got any proof? \"http://blogs.abcnews.com/politicalpunch/2009/05/what-was-church.html\" Dave try npr.com there was a discussion about this on the May 1st edition of \"All Things Considered\" show.", 
        "intTime": 20090515, 
        "postID": 59, 
        "quote": "Originally posted by Grachus: Churchill used torture? How about Mother Teresa? Got any proof? \"http://blogs.abcnews.com/politicalpunch/2009/05/what-was-church.html\" Dave", 
        "reply": " try npr.com there was a discussion about this on the May 1st edition of \"All Things Considered\" show.", 
        "threadID": "672198221_5070043322001", 
        "time": "2009-05-15 11:10:00", 
        "title": "Who does Cheney want tortured now?", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by NickBrand: quote: Originally posted by Grachus: quote: Originally posted by xerello: So when Cheney says “when you get rid of enhanced interrogation techniques, for example, or the terrorist surveillance program, you reduce the intelligence flow to the intelligence community” THAT IS A LIE. quote: Originally posted by NickBrand: Hes arguing to keep the option on the table. I know that must be hard for you to understand. How can you keep a crime as an option on the table? More or less like saying when I argue with someone over a parking space, killing them should be an option on the table. We never had that option before, never had it on the table. What other options you want on the table? Gas warfare? Biological weapons? Dave That's complete B.S. The option has always been there whether or not politicians knew it was going on and turned a blind is another story. Churchill said English never tortured during WWII but in fact they did. He didn't give a crap whether or not Nazis were tortured or not as long as the information that was vital to the winning of the war was good. That is a historical fact. If you think this country hasn't used nefarious methods throughout our history to gain intel your drinking to much kool-aid. By either turning these people over to some other government to do the torture for us ie Rendition or doing it ourselves it makes absolutely no difference as long as we get the information we are looking for. It's been done and whether or not that changes will remain to be seen. Honestly I could give two shiits whether or not those people were waterboarded or tortured. What I care about is the American people's defense and the safety of this country's innocent civilians. I wouldn't condone the use of any of those techniques on a simple matter of robbery or anything else but I would condone it if the lives of thousands of this countries civilians were on the line because of an impending attack. That's my own opinion on the matter and when it comes to my family and their saftey I'm willing to use whatever is necessary to tend to their safety. You obviously differ in that opinion which is your right and I respect that. Churchill used torture? How about Mother Teresa? Got any proof? \"http://blogs.abcnews.com/politicalpunch/2009/05/what-was-church.html\" Dave Heres after a quick google search on that topic \"http://www.politico.com/blogs/bensmith/0409/Obama_and_Churchill.html\" \"http://www.mail-archive.com/futurework@fes.uwaterloo.ca/msg02350.html\" Churchill in a quote. \" In wartime the truth is so important it must be cloaked in a body guard of lies\".", 
        "intTime": 20090515, 
        "postID": 60, 
        "quote": "Originally posted by Grachus: quote: Originally posted by NickBrand: quote: Originally posted by Grachus: quote: Originally posted by xerello: So when Cheney says “when you get rid of enhanced interrogation techniques, for example, or the terrorist surveillance program, you reduce the intelligence flow to the intelligence community” THAT IS A LIE. quote: Originally posted by NickBrand: Hes arguing to keep the option on the table. I know that must be hard for you to understand. How can you keep a crime as an option on the table? More or less like saying when I argue with someone over a parking space, killing them should be an option on the table. We never had that option before, never had it on the table. What other options you want on the table? Gas warfare? Biological weapons? Dave That's complete B.S. The option has always been there whether or not politicians knew it was going on and turned a blind is another story. Churchill said English never tortured during WWII but in fact they did. He didn't give a crap whether or not Nazis were tortured or not as long as the information that was vital to the winning of the war was good. That is a historical fact. If you think this country hasn't used nefarious methods throughout our history to gain intel your drinking to much kool-aid. By either turning these people over to some other government to do the torture for us ie Rendition or doing it ourselves it makes absolutely no difference as long as we get the information we are looking for. It's been done and whether or not that changes will remain to be seen. Honestly I could give two shiits whether or not those people were waterboarded or tortured. What I care about is the American people's defense and the safety of this country's innocent civilians. I wouldn't condone the use of any of those techniques on a simple matter of robbery or anything else but I would condone it if the lives of thousands of this countries civilians were on the line because of an impending attack. That's my own opinion on the matter and when it comes to my family and their saftey I'm willing to use whatever is necessary to tend to their safety. You obviously differ in that opinion which is your right and I respect that. Churchill used torture? How about Mother Teresa? Got any proof? \"http://blogs.abcnews.com/politicalpunch/2009/05/what-was-church.html\" Dave", 
        "reply": " Heres after a quick google search on that topic \"http://www.politico.com/blogs/bensmith/0409/Obama_and_Churchill.html\" \"http://www.mail-archive.com/futurework@fes.uwaterloo.ca/msg02350.html\" Churchill in a quote. \" In wartime the truth is so important it must be cloaked in a body guard of lies\".", 
        "threadID": "672198221_5070043322001", 
        "time": "2009-05-15 11:15:00", 
        "title": "Who does Cheney want tortured now?", 
        "userID": "NickBrand"
    }
]