[
    {
        "content": "\"http://www.ft.com/cms/s/0/bd371350-0f2c-11de-ba10-0000779fd2ac.html\" Now we know why english will NEVER be declaired the official language of this nation. Walmart. Save Money. Live Better. Screw America.", 
        "intTime": 20090313, 
        "postID": 1, 
        "quote": "", 
        "reply": "\"http://www.ft.com/cms/s/0/bd371350-0f2c-11de-ba10-0000779fd2ac.html\" Now we know why english will NEVER be declaired the official language of this nation. Walmart. Save Money. Live Better. Screw America.", 
        "threadID": "672198221_5800097712001", 
        "time": "2009-03-13 15:10:00", 
        "title": "All American WalMart Strikes Again..Wal-Mart looks to Hispanic market", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "How exactly is Wal-Mart screwing this country by offering goods and services? The story also cites other companies doing the same thing but you didn't seem to be upset with them. Any reason why?", 
        "intTime": 20090313, 
        "postID": 2, 
        "quote": "", 
        "reply": "How exactly is Wal-Mart screwing this country by offering goods and services? The story also cites other companies doing the same thing but you didn't seem to be upset with them. Any reason why?", 
        "threadID": "672198221_5800097712001", 
        "time": "2009-03-13 16:12:00", 
        "title": "All American WalMart Strikes Again..Wal-Mart looks to Hispanic market", 
        "userID": "athos20"
    }, 
    {
        "content": "I love Wally World Wall-Mart, Wal-mart, rah rah rah sis boom bah", 
        "intTime": 20090313, 
        "postID": 3, 
        "quote": "", 
        "reply": "I love Wally World Wall-Mart, Wal-mart, rah rah rah sis boom bah", 
        "threadID": "672198221_5800097712001", 
        "time": "2009-03-13 16:15:00", 
        "title": "All American WalMart Strikes Again..Wal-Mart looks to Hispanic market", 
        "userID": "EAG154"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: \"http://www.ft.com/cms/s/0/bd371350-0f2c-11de-ba10-0000779fd2ac.html\" Now we know why english will NEVER be declaired the official language of this nation. Walmart. Save Money. Live Better. Screw America. I've been screwed shopping at many establishments but never at Wal-Mart! It is important for my wife and I to streach our dollars and Wal-Mart gives us the oportunity to do this more than any other store!", 
        "intTime": 20090313, 
        "postID": 4, 
        "quote": "Originally posted by crackerjacks61: \"http://www.ft.com/cms/s/0/bd371350-0f2c-11de-ba10-0000779fd2ac.html\" Now we know why english will NEVER be declaired the official language of this nation. Walmart. Save Money. Live Better. Screw America.", 
        "reply": " I've been screwed shopping at many establishments but never at Wal-Mart! It is important for my wife and I to streach our dollars and Wal-Mart gives us the oportunity to do this more than any other store!", 
        "threadID": "672198221_5800097712001", 
        "time": "2009-03-13 16:23:00", 
        "title": "All American WalMart Strikes Again..Wal-Mart looks to Hispanic market", 
        "userID": "EAG154"
    }, 
    {
        "content": "Because Wal Mart is suppose to be the 'Great American' store. Yeah ok. Screw it..I can't wait till we go to the one world government some want..because it's actions like this that is steering us right in that direction. This is Engish Amerian...not Latino America.", 
        "intTime": 20090313, 
        "postID": 5, 
        "quote": "", 
        "reply": "Because Wal Mart is suppose to be the 'Great American' store. Yeah ok. Screw it..I can't wait till we go to the one world government some want..because it's actions like this that is steering us right in that direction. This is Engish Amerian...not Latino America.", 
        "threadID": "672198221_5800097712001", 
        "time": "2009-03-13 17:36:00", 
        "title": "All American WalMart Strikes Again..Wal-Mart looks to Hispanic market", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by athos20: How exactly is Wal-Mart screwing this country by offering goods and services? The story also cites other companies doing the same thing but you didn't seem to be upset with them. Any reason why? hahahahahahahhaahahahahahahaa", 
        "intTime": 20090313, 
        "postID": 6, 
        "quote": "Originally posted by athos20: How exactly is Wal-Mart screwing this country by offering goods and services? The story also cites other companies doing the same thing but you didn't seem to be upset with them. Any reason why?", 
        "reply": " hahahahahahahhaahahahahahahaa", 
        "threadID": "672198221_5800097712001", 
        "time": "2009-03-13 17:40:00", 
        "title": "All American WalMart Strikes Again..Wal-Mart looks to Hispanic market", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: The retailer said that the stores were in “strongly Hispanic neighbourhoods” and would feature a “new lay-out, signing and product assortment designed to make them even more relevant to local Hispanic customers”. The staff will also be bilingual. Sounds like WalMart is practicing racial profiling by marketing these stores in these neighborhoods. Just because someone lives in a strongly hispanic neighborhood doesn't mean they speak spanish or want more of a selection of latin goods. I hope the Justice Department is ready to investigate and then prosecute them to the fullest extent that the law allows.", 
        "intTime": 20090313, 
        "postID": 7, 
        "quote": "The retailer said that the stores were in “strongly Hispanic neighbourhoods” and would feature a “new lay-out, signing and product assortment designed to make them even more relevant to local Hispanic customers”. The staff will also be bilingual.", 
        "reply": " Sounds like WalMart is practicing racial profiling by marketing these stores in these neighborhoods. Just because someone lives in a strongly hispanic neighborhood doesn't mean they speak spanish or want more of a selection of latin goods. I hope the Justice Department is ready to investigate and then prosecute them to the fullest extent that the law allows.", 
        "threadID": "672198221_5800097712001", 
        "time": "2009-03-13 18:39:00", 
        "title": "All American WalMart Strikes Again..Wal-Mart looks to Hispanic market", 
        "userID": "stec74"
    }, 
    {
        "content": "I guess this means crackerjack will be boycotting Best Buy and Home Depot too. Even if it's only because of their online stores the story mentioned: \"Leading retailers are also pursuing Hispanic consumers online, with Best Buy and Home Depot having launched Spanish-language versions of their e-commerce sites in recent months.\" I'm not entirely sold on the need for an \"official\" language. Particularly on the national level. Call it a states rights issue. By the way, states such as Texas, New Mexico, Arizona, California and others were once part of Mexico. Should Spanish be the \"unofficial\" language of these states?", 
        "intTime": 20090313, 
        "postID": 8, 
        "quote": "", 
        "reply": "I guess this means crackerjack will be boycotting Best Buy and Home Depot too. Even if it's only because of their online stores the story mentioned: \"Leading retailers are also pursuing Hispanic consumers online, with Best Buy and Home Depot having launched Spanish-language versions of their e-commerce sites in recent months.\" I'm not entirely sold on the need for an \"official\" language. Particularly on the national level. Call it a states rights issue. By the way, states such as Texas, New Mexico, Arizona, California and others were once part of Mexico. Should Spanish be the \"unofficial\" language of these states?", 
        "threadID": "672198221_5800097712001", 
        "time": "2009-03-13 22:06:00", 
        "title": "All American WalMart Strikes Again..Wal-Mart looks to Hispanic market", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "Depends on what you purchase. A few years back I purchased a bicycle for my son, had nothing but problems with it. They refused to refund me on my purchase, said they'd repair it, never did. I've also purchased a winter coat from them, in less than a month, it was literally falling apart at the seams. I refused a replacement not wanting a repeat performance, got another coat at Sears. Lasted several years. quote: Originally posted by EAG154: quote: Originally posted by crackerjacks61: \"http://www.ft.com/cms/s/0/bd371350-0f2c-11de-ba10-0000779fd2ac.html\" Now we know why english will NEVER be declaired the official language of this nation. Walmart. Save Money. Live Better. Screw America. I've been screwed shopping at many establishments but never at Wal-Mart! It is important for my wife and I to streach our dollars and Wal-Mart gives us the oportunity to do this more than any other store!", 
        "intTime": 20090314, 
        "postID": 9, 
        "quote": "Originally posted by EAG154: quote: Originally posted by crackerjacks61: \"http://www.ft.com/cms/s/0/bd371350-0f2c-11de-ba10-0000779fd2ac.html\" Now we know why english will NEVER be declaired the official language of this nation. Walmart. Save Money. Live Better. Screw America. I've been screwed shopping at many establishments but never at Wal-Mart! It is important for my wife and I to streach our dollars and Wal-Mart gives us the oportunity to do this more than any other store!", 
        "reply": "Depends on what you purchase. A few years back I purchased a bicycle for my son, had nothing but problems with it. They refused to refund me on my purchase, said they'd repair it, never did. I've also purchased a winter coat from them, in less than a month, it was literally falling apart at the seams. I refused a replacement not wanting a repeat performance, got another coat at Sears. Lasted several years. ", 
        "threadID": "672198221_5800097712001", 
        "time": "2009-03-14 02:08:00", 
        "title": "All American WalMart Strikes Again..Wal-Mart looks to Hispanic market", 
        "userID": "fishnfanatic"
    }, 
    {
        "content": "quote: Originally posted by fishnfanatic: Depends on what you purchase. A few years back I purchased a bicycle for my son, had nothing but problems with it. They refused to refund me on my purchase, said they'd repair it, never did. I've also purchased a winter coat from them, in less than a month, it was literally falling apart at the seams. I refused a replacement not wanting a repeat performance, got another coat at Sears. Lasted several years. quote: Originally posted by EAG154: quote: Originally posted by crackerjacks61: \"http://www.ft.com/cms/s/0/bd371350-0f2c-11de-ba10-0000779fd2ac.html\" Now we know why english will NEVER be declaired the official language of this nation. Walmart. Save Money. Live Better. Screw America. I've been screwed shopping at many establishments but never at Wal-Mart! It is important for my wife and I to streach our dollars and Wal-Mart gives us the oportunity to do this more than any other store! True! Wal-Mart is only sucessful if people shop there and buy their mechandise, and it appears that this is exactly what people are doing. best buy on Adams all Natural Chunky Peanut Butter yum!", 
        "intTime": 20090314, 
        "postID": 10, 
        "quote": "Originally posted by fishnfanatic: Depends on what you purchase. A few years back I purchased a bicycle for my son, had nothing but problems with it. They refused to refund me on my purchase, said they'd repair it, never did. I've also purchased a winter coat from them, in less than a month, it was literally falling apart at the seams. I refused a replacement not wanting a repeat performance, got another coat at Sears. Lasted several years. quote: Originally posted by EAG154: quote: Originally posted by crackerjacks61: \"http://www.ft.com/cms/s/0/bd371350-0f2c-11de-ba10-0000779fd2ac.html\" Now we know why english will NEVER be declaired the official language of this nation. Walmart. Save Money. Live Better. Screw America. I've been screwed shopping at many establishments but never at Wal-Mart! It is important for my wife and I to streach our dollars and Wal-Mart gives us the oportunity to do this more than any other store!", 
        "reply": " True! Wal-Mart is only sucessful if people shop there and buy their mechandise, and it appears that this is exactly what people are doing. best buy on Adams all Natural Chunky Peanut Butter yum!", 
        "threadID": "672198221_5800097712001", 
        "time": "2009-03-14 09:40:00", 
        "title": "All American WalMart Strikes Again..Wal-Mart looks to Hispanic market", 
        "userID": "EAG154"
    }, 
    {
        "content": "quote: Originally posted by athos20: How exactly is Wal-Mart screwing this country by offering goods and services? The story also cites other companies doing the same thing but you didn't seem to be upset with them. Any reason why? Wow! \"The markets include elements such as cafés serving Latino pastries and coffee, and full service meat and fish counters.\" \"A 195,000 sq ft Supercenter that opened in Texas last year included a tortilleria bakery, Hispanic foods and a larger selection of Spanish-language music and DVDs.\" Sounds like this will be a \"hit\" with more than just the local community. Sounds like a good marketing plan. Also.....you do know that even in public schools we have to be able to provide services for other language speakers...dual signs (Spanish-English), communication from the school, forms, etc. I noticed that even some newspapers now have sections specific to the Latino community (and these articles are not also provided for the English-only speaker). \"They love our milk and honey but they preach about some other way of living When you’re running down my country, Hoss you’re walking on the fighting side of me\" - - Merle Haggard", 
        "intTime": 20090314, 
        "postID": 11, 
        "quote": "Originally posted by athos20: How exactly is Wal-Mart screwing this country by offering goods and services? The story also cites other companies doing the same thing but you didn't seem to be upset with them. Any reason why?", 
        "reply": " Wow! \"The markets include elements such as cafés serving Latino pastries and coffee, and full service meat and fish counters.\" \"A 195,000 sq ft Supercenter that opened in Texas last year included a tortilleria bakery, Hispanic foods and a larger selection of Spanish-language music and DVDs.\" Sounds like this will be a \"hit\" with more than just the local community. Sounds like a good marketing plan. Also.....you do know that even in public schools we have to be able to provide services for other language speakers...dual signs (Spanish-English), communication from the school, forms, etc. I noticed that even some newspapers now have sections specific to the Latino community (and these articles are not also provided for the English-only speaker). \"They love our milk and honey but they preach about some other way of living When you’re running down my country, Hoss you’re walking on the fighting side of me\" - - Merle Haggard", 
        "threadID": "672198221_5800097712001", 
        "time": "2009-03-14 14:07:00", 
        "title": "All American WalMart Strikes Again..Wal-Mart looks to Hispanic market", 
        "userID": "aggie_swife"
    }, 
    {
        "content": "i am conflicted on this... it sounds like a good idea in those areas but it also leaves out english speaking people... that i have a problem with....", 
        "intTime": 20090314, 
        "postID": 12, 
        "quote": "", 
        "reply": "i am conflicted on this... it sounds like a good idea in those areas but it also leaves out english speaking people... that i have a problem with....", 
        "threadID": "672198221_5800097712001", 
        "time": "2009-03-14 14:12:00", 
        "title": "All American WalMart Strikes Again..Wal-Mart looks to Hispanic market", 
        "userID": "outlaws93"
    }, 
    {
        "content": "If you are getting shoddy goods at Wal-Mart you can blame Wal-Mart for this happening. In the beginning when a company wants to do business with Wal-Mart they offer their product at a price and with minor haggling Wal-Mart purchases thousands and thousands of units. In some cases they buy almost the entire output of the supplier. After a few years of this Wal-Mart starts lowering the amount they will pay and since the supplier has no one else to sell such volume to they lower the price. Each year the prices are negotiated lower and lower until the manufacturer simply is not making a profit. Here is where the product suffers. You can buy an item at Wal-Mart in the same box with the same numbers and it will be nothing but a cheap piece of junk or you can by the original product from another store at a reasonable price and get a good product. Wall-Mart knows this but yet continues these practices and continues to sell the junk. This is a great example of you get what you pay for! This message has been edited. Last edited by: Another4Truth, Sat 14 March 2009 04:59 PM", 
        "intTime": 20090314, 
        "postID": 13, 
        "quote": "", 
        "reply": "If you are getting shoddy goods at Wal-Mart you can blame Wal-Mart for this happening. In the beginning when a company wants to do business with Wal-Mart they offer their product at a price and with minor haggling Wal-Mart purchases thousands and thousands of units. In some cases they buy almost the entire output of the supplier. After a few years of this Wal-Mart starts lowering the amount they will pay and since the supplier has no one else to sell such volume to they lower the price. Each year the prices are negotiated lower and lower until the manufacturer simply is not making a profit. Here is where the product suffers. You can buy an item at Wal-Mart in the same box with the same numbers and it will be nothing but a cheap piece of junk or you can by the original product from another store at a reasonable price and get a good product. Wall-Mart knows this but yet continues these practices and continues to sell the junk. This is a great example of you get what you pay for! This message has been edited. Last edited by: Another4Truth, Sat 14 March 2009 04:59 PM", 
        "threadID": "672198221_5800097712001", 
        "time": "2009-03-14 16:27:00", 
        "title": "All American WalMart Strikes Again..Wal-Mart looks to Hispanic market", 
        "userID": "Another4Truth"
    }, 
    {
        "content": "quote: Originally posted by Another4Truth: If you are getting shoddy goods at Wal-Mart you can blame Wal-Mart for this happening. In the beginning when a company wants to do business with Wal-Mart they offer their product at a price and with minor haggling Wal-Mart purchases thousands and thousands of units. In some cases they buy almost the entire output of the supplier. After a few years of this Wal-Mart starts lowering the amount they will pay and since the supplier has no one else to sell such volume to they lower the price. Each year the prices are negotiated lower and lower until the manufacturer simply is not making a profit. Here is where the product suffers. You can buy an item at Wal-Mart in the same box with the same numbers and it will be nothing but a cheap piece of junk or you can by the original product from another store at a reasonable price and get a good product. Wall-Mart knows this but yet continues these practices and continues to sell the junk. This is a great example of you get what you pay for! WHAT??? You believe Target and other stores just accepts whatever price the supplier asks? The factories and distribution centers I know of just produce or send the same stuff to all.", 
        "intTime": 20090314, 
        "postID": 14, 
        "quote": "Originally posted by Another4Truth: If you are getting shoddy goods at Wal-Mart you can blame Wal-Mart for this happening. In the beginning when a company wants to do business with Wal-Mart they offer their product at a price and with minor haggling Wal-Mart purchases thousands and thousands of units. In some cases they buy almost the entire output of the supplier. After a few years of this Wal-Mart starts lowering the amount they will pay and since the supplier has no one else to sell such volume to they lower the price. Each year the prices are negotiated lower and lower until the manufacturer simply is not making a profit. Here is where the product suffers. You can buy an item at Wal-Mart in the same box with the same numbers and it will be nothing but a cheap piece of junk or you can by the original product from another store at a reasonable price and get a good product. Wall-Mart knows this but yet continues these practices and continues to sell the junk. This is a great example of you get what you pay for!", 
        "reply": " WHAT??? You believe Target and other stores just accepts whatever price the supplier asks? The factories and distribution centers I know of just produce or send the same stuff to all.", 
        "threadID": "672198221_5800097712001", 
        "time": "2009-03-14 18:01:00", 
        "title": "All American WalMart Strikes Again..Wal-Mart looks to Hispanic market", 
        "userID": "sgt_posty"
    }, 
    {
        "content": "If ya don't like Wal-Mart don't shop there, if ya don't like how people that work there are treated don't work there! duh", 
        "intTime": 20090314, 
        "postID": 15, 
        "quote": "", 
        "reply": "If ya don't like Wal-Mart don't shop there, if ya don't like how people that work there are treated don't work there! duh", 
        "threadID": "672198221_5800097712001", 
        "time": "2009-03-14 18:19:00", 
        "title": "All American WalMart Strikes Again..Wal-Mart looks to Hispanic market", 
        "userID": "EAG154"
    }, 
    {
        "content": "I think they will just have a larger imported Spanish products. doesn't mean there going to stop talking English. there just going to make it easy for people who want to get imported stuff at a cheap price. its not going to be you walk in and there not word of English. walmart smarter then that.", 
        "intTime": 20090314, 
        "postID": 16, 
        "quote": "", 
        "reply": "I think they will just have a larger imported Spanish products. doesn't mean there going to stop talking English. there just going to make it easy for people who want to get imported stuff at a cheap price. its not going to be you walk in and there not word of English. walmart smarter then that.", 
        "threadID": "672198221_5800097712001", 
        "time": "2009-03-14 23:48:00", 
        "title": "All American WalMart Strikes Again..Wal-Mart looks to Hispanic market", 
        "userID": "world_king377"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: \"http://www.ft.com/cms/s/0/bd371350-0f2c-11de-ba10-0000779fd2ac.html\" Now we know why english will NEVER be declaired the official language of this nation. Walmart. Save Money. Live Better. Screw America. Will English ever be declared America's official language? Yeah...right. With every Liberal Civil Rights and Liberties group crying FOUL each time a bus is filled to capacity as it makes its way back to the Mexican border. And we all know by now that by 2042, minorites will become the MAJORITY. By 2050 Hispanics will outnumber every other culture in this nation, with Spanish being spoken by 30% of everybody in this great nation that I almost died for. MAKES ME FRIGGIN' PROUD.", 
        "intTime": 20090315, 
        "postID": 17, 
        "quote": "Originally posted by crackerjacks61: \"http://www.ft.com/cms/s/0/bd371350-0f2c-11de-ba10-0000779fd2ac.html\" Now we know why english will NEVER be declaired the official language of this nation. Walmart. Save Money. Live Better. Screw America.", 
        "reply": " Will English ever be declared America's official language? Yeah...right. With every Liberal Civil Rights and Liberties group crying FOUL each time a bus is filled to capacity as it makes its way back to the Mexican border. And we all know by now that by 2042, minorites will become the MAJORITY. By 2050 Hispanics will outnumber every other culture in this nation, with Spanish being spoken by 30% of everybody in this great nation that I almost died for. MAKES ME FRIGGIN' PROUD.", 
        "threadID": "672198221_5800097712001", 
        "time": "2009-03-15 02:36:00", 
        "title": "All American WalMart Strikes Again..Wal-Mart looks to Hispanic market", 
        "userID": "badmac933"
    }, 
    {
        "content": "I buy two A/C filters for my trailer every couple months. Home Depot, LOWES, Sears, and the local Mom and Pops hardware store all sell them for around $14.00 each. I get them in Wal-Mart for $8.88 each. Where would you go to get them?", 
        "intTime": 20090315, 
        "postID": 18, 
        "quote": "", 
        "reply": "I buy two A/C filters for my trailer every couple months. Home Depot, LOWES, Sears, and the local Mom and Pops hardware store all sell them for around $14.00 each. I get them in Wal-Mart for $8.88 each. Where would you go to get them?", 
        "threadID": "672198221_5800097712001", 
        "time": "2009-03-15 04:32:00", 
        "title": "All American WalMart Strikes Again..Wal-Mart looks to Hispanic market", 
        "userID": "Duster6"
    }, 
    {
        "content": "If you're talkin to me Duster, Walmart will be my main shopping source once I can move to my property outside Murphy,NC. It is the best store by far in my area up there. Best prices, best selection of clothes, full grocery store, lawn and garden, hardware, sporting, auto center, etc. All at a reasonable price! The ones in the Miami area suck due mostly to the dirtbags they hire.", 
        "intTime": 20090315, 
        "postID": 19, 
        "quote": "", 
        "reply": "If you're talkin to me Duster, Walmart will be my main shopping source once I can move to my property outside Murphy,NC. It is the best store by far in my area up there. Best prices, best selection of clothes, full grocery store, lawn and garden, hardware, sporting, auto center, etc. All at a reasonable price! The ones in the Miami area suck due mostly to the dirtbags they hire.", 
        "threadID": "672198221_5800097712001", 
        "time": "2009-03-15 07:26:00", 
        "title": "All American WalMart Strikes Again..Wal-Mart looks to Hispanic market", 
        "userID": "badmac933"
    }, 
    {
        "content": "The only flag Walmart is loyal to - - Wandering and Wondering", 
        "intTime": 20090315, 
        "postID": 20, 
        "quote": "", 
        "reply": "The only flag Walmart is loyal to - - Wandering and Wondering", 
        "threadID": "672198221_5800097712001", 
        "time": "2009-03-15 08:46:00", 
        "title": "All American WalMart Strikes Again..Wal-Mart looks to Hispanic market", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "\"http://www.ft.com/cms/s/0/bd371350-0f2c-11de-ba10-0000779fd2ac.html\" Now we know why english will NEVER be declaired the official language of this nation. Walmart. Save Money. Live Better. Screw America.", 
        "intTime": 20090313, 
        "postID": 21, 
        "quote": "", 
        "reply": "\"http://www.ft.com/cms/s/0/bd371350-0f2c-11de-ba10-0000779fd2ac.html\" Now we know why english will NEVER be declaired the official language of this nation. Walmart. Save Money. Live Better. Screw America.", 
        "threadID": "672198221_5800097712001", 
        "time": "2009-03-13 15:10:00", 
        "title": "All American WalMart Strikes Again..Wal-Mart looks to Hispanic market", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "How exactly is Wal-Mart screwing this country by offering goods and services? The story also cites other companies doing the same thing but you didn't seem to be upset with them. Any reason why?", 
        "intTime": 20090313, 
        "postID": 22, 
        "quote": "", 
        "reply": "How exactly is Wal-Mart screwing this country by offering goods and services? The story also cites other companies doing the same thing but you didn't seem to be upset with them. Any reason why?", 
        "threadID": "672198221_5800097712001", 
        "time": "2009-03-13 16:12:00", 
        "title": "All American WalMart Strikes Again..Wal-Mart looks to Hispanic market", 
        "userID": "athos20"
    }, 
    {
        "content": "I love Wally World Wall-Mart, Wal-mart, rah rah rah sis boom bah", 
        "intTime": 20090313, 
        "postID": 23, 
        "quote": "", 
        "reply": "I love Wally World Wall-Mart, Wal-mart, rah rah rah sis boom bah", 
        "threadID": "672198221_5800097712001", 
        "time": "2009-03-13 16:15:00", 
        "title": "All American WalMart Strikes Again..Wal-Mart looks to Hispanic market", 
        "userID": "EAG154"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: \"http://www.ft.com/cms/s/0/bd371350-0f2c-11de-ba10-0000779fd2ac.html\" Now we know why english will NEVER be declaired the official language of this nation. Walmart. Save Money. Live Better. Screw America. I've been screwed shopping at many establishments but never at Wal-Mart! It is important for my wife and I to streach our dollars and Wal-Mart gives us the oportunity to do this more than any other store!", 
        "intTime": 20090313, 
        "postID": 24, 
        "quote": "Originally posted by crackerjacks61: \"http://www.ft.com/cms/s/0/bd371350-0f2c-11de-ba10-0000779fd2ac.html\" Now we know why english will NEVER be declaired the official language of this nation. Walmart. Save Money. Live Better. Screw America.", 
        "reply": " I've been screwed shopping at many establishments but never at Wal-Mart! It is important for my wife and I to streach our dollars and Wal-Mart gives us the oportunity to do this more than any other store!", 
        "threadID": "672198221_5800097712001", 
        "time": "2009-03-13 16:23:00", 
        "title": "All American WalMart Strikes Again..Wal-Mart looks to Hispanic market", 
        "userID": "EAG154"
    }, 
    {
        "content": "Because Wal Mart is suppose to be the 'Great American' store. Yeah ok. Screw it..I can't wait till we go to the one world government some want..because it's actions like this that is steering us right in that direction. This is Engish Amerian...not Latino America.", 
        "intTime": 20090313, 
        "postID": 25, 
        "quote": "", 
        "reply": "Because Wal Mart is suppose to be the 'Great American' store. Yeah ok. Screw it..I can't wait till we go to the one world government some want..because it's actions like this that is steering us right in that direction. This is Engish Amerian...not Latino America.", 
        "threadID": "672198221_5800097712001", 
        "time": "2009-03-13 17:36:00", 
        "title": "All American WalMart Strikes Again..Wal-Mart looks to Hispanic market", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by athos20: How exactly is Wal-Mart screwing this country by offering goods and services? The story also cites other companies doing the same thing but you didn't seem to be upset with them. Any reason why? hahahahahahahhaahahahahahahaa", 
        "intTime": 20090313, 
        "postID": 26, 
        "quote": "Originally posted by athos20: How exactly is Wal-Mart screwing this country by offering goods and services? The story also cites other companies doing the same thing but you didn't seem to be upset with them. Any reason why?", 
        "reply": " hahahahahahahhaahahahahahahaa", 
        "threadID": "672198221_5800097712001", 
        "time": "2009-03-13 17:40:00", 
        "title": "All American WalMart Strikes Again..Wal-Mart looks to Hispanic market", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: The retailer said that the stores were in “strongly Hispanic neighbourhoods” and would feature a “new lay-out, signing and product assortment designed to make them even more relevant to local Hispanic customers”. The staff will also be bilingual. Sounds like WalMart is practicing racial profiling by marketing these stores in these neighborhoods. Just because someone lives in a strongly hispanic neighborhood doesn't mean they speak spanish or want more of a selection of latin goods. I hope the Justice Department is ready to investigate and then prosecute them to the fullest extent that the law allows.", 
        "intTime": 20090313, 
        "postID": 27, 
        "quote": "The retailer said that the stores were in “strongly Hispanic neighbourhoods” and would feature a “new lay-out, signing and product assortment designed to make them even more relevant to local Hispanic customers”. The staff will also be bilingual.", 
        "reply": " Sounds like WalMart is practicing racial profiling by marketing these stores in these neighborhoods. Just because someone lives in a strongly hispanic neighborhood doesn't mean they speak spanish or want more of a selection of latin goods. I hope the Justice Department is ready to investigate and then prosecute them to the fullest extent that the law allows.", 
        "threadID": "672198221_5800097712001", 
        "time": "2009-03-13 18:39:00", 
        "title": "All American WalMart Strikes Again..Wal-Mart looks to Hispanic market", 
        "userID": "stec74"
    }, 
    {
        "content": "I guess this means crackerjack will be boycotting Best Buy and Home Depot too. Even if it's only because of their online stores the story mentioned: \"Leading retailers are also pursuing Hispanic consumers online, with Best Buy and Home Depot having launched Spanish-language versions of their e-commerce sites in recent months.\" I'm not entirely sold on the need for an \"official\" language. Particularly on the national level. Call it a states rights issue. By the way, states such as Texas, New Mexico, Arizona, California and others were once part of Mexico. Should Spanish be the \"unofficial\" language of these states?", 
        "intTime": 20090313, 
        "postID": 28, 
        "quote": "", 
        "reply": "I guess this means crackerjack will be boycotting Best Buy and Home Depot too. Even if it's only because of their online stores the story mentioned: \"Leading retailers are also pursuing Hispanic consumers online, with Best Buy and Home Depot having launched Spanish-language versions of their e-commerce sites in recent months.\" I'm not entirely sold on the need for an \"official\" language. Particularly on the national level. Call it a states rights issue. By the way, states such as Texas, New Mexico, Arizona, California and others were once part of Mexico. Should Spanish be the \"unofficial\" language of these states?", 
        "threadID": "672198221_5800097712001", 
        "time": "2009-03-13 22:06:00", 
        "title": "All American WalMart Strikes Again..Wal-Mart looks to Hispanic market", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "Depends on what you purchase. A few years back I purchased a bicycle for my son, had nothing but problems with it. They refused to refund me on my purchase, said they'd repair it, never did. I've also purchased a winter coat from them, in less than a month, it was literally falling apart at the seams. I refused a replacement not wanting a repeat performance, got another coat at Sears. Lasted several years. quote: Originally posted by EAG154: quote: Originally posted by crackerjacks61: \"http://www.ft.com/cms/s/0/bd371350-0f2c-11de-ba10-0000779fd2ac.html\" Now we know why english will NEVER be declaired the official language of this nation. Walmart. Save Money. Live Better. Screw America. I've been screwed shopping at many establishments but never at Wal-Mart! It is important for my wife and I to streach our dollars and Wal-Mart gives us the oportunity to do this more than any other store!", 
        "intTime": 20090314, 
        "postID": 29, 
        "quote": "Originally posted by EAG154: quote: Originally posted by crackerjacks61: \"http://www.ft.com/cms/s/0/bd371350-0f2c-11de-ba10-0000779fd2ac.html\" Now we know why english will NEVER be declaired the official language of this nation. Walmart. Save Money. Live Better. Screw America. I've been screwed shopping at many establishments but never at Wal-Mart! It is important for my wife and I to streach our dollars and Wal-Mart gives us the oportunity to do this more than any other store!", 
        "reply": "Depends on what you purchase. A few years back I purchased a bicycle for my son, had nothing but problems with it. They refused to refund me on my purchase, said they'd repair it, never did. I've also purchased a winter coat from them, in less than a month, it was literally falling apart at the seams. I refused a replacement not wanting a repeat performance, got another coat at Sears. Lasted several years. ", 
        "threadID": "672198221_5800097712001", 
        "time": "2009-03-14 02:08:00", 
        "title": "All American WalMart Strikes Again..Wal-Mart looks to Hispanic market", 
        "userID": "fishnfanatic"
    }, 
    {
        "content": "quote: Originally posted by fishnfanatic: Depends on what you purchase. A few years back I purchased a bicycle for my son, had nothing but problems with it. They refused to refund me on my purchase, said they'd repair it, never did. I've also purchased a winter coat from them, in less than a month, it was literally falling apart at the seams. I refused a replacement not wanting a repeat performance, got another coat at Sears. Lasted several years. quote: Originally posted by EAG154: quote: Originally posted by crackerjacks61: \"http://www.ft.com/cms/s/0/bd371350-0f2c-11de-ba10-0000779fd2ac.html\" Now we know why english will NEVER be declaired the official language of this nation. Walmart. Save Money. Live Better. Screw America. I've been screwed shopping at many establishments but never at Wal-Mart! It is important for my wife and I to streach our dollars and Wal-Mart gives us the oportunity to do this more than any other store! True! Wal-Mart is only sucessful if people shop there and buy their mechandise, and it appears that this is exactly what people are doing. best buy on Adams all Natural Chunky Peanut Butter yum!", 
        "intTime": 20090314, 
        "postID": 30, 
        "quote": "Originally posted by fishnfanatic: Depends on what you purchase. A few years back I purchased a bicycle for my son, had nothing but problems with it. They refused to refund me on my purchase, said they'd repair it, never did. I've also purchased a winter coat from them, in less than a month, it was literally falling apart at the seams. I refused a replacement not wanting a repeat performance, got another coat at Sears. Lasted several years. quote: Originally posted by EAG154: quote: Originally posted by crackerjacks61: \"http://www.ft.com/cms/s/0/bd371350-0f2c-11de-ba10-0000779fd2ac.html\" Now we know why english will NEVER be declaired the official language of this nation. Walmart. Save Money. Live Better. Screw America. I've been screwed shopping at many establishments but never at Wal-Mart! It is important for my wife and I to streach our dollars and Wal-Mart gives us the oportunity to do this more than any other store!", 
        "reply": " True! Wal-Mart is only sucessful if people shop there and buy their mechandise, and it appears that this is exactly what people are doing. best buy on Adams all Natural Chunky Peanut Butter yum!", 
        "threadID": "672198221_5800097712001", 
        "time": "2009-03-14 09:40:00", 
        "title": "All American WalMart Strikes Again..Wal-Mart looks to Hispanic market", 
        "userID": "EAG154"
    }, 
    {
        "content": "quote: Originally posted by athos20: How exactly is Wal-Mart screwing this country by offering goods and services? The story also cites other companies doing the same thing but you didn't seem to be upset with them. Any reason why? Wow! \"The markets include elements such as cafés serving Latino pastries and coffee, and full service meat and fish counters.\" \"A 195,000 sq ft Supercenter that opened in Texas last year included a tortilleria bakery, Hispanic foods and a larger selection of Spanish-language music and DVDs.\" Sounds like this will be a \"hit\" with more than just the local community. Sounds like a good marketing plan. Also.....you do know that even in public schools we have to be able to provide services for other language speakers...dual signs (Spanish-English), communication from the school, forms, etc. I noticed that even some newspapers now have sections specific to the Latino community (and these articles are not also provided for the English-only speaker). \"They love our milk and honey but they preach about some other way of living When you’re running down my country, Hoss you’re walking on the fighting side of me\" - - Merle Haggard", 
        "intTime": 20090314, 
        "postID": 31, 
        "quote": "Originally posted by athos20: How exactly is Wal-Mart screwing this country by offering goods and services? The story also cites other companies doing the same thing but you didn't seem to be upset with them. Any reason why?", 
        "reply": " Wow! \"The markets include elements such as cafés serving Latino pastries and coffee, and full service meat and fish counters.\" \"A 195,000 sq ft Supercenter that opened in Texas last year included a tortilleria bakery, Hispanic foods and a larger selection of Spanish-language music and DVDs.\" Sounds like this will be a \"hit\" with more than just the local community. Sounds like a good marketing plan. Also.....you do know that even in public schools we have to be able to provide services for other language speakers...dual signs (Spanish-English), communication from the school, forms, etc. I noticed that even some newspapers now have sections specific to the Latino community (and these articles are not also provided for the English-only speaker). \"They love our milk and honey but they preach about some other way of living When you’re running down my country, Hoss you’re walking on the fighting side of me\" - - Merle Haggard", 
        "threadID": "672198221_5800097712001", 
        "time": "2009-03-14 14:07:00", 
        "title": "All American WalMart Strikes Again..Wal-Mart looks to Hispanic market", 
        "userID": "aggie_swife"
    }, 
    {
        "content": "i am conflicted on this... it sounds like a good idea in those areas but it also leaves out english speaking people... that i have a problem with....", 
        "intTime": 20090314, 
        "postID": 32, 
        "quote": "", 
        "reply": "i am conflicted on this... it sounds like a good idea in those areas but it also leaves out english speaking people... that i have a problem with....", 
        "threadID": "672198221_5800097712001", 
        "time": "2009-03-14 14:12:00", 
        "title": "All American WalMart Strikes Again..Wal-Mart looks to Hispanic market", 
        "userID": "outlaws93"
    }, 
    {
        "content": "If you are getting shoddy goods at Wal-Mart you can blame Wal-Mart for this happening. In the beginning when a company wants to do business with Wal-Mart they offer their product at a price and with minor haggling Wal-Mart purchases thousands and thousands of units. In some cases they buy almost the entire output of the supplier. After a few years of this Wal-Mart starts lowering the amount they will pay and since the supplier has no one else to sell such volume to they lower the price. Each year the prices are negotiated lower and lower until the manufacturer simply is not making a profit. Here is where the product suffers. You can buy an item at Wal-Mart in the same box with the same numbers and it will be nothing but a cheap piece of junk or you can by the original product from another store at a reasonable price and get a good product. Wall-Mart knows this but yet continues these practices and continues to sell the junk. This is a great example of you get what you pay for! This message has been edited. Last edited by: Another4Truth, Sat 14 March 2009 04:59 PM", 
        "intTime": 20090314, 
        "postID": 33, 
        "quote": "", 
        "reply": "If you are getting shoddy goods at Wal-Mart you can blame Wal-Mart for this happening. In the beginning when a company wants to do business with Wal-Mart they offer their product at a price and with minor haggling Wal-Mart purchases thousands and thousands of units. In some cases they buy almost the entire output of the supplier. After a few years of this Wal-Mart starts lowering the amount they will pay and since the supplier has no one else to sell such volume to they lower the price. Each year the prices are negotiated lower and lower until the manufacturer simply is not making a profit. Here is where the product suffers. You can buy an item at Wal-Mart in the same box with the same numbers and it will be nothing but a cheap piece of junk or you can by the original product from another store at a reasonable price and get a good product. Wall-Mart knows this but yet continues these practices and continues to sell the junk. This is a great example of you get what you pay for! This message has been edited. Last edited by: Another4Truth, Sat 14 March 2009 04:59 PM", 
        "threadID": "672198221_5800097712001", 
        "time": "2009-03-14 16:27:00", 
        "title": "All American WalMart Strikes Again..Wal-Mart looks to Hispanic market", 
        "userID": "Another4Truth"
    }, 
    {
        "content": "quote: Originally posted by Another4Truth: If you are getting shoddy goods at Wal-Mart you can blame Wal-Mart for this happening. In the beginning when a company wants to do business with Wal-Mart they offer their product at a price and with minor haggling Wal-Mart purchases thousands and thousands of units. In some cases they buy almost the entire output of the supplier. After a few years of this Wal-Mart starts lowering the amount they will pay and since the supplier has no one else to sell such volume to they lower the price. Each year the prices are negotiated lower and lower until the manufacturer simply is not making a profit. Here is where the product suffers. You can buy an item at Wal-Mart in the same box with the same numbers and it will be nothing but a cheap piece of junk or you can by the original product from another store at a reasonable price and get a good product. Wall-Mart knows this but yet continues these practices and continues to sell the junk. This is a great example of you get what you pay for! WHAT??? You believe Target and other stores just accepts whatever price the supplier asks? The factories and distribution centers I know of just produce or send the same stuff to all.", 
        "intTime": 20090314, 
        "postID": 34, 
        "quote": "Originally posted by Another4Truth: If you are getting shoddy goods at Wal-Mart you can blame Wal-Mart for this happening. In the beginning when a company wants to do business with Wal-Mart they offer their product at a price and with minor haggling Wal-Mart purchases thousands and thousands of units. In some cases they buy almost the entire output of the supplier. After a few years of this Wal-Mart starts lowering the amount they will pay and since the supplier has no one else to sell such volume to they lower the price. Each year the prices are negotiated lower and lower until the manufacturer simply is not making a profit. Here is where the product suffers. You can buy an item at Wal-Mart in the same box with the same numbers and it will be nothing but a cheap piece of junk or you can by the original product from another store at a reasonable price and get a good product. Wall-Mart knows this but yet continues these practices and continues to sell the junk. This is a great example of you get what you pay for!", 
        "reply": " WHAT??? You believe Target and other stores just accepts whatever price the supplier asks? The factories and distribution centers I know of just produce or send the same stuff to all.", 
        "threadID": "672198221_5800097712001", 
        "time": "2009-03-14 18:01:00", 
        "title": "All American WalMart Strikes Again..Wal-Mart looks to Hispanic market", 
        "userID": "sgt_posty"
    }, 
    {
        "content": "If ya don't like Wal-Mart don't shop there, if ya don't like how people that work there are treated don't work there! duh", 
        "intTime": 20090314, 
        "postID": 35, 
        "quote": "", 
        "reply": "If ya don't like Wal-Mart don't shop there, if ya don't like how people that work there are treated don't work there! duh", 
        "threadID": "672198221_5800097712001", 
        "time": "2009-03-14 18:19:00", 
        "title": "All American WalMart Strikes Again..Wal-Mart looks to Hispanic market", 
        "userID": "EAG154"
    }, 
    {
        "content": "I think they will just have a larger imported Spanish products. doesn't mean there going to stop talking English. there just going to make it easy for people who want to get imported stuff at a cheap price. its not going to be you walk in and there not word of English. walmart smarter then that.", 
        "intTime": 20090314, 
        "postID": 36, 
        "quote": "", 
        "reply": "I think they will just have a larger imported Spanish products. doesn't mean there going to stop talking English. there just going to make it easy for people who want to get imported stuff at a cheap price. its not going to be you walk in and there not word of English. walmart smarter then that.", 
        "threadID": "672198221_5800097712001", 
        "time": "2009-03-14 23:48:00", 
        "title": "All American WalMart Strikes Again..Wal-Mart looks to Hispanic market", 
        "userID": "world_king377"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: \"http://www.ft.com/cms/s/0/bd371350-0f2c-11de-ba10-0000779fd2ac.html\" Now we know why english will NEVER be declaired the official language of this nation. Walmart. Save Money. Live Better. Screw America. Will English ever be declared America's official language? Yeah...right. With every Liberal Civil Rights and Liberties group crying FOUL each time a bus is filled to capacity as it makes its way back to the Mexican border. And we all know by now that by 2042, minorites will become the MAJORITY. By 2050 Hispanics will outnumber every other culture in this nation, with Spanish being spoken by 30% of everybody in this great nation that I almost died for. MAKES ME FRIGGIN' PROUD.", 
        "intTime": 20090315, 
        "postID": 37, 
        "quote": "Originally posted by crackerjacks61: \"http://www.ft.com/cms/s/0/bd371350-0f2c-11de-ba10-0000779fd2ac.html\" Now we know why english will NEVER be declaired the official language of this nation. Walmart. Save Money. Live Better. Screw America.", 
        "reply": " Will English ever be declared America's official language? Yeah...right. With every Liberal Civil Rights and Liberties group crying FOUL each time a bus is filled to capacity as it makes its way back to the Mexican border. And we all know by now that by 2042, minorites will become the MAJORITY. By 2050 Hispanics will outnumber every other culture in this nation, with Spanish being spoken by 30% of everybody in this great nation that I almost died for. MAKES ME FRIGGIN' PROUD.", 
        "threadID": "672198221_5800097712001", 
        "time": "2009-03-15 02:36:00", 
        "title": "All American WalMart Strikes Again..Wal-Mart looks to Hispanic market", 
        "userID": "badmac933"
    }, 
    {
        "content": "I buy two A/C filters for my trailer every couple months. Home Depot, LOWES, Sears, and the local Mom and Pops hardware store all sell them for around $14.00 each. I get them in Wal-Mart for $8.88 each. Where would you go to get them?", 
        "intTime": 20090315, 
        "postID": 38, 
        "quote": "", 
        "reply": "I buy two A/C filters for my trailer every couple months. Home Depot, LOWES, Sears, and the local Mom and Pops hardware store all sell them for around $14.00 each. I get them in Wal-Mart for $8.88 each. Where would you go to get them?", 
        "threadID": "672198221_5800097712001", 
        "time": "2009-03-15 04:32:00", 
        "title": "All American WalMart Strikes Again..Wal-Mart looks to Hispanic market", 
        "userID": "Duster6"
    }, 
    {
        "content": "If you're talkin to me Duster, Walmart will be my main shopping source once I can move to my property outside Murphy,NC. It is the best store by far in my area up there. Best prices, best selection of clothes, full grocery store, lawn and garden, hardware, sporting, auto center, etc. All at a reasonable price! The ones in the Miami area suck due mostly to the dirtbags they hire.", 
        "intTime": 20090315, 
        "postID": 39, 
        "quote": "", 
        "reply": "If you're talkin to me Duster, Walmart will be my main shopping source once I can move to my property outside Murphy,NC. It is the best store by far in my area up there. Best prices, best selection of clothes, full grocery store, lawn and garden, hardware, sporting, auto center, etc. All at a reasonable price! The ones in the Miami area suck due mostly to the dirtbags they hire.", 
        "threadID": "672198221_5800097712001", 
        "time": "2009-03-15 07:26:00", 
        "title": "All American WalMart Strikes Again..Wal-Mart looks to Hispanic market", 
        "userID": "badmac933"
    }, 
    {
        "content": "The only flag Walmart is loyal to - - Wandering and Wondering", 
        "intTime": 20090315, 
        "postID": 40, 
        "quote": "", 
        "reply": "The only flag Walmart is loyal to - - Wandering and Wondering", 
        "threadID": "672198221_5800097712001", 
        "time": "2009-03-15 08:46:00", 
        "title": "All American WalMart Strikes Again..Wal-Mart looks to Hispanic market", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "\"http://www.ft.com/cms/s/0/bd371350-0f2c-11de-ba10-0000779fd2ac.html\" Now we know why english will NEVER be declaired the official language of this nation. Walmart. Save Money. Live Better. Screw America.", 
        "intTime": 20090313, 
        "postID": 41, 
        "quote": "", 
        "reply": "\"http://www.ft.com/cms/s/0/bd371350-0f2c-11de-ba10-0000779fd2ac.html\" Now we know why english will NEVER be declaired the official language of this nation. Walmart. Save Money. Live Better. Screw America.", 
        "threadID": "672198221_5800097712001", 
        "time": "2009-03-13 15:10:00", 
        "title": "All American WalMart Strikes Again..Wal-Mart looks to Hispanic market", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "How exactly is Wal-Mart screwing this country by offering goods and services? The story also cites other companies doing the same thing but you didn't seem to be upset with them. Any reason why?", 
        "intTime": 20090313, 
        "postID": 42, 
        "quote": "", 
        "reply": "How exactly is Wal-Mart screwing this country by offering goods and services? The story also cites other companies doing the same thing but you didn't seem to be upset with them. Any reason why?", 
        "threadID": "672198221_5800097712001", 
        "time": "2009-03-13 16:12:00", 
        "title": "All American WalMart Strikes Again..Wal-Mart looks to Hispanic market", 
        "userID": "athos20"
    }, 
    {
        "content": "I love Wally World Wall-Mart, Wal-mart, rah rah rah sis boom bah", 
        "intTime": 20090313, 
        "postID": 43, 
        "quote": "", 
        "reply": "I love Wally World Wall-Mart, Wal-mart, rah rah rah sis boom bah", 
        "threadID": "672198221_5800097712001", 
        "time": "2009-03-13 16:15:00", 
        "title": "All American WalMart Strikes Again..Wal-Mart looks to Hispanic market", 
        "userID": "EAG154"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: \"http://www.ft.com/cms/s/0/bd371350-0f2c-11de-ba10-0000779fd2ac.html\" Now we know why english will NEVER be declaired the official language of this nation. Walmart. Save Money. Live Better. Screw America. I've been screwed shopping at many establishments but never at Wal-Mart! It is important for my wife and I to streach our dollars and Wal-Mart gives us the oportunity to do this more than any other store!", 
        "intTime": 20090313, 
        "postID": 44, 
        "quote": "Originally posted by crackerjacks61: \"http://www.ft.com/cms/s/0/bd371350-0f2c-11de-ba10-0000779fd2ac.html\" Now we know why english will NEVER be declaired the official language of this nation. Walmart. Save Money. Live Better. Screw America.", 
        "reply": " I've been screwed shopping at many establishments but never at Wal-Mart! It is important for my wife and I to streach our dollars and Wal-Mart gives us the oportunity to do this more than any other store!", 
        "threadID": "672198221_5800097712001", 
        "time": "2009-03-13 16:23:00", 
        "title": "All American WalMart Strikes Again..Wal-Mart looks to Hispanic market", 
        "userID": "EAG154"
    }, 
    {
        "content": "Because Wal Mart is suppose to be the 'Great American' store. Yeah ok. Screw it..I can't wait till we go to the one world government some want..because it's actions like this that is steering us right in that direction. This is Engish Amerian...not Latino America.", 
        "intTime": 20090313, 
        "postID": 45, 
        "quote": "", 
        "reply": "Because Wal Mart is suppose to be the 'Great American' store. Yeah ok. Screw it..I can't wait till we go to the one world government some want..because it's actions like this that is steering us right in that direction. This is Engish Amerian...not Latino America.", 
        "threadID": "672198221_5800097712001", 
        "time": "2009-03-13 17:36:00", 
        "title": "All American WalMart Strikes Again..Wal-Mart looks to Hispanic market", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by athos20: How exactly is Wal-Mart screwing this country by offering goods and services? The story also cites other companies doing the same thing but you didn't seem to be upset with them. Any reason why? hahahahahahahhaahahahahahahaa", 
        "intTime": 20090313, 
        "postID": 46, 
        "quote": "Originally posted by athos20: How exactly is Wal-Mart screwing this country by offering goods and services? The story also cites other companies doing the same thing but you didn't seem to be upset with them. Any reason why?", 
        "reply": " hahahahahahahhaahahahahahahaa", 
        "threadID": "672198221_5800097712001", 
        "time": "2009-03-13 17:40:00", 
        "title": "All American WalMart Strikes Again..Wal-Mart looks to Hispanic market", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: The retailer said that the stores were in “strongly Hispanic neighbourhoods” and would feature a “new lay-out, signing and product assortment designed to make them even more relevant to local Hispanic customers”. The staff will also be bilingual. Sounds like WalMart is practicing racial profiling by marketing these stores in these neighborhoods. Just because someone lives in a strongly hispanic neighborhood doesn't mean they speak spanish or want more of a selection of latin goods. I hope the Justice Department is ready to investigate and then prosecute them to the fullest extent that the law allows.", 
        "intTime": 20090313, 
        "postID": 47, 
        "quote": "The retailer said that the stores were in “strongly Hispanic neighbourhoods” and would feature a “new lay-out, signing and product assortment designed to make them even more relevant to local Hispanic customers”. The staff will also be bilingual.", 
        "reply": " Sounds like WalMart is practicing racial profiling by marketing these stores in these neighborhoods. Just because someone lives in a strongly hispanic neighborhood doesn't mean they speak spanish or want more of a selection of latin goods. I hope the Justice Department is ready to investigate and then prosecute them to the fullest extent that the law allows.", 
        "threadID": "672198221_5800097712001", 
        "time": "2009-03-13 18:39:00", 
        "title": "All American WalMart Strikes Again..Wal-Mart looks to Hispanic market", 
        "userID": "stec74"
    }, 
    {
        "content": "I guess this means crackerjack will be boycotting Best Buy and Home Depot too. Even if it's only because of their online stores the story mentioned: \"Leading retailers are also pursuing Hispanic consumers online, with Best Buy and Home Depot having launched Spanish-language versions of their e-commerce sites in recent months.\" I'm not entirely sold on the need for an \"official\" language. Particularly on the national level. Call it a states rights issue. By the way, states such as Texas, New Mexico, Arizona, California and others were once part of Mexico. Should Spanish be the \"unofficial\" language of these states?", 
        "intTime": 20090313, 
        "postID": 48, 
        "quote": "", 
        "reply": "I guess this means crackerjack will be boycotting Best Buy and Home Depot too. Even if it's only because of their online stores the story mentioned: \"Leading retailers are also pursuing Hispanic consumers online, with Best Buy and Home Depot having launched Spanish-language versions of their e-commerce sites in recent months.\" I'm not entirely sold on the need for an \"official\" language. Particularly on the national level. Call it a states rights issue. By the way, states such as Texas, New Mexico, Arizona, California and others were once part of Mexico. Should Spanish be the \"unofficial\" language of these states?", 
        "threadID": "672198221_5800097712001", 
        "time": "2009-03-13 22:06:00", 
        "title": "All American WalMart Strikes Again..Wal-Mart looks to Hispanic market", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "Depends on what you purchase. A few years back I purchased a bicycle for my son, had nothing but problems with it. They refused to refund me on my purchase, said they'd repair it, never did. I've also purchased a winter coat from them, in less than a month, it was literally falling apart at the seams. I refused a replacement not wanting a repeat performance, got another coat at Sears. Lasted several years. quote: Originally posted by EAG154: quote: Originally posted by crackerjacks61: \"http://www.ft.com/cms/s/0/bd371350-0f2c-11de-ba10-0000779fd2ac.html\" Now we know why english will NEVER be declaired the official language of this nation. Walmart. Save Money. Live Better. Screw America. I've been screwed shopping at many establishments but never at Wal-Mart! It is important for my wife and I to streach our dollars and Wal-Mart gives us the oportunity to do this more than any other store!", 
        "intTime": 20090314, 
        "postID": 49, 
        "quote": "Originally posted by EAG154: quote: Originally posted by crackerjacks61: \"http://www.ft.com/cms/s/0/bd371350-0f2c-11de-ba10-0000779fd2ac.html\" Now we know why english will NEVER be declaired the official language of this nation. Walmart. Save Money. Live Better. Screw America. I've been screwed shopping at many establishments but never at Wal-Mart! It is important for my wife and I to streach our dollars and Wal-Mart gives us the oportunity to do this more than any other store!", 
        "reply": "Depends on what you purchase. A few years back I purchased a bicycle for my son, had nothing but problems with it. They refused to refund me on my purchase, said they'd repair it, never did. I've also purchased a winter coat from them, in less than a month, it was literally falling apart at the seams. I refused a replacement not wanting a repeat performance, got another coat at Sears. Lasted several years. ", 
        "threadID": "672198221_5800097712001", 
        "time": "2009-03-14 02:08:00", 
        "title": "All American WalMart Strikes Again..Wal-Mart looks to Hispanic market", 
        "userID": "fishnfanatic"
    }, 
    {
        "content": "quote: Originally posted by fishnfanatic: Depends on what you purchase. A few years back I purchased a bicycle for my son, had nothing but problems with it. They refused to refund me on my purchase, said they'd repair it, never did. I've also purchased a winter coat from them, in less than a month, it was literally falling apart at the seams. I refused a replacement not wanting a repeat performance, got another coat at Sears. Lasted several years. quote: Originally posted by EAG154: quote: Originally posted by crackerjacks61: \"http://www.ft.com/cms/s/0/bd371350-0f2c-11de-ba10-0000779fd2ac.html\" Now we know why english will NEVER be declaired the official language of this nation. Walmart. Save Money. Live Better. Screw America. I've been screwed shopping at many establishments but never at Wal-Mart! It is important for my wife and I to streach our dollars and Wal-Mart gives us the oportunity to do this more than any other store! True! Wal-Mart is only sucessful if people shop there and buy their mechandise, and it appears that this is exactly what people are doing. best buy on Adams all Natural Chunky Peanut Butter yum!", 
        "intTime": 20090314, 
        "postID": 50, 
        "quote": "Originally posted by fishnfanatic: Depends on what you purchase. A few years back I purchased a bicycle for my son, had nothing but problems with it. They refused to refund me on my purchase, said they'd repair it, never did. I've also purchased a winter coat from them, in less than a month, it was literally falling apart at the seams. I refused a replacement not wanting a repeat performance, got another coat at Sears. Lasted several years. quote: Originally posted by EAG154: quote: Originally posted by crackerjacks61: \"http://www.ft.com/cms/s/0/bd371350-0f2c-11de-ba10-0000779fd2ac.html\" Now we know why english will NEVER be declaired the official language of this nation. Walmart. Save Money. Live Better. Screw America. I've been screwed shopping at many establishments but never at Wal-Mart! It is important for my wife and I to streach our dollars and Wal-Mart gives us the oportunity to do this more than any other store!", 
        "reply": " True! Wal-Mart is only sucessful if people shop there and buy their mechandise, and it appears that this is exactly what people are doing. best buy on Adams all Natural Chunky Peanut Butter yum!", 
        "threadID": "672198221_5800097712001", 
        "time": "2009-03-14 09:40:00", 
        "title": "All American WalMart Strikes Again..Wal-Mart looks to Hispanic market", 
        "userID": "EAG154"
    }, 
    {
        "content": "quote: Originally posted by athos20: How exactly is Wal-Mart screwing this country by offering goods and services? The story also cites other companies doing the same thing but you didn't seem to be upset with them. Any reason why? Wow! \"The markets include elements such as cafés serving Latino pastries and coffee, and full service meat and fish counters.\" \"A 195,000 sq ft Supercenter that opened in Texas last year included a tortilleria bakery, Hispanic foods and a larger selection of Spanish-language music and DVDs.\" Sounds like this will be a \"hit\" with more than just the local community. Sounds like a good marketing plan. Also.....you do know that even in public schools we have to be able to provide services for other language speakers...dual signs (Spanish-English), communication from the school, forms, etc. I noticed that even some newspapers now have sections specific to the Latino community (and these articles are not also provided for the English-only speaker). \"They love our milk and honey but they preach about some other way of living When you’re running down my country, Hoss you’re walking on the fighting side of me\" - - Merle Haggard", 
        "intTime": 20090314, 
        "postID": 51, 
        "quote": "Originally posted by athos20: How exactly is Wal-Mart screwing this country by offering goods and services? The story also cites other companies doing the same thing but you didn't seem to be upset with them. Any reason why?", 
        "reply": " Wow! \"The markets include elements such as cafés serving Latino pastries and coffee, and full service meat and fish counters.\" \"A 195,000 sq ft Supercenter that opened in Texas last year included a tortilleria bakery, Hispanic foods and a larger selection of Spanish-language music and DVDs.\" Sounds like this will be a \"hit\" with more than just the local community. Sounds like a good marketing plan. Also.....you do know that even in public schools we have to be able to provide services for other language speakers...dual signs (Spanish-English), communication from the school, forms, etc. I noticed that even some newspapers now have sections specific to the Latino community (and these articles are not also provided for the English-only speaker). \"They love our milk and honey but they preach about some other way of living When you’re running down my country, Hoss you’re walking on the fighting side of me\" - - Merle Haggard", 
        "threadID": "672198221_5800097712001", 
        "time": "2009-03-14 14:07:00", 
        "title": "All American WalMart Strikes Again..Wal-Mart looks to Hispanic market", 
        "userID": "aggie_swife"
    }, 
    {
        "content": "i am conflicted on this... it sounds like a good idea in those areas but it also leaves out english speaking people... that i have a problem with....", 
        "intTime": 20090314, 
        "postID": 52, 
        "quote": "", 
        "reply": "i am conflicted on this... it sounds like a good idea in those areas but it also leaves out english speaking people... that i have a problem with....", 
        "threadID": "672198221_5800097712001", 
        "time": "2009-03-14 14:12:00", 
        "title": "All American WalMart Strikes Again..Wal-Mart looks to Hispanic market", 
        "userID": "outlaws93"
    }, 
    {
        "content": "If you are getting shoddy goods at Wal-Mart you can blame Wal-Mart for this happening. In the beginning when a company wants to do business with Wal-Mart they offer their product at a price and with minor haggling Wal-Mart purchases thousands and thousands of units. In some cases they buy almost the entire output of the supplier. After a few years of this Wal-Mart starts lowering the amount they will pay and since the supplier has no one else to sell such volume to they lower the price. Each year the prices are negotiated lower and lower until the manufacturer simply is not making a profit. Here is where the product suffers. You can buy an item at Wal-Mart in the same box with the same numbers and it will be nothing but a cheap piece of junk or you can by the original product from another store at a reasonable price and get a good product. Wall-Mart knows this but yet continues these practices and continues to sell the junk. This is a great example of you get what you pay for! This message has been edited. Last edited by: Another4Truth, Sat 14 March 2009 04:59 PM", 
        "intTime": 20090314, 
        "postID": 53, 
        "quote": "", 
        "reply": "If you are getting shoddy goods at Wal-Mart you can blame Wal-Mart for this happening. In the beginning when a company wants to do business with Wal-Mart they offer their product at a price and with minor haggling Wal-Mart purchases thousands and thousands of units. In some cases they buy almost the entire output of the supplier. After a few years of this Wal-Mart starts lowering the amount they will pay and since the supplier has no one else to sell such volume to they lower the price. Each year the prices are negotiated lower and lower until the manufacturer simply is not making a profit. Here is where the product suffers. You can buy an item at Wal-Mart in the same box with the same numbers and it will be nothing but a cheap piece of junk or you can by the original product from another store at a reasonable price and get a good product. Wall-Mart knows this but yet continues these practices and continues to sell the junk. This is a great example of you get what you pay for! This message has been edited. Last edited by: Another4Truth, Sat 14 March 2009 04:59 PM", 
        "threadID": "672198221_5800097712001", 
        "time": "2009-03-14 16:27:00", 
        "title": "All American WalMart Strikes Again..Wal-Mart looks to Hispanic market", 
        "userID": "Another4Truth"
    }, 
    {
        "content": "quote: Originally posted by Another4Truth: If you are getting shoddy goods at Wal-Mart you can blame Wal-Mart for this happening. In the beginning when a company wants to do business with Wal-Mart they offer their product at a price and with minor haggling Wal-Mart purchases thousands and thousands of units. In some cases they buy almost the entire output of the supplier. After a few years of this Wal-Mart starts lowering the amount they will pay and since the supplier has no one else to sell such volume to they lower the price. Each year the prices are negotiated lower and lower until the manufacturer simply is not making a profit. Here is where the product suffers. You can buy an item at Wal-Mart in the same box with the same numbers and it will be nothing but a cheap piece of junk or you can by the original product from another store at a reasonable price and get a good product. Wall-Mart knows this but yet continues these practices and continues to sell the junk. This is a great example of you get what you pay for! WHAT??? You believe Target and other stores just accepts whatever price the supplier asks? The factories and distribution centers I know of just produce or send the same stuff to all.", 
        "intTime": 20090314, 
        "postID": 54, 
        "quote": "Originally posted by Another4Truth: If you are getting shoddy goods at Wal-Mart you can blame Wal-Mart for this happening. In the beginning when a company wants to do business with Wal-Mart they offer their product at a price and with minor haggling Wal-Mart purchases thousands and thousands of units. In some cases they buy almost the entire output of the supplier. After a few years of this Wal-Mart starts lowering the amount they will pay and since the supplier has no one else to sell such volume to they lower the price. Each year the prices are negotiated lower and lower until the manufacturer simply is not making a profit. Here is where the product suffers. You can buy an item at Wal-Mart in the same box with the same numbers and it will be nothing but a cheap piece of junk or you can by the original product from another store at a reasonable price and get a good product. Wall-Mart knows this but yet continues these practices and continues to sell the junk. This is a great example of you get what you pay for!", 
        "reply": " WHAT??? You believe Target and other stores just accepts whatever price the supplier asks? The factories and distribution centers I know of just produce or send the same stuff to all.", 
        "threadID": "672198221_5800097712001", 
        "time": "2009-03-14 18:01:00", 
        "title": "All American WalMart Strikes Again..Wal-Mart looks to Hispanic market", 
        "userID": "sgt_posty"
    }, 
    {
        "content": "If ya don't like Wal-Mart don't shop there, if ya don't like how people that work there are treated don't work there! duh", 
        "intTime": 20090314, 
        "postID": 55, 
        "quote": "", 
        "reply": "If ya don't like Wal-Mart don't shop there, if ya don't like how people that work there are treated don't work there! duh", 
        "threadID": "672198221_5800097712001", 
        "time": "2009-03-14 18:19:00", 
        "title": "All American WalMart Strikes Again..Wal-Mart looks to Hispanic market", 
        "userID": "EAG154"
    }, 
    {
        "content": "I think they will just have a larger imported Spanish products. doesn't mean there going to stop talking English. there just going to make it easy for people who want to get imported stuff at a cheap price. its not going to be you walk in and there not word of English. walmart smarter then that.", 
        "intTime": 20090314, 
        "postID": 56, 
        "quote": "", 
        "reply": "I think they will just have a larger imported Spanish products. doesn't mean there going to stop talking English. there just going to make it easy for people who want to get imported stuff at a cheap price. its not going to be you walk in and there not word of English. walmart smarter then that.", 
        "threadID": "672198221_5800097712001", 
        "time": "2009-03-14 23:48:00", 
        "title": "All American WalMart Strikes Again..Wal-Mart looks to Hispanic market", 
        "userID": "world_king377"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: \"http://www.ft.com/cms/s/0/bd371350-0f2c-11de-ba10-0000779fd2ac.html\" Now we know why english will NEVER be declaired the official language of this nation. Walmart. Save Money. Live Better. Screw America. Will English ever be declared America's official language? Yeah...right. With every Liberal Civil Rights and Liberties group crying FOUL each time a bus is filled to capacity as it makes its way back to the Mexican border. And we all know by now that by 2042, minorites will become the MAJORITY. By 2050 Hispanics will outnumber every other culture in this nation, with Spanish being spoken by 30% of everybody in this great nation that I almost died for. MAKES ME FRIGGIN' PROUD.", 
        "intTime": 20090315, 
        "postID": 57, 
        "quote": "Originally posted by crackerjacks61: \"http://www.ft.com/cms/s/0/bd371350-0f2c-11de-ba10-0000779fd2ac.html\" Now we know why english will NEVER be declaired the official language of this nation. Walmart. Save Money. Live Better. Screw America.", 
        "reply": " Will English ever be declared America's official language? Yeah...right. With every Liberal Civil Rights and Liberties group crying FOUL each time a bus is filled to capacity as it makes its way back to the Mexican border. And we all know by now that by 2042, minorites will become the MAJORITY. By 2050 Hispanics will outnumber every other culture in this nation, with Spanish being spoken by 30% of everybody in this great nation that I almost died for. MAKES ME FRIGGIN' PROUD.", 
        "threadID": "672198221_5800097712001", 
        "time": "2009-03-15 02:36:00", 
        "title": "All American WalMart Strikes Again..Wal-Mart looks to Hispanic market", 
        "userID": "badmac933"
    }, 
    {
        "content": "I buy two A/C filters for my trailer every couple months. Home Depot, LOWES, Sears, and the local Mom and Pops hardware store all sell them for around $14.00 each. I get them in Wal-Mart for $8.88 each. Where would you go to get them?", 
        "intTime": 20090315, 
        "postID": 58, 
        "quote": "", 
        "reply": "I buy two A/C filters for my trailer every couple months. Home Depot, LOWES, Sears, and the local Mom and Pops hardware store all sell them for around $14.00 each. I get them in Wal-Mart for $8.88 each. Where would you go to get them?", 
        "threadID": "672198221_5800097712001", 
        "time": "2009-03-15 04:32:00", 
        "title": "All American WalMart Strikes Again..Wal-Mart looks to Hispanic market", 
        "userID": "Duster6"
    }, 
    {
        "content": "If you're talkin to me Duster, Walmart will be my main shopping source once I can move to my property outside Murphy,NC. It is the best store by far in my area up there. Best prices, best selection of clothes, full grocery store, lawn and garden, hardware, sporting, auto center, etc. All at a reasonable price! The ones in the Miami area suck due mostly to the dirtbags they hire.", 
        "intTime": 20090315, 
        "postID": 59, 
        "quote": "", 
        "reply": "If you're talkin to me Duster, Walmart will be my main shopping source once I can move to my property outside Murphy,NC. It is the best store by far in my area up there. Best prices, best selection of clothes, full grocery store, lawn and garden, hardware, sporting, auto center, etc. All at a reasonable price! The ones in the Miami area suck due mostly to the dirtbags they hire.", 
        "threadID": "672198221_5800097712001", 
        "time": "2009-03-15 07:26:00", 
        "title": "All American WalMart Strikes Again..Wal-Mart looks to Hispanic market", 
        "userID": "badmac933"
    }, 
    {
        "content": "The only flag Walmart is loyal to - - Wandering and Wondering", 
        "intTime": 20090315, 
        "postID": 60, 
        "quote": "", 
        "reply": "The only flag Walmart is loyal to - - Wandering and Wondering", 
        "threadID": "672198221_5800097712001", 
        "time": "2009-03-15 08:46:00", 
        "title": "All American WalMart Strikes Again..Wal-Mart looks to Hispanic market", 
        "userID": "greywolfghost"
    }
]