[
    {
        "content": "Judgement 'http://online.wsj.com/article/SB123992516941227309.html' quote: Steven Rattner, the leader of the Obama administration’s auto task force, was one of the executives involved with payments under scrutiny in a probe of an alleged kickback scheme at New York state’s pension fund, according to a person familiar with the matter. A Securities and Exchange Commission complaint says a “senior executive” of Mr. Rattner’s investment firm met with a politically connected consultant about a finder’s fee. Later, the complaint says, the firm received an investment from the state pension fund, then paid a $1.1 million fee. The “senior executive,” not named in the complaint, is Mr. Rattner, according to the person familiar with the matter. He is co-founder of the investment firm, Quadrangle Group, which he left to join the Treasury Department to oversee the auto task force earlier this year. A spokeswoman for the Treasury, which is in charge of the auto task force, said that “during the transition, Mr. Rattner made us aware of the pending investigation.”", 
        "intTime": 20090417, 
        "postID": 1, 
        "quote": "Steven Rattner, the leader of the Obama administration’s auto task force, was one of the executives involved with payments under scrutiny in a probe of an alleged kickback scheme at New York state’s pension fund, according to a person familiar with the matter. A Securities and Exchange Commission complaint says a “senior executive” of Mr. Rattner’s investment firm met with a politically connected consultant about a finder’s fee. Later, the complaint says, the firm received an investment from the state pension fund, then paid a $1.1 million fee. The “senior executive,” not named in the complaint, is Mr. Rattner, according to the person familiar with the matter. He is co-founder of the investment firm, Quadrangle Group, which he left to join the Treasury Department to oversee the auto task force earlier this year. A spokeswoman for the Treasury, which is in charge of the auto task force, said that “during the transition, Mr. Rattner made us aware of the pending investigation.”", 
        "reply": "Judgement 'http://online.wsj.com/article/SB123992516941227309.html' ", 
        "threadID": "672198221_5260000122001", 
        "time": "2009-04-17 06:39:00", 
        "title": "Auto czar under investigation for kickbacks, Surprise?", 
        "userID": "GunnyRet03"
    }
]