[
    {
        "content": "http://www.military.com/features/0,15240,189145,00.html After serving this country now we want to raise the cost of health care and make our veterans pay more. There are other health plans out there many with excellent benefits. This seems to be a roll off of when obama proposed increases. I hope Gates is not becoming a YES man.", 
        "intTime": 20090416, 
        "postID": 1, 
        "quote": "", 
        "reply": "http://www.military.com/features/0,15240,189145,00.html After serving this country now we want to raise the cost of health care and make our veterans pay more. There are other health plans out there many with excellent benefits. This seems to be a roll off of when obama proposed increases. I hope Gates is not becoming a YES man.", 
        "threadID": "672198221_4070069022001", 
        "time": "2009-04-16 18:04:00", 
        "title": "Gates: Retiree TRICARE Fees Should Rise", 
        "userID": "ss_287"
    }, 
    {
        "content": "And what does anybody expect? When it comes to veterans' issues that really matter to many, the obamanites don't much give a damn for veterans (Secretary Napolitano represents their knee-jerk attitudes well). The guvmint cannot afford to do what it promised us years ago. Yet, the suckers think and liars tell us that nationalized healthcare for 300 million Americans, many of who could have earned their care but chose not to, shall be as good for those who have earned good care as it is for them now. One cute tidbit I got from Dick Morris tonight: those under the collectivized Canadian system who are diagnosed with colon cancer die within 5 years 41% of the time. Only 32% die within 5 years among those diagnosed with the same disease in the US. The sole significant difference? Canada refuses to buy the best drugs; too costly. It will be such decision-making by a Washington bureaucrat instead of the patient's oncologist that results in sooner deaths. And that will be the case time after time after time, affliction after affliction after affliction. But, hey, there's that double bennie for us all: it'll keep down those Social Insecurity costs, too. Man, what'll the jackasses think of next--always looking out for the citizens' good. Yowzah.", 
        "intTime": 20090416, 
        "postID": 2, 
        "quote": "", 
        "reply": "And what does anybody expect? When it comes to veterans' issues that really matter to many, the obamanites don't much give a damn for veterans (Secretary Napolitano represents their knee-jerk attitudes well). The guvmint cannot afford to do what it promised us years ago. Yet, the suckers think and liars tell us that nationalized healthcare for 300 million Americans, many of who could have earned their care but chose not to, shall be as good for those who have earned good care as it is for them now. One cute tidbit I got from Dick Morris tonight: those under the collectivized Canadian system who are diagnosed with colon cancer die within 5 years 41% of the time. Only 32% die within 5 years among those diagnosed with the same disease in the US. The sole significant difference? Canada refuses to buy the best drugs; too costly. It will be such decision-making by a Washington bureaucrat instead of the patient's oncologist that results in sooner deaths. And that will be the case time after time after time, affliction after affliction after affliction. But, hey, there's that double bennie for us all: it'll keep down those Social Insecurity costs, too. Man, what'll the jackasses think of next--always looking out for the citizens' good. Yowzah.", 
        "threadID": "672198221_4070069022001", 
        "time": "2009-04-16 19:11:00", 
        "title": "Gates: Retiree TRICARE Fees Should Rise", 
        "userID": "RRR52"
    }, 
    {
        "content": "GEN (Ret.) Eric Shinseki is the Secretary of Veterans Affairs. He has considerably more influence over this particular type of issue than the Secretary of Homeland Security (Napolitano).", 
        "intTime": 20090417, 
        "postID": 3, 
        "quote": "", 
        "reply": "GEN (Ret.) Eric Shinseki is the Secretary of Veterans Affairs. He has considerably more influence over this particular type of issue than the Secretary of Homeland Security (Napolitano).", 
        "threadID": "672198221_4070069022001", 
        "time": "2009-04-17 03:22:00", 
        "title": "Gates: Retiree TRICARE Fees Should Rise", 
        "userID": "Cider33_Alpha"
    }, 
    {
        "content": "Yay. I'll just add that to my ever-increasing tax burden. \"The World's Finest\"", 
        "intTime": 20090417, 
        "postID": 4, 
        "quote": "", 
        "reply": "Yay. I'll just add that to my ever-increasing tax burden. \"The World's Finest\"", 
        "threadID": "672198221_4070069022001", 
        "time": "2009-04-17 03:25:00", 
        "title": "Gates: Retiree TRICARE Fees Should Rise", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by ss_287: http://www.military.com/features/0,15240,189145,00.html After serving this country now we want to raise the cost of health care and make our veterans pay more. There are other health plans out there many with excellent benefits. This seems to be a roll off of when obama proposed increases. I hope Gates is not becoming a YES man. If fees have been frozen since the beginning of the program it does not seem out of line to consider increasing them. It was designed as a cost sharing relationship and to think that there would never be changes in unrealistic. As stated in the article: \"Another part of the problem,\" Gates said, \"is we cannot get any relief from the Congress in terms of increasing either [TRICARE] co-pays or the premiums. TRICARE is now about a dozen years old. There has not been a single premium increase allowed since the program was founded. What medical plan in the nation has not had a single increase in the premium or co-pays in the last dozen years?\"", 
        "intTime": 20090417, 
        "postID": 5, 
        "quote": "Originally posted by ss_287: http://www.military.com/features/0,15240,189145,00.html After serving this country now we want to raise the cost of health care and make our veterans pay more. There are other health plans out there many with excellent benefits. This seems to be a roll off of when obama proposed increases. I hope Gates is not becoming a YES man.", 
        "reply": " If fees have been frozen since the beginning of the program it does not seem out of line to consider increasing them. It was designed as a cost sharing relationship and to think that there would never be changes in unrealistic. As stated in the article: \"Another part of the problem,\" Gates said, \"is we cannot get any relief from the Congress in terms of increasing either [TRICARE] co-pays or the premiums. TRICARE is now about a dozen years old. There has not been a single premium increase allowed since the program was founded. What medical plan in the nation has not had a single increase in the premium or co-pays in the last dozen years?\"", 
        "threadID": "672198221_4070069022001", 
        "time": "2009-04-17 03:33:00", 
        "title": "Gates: Retiree TRICARE Fees Should Rise", 
        "userID": "adminnco1"
    }, 
    {
        "content": "Unbeleiveable! They've even got Gates saying this crap now. It should be free. No fees. At all. Oh, and you people can thank the Democrats for the fact that the fees haven't increased. Bush tried 1,433 times during his eight years to raise TRICARE fees. For a while, it was like winning in Iraq was tied to the fees or something the way he was pushing for it. There was even a push during the Bush years to eliminate TRICARE completely and replace it with MEDICARE.", 
        "intTime": 20090417, 
        "postID": 6, 
        "quote": "", 
        "reply": "Unbeleiveable! They've even got Gates saying this crap now. It should be free. No fees. At all. Oh, and you people can thank the Democrats for the fact that the fees haven't increased. Bush tried 1,433 times during his eight years to raise TRICARE fees. For a while, it was like winning in Iraq was tied to the fees or something the way he was pushing for it. There was even a push during the Bush years to eliminate TRICARE completely and replace it with MEDICARE.", 
        "threadID": "672198221_4070069022001", 
        "time": "2009-04-17 03:39:00", 
        "title": "Gates: Retiree TRICARE Fees Should Rise", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by RRR52: And what does anybody expect? When it comes to veterans' issues that really matter to many, the obamanites don't much give a damn for veterans (Secretary Napolitano represents their knee-jerk attitudes well). The guvmint cannot afford to do what it promised us years ago. Yet, the suckers think and liars tell us that nationalized healthcare for 300 million Americans, many of who could have earned their care but chose not to, shall be as good for those who have earned good care as it is for them now. One cute tidbit I got from Dick Morris tonight: those under the collectivized Canadian system who are diagnosed with colon cancer die within 5 years 41% of the time. Only 32% die within 5 years among those diagnosed with the same disease in the US. The sole significant difference? Canada refuses to buy the best drugs; too costly. It will be such decision-making by a Washington bureaucrat instead of the patient's oncologist that results in sooner deaths. And that will be the case time after time after time, affliction after affliction after affliction. But, hey, there's that double bennie for us all: it'll keep down those Social Insecurity costs, too. Man, what'll the jackasses think of next--always looking out for the citizens' good. Yowzah. Do you like the new G.I. Bill? Guess what? It was drafted by a Democrat.", 
        "intTime": 20090417, 
        "postID": 7, 
        "quote": "Originally posted by RRR52: And what does anybody expect? When it comes to veterans' issues that really matter to many, the obamanites don't much give a damn for veterans (Secretary Napolitano represents their knee-jerk attitudes well). The guvmint cannot afford to do what it promised us years ago. Yet, the suckers think and liars tell us that nationalized healthcare for 300 million Americans, many of who could have earned their care but chose not to, shall be as good for those who have earned good care as it is for them now. One cute tidbit I got from Dick Morris tonight: those under the collectivized Canadian system who are diagnosed with colon cancer die within 5 years 41% of the time. Only 32% die within 5 years among those diagnosed with the same disease in the US. The sole significant difference? Canada refuses to buy the best drugs; too costly. It will be such decision-making by a Washington bureaucrat instead of the patient's oncologist that results in sooner deaths. And that will be the case time after time after time, affliction after affliction after affliction. But, hey, there's that double bennie for us all: it'll keep down those Social Insecurity costs, too. Man, what'll the jackasses think of next--always looking out for the citizens' good. Yowzah.", 
        "reply": " Do you like the new G.I. Bill? Guess what? It was drafted by a Democrat.", 
        "threadID": "672198221_4070069022001", 
        "time": "2009-04-17 03:41:00", 
        "title": "Gates: Retiree TRICARE Fees Should Rise", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by ss_287: http://www.military.com/features/0,15240,189145,00.html After serving this country now we want to raise the cost of health care and make our veterans pay more. There are other health plans out there many with excellent benefits. This seems to be a roll off of when obama proposed increases. I hope Gates is not becoming a YES man. If fees have been frozen since the beginning of the program it does not seem out of line to consider increasing them. It was designed as a cost sharing relationship and to think that there would never be changes in unrealistic. As stated in the article: \"Another part of the problem,\" Gates said, \"is we cannot get any relief from the Congress in terms of increasing either [TRICARE] co-pays or the premiums. TRICARE is now about a dozen years old. There has not been a single premium increase allowed since the program was founded. What medical plan in the nation has not had a single increase in the premium or co-pays in the last dozen years?\" A right rational response ... but a few comments. 1) When Congress (ICW DoD) enacted this program it failed (as it does in so many things, the AMT for example) to provide for inflation creep. For the past 4-5 years, DoD has been attempting to mitigate this by getting Congress to double and triple premiums as well as increase co-pays and tie premiums to grade at retirement. 2) The proponent for this \"mechanism\" for balancing the DoD books has been Undersecretary of Defense for Personnel and Readiness, Dr David Chu ... unkindly referred to as F*k Chu by some in the military community. Obama, for some indefensible reason, has kept him on under his administration, at least so far. 3) Were Congress to tie an annual increase in premiums and co-pays to the annual COLA, I suspect that many of us would gripe ... but accept that as a reasonable measure though not exactly the \"free\" healthcare for life that many believe they were promised. 4) Both Republican and Democratic Congresscritters have kept this shelved for the past 4-5 years ... and hopefully will continue to do so unless DoD comes up with a better proposal than a one-time doubling then tripling of premiums and co-pays.", 
        "intTime": 20090417, 
        "postID": 8, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by ss_287: http://www.military.com/features/0,15240,189145,00.html After serving this country now we want to raise the cost of health care and make our veterans pay more. There are other health plans out there many with excellent benefits. This seems to be a roll off of when obama proposed increases. I hope Gates is not becoming a YES man. If fees have been frozen since the beginning of the program it does not seem out of line to consider increasing them. It was designed as a cost sharing relationship and to think that there would never be changes in unrealistic. As stated in the article: \"Another part of the problem,\" Gates said, \"is we cannot get any relief from the Congress in terms of increasing either [TRICARE] co-pays or the premiums. TRICARE is now about a dozen years old. There has not been a single premium increase allowed since the program was founded. What medical plan in the nation has not had a single increase in the premium or co-pays in the last dozen years?\"", 
        "reply": " A right rational response ... but a few comments. 1) When Congress (ICW DoD) enacted this program it failed (as it does in so many things, the AMT for example) to provide for inflation creep. For the past 4-5 years, DoD has been attempting to mitigate this by getting Congress to double and triple premiums as well as increase co-pays and tie premiums to grade at retirement. 2) The proponent for this \"mechanism\" for balancing the DoD books has been Undersecretary of Defense for Personnel and Readiness, Dr David Chu ... unkindly referred to as F*k Chu by some in the military community. Obama, for some indefensible reason, has kept him on under his administration, at least so far. 3) Were Congress to tie an annual increase in premiums and co-pays to the annual COLA, I suspect that many of us would gripe ... but accept that as a reasonable measure though not exactly the \"free\" healthcare for life that many believe they were promised. 4) Both Republican and Democratic Congresscritters have kept this shelved for the past 4-5 years ... and hopefully will continue to do so unless DoD comes up with a better proposal than a one-time doubling then tripling of premiums and co-pays.", 
        "threadID": "672198221_4070069022001", 
        "time": "2009-04-17 05:45:00", 
        "title": "Gates: Retiree TRICARE Fees Should Rise", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "Before people begin bashing Obama for this idea, let me sum up the last 8 years: 1. Bush Administration proposes raising TRICARE fees. 2. Congress or The Senate override him. 3. Repeat. I really, really, really hated it when Generals would talk about all the reasons why we should raise TRICARE co-pays. You're in the military, shut the hell up you idiot. Just because you make $120,000 a year in base pay alone and can afford higher TRICARE co-pays when you retire doesn't mean a retired E5 can.", 
        "intTime": 20090417, 
        "postID": 9, 
        "quote": "", 
        "reply": "Before people begin bashing Obama for this idea, let me sum up the last 8 years: 1. Bush Administration proposes raising TRICARE fees. 2. Congress or The Senate override him. 3. Repeat. I really, really, really hated it when Generals would talk about all the reasons why we should raise TRICARE co-pays. You're in the military, shut the hell up you idiot. Just because you make $120,000 a year in base pay alone and can afford higher TRICARE co-pays when you retire doesn't mean a retired E5 can.", 
        "threadID": "672198221_4070069022001", 
        "time": "2009-04-17 05:58:00", 
        "title": "Gates: Retiree TRICARE Fees Should Rise", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by Cider33_Alpha: GEN (Ret.) Eric Shinseki is the Secretary of Veterans Affairs. He has considerably more influence over this particular type of issue than the Secretary of Homeland Security (Napolitano). Nobody says he shouldn't. Where is his public statement to clarify what veterans contribute beyond false fodder for Napolitano's idiocy? will he speak for veterans when so maligned, or will he flaccidly remain mum? The selection of people with Napolitano's attitude toward veterans is expected of the obamanites.", 
        "intTime": 20090419, 
        "postID": 10, 
        "quote": "Originally posted by Cider33_Alpha: GEN (Ret.) Eric Shinseki is the Secretary of Veterans Affairs. He has considerably more influence over this particular type of issue than the Secretary of Homeland Security (Napolitano).", 
        "reply": " Nobody says he shouldn't. Where is his public statement to clarify what veterans contribute beyond false fodder for Napolitano's idiocy? will he speak for veterans when so maligned, or will he flaccidly remain mum? The selection of people with Napolitano's attitude toward veterans is expected of the obamanites.", 
        "threadID": "672198221_4070069022001", 
        "time": "2009-04-19 16:26:00", 
        "title": "Gates: Retiree TRICARE Fees Should Rise", 
        "userID": "RRR52"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by RRR52: And what does anybody expect? When it comes to veterans' issues that really matter to many, the obamanites don't much give a damn for veterans (Secretary Napolitano represents their knee-jerk attitudes well). The guvmint cannot afford to do what it promised us years ago. Yet, the suckers think and liars tell us that nationalized healthcare for 300 million Americans, many of who could have earned their care but chose not to, shall be as good for those who have earned good care as it is for them now. One cute tidbit I got from Dick Morris tonight: those under the collectivized Canadian system who are diagnosed with colon cancer die within 5 years 41% of the time. Only 32% die within 5 years among those diagnosed with the same disease in the US. The sole significant difference? Canada refuses to buy the best drugs; too costly. It will be such decision-making by a Washington bureaucrat instead of the patient's oncologist that results in sooner deaths. And that will be the case time after time after time, affliction after affliction after affliction. But, hey, there's that double bennie for us all: it'll keep down those Social Insecurity costs, too. Man, what'll the jackasses think of next--always looking out for the citizens' good. Yowzah. Do you like the new G.I. Bill? Guess what? It was drafted by a Democrat. You are off-track again. It is TRICARE, not education that we discuss. Do you really believe that there will be no cuts in the GI Bill, too? Sorry, there shall be. Watch.", 
        "intTime": 20090419, 
        "postID": 11, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by RRR52: And what does anybody expect? When it comes to veterans' issues that really matter to many, the obamanites don't much give a damn for veterans (Secretary Napolitano represents their knee-jerk attitudes well). The guvmint cannot afford to do what it promised us years ago. Yet, the suckers think and liars tell us that nationalized healthcare for 300 million Americans, many of who could have earned their care but chose not to, shall be as good for those who have earned good care as it is for them now. One cute tidbit I got from Dick Morris tonight: those under the collectivized Canadian system who are diagnosed with colon cancer die within 5 years 41% of the time. Only 32% die within 5 years among those diagnosed with the same disease in the US. The sole significant difference? Canada refuses to buy the best drugs; too costly. It will be such decision-making by a Washington bureaucrat instead of the patient's oncologist that results in sooner deaths. And that will be the case time after time after time, affliction after affliction after affliction. But, hey, there's that double bennie for us all: it'll keep down those Social Insecurity costs, too. Man, what'll the jackasses think of next--always looking out for the citizens' good. Yowzah. Do you like the new G.I. Bill? Guess what? It was drafted by a Democrat.", 
        "reply": " You are off-track again. It is TRICARE, not education that we discuss. Do you really believe that there will be no cuts in the GI Bill, too? Sorry, there shall be. Watch.", 
        "threadID": "672198221_4070069022001", 
        "time": "2009-04-19 16:29:00", 
        "title": "Gates: Retiree TRICARE Fees Should Rise", 
        "userID": "RRR52"
    }, 
    {
        "content": "quote: Originally posted by RRR52: And what does anybody expect? When it comes to veterans' issues that really matter to many, the obamanites don't much give a damn for veterans (Secretary Napolitano represents their knee-jerk attitudes well). The guvmint cannot afford to do what it promised us years ago. Yet, the suckers think and liars tell us that nationalized healthcare for 300 million Americans, many of who could have earned their care but chose not to, shall be as good for those who have earned good care as it is for them now. One cute tidbit I got from Dick Morris tonight: those under the collectivized Canadian system who are diagnosed with colon cancer die within 5 years 41% of the time. Only 32% die within 5 years among those diagnosed with the same disease in the US. The sole significant difference? Canada refuses to buy the best drugs; too costly. It will be such decision-making by a Washington bureaucrat instead of the patient's oncologist that results in sooner deaths. And that will be the case time after time after time, affliction after affliction after affliction. But, hey, there's that double bennie for us all: it'll keep down those Social Insecurity costs, too. Man, what'll the jackasses think of next--always looking out for the citizens' good. Yowzah. quote: One cute tidbit I got from Dick Morris tonight: those under the collectivized Canadian system who are diagnosed with colon cancer die within 5 years 41% of the time. Only 32% die within 5 years among those diagnosed with the same disease in the US. Did Dick mention where he got his data from. Apparently not from this source: Concord Study Reveals High Cancer Survival Rate In Canada Regina, Canada (AHN) - Most Canadian citizens are likely to survive the often fatal disease of cancer because of the country's accessible and reliable health care system, according to a Concord study. The study, which will appear in the August issue of The Lancet Oncology, revealed that Canada ranked second in patient survival for breast cancer, third for prostate cancer in men and for colorectal cancer in women, and sixth for colorectal cancer in men. The Concord study, which involved 125 researchers, benchmarked five-year survival rates of two million cancer patients in 31 countries from 1990 to 1994. In Canada, information was based on cancer registries in Saskatchewan, British Columbia, Manitoba, Ontario and Nova Scotia. On a global scale, countries that have the highest cancer survival rates are the United States, France and Japan. The U.S. has a higher survival rate than Europe, with Eastern Europe at the lowest. The country that has the lowest survival rate is Algeria. Australia ranks together with Canada, which have similar health care systems. http://www.allheadlinenews.com/articles/7011660660 The United States has the highest rates of survival for breast and prostate cancers, while Japan has the highest survival rates for colon and rectal cancers among men. France has the highest survival rates for colon and rectal cancer among women, the report found. In addition, Canada and Australia also have very high survival rates for most cancers. The lowest rate of survival among both men and women was seen in Algeria. http://www.hon.ch/News/HSN/617550.html Most Canadian citizens are likely to survive the often fatal disease of cancer because of the country's accessible and reliable health care system, according to a Concord study. http://www.vitabeat.com/study-reveals-high-cancer-survival-rate-in-canada/v/8771/ http://news.bbc.co.uk/2/hi/health/7510121.stm It's more likely that Dick just wants to ramp up sales for his next book with a 'research' hint, that obviously you will have to buy the book to find out where he gets his data. I wonder how much kick back Dick gets on a yearly basis from the Pharmacy, and Health Care Industry for keeping the FOX crowd uninformed? Now that would be a real 'investigative' story worth reading. This message has been edited. Last edited by: jdksfcret, Mon 20 April 2009 11:57 AM", 
        "intTime": 20090419, 
        "postID": 12, 
        "quote": "Originally posted by RRR52: And what does anybody expect? When it comes to veterans' issues that really matter to many, the obamanites don't much give a damn for veterans (Secretary Napolitano represents their knee-jerk attitudes well). The guvmint cannot afford to do what it promised us years ago. Yet, the suckers think and liars tell us that nationalized healthcare for 300 million Americans, many of who could have earned their care but chose not to, shall be as good for those who have earned good care as it is for them now. One cute tidbit I got from Dick Morris tonight: those under the collectivized Canadian system who are diagnosed with colon cancer die within 5 years 41% of the time. Only 32% die within 5 years among those diagnosed with the same disease in the US. The sole significant difference? Canada refuses to buy the best drugs; too costly. It will be such decision-making by a Washington bureaucrat instead of the patient's oncologist that results in sooner deaths. And that will be the case time after time after time, affliction after affliction after affliction. But, hey, there's that double bennie for us all: it'll keep down those Social Insecurity costs, too. Man, what'll the jackasses think of next--always looking out for the citizens' good. Yowzah.", 
        "reply": " quote: One cute tidbit I got from Dick Morris tonight: those under the collectivized Canadian system who are diagnosed with colon cancer die within 5 years 41% of the time. Only 32% die within 5 years among those diagnosed with the same disease in the US. Did Dick mention where he got his data from. Apparently not from this source: Concord Study Reveals High Cancer Survival Rate In Canada Regina, Canada (AHN) - Most Canadian citizens are likely to survive the often fatal disease of cancer because of the country's accessible and reliable health care system, according to a Concord study. The study, which will appear in the August issue of The Lancet Oncology, revealed that Canada ranked second in patient survival for breast cancer, third for prostate cancer in men and for colorectal cancer in women, and sixth for colorectal cancer in men. The Concord study, which involved 125 researchers, benchmarked five-year survival rates of two million cancer patients in 31 countries from 1990 to 1994. In Canada, information was based on cancer registries in Saskatchewan, British Columbia, Manitoba, Ontario and Nova Scotia. On a global scale, countries that have the highest cancer survival rates are the United States, France and Japan. The U.S. has a higher survival rate than Europe, with Eastern Europe at the lowest. The country that has the lowest survival rate is Algeria. Australia ranks together with Canada, which have similar health care systems. http://www.allheadlinenews.com/articles/7011660660 The United States has the highest rates of survival for breast and prostate cancers, while Japan has the highest survival rates for colon and rectal cancers among men. France has the highest survival rates for colon and rectal cancer among women, the report found. In addition, Canada and Australia also have very high survival rates for most cancers. The lowest rate of survival among both men and women was seen in Algeria. http://www.hon.ch/News/HSN/617550.html Most Canadian citizens are likely to survive the often fatal disease of cancer because of the country's accessible and reliable health care system, according to a Concord study. http://www.vitabeat.com/study-reveals-high-cancer-survival-rate-in-canada/v/8771/ http://news.bbc.co.uk/2/hi/health/7510121.stm It's more likely that Dick just wants to ramp up sales for his next book with a 'research' hint, that obviously you will have to buy the book to find out where he gets his data. I wonder how much kick back Dick gets on a yearly basis from the Pharmacy, and Health Care Industry for keeping the FOX crowd uninformed? Now that would be a real 'investigative' story worth reading. This message has been edited. Last edited by: jdksfcret, Mon 20 April 2009 11:57 AM", 
        "threadID": "672198221_4070069022001", 
        "time": "2009-04-19 20:36:00", 
        "title": "Gates: Retiree TRICARE Fees Should Rise", 
        "userID": "jdksfcret"
    }, 
    {
        "content": "Do the American statistics for colon cancer include the number of people unable to get care because the have no health insurance? And under the the Republican administration, especially Rumsfeld's leadership, many attempts were made to raise Tricare fees and make retirement benefits closer to the private sector. Not much of a way to support the troops there.", 
        "intTime": 20090420, 
        "postID": 13, 
        "quote": "", 
        "reply": "Do the American statistics for colon cancer include the number of people unable to get care because the have no health insurance? And under the the Republican administration, especially Rumsfeld's leadership, many attempts were made to raise Tricare fees and make retirement benefits closer to the private sector. Not much of a way to support the troops there.", 
        "threadID": "672198221_4070069022001", 
        "time": "2009-04-20 10:49:00", 
        "title": "Gates: Retiree TRICARE Fees Should Rise", 
        "userID": "lincoln1"
    }, 
    {
        "content": "quote: Originally posted by RRR52: And what does anybody expect? When it comes to veterans' issues that really matter to many, the obamanites don't much give a damn for veterans (Secretary Napolitano represents their knee-jerk attitudes well). The guvmint cannot afford to do what it promised us years ago. Yet, the suckers think and liars tell us that nationalized healthcare for 300 million Americans, many of who could have earned their care but chose not to, shall be as good for those who have earned good care as it is for them now. One cute tidbit I got from Dick Morris tonight: those under the collectivized Canadian system who are diagnosed with colon cancer die within 5 years 41% of the time. Only 32% die within 5 years among those diagnosed with the same disease in the US. The sole significant difference? Canada refuses to buy the best drugs; too costly. It will be such decision-making by a Washington bureaucrat instead of the patient's oncologist that results in sooner deaths. And that will be the case time after time after time, affliction after affliction after affliction. But, hey, there's that double bennie for us all: it'll keep down those Social Insecurity costs, too. Man, what'll the jackasses think of next--always looking out for the citizens' good. Yowzah. Shall we compare congressional voting on veteran's issues...republicans vs democrats?", 
        "intTime": 20090420, 
        "postID": 14, 
        "quote": "Originally posted by RRR52: And what does anybody expect? When it comes to veterans' issues that really matter to many, the obamanites don't much give a damn for veterans (Secretary Napolitano represents their knee-jerk attitudes well). The guvmint cannot afford to do what it promised us years ago. Yet, the suckers think and liars tell us that nationalized healthcare for 300 million Americans, many of who could have earned their care but chose not to, shall be as good for those who have earned good care as it is for them now. One cute tidbit I got from Dick Morris tonight: those under the collectivized Canadian system who are diagnosed with colon cancer die within 5 years 41% of the time. Only 32% die within 5 years among those diagnosed with the same disease in the US. The sole significant difference? Canada refuses to buy the best drugs; too costly. It will be such decision-making by a Washington bureaucrat instead of the patient's oncologist that results in sooner deaths. And that will be the case time after time after time, affliction after affliction after affliction. But, hey, there's that double bennie for us all: it'll keep down those Social Insecurity costs, too. Man, what'll the jackasses think of next--always looking out for the citizens' good. Yowzah.", 
        "reply": " Shall we compare congressional voting on veteran's issues...republicans vs democrats?", 
        "threadID": "672198221_4070069022001", 
        "time": "2009-04-20 10:54:00", 
        "title": "Gates: Retiree TRICARE Fees Should Rise", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "TriCare? Bend over! When you give more to some (Health care for illegal alliens), you must then lessen the costs and services elsewhere (veteran's). Socialism sucks, don't it!", 
        "intTime": 20090420, 
        "postID": 15, 
        "quote": "", 
        "reply": "TriCare? Bend over! When you give more to some (Health care for illegal alliens), you must then lessen the costs and services elsewhere (veteran's). Socialism sucks, don't it!", 
        "threadID": "672198221_4070069022001", 
        "time": "2009-04-20 14:34:00", 
        "title": "Gates: Retiree TRICARE Fees Should Rise", 
        "userID": "_cash_"
    }, 
    {
        "content": "In the over 32 years since I left active duty, complaining about military health care, Champus, TriCare, etc. has been ongoing. After retiring from the military, my next career provided Michigan Blue Cross/Blue Shield, for which we paid a portion of the premiums. After retiring from that career, health care for retirees was gradually whittled down and our co-pay increased until, just over four years ago, health care was eliminated from the company retirement package. My wife and I reverted back to the military, on-base, specialists through TriCare, the VA, and Medicare at age 65. Now we receive health care far superior to our so-called company provided health care. I, for one, am thankful for the Tri-Care system. Raising our premiums a small percentage sure beats being one of the 47 million American citizens lacking any form of health care. Jack", 
        "intTime": 20090420, 
        "postID": 16, 
        "quote": "", 
        "reply": "In the over 32 years since I left active duty, complaining about military health care, Champus, TriCare, etc. has been ongoing. After retiring from the military, my next career provided Michigan Blue Cross/Blue Shield, for which we paid a portion of the premiums. After retiring from that career, health care for retirees was gradually whittled down and our co-pay increased until, just over four years ago, health care was eliminated from the company retirement package. My wife and I reverted back to the military, on-base, specialists through TriCare, the VA, and Medicare at age 65. Now we receive health care far superior to our so-called company provided health care. I, for one, am thankful for the Tri-Care system. Raising our premiums a small percentage sure beats being one of the 47 million American citizens lacking any form of health care. Jack", 
        "threadID": "672198221_4070069022001", 
        "time": "2009-04-20 17:24:00", 
        "title": "Gates: Retiree TRICARE Fees Should Rise", 
        "userID": "jackhunter1"
    }, 
    {
        "content": "quote: Originally posted by jackhunter1: In the over 32 years since I left active duty, complaining about military health care, Champus, TriCare, etc. has been ongoing. After retiring from the military, my next career provided Michigan Blue Cross/Blue Shield, for which we paid a portion of the premiums. After retiring from that career, health care for retirees was gradually whittled down and our co-pay increased until, just over four years ago, health care was eliminated from the company retirement package. My wife and I reverted back to the military, on-base, specialists through TriCare, the VA, and Medicare at age 65. Now we receive health care far superior to our so-called company provided health care. I, for one, am thankful for the Tri-Care system. Raising our premiums a small percentage sure beats being one of the 47 million American citizens lacking any form of health care. Jack The voice of experience and reason. Thanks, Jack I would gladly pay an increase in my Tri-Care premium to keep it solvent.", 
        "intTime": 20090420, 
        "postID": 17, 
        "quote": "Originally posted by jackhunter1: In the over 32 years since I left active duty, complaining about military health care, Champus, TriCare, etc. has been ongoing. After retiring from the military, my next career provided Michigan Blue Cross/Blue Shield, for which we paid a portion of the premiums. After retiring from that career, health care for retirees was gradually whittled down and our co-pay increased until, just over four years ago, health care was eliminated from the company retirement package. My wife and I reverted back to the military, on-base, specialists through TriCare, the VA, and Medicare at age 65. Now we receive health care far superior to our so-called company provided health care. I, for one, am thankful for the Tri-Care system. Raising our premiums a small percentage sure beats being one of the 47 million American citizens lacking any form of health care. Jack", 
        "reply": " The voice of experience and reason. Thanks, Jack I would gladly pay an increase in my Tri-Care premium to keep it solvent.", 
        "threadID": "672198221_4070069022001", 
        "time": "2009-04-20 17:29:00", 
        "title": "Gates: Retiree TRICARE Fees Should Rise", 
        "userID": "jdksfcret"
    }, 
    {
        "content": "Not so many years ago, Congress decided to compromise and put forth the TriCare package to retirees. This was to still the broken promises of a healthcare for life for military retirees. Recruiter's used this promise to recruit and it appeared on brochures, Congress denies the promise was ever made....conveniently! TriCare was the plan, Both sides swallowed hard.....but now it's time again to put the screws to retirees. The premiums amd prescription prices should only rise with the same rate that military pay increases do. The nation promises to provide a National Healthcare....but at the same time want's to water down and increase premiums for veteran's healthcare. Sounds slight of hand!", 
        "intTime": 20090420, 
        "postID": 18, 
        "quote": "", 
        "reply": "Not so many years ago, Congress decided to compromise and put forth the TriCare package to retirees. This was to still the broken promises of a healthcare for life for military retirees. Recruiter's used this promise to recruit and it appeared on brochures, Congress denies the promise was ever made....conveniently! TriCare was the plan, Both sides swallowed hard.....but now it's time again to put the screws to retirees. The premiums amd prescription prices should only rise with the same rate that military pay increases do. The nation promises to provide a National Healthcare....but at the same time want's to water down and increase premiums for veteran's healthcare. Sounds slight of hand!", 
        "threadID": "672198221_4070069022001", 
        "time": "2009-04-20 19:40:00", 
        "title": "Gates: Retiree TRICARE Fees Should Rise", 
        "userID": "_cash_"
    }, 
    {
        "content": "I say we do away with the health care for life for our congressmen and senators.. We could also drop their retirement for life benefits, both of which would help drop the federal budget.", 
        "intTime": 20090420, 
        "postID": 19, 
        "quote": "", 
        "reply": "I say we do away with the health care for life for our congressmen and senators.. We could also drop their retirement for life benefits, both of which would help drop the federal budget.", 
        "threadID": "672198221_4070069022001", 
        "time": "2009-04-20 20:41:00", 
        "title": "Gates: Retiree TRICARE Fees Should Rise", 
        "userID": "3678131"
    }
]