[
    {
        "content": "Congress has an RCP Poll Average of -15 \"http://www.realclearpolitics.com/epolls/other/congressional_job_approval-903.html\" POTUS has an RCP Poll Average of +30.6 \"http://www.realclearpolitics.com/epolls/other/president_obama_job_approval-1044.html\" Direction of the Country has an RCP Poll Average of -20.2 \"http://www.realclearpolitics.com/epolls/other/direction_of_country-902.html\" Can someone please explain how we disapprove of Congress and the direction of our country, but yet the POTUS still has a mediocre approval rating? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090312, 
        "postID": 1, 
        "quote": "", 
        "reply": "Congress has an RCP Poll Average of -15 \"http://www.realclearpolitics.com/epolls/other/congressional_job_approval-903.html\" POTUS has an RCP Poll Average of +30.6 \"http://www.realclearpolitics.com/epolls/other/president_obama_job_approval-1044.html\" Direction of the Country has an RCP Poll Average of -20.2 \"http://www.realclearpolitics.com/epolls/other/direction_of_country-902.html\" Can someone please explain how we disapprove of Congress and the direction of our country, but yet the POTUS still has a mediocre approval rating? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_1850046712001", 
        "time": "2009-03-12 08:34:00", 
        "title": "Political Job Approvals", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Can someone please explain how we disapprove of Congress and the direction of our country, but yet the POTUS still has a mediocre approval rating? The people that \"approve\" of him are doing so on a personal, not political level. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090312, 
        "postID": 2, 
        "quote": "Can someone please explain how we disapprove of Congress and the direction of our country, but yet the POTUS still has a mediocre approval rating?", 
        "reply": " The people that \"approve\" of him are doing so on a personal, not political level. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_1850046712001", 
        "time": "2009-03-12 08:49:00", 
        "title": "Political Job Approvals", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Can someone please explain how we disapprove of Congress and the direction of our country, but yet the POTUS still has a mediocre approval rating? The people that \"approve\" of him are doing so on a personal, not political level. Yeah, I figured that much. I have been saying all long that people need to pull their head out of his arse and off his johnson so they can see the light. Maybe one day we will have change and hope. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090312, 
        "postID": 3, 
        "quote": "Originally posted by L0A1: quote: Can someone please explain how we disapprove of Congress and the direction of our country, but yet the POTUS still has a mediocre approval rating? The people that \"approve\" of him are doing so on a personal, not political level.", 
        "reply": " Yeah, I figured that much. I have been saying all long that people need to pull their head out of his arse and off his johnson so they can see the light. Maybe one day we will have change and hope. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_1850046712001", 
        "time": "2009-03-12 09:16:00", 
        "title": "Political Job Approvals", 
        "userID": "Anbar7"
    }, 
    {
        "content": "One Republican Senator in Florida and one Democrat Senator. I sent an email to both thanking the Republican for his NAY vote on the Budget Bill and asked the Democrat Senator for his immediate resignation due to incredibly poor leadership. He hasn't responded yet!", 
        "intTime": 20090312, 
        "postID": 4, 
        "quote": "", 
        "reply": "One Republican Senator in Florida and one Democrat Senator. I sent an email to both thanking the Republican for his NAY vote on the Budget Bill and asked the Democrat Senator for his immediate resignation due to incredibly poor leadership. He hasn't responded yet!", 
        "threadID": "672198221_1850046712001", 
        "time": "2009-03-12 09:37:00", 
        "title": "Political Job Approvals", 
        "userID": "busnrete8"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: Congress has an RCP Poll Average of -15 \"http://www.realclearpolitics.com/epolls/other/congressional_job_approval-903.html\" POTUS has an RCP Poll Average of +30.6 \"http://www.realclearpolitics.com/epolls/other/president_obama_job_approval-1044.html\" Direction of the Country has an RCP Poll Average of -20.2 \"http://www.realclearpolitics.com/epolls/other/direction_of_country-902.html\" Can someone please explain how we disapprove of Congress and the direction of our country, but yet the POTUS still has a mediocre approval rating? Could someone explain to me why we keep voting for Dems or Reps for the last 150+ Years only to know what we will get? How dumb. Cut your ties to these party people.", 
        "intTime": 20090312, 
        "postID": 5, 
        "quote": "Originally posted by Anbar7: Congress has an RCP Poll Average of -15 \"http://www.realclearpolitics.com/epolls/other/congressional_job_approval-903.html\" POTUS has an RCP Poll Average of +30.6 \"http://www.realclearpolitics.com/epolls/other/president_obama_job_approval-1044.html\" Direction of the Country has an RCP Poll Average of -20.2 \"http://www.realclearpolitics.com/epolls/other/direction_of_country-902.html\" Can someone please explain how we disapprove of Congress and the direction of our country, but yet the POTUS still has a mediocre approval rating?", 
        "reply": " Could someone explain to me why we keep voting for Dems or Reps for the last 150+ Years only to know what we will get? How dumb. Cut your ties to these party people.", 
        "threadID": "672198221_1850046712001", 
        "time": "2009-03-12 14:03:00", 
        "title": "Political Job Approvals", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "CJ, we don't always see eye to eye, however this I agree with 100% I believe we need the libatarian party to get moving in America. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090312, 
        "postID": 6, 
        "quote": "", 
        "reply": "CJ, we don't always see eye to eye, however this I agree with 100% I believe we need the libatarian party to get moving in America. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_1850046712001", 
        "time": "2009-03-12 14:07:00", 
        "title": "Political Job Approvals", 
        "userID": "L0A1"
    }, 
    {
        "content": "Could someone explain to me why we keep voting for Dems or Reps for the last 150+ Years only to know what we will get? How dumb. Cut your ties to these party people.[/QUOTE] Have to agree, (have had to agree with CJ a few other times )", 
        "intTime": 20090312, 
        "postID": 7, 
        "quote": "", 
        "reply": "Could someone explain to me why we keep voting for Dems or Reps for the last 150+ Years only to know what we will get? How dumb. Cut your ties to these party people.[/QUOTE] Have to agree, (have had to agree with CJ a few other times )", 
        "threadID": "672198221_1850046712001", 
        "time": "2009-03-12 14:38:00", 
        "title": "Political Job Approvals", 
        "userID": "JustanotherGI"
    }, 
    {
        "content": "quote: Originally posted by L0A1: CJ, we don't always see eye to eye, however this I agree with 100% I believe we need the libatarian party to get moving in America. America's third largest party is greasing their wheels, that you can be sure of. Just here in Ohio our meeting have been pumping full of people. I hope that this trend continues. Not just for the LP, but for the future of America.", 
        "intTime": 20090312, 
        "postID": 8, 
        "quote": "Originally posted by L0A1: CJ, we don't always see eye to eye, however this I agree with 100% I believe we need the libatarian party to get moving in America.", 
        "reply": " America's third largest party is greasing their wheels, that you can be sure of. Just here in Ohio our meeting have been pumping full of people. I hope that this trend continues. Not just for the LP, but for the future of America.", 
        "threadID": "672198221_1850046712001", 
        "time": "2009-03-12 15:37:00", 
        "title": "Political Job Approvals", 
        "userID": "10Tenths"
    }, 
    {
        "content": "quote: Originally posted by L0A1: CJ, we don't always see eye to eye, however this I agree with 100% I believe we need the libatarian party to get moving in America. I took a side for a reason. That reason was to show some people that are fighting for the republican party is just as dumb as fighting for the Democratic party. The Kings and Queens we have on Capital hill need to go as long as they affiliate themselves with either one of those parties and continue to do things in their best political interest instead of what is right for the nation. But nooooo, every 4 years we get to hear a Dem or a Rep stand up and make great speeches, then the people split and support candidates just because of party affiliation. What they say does not really mean squat except that it sounds good and makes us feel good for a time. We probably enjoy 1/4 (if that much) of the freedoms and liberties our founders had because of both these parties. You can not support a party that supports 100% corporate take over of American rights and freedoms as individuals without backlash no more than you can support a part that believes in taking from one and giving to another. Americans as free and independent men in this nation have been enslaved by the Corporate rulers as well as have been driven to become one of those rules or get \"punished\" as well and I am getting back the only way I know how and can legally do so. With my vote. Continue to fight this voter at the poll and this voter will continue down the same path of resistance or actually the most hurtful one. A man that has a right to be treated as individual in the same breath they steal a mans liberties with disrespect and dishonor by not allowing himself to defend those very things in which blood was shed. Honor, Respect and Dignity, American Style. In the old days that would have been settled out back between 2 men. Corporate and Federal Enslavement go hand in hand to me. Reps support both of those concepts. The Dems support the Federal Enslavement at the same time hold a hand out to the average American who gets the brunt of the beating by the Corporations while enslaving them with more government. As I have said before and will continue to say until I die. We can not be the nation we are suppose to be if we do not act like the nation we are suppose to be. Quit running to mama government every time little company does not get his way. Taking my hard earned money in taxes and keeping it or not paying me a decent living wage is the same thing in my eyes. If I work my azz off for it, then I deserve some of the returns no matter what I am doing. If a Company prospers, then all hard workers should prosper and fire the no loads, union or not, hourly or salary. What our nation/government does among the rest of the world should have a direct benefit back to this nation in some way shape or form and not just the elite using tax payer money and government power to accomplish. I am sick and tired of seeing our government do things that only supports a false since of economic success as a economic super power when quite the opposite has been PROVEN without a shadow of doubt that it does not work and only adds to the eventual economic fall of a nation like we have seen. No one will get every thing, but we all deserve some thing and that's the country we once had with an opprtunity to live and raise a decent family and most of all BE FREE. This message has been edited. Last edited by: crackerjacks61, Thu 12 March 2009 03:55 PM", 
        "intTime": 20090312, 
        "postID": 9, 
        "quote": "Originally posted by L0A1: CJ, we don't always see eye to eye, however this I agree with 100% I believe we need the libatarian party to get moving in America.", 
        "reply": " I took a side for a reason. That reason was to show some people that are fighting for the republican party is just as dumb as fighting for the Democratic party. The Kings and Queens we have on Capital hill need to go as long as they affiliate themselves with either one of those parties and continue to do things in their best political interest instead of what is right for the nation. But nooooo, every 4 years we get to hear a Dem or a Rep stand up and make great speeches, then the people split and support candidates just because of party affiliation. What they say does not really mean squat except that it sounds good and makes us feel good for a time. We probably enjoy 1/4 (if that much) of the freedoms and liberties our founders had because of both these parties. You can not support a party that supports 100% corporate take over of American rights and freedoms as individuals without backlash no more than you can support a part that believes in taking from one and giving to another. Americans as free and independent men in this nation have been enslaved by the Corporate rulers as well as have been driven to become one of those rules or get \"punished\" as well and I am getting back the only way I know how and can legally do so. With my vote. Continue to fight this voter at the poll and this voter will continue down the same path of resistance or actually the most hurtful one. A man that has a right to be treated as individual in the same breath they steal a mans liberties with disrespect and dishonor by not allowing himself to defend those very things in which blood was shed. Honor, Respect and Dignity, American Style. In the old days that would have been settled out back between 2 men. Corporate and Federal Enslavement go hand in hand to me. Reps support both of those concepts. The Dems support the Federal Enslavement at the same time hold a hand out to the average American who gets the brunt of the beating by the Corporations while enslaving them with more government. As I have said before and will continue to say until I die. We can not be the nation we are suppose to be if we do not act like the nation we are suppose to be. Quit running to mama government every time little company does not get his way. Taking my hard earned money in taxes and keeping it or not paying me a decent living wage is the same thing in my eyes. If I work my azz off for it, then I deserve some of the returns no matter what I am doing. If a Company prospers, then all hard workers should prosper and fire the no loads, union or not, hourly or salary. What our nation/government does among the rest of the world should have a direct benefit back to this nation in some way shape or form and not just the elite using tax payer money and government power to accomplish. I am sick and tired of seeing our government do things that only supports a false since of economic success as a economic super power when quite the opposite has been PROVEN without a shadow of doubt that it does not work and only adds to the eventual economic fall of a nation like we have seen. No one will get every thing, but we all deserve some thing and that's the country we once had with an opprtunity to live and raise a decent family and most of all BE FREE. This message has been edited. Last edited by: crackerjacks61, Thu 12 March 2009 03:55 PM", 
        "threadID": "672198221_1850046712001", 
        "time": "2009-03-12 15:39:00", 
        "title": "Political Job Approvals", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by busnrete8: One Republican Senator in Florida and one Democrat Senator. I sent an email to both thanking the Republican for his NAY vote on the Budget Bill and asked the Democrat Senator for his immediate resignation due to incredibly poor leadership. He hasn't responded yet! well i did the same thing but to mel martenze(sp)... but for his support of obama and not launching an investigation into obama birth records....and he will loose his job come election time...", 
        "intTime": 20090312, 
        "postID": 10, 
        "quote": "Originally posted by busnrete8: One Republican Senator in Florida and one Democrat Senator. I sent an email to both thanking the Republican for his NAY vote on the Budget Bill and asked the Democrat Senator for his immediate resignation due to incredibly poor leadership. He hasn't responded yet!", 
        "reply": " well i did the same thing but to mel martenze(sp)... but for his support of obama and not launching an investigation into obama birth records....and he will loose his job come election time...", 
        "threadID": "672198221_1850046712001", 
        "time": "2009-03-12 15:41:00", 
        "title": "Political Job Approvals", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: quote: Originally posted by busnrete8: One Republican Senator in Florida and one Democrat Senator. I sent an email to both thanking the Republican for his NAY vote on the Budget Bill and asked the Democrat Senator for his immediate resignation due to incredibly poor leadership. He hasn't responded yet! well i did the same thing but to mel martenze(sp)... but for his support of obama and not launching an investigation into obama birth records....and he will loose his job come election time... You think your reps actually read and/or listen to you? Nope. Americans unite. tell our government whos in charge. We say we want the IRS to be gone and taxes done like WE want them to be done. \"www.fairtax.org\"", 
        "intTime": 20090312, 
        "postID": 11, 
        "quote": "Originally posted by outlaws93: quote: Originally posted by busnrete8: One Republican Senator in Florida and one Democrat Senator. I sent an email to both thanking the Republican for his NAY vote on the Budget Bill and asked the Democrat Senator for his immediate resignation due to incredibly poor leadership. He hasn't responded yet! well i did the same thing but to mel martenze(sp)... but for his support of obama and not launching an investigation into obama birth records....and he will loose his job come election time...", 
        "reply": " You think your reps actually read and/or listen to you? Nope. Americans unite. tell our government whos in charge. We say we want the IRS to be gone and taxes done like WE want them to be done. \"www.fairtax.org\"", 
        "threadID": "672198221_1850046712001", 
        "time": "2009-03-12 15:53:00", 
        "title": "Political Job Approvals", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "My rep most certainly does listen to me. I talk to him almost every week. And, he votes almost entirely in line with my frame of mind. When he doesn't, the first thing he says to me is, \"ok Joe, I can explain my position on that issue\". And, he does just that. I also keep in contact with my old Representative and the Representative where I do most of my volunteer work. They know me pretty well. As for my Senators, Voinovich is a pretty cool cat and I have spoke with him quite often. But, he is retiring. Brown is a POS. He dreads my call and avoids it at all costs. So, anytime I am in DC for a convention or he is here in Ohio I make it a point to see him face to face. You can get things done if you really want to. It is just that most people are more content to sit on their couch and complain.", 
        "intTime": 20090312, 
        "postID": 12, 
        "quote": "", 
        "reply": "My rep most certainly does listen to me. I talk to him almost every week. And, he votes almost entirely in line with my frame of mind. When he doesn't, the first thing he says to me is, \"ok Joe, I can explain my position on that issue\". And, he does just that. I also keep in contact with my old Representative and the Representative where I do most of my volunteer work. They know me pretty well. As for my Senators, Voinovich is a pretty cool cat and I have spoke with him quite often. But, he is retiring. Brown is a POS. He dreads my call and avoids it at all costs. So, anytime I am in DC for a convention or he is here in Ohio I make it a point to see him face to face. You can get things done if you really want to. It is just that most people are more content to sit on their couch and complain.", 
        "threadID": "672198221_1850046712001", 
        "time": "2009-03-12 16:29:00", 
        "title": "Political Job Approvals", 
        "userID": "10Tenths"
    }, 
    {
        "content": "quote: Originally posted by 10tenths: My rep most certainly does listen to me. I talk to him almost every week. And, he votes almost entirely in line with my frame of mind. When he doesn't, the first thing he says to me is, \"ok Joe, I can explain my position on that issue\". And, he does just that. I also keep in contact with my old Representative and the Representative where I do most of my volunteer work. They know me pretty well. As for my Senators, Voinovich is a pretty cool cat and I have spoke with him quite often. But, he is retiring. Brown is a POS. He dreads my call and avoids it at all costs. So, anytime I am in DC for a convention or he is here in Ohio I make it a point to see him face to face. You can get things done if you really want to. It is just that most people are more content to sit on their couch and complain. Thats great! Then please do this for yourself, your country and your offspring. Tell them you want the fairtax. Lets see how well he listens to you. If you believe in the fairtax of course. But I often ask myself why no one in this nation would not believe in it and rather trust a system that is and has been broken since inseption in 1913.", 
        "intTime": 20090312, 
        "postID": 13, 
        "quote": "Originally posted by 10tenths: My rep most certainly does listen to me. I talk to him almost every week. And, he votes almost entirely in line with my frame of mind. When he doesn't, the first thing he says to me is, \"ok Joe, I can explain my position on that issue\". And, he does just that. I also keep in contact with my old Representative and the Representative where I do most of my volunteer work. They know me pretty well. As for my Senators, Voinovich is a pretty cool cat and I have spoke with him quite often. But, he is retiring. Brown is a POS. He dreads my call and avoids it at all costs. So, anytime I am in DC for a convention or he is here in Ohio I make it a point to see him face to face. You can get things done if you really want to. It is just that most people are more content to sit on their couch and complain.", 
        "reply": " Thats great! Then please do this for yourself, your country and your offspring. Tell them you want the fairtax. Lets see how well he listens to you. If you believe in the fairtax of course. But I often ask myself why no one in this nation would not believe in it and rather trust a system that is and has been broken since inseption in 1913.", 
        "threadID": "672198221_1850046712001", 
        "time": "2009-03-12 16:54:00", 
        "title": "Political Job Approvals", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "I may. But, I am still skeptical of what I would actually pay per year as apposed to what I pay now (5%-9%). Also, if it does pass, it will cease to exist after 7 years if the 16th amendment is not repealed in that same amount of time.", 
        "intTime": 20090312, 
        "postID": 14, 
        "quote": "", 
        "reply": "I may. But, I am still skeptical of what I would actually pay per year as apposed to what I pay now (5%-9%). Also, if it does pass, it will cease to exist after 7 years if the 16th amendment is not repealed in that same amount of time.", 
        "threadID": "672198221_1850046712001", 
        "time": "2009-03-12 17:08:00", 
        "title": "Political Job Approvals", 
        "userID": "10Tenths"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: quote: Originally posted by busnrete8: One Republican Senator in Florida and one Democrat Senator. I sent an email to both thanking the Republican for his NAY vote on the Budget Bill and asked the Democrat Senator for his immediate resignation due to incredibly poor leadership. He hasn't responded yet! well i did the same thing but to mel martenze(sp)... but for his support of obama and not launching an investigation into obama birth records....and he will loose his job come election time... I've been writing Senator Nelson for years and he usually (office staff) response. He use to have a monthly news letter but haven't seen it since before the great disaster of 2008, election day. Nelson's pledge for bi-partisan support before his last election (2006)caught my attention and wrote him that was the way to go. As soon as the election was over he high tails to Syria to show up Bush and push Democrats foreign policy. His trip to Venezuela was an embarassment to him and to Floridians. Often pointed to his Army service record and NASA astronaut experience as a sign of respect but his allegience to Party, party, party, gets old. Why have 535 members of Congress when two could do as well. Being dictated by non elected RNC and DNC and political hacks is not exactly my idea of democracy. Anyway, Mel Martinez is retiring the next election. I've notice those that are half way decent make that a habit, while we are stuck with ear markers and briberys.", 
        "intTime": 20090312, 
        "postID": 15, 
        "quote": "Originally posted by outlaws93: quote: Originally posted by busnrete8: One Republican Senator in Florida and one Democrat Senator. I sent an email to both thanking the Republican for his NAY vote on the Budget Bill and asked the Democrat Senator for his immediate resignation due to incredibly poor leadership. He hasn't responded yet! well i did the same thing but to mel martenze(sp)... but for his support of obama and not launching an investigation into obama birth records....and he will loose his job come election time...", 
        "reply": " I've been writing Senator Nelson for years and he usually (office staff) response. He use to have a monthly news letter but haven't seen it since before the great disaster of 2008, election day. Nelson's pledge for bi-partisan support before his last election (2006)caught my attention and wrote him that was the way to go. As soon as the election was over he high tails to Syria to show up Bush and push Democrats foreign policy. His trip to Venezuela was an embarassment to him and to Floridians. Often pointed to his Army service record and NASA astronaut experience as a sign of respect but his allegience to Party, party, party, gets old. Why have 535 members of Congress when two could do as well. Being dictated by non elected RNC and DNC and political hacks is not exactly my idea of democracy. Anyway, Mel Martinez is retiring the next election. I've notice those that are half way decent make that a habit, while we are stuck with ear markers and briberys.", 
        "threadID": "672198221_1850046712001", 
        "time": "2009-03-12 18:03:00", 
        "title": "Political Job Approvals", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "No disrespect but the President is averaging around 60% approval rating, Congress is a joke and not too many like seeing the country going down the sewer. One thing they don't tell you every President since Reagan experienced the same approval ratings, even better, early in their first term in office. Given time, I'm sure the President can match Lincoln, Jackson, Truman and Bush before he's through. All experienced a downturn. Sometimes it just means he's doing his job.", 
        "intTime": 20090312, 
        "postID": 16, 
        "quote": "", 
        "reply": "No disrespect but the President is averaging around 60% approval rating, Congress is a joke and not too many like seeing the country going down the sewer. One thing they don't tell you every President since Reagan experienced the same approval ratings, even better, early in their first term in office. Given time, I'm sure the President can match Lincoln, Jackson, Truman and Bush before he's through. All experienced a downturn. Sometimes it just means he's doing his job.", 
        "threadID": "672198221_1850046712001", 
        "time": "2009-03-12 18:12:00", 
        "title": "Political Job Approvals", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: quote: Originally posted by L0A1: CJ, we don't always see eye to eye, however this I agree with 100% I believe we need the libatarian party to get moving in America. I took a side for a reason. That reason was to show some people that are fighting for the republican party is just as dumb as fighting for the Democratic party. The Kings and Queens we have on Capital hill need to go as long as they affiliate themselves with either one of those parties and continue to do things in their best political interest instead of what is right for the nation. But nooooo, every 4 years we get to hear a Dem or a Rep stand up and make great speeches, then the people split and support candidates just because of party affiliation. What they say does not really mean squat except that it sounds good and makes us feel good for a time. We probably enjoy 1/4 (if that much) of the freedoms and liberties our founders had because of both these parties. You can not support a party that supports 100% corporate take over of American rights and freedoms as individuals without backlash no more than you can support a part that believes in taking from one and giving to another. Americans as free and independent men in this nation have been enslaved by the Corporate rulers as well as have been driven to become one of those rules or get \"punished\" as well and I am getting back the only way I know how and can legally do so. With my vote. Continue to fight this voter at the poll and this voter will continue down the same path of resistance or actually the most hurtful one. A man that has a right to be treated as individual in the same breath they steal a mans liberties with disrespect and dishonor by not allowing himself to defend those very things in which blood was shed. Honor, Respect and Dignity, American Style. In the old days that would have been settled out back between 2 men. Corporate and Federal Enslavement go hand in hand to me. Reps support both of those concepts. The Dems support the Federal Enslavement at the same time hold a hand out to the average American who gets the brunt of the beating by the Corporations while enslaving them with more government. As I have said before and will continue to say until I die. We can not be the nation we are suppose to be if we do not act like the nation we are suppose to be. Quit running to mama government every time little company does not get his way. Taking my hard earned money in taxes and keeping it or not paying me a decent living wage is the same thing in my eyes. If I work my azz off for it, then I deserve some of the returns no matter what I am doing. If a Company prospers, then all hard workers should prosper and fire the no loads, union or not, hourly or salary. What our nation/government does among the rest of the world should have a direct benefit back to this nation in some way shape or form and not just the elite using tax payer money and government power to accomplish. I am sick and tired of seeing our government do things that only supports a false since of economic success as a economic super power when quite the opposite has been PROVEN without a shadow of doubt that it does not work and only adds to the eventual economic fall of a nation like we have seen. No one will get every thing, but we all deserve some thing and that's the country we once had with an opprtunity to live and raise a decent family and most of all BE FREE. The LP never gets invited to the debates. People aren't going to vote for somebody they can't see or hear. That is the problem with the media. They direct our behavior. They say we only need a Repub and a Dem up there on stage. I guess if you get enough Independents and others in Congress then they will have to recognize this. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090314, 
        "postID": 17, 
        "quote": "Originally posted by crackerjacks61: quote: Originally posted by L0A1: CJ, we don't always see eye to eye, however this I agree with 100% I believe we need the libatarian party to get moving in America. I took a side for a reason. That reason was to show some people that are fighting for the republican party is just as dumb as fighting for the Democratic party. The Kings and Queens we have on Capital hill need to go as long as they affiliate themselves with either one of those parties and continue to do things in their best political interest instead of what is right for the nation. But nooooo, every 4 years we get to hear a Dem or a Rep stand up and make great speeches, then the people split and support candidates just because of party affiliation. What they say does not really mean squat except that it sounds good and makes us feel good for a time. We probably enjoy 1/4 (if that much) of the freedoms and liberties our founders had because of both these parties. You can not support a party that supports 100% corporate take over of American rights and freedoms as individuals without backlash no more than you can support a part that believes in taking from one and giving to another. Americans as free and independent men in this nation have been enslaved by the Corporate rulers as well as have been driven to become one of those rules or get \"punished\" as well and I am getting back the only way I know how and can legally do so. With my vote. Continue to fight this voter at the poll and this voter will continue down the same path of resistance or actually the most hurtful one. A man that has a right to be treated as individual in the same breath they steal a mans liberties with disrespect and dishonor by not allowing himself to defend those very things in which blood was shed. Honor, Respect and Dignity, American Style. In the old days that would have been settled out back between 2 men. Corporate and Federal Enslavement go hand in hand to me. Reps support both of those concepts. The Dems support the Federal Enslavement at the same time hold a hand out to the average American who gets the brunt of the beating by the Corporations while enslaving them with more government. As I have said before and will continue to say until I die. We can not be the nation we are suppose to be if we do not act like the nation we are suppose to be. Quit running to mama government every time little company does not get his way. Taking my hard earned money in taxes and keeping it or not paying me a decent living wage is the same thing in my eyes. If I work my azz off for it, then I deserve some of the returns no matter what I am doing. If a Company prospers, then all hard workers should prosper and fire the no loads, union or not, hourly or salary. What our nation/government does among the rest of the world should have a direct benefit back to this nation in some way shape or form and not just the elite using tax payer money and government power to accomplish. I am sick and tired of seeing our government do things that only supports a false since of economic success as a economic super power when quite the opposite has been PROVEN without a shadow of doubt that it does not work and only adds to the eventual economic fall of a nation like we have seen. No one will get every thing, but we all deserve some thing and that's the country we once had with an opprtunity to live and raise a decent family and most of all BE FREE.", 
        "reply": " The LP never gets invited to the debates. People aren't going to vote for somebody they can't see or hear. That is the problem with the media. They direct our behavior. They say we only need a Repub and a Dem up there on stage. I guess if you get enough Independents and others in Congress then they will have to recognize this. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_1850046712001", 
        "time": "2009-03-14 05:00:00", 
        "title": "Political Job Approvals", 
        "userID": "Anbar7"
    }
]