[
    {
        "content": "- A very compelling Op-Ed about the need to cease drone operations in Pakistan. It’s co-written by a man who knows, too (clipped from wiki): quote: David Kilcullen, Ph.D. (born 1967) is a contemporary practitioner and theorist of counterinsurgency and counterterrorism. A former Australian Army officer, he left that army as a lieutenant colonel in 2005 and now works for the United States State Department. During 2007 he served in Iraq as Senior Counterinsurgency Adviser, Multi-National Force - Iraq, a civilian position on the personal staff of U.S. Army General David Howell Petraeus, responsible for planning and executing the 2007-8 Joint Campaign Plan, which drove the Iraq War troop surge of 2007. [snip] He is reputed to be independent, non-political and outspoken, a trait that has apparently given him significant credibility with senior officials and leaders from both sides of American politics. From the article: quote: Imagine, for example, that burglars move into a neighborhood. If the police were to start blowing up people’s houses from the air, would this convince homeowners to rise up against the burglars? Wouldn’t it be more likely to turn the whole population against the police? And if their neighbors wanted to turn the burglars in, how would they do that, exactly? Yet this is the same basic logic underlying the drone war. Very, very interesting indeed. And while I have your attention, is there any chance there could be a few more military -themed discussions here? Most of them seem to be about gays, guns rights and Miss California's boob job these days. This IS military.com right? -", 
        "intTime": 20090517, 
        "postID": 1, 
        "quote": "David Kilcullen, Ph.D. (born 1967) is a contemporary practitioner and theorist of counterinsurgency and counterterrorism. A former Australian Army officer, he left that army as a lieutenant colonel in 2005 and now works for the United States State Department. During 2007 he served in Iraq as Senior Counterinsurgency Adviser, Multi-National Force - Iraq, a civilian position on the personal staff of U.S. Army General David Howell Petraeus, responsible for planning and executing the 2007-8 Joint Campaign Plan, which drove the Iraq War troop surge of 2007. [snip] He is reputed to be independent, non-political and outspoken, a trait that has apparently given him significant credibility with senior officials and leaders from both sides of American politics.", 
        "reply": "- A very compelling Op-Ed about the need to cease drone operations in Pakistan. It’s co-written by a man who knows, too (clipped from wiki):  From the article: quote: Imagine, for example, that burglars move into a neighborhood. If the police were to start blowing up people’s houses from the air, would this convince homeowners to rise up against the burglars? Wouldn’t it be more likely to turn the whole population against the police? And if their neighbors wanted to turn the burglars in, how would they do that, exactly? Yet this is the same basic logic underlying the drone war. Very, very interesting indeed. And while I have your attention, is there any chance there could be a few more military -themed discussions here? Most of them seem to be about gays, guns rights and Miss California's boob job these days. This IS military.com right? -", 
        "threadID": "672198221_7560084322001", 
        "time": "2009-05-17 00:31:00", 
        "title": "Expert: end drone attacks in Pakistan", 
        "userID": "ANZACbiscuit"
    }, 
    {
        "content": "quote: Originally posted by ANZACbiscuit: - A very compelling Op-Ed about the need to cease drone operations in Pakistan. It’s co-written by a man who knows, too (clipped from wiki): quote: David Kilcullen, Ph.D. (born 1967) is a contemporary practitioner and theorist of counterinsurgency and counterterrorism. A former Australian Army officer, he left that army as a lieutenant colonel in 2005 and now works for the United States State Department. During 2007 he served in Iraq as Senior Counterinsurgency Adviser, Multi-National Force - Iraq, a civilian position on the personal staff of U.S. Army General David Howell Petraeus, responsible for planning and executing the 2007-8 Joint Campaign Plan, which drove the Iraq War troop surge of 2007. [snip] He is reputed to be independent, non-political and outspoken, a trait that has apparently given him significant credibility with senior officials and leaders from both sides of American politics. From the article: quote: Imagine, for example, that burglars move into a neighborhood. If the police were to start blowing up people’s houses from the air, would this convince homeowners to rise up against the burglars? Wouldn’t it be more likely to turn the whole population against the police? And if their neighbors wanted to turn the burglars in, how would they do that, exactly? Yet this is the same basic logic underlying the drone war. Very, very interesting indeed. And while I have your attention, is there any chance there could be a few more military -themed discussions here? Most of them seem to be about gays, guns rights and Miss California's boob job these days. This IS military.com right? - The 'personal touch' doesn't seem to be any more effective. Prone as they are to 'bad intel', fog of war and unrestrained firing in enclosed spaces, night raids appear to be spectacular failures in eliminating AQ/Taliban fighters or hastening victory. Some of the notable civilian 'massacres' have come as a result of mano a mano take-outs. With a bomb or rocket you can always blame a wonky servo-motor.", 
        "intTime": 20090517, 
        "postID": 2, 
        "quote": "Originally posted by ANZACbiscuit: - A very compelling Op-Ed about the need to cease drone operations in Pakistan. It’s co-written by a man who knows, too (clipped from wiki): quote: David Kilcullen, Ph.D. (born 1967) is a contemporary practitioner and theorist of counterinsurgency and counterterrorism. A former Australian Army officer, he left that army as a lieutenant colonel in 2005 and now works for the United States State Department. During 2007 he served in Iraq as Senior Counterinsurgency Adviser, Multi-National Force - Iraq, a civilian position on the personal staff of U.S. Army General David Howell Petraeus, responsible for planning and executing the 2007-8 Joint Campaign Plan, which drove the Iraq War troop surge of 2007. [snip] He is reputed to be independent, non-political and outspoken, a trait that has apparently given him significant credibility with senior officials and leaders from both sides of American politics. From the article: quote: Imagine, for example, that burglars move into a neighborhood. If the police were to start blowing up people’s houses from the air, would this convince homeowners to rise up against the burglars? Wouldn’t it be more likely to turn the whole population against the police? And if their neighbors wanted to turn the burglars in, how would they do that, exactly? Yet this is the same basic logic underlying the drone war. Very, very interesting indeed. And while I have your attention, is there any chance there could be a few more military -themed discussions here? Most of them seem to be about gays, guns rights and Miss California's boob job these days. This IS military.com right? -", 
        "reply": " The 'personal touch' doesn't seem to be any more effective. Prone as they are to 'bad intel', fog of war and unrestrained firing in enclosed spaces, night raids appear to be spectacular failures in eliminating AQ/Taliban fighters or hastening victory. Some of the notable civilian 'massacres' have come as a result of mano a mano take-outs. With a bomb or rocket you can always blame a wonky servo-motor.", 
        "threadID": "672198221_7560084322001", 
        "time": "2009-05-17 06:36:00", 
        "title": "Expert: end drone attacks in Pakistan", 
        "userID": "popsiq"
    }, 
    {
        "content": "quote: Imagine, for example, that burglars move into a neighborhood. If the police were to start blowing up people’s houses from the air, would this convince homeowners to rise up against the burglars? Wouldn’t it be more likely to turn the whole population against the police? And if their neighbors wanted to turn the burglars in, how would they do that, exactly? Yet this is the same basic logic underlying the drone war. That analogy doesn't describe the current situation in Pakistan with regards to Al Quaeda and other Islamic extremists. A better analogy would be: Your allow your cousin Vinny and his buddies (who are wanted by 48 of the 50 states and a few foreign countries for mass murder and the like) to move into your home - and then wonder why the cops come bust down your door and slam you (and everybody else in the house) to the ground at gunpoint in a midnight no-knock raid.", 
        "intTime": 20090517, 
        "postID": 3, 
        "quote": "Imagine, for example, that burglars move into a neighborhood. If the police were to start blowing up people’s houses from the air, would this convince homeowners to rise up against the burglars? Wouldn’t it be more likely to turn the whole population against the police? And if their neighbors wanted to turn the burglars in, how would they do that, exactly? Yet this is the same basic logic underlying the drone war.", 
        "reply": " That analogy doesn't describe the current situation in Pakistan with regards to Al Quaeda and other Islamic extremists. A better analogy would be: Your allow your cousin Vinny and his buddies (who are wanted by 48 of the 50 states and a few foreign countries for mass murder and the like) to move into your home - and then wonder why the cops come bust down your door and slam you (and everybody else in the house) to the ground at gunpoint in a midnight no-knock raid.", 
        "threadID": "672198221_7560084322001", 
        "time": "2009-05-17 06:41:00", 
        "title": "Expert: end drone attacks in Pakistan", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: quote: Imagine, for example, that burglars move into a neighborhood. If the police were to start blowing up people’s houses from the air, would this convince homeowners to rise up against the burglars? Wouldn’t it be more likely to turn the whole population against the police? And if their neighbors wanted to turn the burglars in, how would they do that, exactly? Yet this is the same basic logic underlying the drone war. That analogy doesn't describe the current situation in Pakistan with regards to Al Quaeda and other Islamic extremists. A better analogy would be: Your allow your cousin Vinny and his buddies (who are wanted by 48 of the 50 states and a few foreign countries for mass murder and the like) to move into your home - and then wonder why the cops come bust down your door and slam you (and everybody else in the house) to the ground at gunpoint in a midnight no-knock raid. You are making the assumption that people \"allow\" Talibs to set up in their villages. Mostly they don't, the Taliban turn up mob handed with RPGs and AK47s and \"request\" in the name of Allah that you let them in (in the same way that Vinny and his mates will hold a gun to your head). The villagers haven't got much choice in the matter, they are virtual hostages.", 
        "intTime": 20090517, 
        "postID": 4, 
        "quote": "Originally posted by PhoenixDark: quote: Imagine, for example, that burglars move into a neighborhood. If the police were to start blowing up people’s houses from the air, would this convince homeowners to rise up against the burglars? Wouldn’t it be more likely to turn the whole population against the police? And if their neighbors wanted to turn the burglars in, how would they do that, exactly? Yet this is the same basic logic underlying the drone war. That analogy doesn't describe the current situation in Pakistan with regards to Al Quaeda and other Islamic extremists. A better analogy would be: Your allow your cousin Vinny and his buddies (who are wanted by 48 of the 50 states and a few foreign countries for mass murder and the like) to move into your home - and then wonder why the cops come bust down your door and slam you (and everybody else in the house) to the ground at gunpoint in a midnight no-knock raid.", 
        "reply": " You are making the assumption that people \"allow\" Talibs to set up in their villages. Mostly they don't, the Taliban turn up mob handed with RPGs and AK47s and \"request\" in the name of Allah that you let them in (in the same way that Vinny and his mates will hold a gun to your head). The villagers haven't got much choice in the matter, they are virtual hostages.", 
        "threadID": "672198221_7560084322001", 
        "time": "2009-05-17 08:26:00", 
        "title": "Expert: end drone attacks in Pakistan", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "Same gentleman wrote another op-ed in the New York Times (David Kilcullen, counterinsurgency adviser to Gen. David Petraeus from 2006 to 2008.) quote: Excerpt: The appeal of drone attacks for policy makers is clear. For one thing, their effects are measurable. Military commanders and intelligence officials point out that drone attacks have disrupted terrorist networks in Pakistan, killing key leaders and hampering operations. Drone attacks create a sense of insecurity among militants and constrain their interactions with suspected informers. And, because they kill remotely, drone strikes avoid American casualties. But on balance, the costs outweigh these benefits for three reasons. First, the drone war has created a siege mentality among Pakistani civilians. This is similar to what happened in Somalia in 2005 and 2006, when similar strikes were employed against the forces of the Union of Islamic Courts. While the strikes did kill individual militants who were the targets, public anger over the American show of force solidified the power of extremists. The Islamists’ popularity rose and the group became more extreme, leading eventually to a messy Ethiopian military intervention, the rise of a new regional insurgency and an increase in offshore piracy. While violent extremists may be unpopular, for a frightened population they seem less ominous than a faceless enemy that wages war from afar and often kills more civilians than militants. Press reports suggest that over the last three years drone strikes have killed about 14 terrorist leaders. But, according to Pakistani sources, they have also killed some 700 civilians. This is 50 civilians for every militant killed, a hit rate of 2 percent — hardly “precision.” American officials vehemently dispute these figures, and it is likely that more militants and fewer civilians have been killed than is reported by the press in Pakistan. Nevertheless, every one of these dead noncombatants represents an alienated family, a new desire for revenge, and more recruits for a militant movement that has grown exponentially even as drone strikes have increased. Second, public outrage at the strikes is hardly limited to the region in which they take place — areas of northwestern Pakistan where ethnic Pashtuns predominate. Rather, the strikes are now exciting visceral opposition across a broad spectrum of Pakistani opinion in Punjab and Sindh, the nation’s two most populous provinces. Covered extensively by the news media, drone attacks are popularly believed to have caused even more civilian casualties than is actually the case. The persistence of these attacks on Pakistani territory offends people’s deepest sensibilities, alienates them from their government, and contributes to Pakistan’s instability. Third, the use of drones displays every characteristic of a tactic — or, more accurately, a piece of technology — substituting for a strategy. These attacks are now being carried out without a concerted information campaign directed at the Pakistani public or a real effort to understand the tribal dynamics of the local population, efforts that might make such attacks more effective.", 
        "intTime": 20090517, 
        "postID": 5, 
        "quote": "Excerpt: The appeal of drone attacks for policy makers is clear. For one thing, their effects are measurable. Military commanders and intelligence officials point out that drone attacks have disrupted terrorist networks in Pakistan, killing key leaders and hampering operations. Drone attacks create a sense of insecurity among militants and constrain their interactions with suspected informers. And, because they kill remotely, drone strikes avoid American casualties. But on balance, the costs outweigh these benefits for three reasons. First, the drone war has created a siege mentality among Pakistani civilians. This is similar to what happened in Somalia in 2005 and 2006, when similar strikes were employed against the forces of the Union of Islamic Courts. While the strikes did kill individual militants who were the targets, public anger over the American show of force solidified the power of extremists. The Islamists’ popularity rose and the group became more extreme, leading eventually to a messy Ethiopian military intervention, the rise of a new regional insurgency and an increase in offshore piracy. While violent extremists may be unpopular, for a frightened population they seem less ominous than a faceless enemy that wages war from afar and often kills more civilians than militants. Press reports suggest that over the last three years drone strikes have killed about 14 terrorist leaders. But, according to Pakistani sources, they have also killed some 700 civilians. This is 50 civilians for every militant killed, a hit rate of 2 percent — hardly “precision.” American officials vehemently dispute these figures, and it is likely that more militants and fewer civilians have been killed than is reported by the press in Pakistan. Nevertheless, every one of these dead noncombatants represents an alienated family, a new desire for revenge, and more recruits for a militant movement that has grown exponentially even as drone strikes have increased. Second, public outrage at the strikes is hardly limited to the region in which they take place — areas of northwestern Pakistan where ethnic Pashtuns predominate. Rather, the strikes are now exciting visceral opposition across a broad spectrum of Pakistani opinion in Punjab and Sindh, the nation’s two most populous provinces. Covered extensively by the news media, drone attacks are popularly believed to have caused even more civilian casualties than is actually the case. The persistence of these attacks on Pakistani territory offends people’s deepest sensibilities, alienates them from their government, and contributes to Pakistan’s instability. Third, the use of drones displays every characteristic of a tactic — or, more accurately, a piece of technology — substituting for a strategy. These attacks are now being carried out without a concerted information campaign directed at the Pakistani public or a real effort to understand the tribal dynamics of the local population, efforts that might make such attacks more effective.", 
        "reply": "Same gentleman wrote another op-ed in the New York Times (David Kilcullen, counterinsurgency adviser to Gen. David Petraeus from 2006 to 2008.) ", 
        "threadID": "672198221_7560084322001", 
        "time": "2009-05-17 08:50:00", 
        "title": "Expert: end drone attacks in Pakistan", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "quote: Originally posted by AngelHeart: Same gentleman wrote another op-ed in the New York Times (David Kilcullen, counterinsurgency adviser to Gen. David Petraeus from 2006 to 2008.) Oops, yeah, same article... just forgot to mention source. -", 
        "intTime": 20090518, 
        "postID": 6, 
        "quote": "Originally posted by AngelHeart: Same gentleman wrote another op-ed in the New York Times (David Kilcullen, counterinsurgency adviser to Gen. David Petraeus from 2006 to 2008.)", 
        "reply": " Oops, yeah, same article... just forgot to mention source. -", 
        "threadID": "672198221_7560084322001", 
        "time": "2009-05-18 03:09:00", 
        "title": "Expert: end drone attacks in Pakistan", 
        "userID": "ANZACbiscuit"
    }, 
    {
        "content": "A number examples in my own neighborhood. I'll only bore you with one. Street corner sales inc. Business was brisk and 24/7. Friend called the police with no results and when he and the neighbors confronted the street vendors eyeball to eyeball guess who shows up. The salesman were undercover cops, but the morale to the story you do something about the situation. That's what General Petraeus relied on with the Sunni home front, Enabling, against the Al Qaeda in Iraq. Applying the same rule of thumb. Sharia Law extremist won't be leaving without a shove towards the door. Islamabad knows this now after decades of playing footsie with them. Drone attacks? What about F-16, F-18 and occassional C-130? Next you'll be wanting the semi-automomous region Waziristan ceded over to Omar and Ben Laden. Give them an inch and they'll take a mile, including the capital of the country. This has happoen so often a blind man can see.", 
        "intTime": 20090518, 
        "postID": 7, 
        "quote": "", 
        "reply": "A number examples in my own neighborhood. I'll only bore you with one. Street corner sales inc. Business was brisk and 24/7. Friend called the police with no results and when he and the neighbors confronted the street vendors eyeball to eyeball guess who shows up. The salesman were undercover cops, but the morale to the story you do something about the situation. That's what General Petraeus relied on with the Sunni home front, Enabling, against the Al Qaeda in Iraq. Applying the same rule of thumb. Sharia Law extremist won't be leaving without a shove towards the door. Islamabad knows this now after decades of playing footsie with them. Drone attacks? What about F-16, F-18 and occassional C-130? Next you'll be wanting the semi-automomous region Waziristan ceded over to Omar and Ben Laden. Give them an inch and they'll take a mile, including the capital of the country. This has happoen so often a blind man can see.", 
        "threadID": "672198221_7560084322001", 
        "time": "2009-05-18 13:43:00", 
        "title": "Expert: end drone attacks in Pakistan", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "I have not had time to research this but has the author made any suggestions or operational plans or other solutions on how to deal with the issue of bad guys in Pakistan if we stop the drone attacks? Yes, they can be destabilizing, but what are the choices?", 
        "intTime": 20090519, 
        "postID": 8, 
        "quote": "", 
        "reply": "I have not had time to research this but has the author made any suggestions or operational plans or other solutions on how to deal with the issue of bad guys in Pakistan if we stop the drone attacks? Yes, they can be destabilizing, but what are the choices?", 
        "threadID": "672198221_7560084322001", 
        "time": "2009-05-19 13:07:00", 
        "title": "Expert: end drone attacks in Pakistan", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by sw614: I have not had time to research this but has the author made any suggestions or operational plans or other solutions on how to deal with the issue of bad guys in Pakistan if we stop the drone attacks? Yes, they can be destabilizing, but what are the choices? He ends the article with the standard COIN strategy. Which, you know, makes sense. quote: The goal should be to isolate extremists from the communities in which they live. The best way to do this is to adopt policies that build local partnerships. Al Qaeda and its Taliban allies must be defeated by indigenous forces — not from the United States, and not even from Punjab, but from the parts of Pakistan in which they now hide. -", 
        "intTime": 20090520, 
        "postID": 9, 
        "quote": "Originally posted by sw614: I have not had time to research this but has the author made any suggestions or operational plans or other solutions on how to deal with the issue of bad guys in Pakistan if we stop the drone attacks? Yes, they can be destabilizing, but what are the choices?", 
        "reply": " He ends the article with the standard COIN strategy. Which, you know, makes sense. quote: The goal should be to isolate extremists from the communities in which they live. The best way to do this is to adopt policies that build local partnerships. Al Qaeda and its Taliban allies must be defeated by indigenous forces — not from the United States, and not even from Punjab, but from the parts of Pakistan in which they now hide. -", 
        "threadID": "672198221_7560084322001", 
        "time": "2009-05-20 23:07:00", 
        "title": "Expert: end drone attacks in Pakistan", 
        "userID": "ANZACbiscuit"
    }, 
    {
        "content": "quote: Originally posted by ANZACbiscuit: quote: Originally posted by sw614: I have not had time to research this but has the author made any suggestions or operational plans or other solutions on how to deal with the issue of bad guys in Pakistan if we stop the drone attacks? Yes, they can be destabilizing, but what are the choices? He ends the article with the standard COIN strategy. Which, you know, makes sense. quote: The goal should be to isolate extremists from the communities in which they live. The best way to do this is to adopt policies that build local partnerships. Al Qaeda and its Taliban allies must be defeated by indigenous forces — not from the United States, and not even from Punjab, but from the parts of Pakistan in which they now hide. - So win the hearts and minds of those who like getting help and money from both sides? Or making agreements with local factions so we can help each other only to actually get lackluster support as in blocking escape routes at Tora Bora? While the COIN answer appears logical and worth a try, its chance of success in real life, given the different factions, families, loose cooalitions, etc., are iffy. I agree that Pakistani forces need to be the ones who clear the region, but their government seemed unwilling to take action until recently. The Pakistani government allowed the Taliban and Al Queda to take root and let the situation fester until it was apparent that the governments very existance was in jeopardy. If Pakistan is now serious about taking on the bad guys and not trying for peaceful coexistance, which had zero chance of success, then maybe we can back off. But that is up to them.", 
        "intTime": 20090521, 
        "postID": 10, 
        "quote": "Originally posted by ANZACbiscuit: quote: Originally posted by sw614: I have not had time to research this but has the author made any suggestions or operational plans or other solutions on how to deal with the issue of bad guys in Pakistan if we stop the drone attacks? Yes, they can be destabilizing, but what are the choices? He ends the article with the standard COIN strategy. Which, you know, makes sense. quote: The goal should be to isolate extremists from the communities in which they live. The best way to do this is to adopt policies that build local partnerships. Al Qaeda and its Taliban allies must be defeated by indigenous forces — not from the United States, and not even from Punjab, but from the parts of Pakistan in which they now hide. -", 
        "reply": " So win the hearts and minds of those who like getting help and money from both sides? Or making agreements with local factions so we can help each other only to actually get lackluster support as in blocking escape routes at Tora Bora? While the COIN answer appears logical and worth a try, its chance of success in real life, given the different factions, families, loose cooalitions, etc., are iffy. I agree that Pakistani forces need to be the ones who clear the region, but their government seemed unwilling to take action until recently. The Pakistani government allowed the Taliban and Al Queda to take root and let the situation fester until it was apparent that the governments very existance was in jeopardy. If Pakistan is now serious about taking on the bad guys and not trying for peaceful coexistance, which had zero chance of success, then maybe we can back off. But that is up to them.", 
        "threadID": "672198221_7560084322001", 
        "time": "2009-05-21 09:14:00", 
        "title": "Expert: end drone attacks in Pakistan", 
        "userID": "sw614"
    }, 
    {
        "content": "Its called the lolly pop effect...", 
        "intTime": 20090521, 
        "postID": 11, 
        "quote": "", 
        "reply": "Its called the lolly pop effect...", 
        "threadID": "672198221_7560084322001", 
        "time": "2009-05-21 12:44:00", 
        "title": "Expert: end drone attacks in Pakistan", 
        "userID": "dman1948"
    }, 
    {
        "content": "quote: Originally posted by sw614: So win the hearts and minds of those who like getting help and money from both sides? No, there's no winning the hearts and minds of terrorists/militants/fanatics. They need to be wiped out. But remember, like all other human beings, 99% of the people in that region just want to earn a buck, send their kids to school and live in peace. They need to be won over with aid and development etc, not have hi-ex dropped on them, which just creates more terrorists/militants/fanatics. PS: I wish more discussion were like this on Mil.com. Too much azzcrud about Bristol Palin, gays and gun rights! -", 
        "intTime": 20090521, 
        "postID": 12, 
        "quote": "Originally posted by sw614: So win the hearts and minds of those who like getting help and money from both sides?", 
        "reply": " No, there's no winning the hearts and minds of terrorists/militants/fanatics. They need to be wiped out. But remember, like all other human beings, 99% of the people in that region just want to earn a buck, send their kids to school and live in peace. They need to be won over with aid and development etc, not have hi-ex dropped on them, which just creates more terrorists/militants/fanatics. PS: I wish more discussion were like this on Mil.com. Too much azzcrud about Bristol Palin, gays and gun rights! -", 
        "threadID": "672198221_7560084322001", 
        "time": "2009-05-21 16:17:00", 
        "title": "Expert: end drone attacks in Pakistan", 
        "userID": "ANZACbiscuit"
    }
]