[
    {
        "content": "\"http://www.cbsnews.com/stories/2009/04/30/politics/main4980134.shtml?tag=topHome;topStories\" AP) An Obama administration policy to go after employers who knowingly hire and exploit illegal workers is not significantly different from the Bush administration strategy, according to a copy of the guidelines, obtained by The Associated Press. The new guidelines for immigration agents, which the Homeland Security Department calls a \"renewed department-wide focus\" will impose fines and criminal charges against employers who break the law. While the priority is to go after employers, the policy states that agents will continue to arrest illegal workers. The Barack Obama policy, however, stresses that humanitarian guidelines will be followed more broadly than in the previous administration. Homeland Security Secretary Janet Napolitano has said that under her leadership the agency will now be focused on \"renewing a priority on employers who are making money off of these illegal immigrants and giving them jobs that should be going to American workers, as opposed to just counting numbers.\" In 2008, Immigration and Customs Enforcement brought criminal charges against 135 employers and 968 workers. In an interview with The Associated Press earlier this month, Napolitano said using investigative tools such as auditing documents employees fill out when they join a company, having illegal workers go undercover and talking to people who regularly interact with the employers are all ways to build a case against a business that hires illegal workers. \"What I want to do is deter more employers from intentionally and knowingly hiring illegal workers,\" Napolitano said.",
        "intTime": 20090430,
        "postID": 1,
        "quote": "",
        "reply": "\"http://www.cbsnews.com/stories/2009/04/30/politics/main4980134.shtml?tag=topHome;topStories\" AP) An Obama administration policy to go after employers who knowingly hire and exploit illegal workers is not significantly different from the Bush administration strategy, according to a copy of the guidelines, obtained by The Associated Press. The new guidelines for immigration agents, which the Homeland Security Department calls a \"renewed department-wide focus\" will impose fines and criminal charges against employers who break the law. While the priority is to go after employers, the policy states that agents will continue to arrest illegal workers. The Barack Obama policy, however, stresses that humanitarian guidelines will be followed more broadly than in the previous administration. Homeland Security Secretary Janet Napolitano has said that under her leadership the agency will now be focused on \"renewing a priority on employers who are making money off of these illegal immigrants and giving them jobs that should be going to American workers, as opposed to just counting numbers.\" In 2008, Immigration and Customs Enforcement brought criminal charges against 135 employers and 968 workers. In an interview with The Associated Press earlier this month, Napolitano said using investigative tools such as auditing documents employees fill out when they join a company, having illegal workers go undercover and talking to people who regularly interact with the employers are all ways to build a case against a business that hires illegal workers. \"What I want to do is deter more employers from intentionally and knowingly hiring illegal workers,\" Napolitano said.",
        "threadID": "672198221_8630091222001",
        "time": "2009-04-30 16:32:00",
        "title": "Government Going After Hiring Of Illegals",
        "userID": "ss_287"
    },
    {
        "content": "It's a start at least.",
        "intTime": 20090430,
        "postID": 2,
        "quote": "",
        "reply": "It's a start at least.",
        "threadID": "672198221_8630091222001",
        "time": "2009-04-30 17:22:00",
        "title": "Government Going After Hiring Of Illegals",
        "userID": "shuman14"
    },
    {
        "content": "in other words, no news here. at least they are not going backwards on enforcement.",
        "intTime": 20090430,
        "postID": 3,
        "quote": "",
        "reply": "in other words, no news here. at least they are not going backwards on enforcement.",
        "threadID": "672198221_8630091222001",
        "time": "2009-04-30 17:35:00",
        "title": "Government Going After Hiring Of Illegals",
        "userID": "FlankerFlyer"
    },
    {
        "content": "Flank, I thought you would be the last person to complain about immigrants taking peoples' jobs. You've always disagreed with me on every single point when I advocated companies that companies hire American workers, or as you call them, yahoos, and replacing them with more educated Indians. quote: Originally posted by FlankerFlyer: in other words, no news here. at least they are not going backwards on enforcement.",
        "intTime": 20090430,
        "postID": 4,
        "quote": "Originally posted by FlankerFlyer: in other words, no news here. at least they are not going backwards on enforcement.",
        "reply": "Flank, I thought you would be the last person to complain about immigrants taking peoples' jobs. You've always disagreed with me on every single point when I advocated companies that companies hire American workers, or as you call them, yahoos, and replacing them with more educated Indians. ",
        "threadID": "672198221_8630091222001",
        "time": "2009-04-30 21:13:00",
        "title": "Government Going After Hiring Of Illegals",
        "userID": "cybercafe"
    },
    {
        "content": "quote: Originally posted by FlankerFlyer: in other words, no news here. at least they are not going backwards on enforcement. Pretty much what I was going to say.",
        "intTime": 20090501,
        "postID": 5,
        "quote": "Originally posted by FlankerFlyer: in other words, no news here. at least they are not going backwards on enforcement.",
        "reply": " Pretty much what I was going to say.",
        "threadID": "672198221_8630091222001",
        "time": "2009-05-01 03:43:00",
        "title": "Government Going After Hiring Of Illegals",
        "userID": "mrmixitup"
    },
    {
        "content": "Where is Pelosi, this is unAmerican, she must be outraged. I bet all those immigrants and illegals that voted for Obama are ****ed now. He was supposed to protect them. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "intTime": 20090501,
        "postID": 6,
        "quote": "",
        "reply": "Where is Pelosi, this is unAmerican, she must be outraged. I bet all those immigrants and illegals that voted for Obama are ****ed now. He was supposed to protect them. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "threadID": "672198221_8630091222001",
        "time": "2009-05-01 05:38:00",
        "title": "Government Going After Hiring Of Illegals",
        "userID": "Anbar7"
    },
    {
        "content": "quote: Originally posted by ss_287: \"http://www.cbsnews.com/stories/2009/04/30/politics/main4980134.shtml?tag=topHome;topStories\" AP) An Obama administration policy to go after employers who knowingly hire and exploit illegal workers is not significantly different from the Bush administration strategy, according to a copy of the guidelines, obtained by The Associated Press. The new guidelines for immigration agents, which the Homeland Security Department calls a \"renewed department-wide focus\" will impose fines and criminal charges against employers who break the law. While the priority is to go after employers, the policy states that agents will continue to arrest illegal workers. The Barack Obama policy, however, stresses that humanitarian guidelines will be followed more broadly than in the previous administration. Homeland Security Secretary Janet Napolitano has said that under her leadership the agency will now be focused on \"renewing a priority on employers who are making money off of these illegal immigrants and giving them jobs that should be going to American workers, as opposed to just counting numbers.\" In 2008, Immigration and Customs Enforcement brought criminal charges against 135 employers and 968 workers. In an interview with The Associated Press earlier this month, Napolitano said using investigative tools such as auditing documents employees fill out when they join a company, having illegal workers go undercover and talking to people who regularly interact with the employers are all ways to build a case against a business that hires illegal workers. \"What I want to do is deter more employers from intentionally and knowingly hiring illegal workers,\" Napolitano said. Hey, you NITWIT! Why are you against E-Verify?! And as we have seen with this Adm, as soon as these businesses are investigated their Illegal employees get visas. Yeh, I bet there is a bog trend in this. This is also the same adm that didnt want any provisions in the bailouts bills to keep the govt from hiring illegals. Spare me the enforcement bs!",
        "intTime": 20090501,
        "postID": 7,
        "quote": "Originally posted by ss_287: \"http://www.cbsnews.com/stories/2009/04/30/politics/main4980134.shtml?tag=topHome;topStories\" AP) An Obama administration policy to go after employers who knowingly hire and exploit illegal workers is not significantly different from the Bush administration strategy, according to a copy of the guidelines, obtained by The Associated Press. The new guidelines for immigration agents, which the Homeland Security Department calls a \"renewed department-wide focus\" will impose fines and criminal charges against employers who break the law. While the priority is to go after employers, the policy states that agents will continue to arrest illegal workers. The Barack Obama policy, however, stresses that humanitarian guidelines will be followed more broadly than in the previous administration. Homeland Security Secretary Janet Napolitano has said that under her leadership the agency will now be focused on \"renewing a priority on employers who are making money off of these illegal immigrants and giving them jobs that should be going to American workers, as opposed to just counting numbers.\" In 2008, Immigration and Customs Enforcement brought criminal charges against 135 employers and 968 workers. In an interview with The Associated Press earlier this month, Napolitano said using investigative tools such as auditing documents employees fill out when they join a company, having illegal workers go undercover and talking to people who regularly interact with the employers are all ways to build a case against a business that hires illegal workers. \"What I want to do is deter more employers from intentionally and knowingly hiring illegal workers,\" Napolitano said. Hey, you NITWIT! Why are you against E-Verify?!",
        "reply": " And as we have seen with this Adm, as soon as these businesses are investigated their Illegal employees get visas. Yeh, I bet there is a bog trend in this. This is also the same adm that didnt want any provisions in the bailouts bills to keep the govt from hiring illegals. Spare me the enforcement bs!",
        "threadID": "672198221_8630091222001",
        "time": "2009-05-01 06:04:00",
        "title": "Government Going After Hiring Of Illegals",
        "userID": "GunnyRet03"
    },
    {
        "content": "Smoke and mirrors! Those illegals are potential voters for the Democrats so they show only a token interest in deporting any of them. Watch as they get amnesty down the line.",
        "intTime": 20090501,
        "postID": 8,
        "quote": "",
        "reply": "Smoke and mirrors! Those illegals are potential voters for the Democrats so they show only a token interest in deporting any of them. Watch as they get amnesty down the line.",
        "threadID": "672198221_8630091222001",
        "time": "2009-05-01 07:15:00",
        "title": "Government Going After Hiring Of Illegals",
        "userID": "Vanir97"
    },
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by FlankerFlyer: in other words, no news here. at least they are not going backwards on enforcement. Pretty much what I was going to say. Having a policy and ACTUALLY enforcing the policy are 2 differentt hings and IMO the Bsuh admin did NOT go after the employers and in fact often protected them. Now we just have to wait and see if the Obama admin actually enforces a policy of going after the employers or just pretends like the Bush admin did.",
        "intTime": 20090501,
        "postID": 9,
        "quote": "Originally posted by mrmixitup: quote: Originally posted by FlankerFlyer: in other words, no news here. at least they are not going backwards on enforcement. Pretty much what I was going to say.",
        "reply": " Having a policy and ACTUALLY enforcing the policy are 2 differentt hings and IMO the Bsuh admin did NOT go after the employers and in fact often protected them. Now we just have to wait and see if the Obama admin actually enforces a policy of going after the employers or just pretends like the Bush admin did.",
        "threadID": "672198221_8630091222001",
        "time": "2009-05-01 12:18:00",
        "title": "Government Going After Hiring Of Illegals",
        "userID": "rayld2"
    },
    {
        "content": "quote: Originally posted by Vanir97: Smoke and mirrors! Those illegals are potential voters for the Democrats so they show only a token interest in deporting any of them. Watch as they get amnesty down the line. Vanir97 You are either VERY ignorant of US voting laws or ae deliberately distorting them so you can attack Mr. Obama. Even if the illegals are given legal residency with a track to citizenship their is NO way they would be citizens in time to ever vote for Mr. Obama for President.",
        "intTime": 20090501,
        "postID": 10,
        "quote": "Originally posted by Vanir97: Smoke and mirrors! Those illegals are potential voters for the Democrats so they show only a token interest in deporting any of them. Watch as they get amnesty down the line.",
        "reply": " Vanir97 You are either VERY ignorant of US voting laws or ae deliberately distorting them so you can attack Mr. Obama. Even if the illegals are given legal residency with a track to citizenship their is NO way they would be citizens in time to ever vote for Mr. Obama for President.",
        "threadID": "672198221_8630091222001",
        "time": "2009-05-01 22:42:00",
        "title": "Government Going After Hiring Of Illegals",
        "userID": "rayld2"
    },
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by Vanir97: Smoke and mirrors! Those illegals are potential voters for the Democrats so they show only a token interest in deporting any of them. Watch as they get amnesty down the line. Vanir97 You are either VERY ignorant of US voting laws or ae deliberately distorting them so you can attack Mr. Obama. Even if the illegals are given legal residency with a track to citizenship their is NO way they would be citizens in time to ever vote for Mr. Obama for President. I will address your comments this way Dude> If you attack me one more time I will notify the moderators and have you barred. Understand? Number two. I am highly educated and am much older than you. I have been around for many years and have voted in many elections and am entitled to my thoughts and comments. If you don't agree with me then fine. But don't call me out for my comments. Also, if you re-read my comments I did not mention the President of the USA. I mentioned the Democratic party that will be around even after the POTUS leaves office. So I did not attack the President.",
        "intTime": 20090502,
        "postID": 11,
        "quote": "Originally posted by rayld2: quote: Originally posted by Vanir97: Smoke and mirrors! Those illegals are potential voters for the Democrats so they show only a token interest in deporting any of them. Watch as they get amnesty down the line. Vanir97 You are either VERY ignorant of US voting laws or ae deliberately distorting them so you can attack Mr. Obama. Even if the illegals are given legal residency with a track to citizenship their is NO way they would be citizens in time to ever vote for Mr. Obama for President.",
        "reply": " I will address your comments this way Dude> If you attack me one more time I will notify the moderators and have you barred. Understand? Number two. I am highly educated and am much older than you. I have been around for many years and have voted in many elections and am entitled to my thoughts and comments. If you don't agree with me then fine. But don't call me out for my comments. Also, if you re-read my comments I did not mention the President of the USA. I mentioned the Democratic party that will be around even after the POTUS leaves office. So I did not attack the President.",
        "threadID": "672198221_8630091222001",
        "time": "2009-05-02 07:28:00",
        "title": "Government Going After Hiring Of Illegals",
        "userID": "Vanir97"
    },
    {
        "content": "quote: Originally posted by Vanir97: Smoke and mirrors! Those illegals are potential voters for the Democrats so they show only a token interest in deporting any of them. Watch as they get amnesty down the line. Smoke and mirrors! Those who knowingly hire illegals are voters and fund raisers for the Republicans so the Republicans show only a token interest in punishing any of them. Those who knowingly hire illegals are praying for the Republicans to get back into power so they get amnesty down the line.",
        "intTime": 20090502,
        "postID": 12,
        "quote": "Originally posted by Vanir97: Smoke and mirrors! Those illegals are potential voters for the Democrats so they show only a token interest in deporting any of them. Watch as they get amnesty down the line.",
        "reply": " Smoke and mirrors! Those who knowingly hire illegals are voters and fund raisers for the Republicans so the Republicans show only a token interest in punishing any of them. Those who knowingly hire illegals are praying for the Republicans to get back into power so they get amnesty down the line.",
        "threadID": "672198221_8630091222001",
        "time": "2009-05-02 07:40:00",
        "title": "Government Going After Hiring Of Illegals",
        "userID": "Fightdirector"
    },
    {
        "content": "Correction: those that KNOWINGLY hire illegals are greedy. they are representative of neither republicans nor democrats. they are just greedy money grubbing profiteers who would be just as happy owning slaves, but settle for second best. people who KNOWINGLY hire illegals deserve nothing short of prison time. as for the rest (the ones who we can't prove KNOWINGLY hired illegals) they get stiff fines the first time. if there is a second time the business gets shut down while the hireing practices get reviewed/changed. there is no third time, or it is assumed that the owner KNOWINGLY hired illegals. illegal immigration has got to be stopped. and Mr Obama's plan is the best so far... the kinks in E-verify need to be fixed soon. that is one of the best plans so far, but there is TOO MUCH ROOM FOR ERROR in it still (1 out of 5)",
        "intTime": 20090502,
        "postID": 13,
        "quote": "",
        "reply": "Correction: those that KNOWINGLY hire illegals are greedy. they are representative of neither republicans nor democrats. they are just greedy money grubbing profiteers who would be just as happy owning slaves, but settle for second best. people who KNOWINGLY hire illegals deserve nothing short of prison time. as for the rest (the ones who we can't prove KNOWINGLY hired illegals) they get stiff fines the first time. if there is a second time the business gets shut down while the hireing practices get reviewed/changed. there is no third time, or it is assumed that the owner KNOWINGLY hired illegals. illegal immigration has got to be stopped. and Mr Obama's plan is the best so far... the kinks in E-verify need to be fixed soon. that is one of the best plans so far, but there is TOO MUCH ROOM FOR ERROR in it still (1 out of 5)",
        "threadID": "672198221_8630091222001",
        "time": "2009-05-02 07:59:00",
        "title": "Government Going After Hiring Of Illegals",
        "userID": "Elesso"
    },
    {
        "content": "quote: Originally posted by Vanir97: quote: Originally posted by rayld2: quote: Originally posted by Vanir97: Smoke and mirrors! Those illegals are potential voters for the Democrats so they show only a token interest in deporting any of them. Watch as they get amnesty down the line. Vanir97 You are either VERY ignorant of US voting laws or ae deliberately distorting them so you can attack Mr. Obama. Even if the illegals are given legal residency with a track to citizenship their is NO way they would be citizens in time to ever vote for Mr. Obama for President. I will address your comments this way Dude> If you attack me one more time I will notify the moderators and have you barred. Understand? Number two. I am highly educated and am much older than you. I have been around for many years and have voted in many elections and am entitled to my thoughts and comments. If you don't agree with me then fine. But don't call me out for my comments. Also, if you re-read my comments I did not mention the President of the USA. I mentioned the Democratic party that will be around even after the POTUS leaves office. So I did not attack the President. dude... he is attacking your post. your opinion that dems (or repubs) want to legalize them for voting purposes is ignorant. it is sennsationalist and irrelevant to the subject. scream to the mods all you want, but your topic is imflamatory and WRONG!!! it shows one of two things, either A) you are an ignorant fool, or B) you are very intelligent and are KNOWINGLY pouring gas on a fire just to watch it burn... i vote B",
        "intTime": 20090502,
        "postID": 14,
        "quote": "Originally posted by Vanir97: quote: Originally posted by rayld2: quote: Originally posted by Vanir97: Smoke and mirrors! Those illegals are potential voters for the Democrats so they show only a token interest in deporting any of them. Watch as they get amnesty down the line. Vanir97 You are either VERY ignorant of US voting laws or ae deliberately distorting them so you can attack Mr. Obama. Even if the illegals are given legal residency with a track to citizenship their is NO way they would be citizens in time to ever vote for Mr. Obama for President. I will address your comments this way Dude> If you attack me one more time I will notify the moderators and have you barred. Understand? Number two. I am highly educated and am much older than you. I have been around for many years and have voted in many elections and am entitled to my thoughts and comments. If you don't agree with me then fine. But don't call me out for my comments. Also, if you re-read my comments I did not mention the President of the USA. I mentioned the Democratic party that will be around even after the POTUS leaves office. So I did not attack the President.",
        "reply": " dude... he is attacking your post. your opinion that dems (or repubs) want to legalize them for voting purposes is ignorant. it is sennsationalist and irrelevant to the subject. scream to the mods all you want, but your topic is imflamatory and WRONG!!! it shows one of two things, either A) you are an ignorant fool, or B) you are very intelligent and are KNOWINGLY pouring gas on a fire just to watch it burn... i vote B",
        "threadID": "672198221_8630091222001",
        "time": "2009-05-02 08:04:00",
        "title": "Government Going After Hiring Of Illegals",
        "userID": "Elesso"
    },
    {
        "content": "quote: illegal immigration has got to be stopped. and Mr Obama's plan is the best so far... How is giving them automatic citizenship stopping illegal immigration? That is what the donkeys want to do. quote: Smoke and mirrors! Those illegals are potential voters for the Democrats so they show only a token interest in deporting any of them. Watch as they get amnesty down the line. Nothing stops them from voting now in places like California and New York and other places where motor voter allows them to register when they conduct business at the motor vehicle offices. No one is asking their status there and since the paperwork used to verify their status later is provided by the illegals themselves during the licensing process it is very difficult to catch them. quote: This is also the same adm that didnt want any provisions in the bailouts bills to keep the govt from hiring illegals. Spare me the enforcement bs! And there is the proof that the donkeys have no intention of doing anything else than allowing the dilution of American culture, language and borders to continue.",
        "intTime": 20090502,
        "postID": 15,
        "quote": "illegal immigration has got to be stopped. and Mr Obama's plan is the best so far...",
        "reply": " How is giving them automatic citizenship stopping illegal immigration? That is what the donkeys want to do. quote: Smoke and mirrors! Those illegals are potential voters for the Democrats so they show only a token interest in deporting any of them. Watch as they get amnesty down the line. Nothing stops them from voting now in places like California and New York and other places where motor voter allows them to register when they conduct business at the motor vehicle offices. No one is asking their status there and since the paperwork used to verify their status later is provided by the illegals themselves during the licensing process it is very difficult to catch them. quote: This is also the same adm that didnt want any provisions in the bailouts bills to keep the govt from hiring illegals. Spare me the enforcement bs! And there is the proof that the donkeys have no intention of doing anything else than allowing the dilution of American culture, language and borders to continue.",
        "threadID": "672198221_8630091222001",
        "time": "2009-05-02 08:17:00",
        "title": "Government Going After Hiring Of Illegals",
        "userID": "FlankerFlyer"
    },
    {
        "content": "quote: How is giving them automatic citizenship stopping illegal immigration? That is what the donkeys want to do. where in hell did you get that? show me irrefutable proof of your claim. anything less will be taken as a breech of decent discussion.... more flaming from the ravings of the ignorant.",
        "intTime": 20090502,
        "postID": 16,
        "quote": "How is giving them automatic citizenship stopping illegal immigration? That is what the donkeys want to do.",
        "reply": " where in hell did you get that? show me irrefutable proof of your claim. anything less will be taken as a breech of decent discussion.... more flaming from the ravings of the ignorant.",
        "threadID": "672198221_8630091222001",
        "time": "2009-05-02 08:42:00",
        "title": "Government Going After Hiring Of Illegals",
        "userID": "Elesso"
    },
    {
        "content": "quote: Originally posted by FlankerFlyer: quote: illegal immigration has got to be stopped. and Mr Obama's plan is the best so far... How is giving them automatic citizenship stopping illegal immigration? That is what the donkeys want to do. Want to do? You have proof, other than citing yourself saying it? Dave",
        "intTime": 20090502,
        "postID": 17,
        "quote": "Originally posted by FlankerFlyer: quote: illegal immigration has got to be stopped. and Mr Obama's plan is the best so far... How is giving them automatic citizenship stopping illegal immigration? That is what the donkeys want to do.",
        "reply": " Want to do? You have proof, other than citing yourself saying it? Dave",
        "threadID": "672198221_8630091222001",
        "time": "2009-05-02 10:00:00",
        "title": "Government Going After Hiring Of Illegals",
        "userID": "Grachus"
    },
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by FlankerFlyer: quote: illegal immigration has got to be stopped. and Mr Obama's plan is the best so far... How is giving them automatic citizenship stopping illegal immigration? That is what the donkeys want to do. Want to do? You have proof, other than citing yourself saying it? Dave Tell a lie long enough and loud enough - and soon people will believe you're telling the truth. Hitler and the Nazi Party used similar lies to bring down the Weimar Republic so that they could seize power in post-WWI Germany.",
        "intTime": 20090502,
        "postID": 18,
        "quote": "Originally posted by Grachus: quote: Originally posted by FlankerFlyer: quote: illegal immigration has got to be stopped. and Mr Obama's plan is the best so far... How is giving them automatic citizenship stopping illegal immigration? That is what the donkeys want to do. Want to do? You have proof, other than citing yourself saying it? Dave",
        "reply": " Tell a lie long enough and loud enough - and soon people will believe you're telling the truth. Hitler and the Nazi Party used similar lies to bring down the Weimar Republic so that they could seize power in post-WWI Germany.",
        "threadID": "672198221_8630091222001",
        "time": "2009-05-02 10:24:00",
        "title": "Government Going After Hiring Of Illegals",
        "userID": "Fightdirector"
    },
    {
        "content": "quote: He said then that comprehensive immigration legislation, including a plan to make legal status possible for an estimated 12 million illegal immigrants, would be a priority in his first year in office. Latino voters turned out strongly for Mr. Obama in the election. >>http://www.nytimes.com/2009/04/09/us/politics/09immig.html?hp",
        "intTime": 20090502,
        "postID": 19,
        "quote": "He said then that comprehensive immigration legislation, including a plan to make legal status possible for an estimated 12 million illegal immigrants, would be a priority in his first year in office. Latino voters turned out strongly for Mr. Obama in the election.",
        "reply": " >>http://www.nytimes.com/2009/04/09/us/politics/09immig.html?hp",
        "threadID": "672198221_8630091222001",
        "time": "2009-05-02 10:50:00",
        "title": "Government Going After Hiring Of Illegals",
        "userID": "FlankerFlyer"
    },
    {
        "content": "\"http://www.cbsnews.com/stories/2009/04/30/politics/main4980134.shtml?tag=topHome;topStories\" AP) An Obama administration policy to go after employers who knowingly hire and exploit illegal workers is not significantly different from the Bush administration strategy, according to a copy of the guidelines, obtained by The Associated Press. The new guidelines for immigration agents, which the Homeland Security Department calls a \"renewed department-wide focus\" will impose fines and criminal charges against employers who break the law. While the priority is to go after employers, the policy states that agents will continue to arrest illegal workers. The Barack Obama policy, however, stresses that humanitarian guidelines will be followed more broadly than in the previous administration. Homeland Security Secretary Janet Napolitano has said that under her leadership the agency will now be focused on \"renewing a priority on employers who are making money off of these illegal immigrants and giving them jobs that should be going to American workers, as opposed to just counting numbers.\" In 2008, Immigration and Customs Enforcement brought criminal charges against 135 employers and 968 workers. In an interview with The Associated Press earlier this month, Napolitano said using investigative tools such as auditing documents employees fill out when they join a company, having illegal workers go undercover and talking to people who regularly interact with the employers are all ways to build a case against a business that hires illegal workers. \"What I want to do is deter more employers from intentionally and knowingly hiring illegal workers,\" Napolitano said.",
        "intTime": 20090430,
        "postID": 20,
        "quote": "",
        "reply": "\"http://www.cbsnews.com/stories/2009/04/30/politics/main4980134.shtml?tag=topHome;topStories\" AP) An Obama administration policy to go after employers who knowingly hire and exploit illegal workers is not significantly different from the Bush administration strategy, according to a copy of the guidelines, obtained by The Associated Press. The new guidelines for immigration agents, which the Homeland Security Department calls a \"renewed department-wide focus\" will impose fines and criminal charges against employers who break the law. While the priority is to go after employers, the policy states that agents will continue to arrest illegal workers. The Barack Obama policy, however, stresses that humanitarian guidelines will be followed more broadly than in the previous administration. Homeland Security Secretary Janet Napolitano has said that under her leadership the agency will now be focused on \"renewing a priority on employers who are making money off of these illegal immigrants and giving them jobs that should be going to American workers, as opposed to just counting numbers.\" In 2008, Immigration and Customs Enforcement brought criminal charges against 135 employers and 968 workers. In an interview with The Associated Press earlier this month, Napolitano said using investigative tools such as auditing documents employees fill out when they join a company, having illegal workers go undercover and talking to people who regularly interact with the employers are all ways to build a case against a business that hires illegal workers. \"What I want to do is deter more employers from intentionally and knowingly hiring illegal workers,\" Napolitano said.",
        "threadID": "672198221_8630091222001",
        "time": "2009-04-30 16:32:00",
        "title": "Government Going After Hiring Of Illegals",
        "userID": "ss_287"
    },
    {
        "content": "It's a start at least.",
        "intTime": 20090430,
        "postID": 21,
        "quote": "",
        "reply": "It's a start at least.",
        "threadID": "672198221_8630091222001",
        "time": "2009-04-30 17:22:00",
        "title": "Government Going After Hiring Of Illegals",
        "userID": "shuman14"
    },
    {
        "content": "in other words, no news here. at least they are not going backwards on enforcement.",
        "intTime": 20090430,
        "postID": 22,
        "quote": "",
        "reply": "in other words, no news here. at least they are not going backwards on enforcement.",
        "threadID": "672198221_8630091222001",
        "time": "2009-04-30 17:35:00",
        "title": "Government Going After Hiring Of Illegals",
        "userID": "FlankerFlyer"
    },
    {
        "content": "Flank, I thought you would be the last person to complain about immigrants taking peoples' jobs. You've always disagreed with me on every single point when I advocated companies that companies hire American workers, or as you call them, yahoos, and replacing them with more educated Indians. quote: Originally posted by FlankerFlyer: in other words, no news here. at least they are not going backwards on enforcement.",
        "intTime": 20090430,
        "postID": 23,
        "quote": "Originally posted by FlankerFlyer: in other words, no news here. at least they are not going backwards on enforcement.",
        "reply": "Flank, I thought you would be the last person to complain about immigrants taking peoples' jobs. You've always disagreed with me on every single point when I advocated companies that companies hire American workers, or as you call them, yahoos, and replacing them with more educated Indians. ",
        "threadID": "672198221_8630091222001",
        "time": "2009-04-30 21:13:00",
        "title": "Government Going After Hiring Of Illegals",
        "userID": "cybercafe"
    },
    {
        "content": "quote: Originally posted by FlankerFlyer: in other words, no news here. at least they are not going backwards on enforcement. Pretty much what I was going to say.",
        "intTime": 20090501,
        "postID": 24,
        "quote": "Originally posted by FlankerFlyer: in other words, no news here. at least they are not going backwards on enforcement.",
        "reply": " Pretty much what I was going to say.",
        "threadID": "672198221_8630091222001",
        "time": "2009-05-01 03:43:00",
        "title": "Government Going After Hiring Of Illegals",
        "userID": "mrmixitup"
    },
    {
        "content": "Where is Pelosi, this is unAmerican, she must be outraged. I bet all those immigrants and illegals that voted for Obama are ****ed now. He was supposed to protect them. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "intTime": 20090501,
        "postID": 25,
        "quote": "",
        "reply": "Where is Pelosi, this is unAmerican, she must be outraged. I bet all those immigrants and illegals that voted for Obama are ****ed now. He was supposed to protect them. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "threadID": "672198221_8630091222001",
        "time": "2009-05-01 05:38:00",
        "title": "Government Going After Hiring Of Illegals",
        "userID": "Anbar7"
    },
    {
        "content": "quote: Originally posted by ss_287: \"http://www.cbsnews.com/stories/2009/04/30/politics/main4980134.shtml?tag=topHome;topStories\" AP) An Obama administration policy to go after employers who knowingly hire and exploit illegal workers is not significantly different from the Bush administration strategy, according to a copy of the guidelines, obtained by The Associated Press. The new guidelines for immigration agents, which the Homeland Security Department calls a \"renewed department-wide focus\" will impose fines and criminal charges against employers who break the law. While the priority is to go after employers, the policy states that agents will continue to arrest illegal workers. The Barack Obama policy, however, stresses that humanitarian guidelines will be followed more broadly than in the previous administration. Homeland Security Secretary Janet Napolitano has said that under her leadership the agency will now be focused on \"renewing a priority on employers who are making money off of these illegal immigrants and giving them jobs that should be going to American workers, as opposed to just counting numbers.\" In 2008, Immigration and Customs Enforcement brought criminal charges against 135 employers and 968 workers. In an interview with The Associated Press earlier this month, Napolitano said using investigative tools such as auditing documents employees fill out when they join a company, having illegal workers go undercover and talking to people who regularly interact with the employers are all ways to build a case against a business that hires illegal workers. \"What I want to do is deter more employers from intentionally and knowingly hiring illegal workers,\" Napolitano said. Hey, you NITWIT! Why are you against E-Verify?! And as we have seen with this Adm, as soon as these businesses are investigated their Illegal employees get visas. Yeh, I bet there is a bog trend in this. This is also the same adm that didnt want any provisions in the bailouts bills to keep the govt from hiring illegals. Spare me the enforcement bs!",
        "intTime": 20090501,
        "postID": 26,
        "quote": "Originally posted by ss_287: \"http://www.cbsnews.com/stories/2009/04/30/politics/main4980134.shtml?tag=topHome;topStories\" AP) An Obama administration policy to go after employers who knowingly hire and exploit illegal workers is not significantly different from the Bush administration strategy, according to a copy of the guidelines, obtained by The Associated Press. The new guidelines for immigration agents, which the Homeland Security Department calls a \"renewed department-wide focus\" will impose fines and criminal charges against employers who break the law. While the priority is to go after employers, the policy states that agents will continue to arrest illegal workers. The Barack Obama policy, however, stresses that humanitarian guidelines will be followed more broadly than in the previous administration. Homeland Security Secretary Janet Napolitano has said that under her leadership the agency will now be focused on \"renewing a priority on employers who are making money off of these illegal immigrants and giving them jobs that should be going to American workers, as opposed to just counting numbers.\" In 2008, Immigration and Customs Enforcement brought criminal charges against 135 employers and 968 workers. In an interview with The Associated Press earlier this month, Napolitano said using investigative tools such as auditing documents employees fill out when they join a company, having illegal workers go undercover and talking to people who regularly interact with the employers are all ways to build a case against a business that hires illegal workers. \"What I want to do is deter more employers from intentionally and knowingly hiring illegal workers,\" Napolitano said. Hey, you NITWIT! Why are you against E-Verify?!",
        "reply": " And as we have seen with this Adm, as soon as these businesses are investigated their Illegal employees get visas. Yeh, I bet there is a bog trend in this. This is also the same adm that didnt want any provisions in the bailouts bills to keep the govt from hiring illegals. Spare me the enforcement bs!",
        "threadID": "672198221_8630091222001",
        "time": "2009-05-01 06:04:00",
        "title": "Government Going After Hiring Of Illegals",
        "userID": "GunnyRet03"
    },
    {
        "content": "Smoke and mirrors! Those illegals are potential voters for the Democrats so they show only a token interest in deporting any of them. Watch as they get amnesty down the line.",
        "intTime": 20090501,
        "postID": 27,
        "quote": "",
        "reply": "Smoke and mirrors! Those illegals are potential voters for the Democrats so they show only a token interest in deporting any of them. Watch as they get amnesty down the line.",
        "threadID": "672198221_8630091222001",
        "time": "2009-05-01 07:15:00",
        "title": "Government Going After Hiring Of Illegals",
        "userID": "Vanir97"
    },
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by FlankerFlyer: in other words, no news here. at least they are not going backwards on enforcement. Pretty much what I was going to say. Having a policy and ACTUALLY enforcing the policy are 2 differentt hings and IMO the Bsuh admin did NOT go after the employers and in fact often protected them. Now we just have to wait and see if the Obama admin actually enforces a policy of going after the employers or just pretends like the Bush admin did.",
        "intTime": 20090501,
        "postID": 28,
        "quote": "Originally posted by mrmixitup: quote: Originally posted by FlankerFlyer: in other words, no news here. at least they are not going backwards on enforcement. Pretty much what I was going to say.",
        "reply": " Having a policy and ACTUALLY enforcing the policy are 2 differentt hings and IMO the Bsuh admin did NOT go after the employers and in fact often protected them. Now we just have to wait and see if the Obama admin actually enforces a policy of going after the employers or just pretends like the Bush admin did.",
        "threadID": "672198221_8630091222001",
        "time": "2009-05-01 12:18:00",
        "title": "Government Going After Hiring Of Illegals",
        "userID": "rayld2"
    },
    {
        "content": "quote: Originally posted by Vanir97: Smoke and mirrors! Those illegals are potential voters for the Democrats so they show only a token interest in deporting any of them. Watch as they get amnesty down the line. Vanir97 You are either VERY ignorant of US voting laws or ae deliberately distorting them so you can attack Mr. Obama. Even if the illegals are given legal residency with a track to citizenship their is NO way they would be citizens in time to ever vote for Mr. Obama for President.",
        "intTime": 20090501,
        "postID": 29,
        "quote": "Originally posted by Vanir97: Smoke and mirrors! Those illegals are potential voters for the Democrats so they show only a token interest in deporting any of them. Watch as they get amnesty down the line.",
        "reply": " Vanir97 You are either VERY ignorant of US voting laws or ae deliberately distorting them so you can attack Mr. Obama. Even if the illegals are given legal residency with a track to citizenship their is NO way they would be citizens in time to ever vote for Mr. Obama for President.",
        "threadID": "672198221_8630091222001",
        "time": "2009-05-01 22:42:00",
        "title": "Government Going After Hiring Of Illegals",
        "userID": "rayld2"
    },
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by Vanir97: Smoke and mirrors! Those illegals are potential voters for the Democrats so they show only a token interest in deporting any of them. Watch as they get amnesty down the line. Vanir97 You are either VERY ignorant of US voting laws or ae deliberately distorting them so you can attack Mr. Obama. Even if the illegals are given legal residency with a track to citizenship their is NO way they would be citizens in time to ever vote for Mr. Obama for President. I will address your comments this way Dude> If you attack me one more time I will notify the moderators and have you barred. Understand? Number two. I am highly educated and am much older than you. I have been around for many years and have voted in many elections and am entitled to my thoughts and comments. If you don't agree with me then fine. But don't call me out for my comments. Also, if you re-read my comments I did not mention the President of the USA. I mentioned the Democratic party that will be around even after the POTUS leaves office. So I did not attack the President.",
        "intTime": 20090502,
        "postID": 30,
        "quote": "Originally posted by rayld2: quote: Originally posted by Vanir97: Smoke and mirrors! Those illegals are potential voters for the Democrats so they show only a token interest in deporting any of them. Watch as they get amnesty down the line. Vanir97 You are either VERY ignorant of US voting laws or ae deliberately distorting them so you can attack Mr. Obama. Even if the illegals are given legal residency with a track to citizenship their is NO way they would be citizens in time to ever vote for Mr. Obama for President.",
        "reply": " I will address your comments this way Dude> If you attack me one more time I will notify the moderators and have you barred. Understand? Number two. I am highly educated and am much older than you. I have been around for many years and have voted in many elections and am entitled to my thoughts and comments. If you don't agree with me then fine. But don't call me out for my comments. Also, if you re-read my comments I did not mention the President of the USA. I mentioned the Democratic party that will be around even after the POTUS leaves office. So I did not attack the President.",
        "threadID": "672198221_8630091222001",
        "time": "2009-05-02 07:28:00",
        "title": "Government Going After Hiring Of Illegals",
        "userID": "Vanir97"
    },
    {
        "content": "quote: Originally posted by Vanir97: Smoke and mirrors! Those illegals are potential voters for the Democrats so they show only a token interest in deporting any of them. Watch as they get amnesty down the line. Smoke and mirrors! Those who knowingly hire illegals are voters and fund raisers for the Republicans so the Republicans show only a token interest in punishing any of them. Those who knowingly hire illegals are praying for the Republicans to get back into power so they get amnesty down the line.",
        "intTime": 20090502,
        "postID": 31,
        "quote": "Originally posted by Vanir97: Smoke and mirrors! Those illegals are potential voters for the Democrats so they show only a token interest in deporting any of them. Watch as they get amnesty down the line.",
        "reply": " Smoke and mirrors! Those who knowingly hire illegals are voters and fund raisers for the Republicans so the Republicans show only a token interest in punishing any of them. Those who knowingly hire illegals are praying for the Republicans to get back into power so they get amnesty down the line.",
        "threadID": "672198221_8630091222001",
        "time": "2009-05-02 07:40:00",
        "title": "Government Going After Hiring Of Illegals",
        "userID": "Fightdirector"
    },
    {
        "content": "Correction: those that KNOWINGLY hire illegals are greedy. they are representative of neither republicans nor democrats. they are just greedy money grubbing profiteers who would be just as happy owning slaves, but settle for second best. people who KNOWINGLY hire illegals deserve nothing short of prison time. as for the rest (the ones who we can't prove KNOWINGLY hired illegals) they get stiff fines the first time. if there is a second time the business gets shut down while the hireing practices get reviewed/changed. there is no third time, or it is assumed that the owner KNOWINGLY hired illegals. illegal immigration has got to be stopped. and Mr Obama's plan is the best so far... the kinks in E-verify need to be fixed soon. that is one of the best plans so far, but there is TOO MUCH ROOM FOR ERROR in it still (1 out of 5)",
        "intTime": 20090502,
        "postID": 32,
        "quote": "",
        "reply": "Correction: those that KNOWINGLY hire illegals are greedy. they are representative of neither republicans nor democrats. they are just greedy money grubbing profiteers who would be just as happy owning slaves, but settle for second best. people who KNOWINGLY hire illegals deserve nothing short of prison time. as for the rest (the ones who we can't prove KNOWINGLY hired illegals) they get stiff fines the first time. if there is a second time the business gets shut down while the hireing practices get reviewed/changed. there is no third time, or it is assumed that the owner KNOWINGLY hired illegals. illegal immigration has got to be stopped. and Mr Obama's plan is the best so far... the kinks in E-verify need to be fixed soon. that is one of the best plans so far, but there is TOO MUCH ROOM FOR ERROR in it still (1 out of 5)",
        "threadID": "672198221_8630091222001",
        "time": "2009-05-02 07:59:00",
        "title": "Government Going After Hiring Of Illegals",
        "userID": "Elesso"
    },
    {
        "content": "quote: Originally posted by Vanir97: quote: Originally posted by rayld2: quote: Originally posted by Vanir97: Smoke and mirrors! Those illegals are potential voters for the Democrats so they show only a token interest in deporting any of them. Watch as they get amnesty down the line. Vanir97 You are either VERY ignorant of US voting laws or ae deliberately distorting them so you can attack Mr. Obama. Even if the illegals are given legal residency with a track to citizenship their is NO way they would be citizens in time to ever vote for Mr. Obama for President. I will address your comments this way Dude> If you attack me one more time I will notify the moderators and have you barred. Understand? Number two. I am highly educated and am much older than you. I have been around for many years and have voted in many elections and am entitled to my thoughts and comments. If you don't agree with me then fine. But don't call me out for my comments. Also, if you re-read my comments I did not mention the President of the USA. I mentioned the Democratic party that will be around even after the POTUS leaves office. So I did not attack the President. dude... he is attacking your post. your opinion that dems (or repubs) want to legalize them for voting purposes is ignorant. it is sennsationalist and irrelevant to the subject. scream to the mods all you want, but your topic is imflamatory and WRONG!!! it shows one of two things, either A) you are an ignorant fool, or B) you are very intelligent and are KNOWINGLY pouring gas on a fire just to watch it burn... i vote B",
        "intTime": 20090502,
        "postID": 33,
        "quote": "Originally posted by Vanir97: quote: Originally posted by rayld2: quote: Originally posted by Vanir97: Smoke and mirrors! Those illegals are potential voters for the Democrats so they show only a token interest in deporting any of them. Watch as they get amnesty down the line. Vanir97 You are either VERY ignorant of US voting laws or ae deliberately distorting them so you can attack Mr. Obama. Even if the illegals are given legal residency with a track to citizenship their is NO way they would be citizens in time to ever vote for Mr. Obama for President. I will address your comments this way Dude> If you attack me one more time I will notify the moderators and have you barred. Understand? Number two. I am highly educated and am much older than you. I have been around for many years and have voted in many elections and am entitled to my thoughts and comments. If you don't agree with me then fine. But don't call me out for my comments. Also, if you re-read my comments I did not mention the President of the USA. I mentioned the Democratic party that will be around even after the POTUS leaves office. So I did not attack the President.",
        "reply": " dude... he is attacking your post. your opinion that dems (or repubs) want to legalize them for voting purposes is ignorant. it is sennsationalist and irrelevant to the subject. scream to the mods all you want, but your topic is imflamatory and WRONG!!! it shows one of two things, either A) you are an ignorant fool, or B) you are very intelligent and are KNOWINGLY pouring gas on a fire just to watch it burn... i vote B",
        "threadID": "672198221_8630091222001",
        "time": "2009-05-02 08:04:00",
        "title": "Government Going After Hiring Of Illegals",
        "userID": "Elesso"
    },
    {
        "content": "quote: illegal immigration has got to be stopped. and Mr Obama's plan is the best so far... How is giving them automatic citizenship stopping illegal immigration? That is what the donkeys want to do. quote: Smoke and mirrors! Those illegals are potential voters for the Democrats so they show only a token interest in deporting any of them. Watch as they get amnesty down the line. Nothing stops them from voting now in places like California and New York and other places where motor voter allows them to register when they conduct business at the motor vehicle offices. No one is asking their status there and since the paperwork used to verify their status later is provided by the illegals themselves during the licensing process it is very difficult to catch them. quote: This is also the same adm that didnt want any provisions in the bailouts bills to keep the govt from hiring illegals. Spare me the enforcement bs! And there is the proof that the donkeys have no intention of doing anything else than allowing the dilution of American culture, language and borders to continue.",
        "intTime": 20090502,
        "postID": 34,
        "quote": "illegal immigration has got to be stopped. and Mr Obama's plan is the best so far...",
        "reply": " How is giving them automatic citizenship stopping illegal immigration? That is what the donkeys want to do. quote: Smoke and mirrors! Those illegals are potential voters for the Democrats so they show only a token interest in deporting any of them. Watch as they get amnesty down the line. Nothing stops them from voting now in places like California and New York and other places where motor voter allows them to register when they conduct business at the motor vehicle offices. No one is asking their status there and since the paperwork used to verify their status later is provided by the illegals themselves during the licensing process it is very difficult to catch them. quote: This is also the same adm that didnt want any provisions in the bailouts bills to keep the govt from hiring illegals. Spare me the enforcement bs! And there is the proof that the donkeys have no intention of doing anything else than allowing the dilution of American culture, language and borders to continue.",
        "threadID": "672198221_8630091222001",
        "time": "2009-05-02 08:17:00",
        "title": "Government Going After Hiring Of Illegals",
        "userID": "FlankerFlyer"
    },
    {
        "content": "quote: How is giving them automatic citizenship stopping illegal immigration? That is what the donkeys want to do. where in hell did you get that? show me irrefutable proof of your claim. anything less will be taken as a breech of decent discussion.... more flaming from the ravings of the ignorant.",
        "intTime": 20090502,
        "postID": 35,
        "quote": "How is giving them automatic citizenship stopping illegal immigration? That is what the donkeys want to do.",
        "reply": " where in hell did you get that? show me irrefutable proof of your claim. anything less will be taken as a breech of decent discussion.... more flaming from the ravings of the ignorant.",
        "threadID": "672198221_8630091222001",
        "time": "2009-05-02 08:42:00",
        "title": "Government Going After Hiring Of Illegals",
        "userID": "Elesso"
    },
    {
        "content": "quote: Originally posted by FlankerFlyer: quote: illegal immigration has got to be stopped. and Mr Obama's plan is the best so far... How is giving them automatic citizenship stopping illegal immigration? That is what the donkeys want to do. Want to do? You have proof, other than citing yourself saying it? Dave",
        "intTime": 20090502,
        "postID": 36,
        "quote": "Originally posted by FlankerFlyer: quote: illegal immigration has got to be stopped. and Mr Obama's plan is the best so far... How is giving them automatic citizenship stopping illegal immigration? That is what the donkeys want to do.",
        "reply": " Want to do? You have proof, other than citing yourself saying it? Dave",
        "threadID": "672198221_8630091222001",
        "time": "2009-05-02 10:00:00",
        "title": "Government Going After Hiring Of Illegals",
        "userID": "Grachus"
    },
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by FlankerFlyer: quote: illegal immigration has got to be stopped. and Mr Obama's plan is the best so far... How is giving them automatic citizenship stopping illegal immigration? That is what the donkeys want to do. Want to do? You have proof, other than citing yourself saying it? Dave Tell a lie long enough and loud enough - and soon people will believe you're telling the truth. Hitler and the Nazi Party used similar lies to bring down the Weimar Republic so that they could seize power in post-WWI Germany.",
        "intTime": 20090502,
        "postID": 37,
        "quote": "Originally posted by Grachus: quote: Originally posted by FlankerFlyer: quote: illegal immigration has got to be stopped. and Mr Obama's plan is the best so far... How is giving them automatic citizenship stopping illegal immigration? That is what the donkeys want to do. Want to do? You have proof, other than citing yourself saying it? Dave",
        "reply": " Tell a lie long enough and loud enough - and soon people will believe you're telling the truth. Hitler and the Nazi Party used similar lies to bring down the Weimar Republic so that they could seize power in post-WWI Germany.",
        "threadID": "672198221_8630091222001",
        "time": "2009-05-02 10:24:00",
        "title": "Government Going After Hiring Of Illegals",
        "userID": "Fightdirector"
    },
    {
        "content": "quote: He said then that comprehensive immigration legislation, including a plan to make legal status possible for an estimated 12 million illegal immigrants, would be a priority in his first year in office. Latino voters turned out strongly for Mr. Obama in the election. >>http://www.nytimes.com/2009/04/09/us/politics/09immig.html?hp",
        "intTime": 20090502,
        "postID": 38,
        "quote": "He said then that comprehensive immigration legislation, including a plan to make legal status possible for an estimated 12 million illegal immigrants, would be a priority in his first year in office. Latino voters turned out strongly for Mr. Obama in the election.",
        "reply": " >>http://www.nytimes.com/2009/04/09/us/politics/09immig.html?hp",
        "threadID": "672198221_8630091222001",
        "time": "2009-05-02 10:50:00",
        "title": "Government Going After Hiring Of Illegals",
        "userID": "FlankerFlyer"
    }
]