[
    {
        "content": "My link to this story is Fox news @ 2pm today and a short link on todays USA TODAY web page. Obama told the major credit card issuers that he wanted to see change in the way these banks and credit card issuers do business. He mentioned that he wanted to see fair and responsible rates and that they not double or triple just because hard times are here. He also wants to see no more fine print. Transparent he says. I say if he can pull this off I will give him a big hug. Lets just see how much power he has over these big companies. He stated that if these credit card issuers couldn't come up with a fair plan then he and Congress would. To be continued.", 
        "intTime": 20090423, 
        "postID": 1, 
        "quote": "", 
        "reply": "My link to this story is Fox news @ 2pm today and a short link on todays USA TODAY web page. Obama told the major credit card issuers that he wanted to see change in the way these banks and credit card issuers do business. He mentioned that he wanted to see fair and responsible rates and that they not double or triple just because hard times are here. He also wants to see no more fine print. Transparent he says. I say if he can pull this off I will give him a big hug. Lets just see how much power he has over these big companies. He stated that if these credit card issuers couldn't come up with a fair plan then he and Congress would. To be continued.", 
        "threadID": "672198221_5710065122001", 
        "time": "2009-04-23 11:32:00", 
        "title": "Obama slams credit card issuers.", 
        "userID": "Duster6"
    }, 
    {
        "content": "Here is a link. Obama pledges protections for credit-card users President Barack Obama said Thursday his administration is determined to get a credit-card law that eliminates tricky fine print, sudden rate increases and late fees that give millions of consumers headaches. \"I trust that those in the industry who want to act responsibly will engage with us in a constructive fashion, and that we're going to get this done in short order,\" Obama said, delivering a pointed message to leading executives of credit-card issuing companies seated at his side. Both the House and the Senate are pursuing bills to give consumers greater protections. Obama said his economic advisers will examine the various proposals and work with Congress and the industry, but he made clear he intends to sign a law. At issue is how to protect consumers, particularly in a severe recession, while not imposing the kind of rules that could make it harder for banks to offer credit or put credit out of reach for many borrowers. Industry advocates are wary of those consequences and hopeful Obama will listen. more here: \"http://news.yahoo.com/s/ap/20090423/ap_on_go_pr_wh/us_obama_credit_cards\" \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090423, 
        "postID": 2, 
        "quote": "", 
        "reply": "Here is a link. Obama pledges protections for credit-card users President Barack Obama said Thursday his administration is determined to get a credit-card law that eliminates tricky fine print, sudden rate increases and late fees that give millions of consumers headaches. \"I trust that those in the industry who want to act responsibly will engage with us in a constructive fashion, and that we're going to get this done in short order,\" Obama said, delivering a pointed message to leading executives of credit-card issuing companies seated at his side. Both the House and the Senate are pursuing bills to give consumers greater protections. Obama said his economic advisers will examine the various proposals and work with Congress and the industry, but he made clear he intends to sign a law. At issue is how to protect consumers, particularly in a severe recession, while not imposing the kind of rules that could make it harder for banks to offer credit or put credit out of reach for many borrowers. Industry advocates are wary of those consequences and hopeful Obama will listen. more here: \"http://news.yahoo.com/s/ap/20090423/ap_on_go_pr_wh/us_obama_credit_cards\" \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_5710065122001", 
        "time": "2009-04-23 11:48:00", 
        "title": "Obama slams credit card issuers.", 
        "userID": "Anbar7"
    }, 
    {
        "content": "Why reduce credit card interest at this Obominations direction? Why is anybody falling for this control and type of power these are wheeling who apologize and seem to hate this land. These very ones develop their own fine fine print.", 
        "intTime": 20090423, 
        "postID": 3, 
        "quote": "", 
        "reply": "Why reduce credit card interest at this Obominations direction? Why is anybody falling for this control and type of power these are wheeling who apologize and seem to hate this land. These very ones develop their own fine fine print.", 
        "threadID": "672198221_5710065122001", 
        "time": "2009-04-23 13:12:00", 
        "title": "Obama slams credit card issuers.", 
        "userID": "5727609"
    }, 
    {
        "content": "quote: Originally posted by 5727609: Why reduce credit card interest at this Obominations direction? Why is anybody falling for this control and type of power these are wheeling who apologize and seem to hate this land. These very ones develop their own fine fine print. You seem to be saying it is our patriotic duty to passively sit back and watch our interest rates jump from 14% to 28% so CEOs can make billions more. We hate this country because we want to control usury? ... dude you have issues!", 
        "intTime": 20090423, 
        "postID": 4, 
        "quote": "Originally posted by 5727609: Why reduce credit card interest at this Obominations direction? Why is anybody falling for this control and type of power these are wheeling who apologize and seem to hate this land. These very ones develop their own fine fine print.", 
        "reply": " You seem to be saying it is our patriotic duty to passively sit back and watch our interest rates jump from 14% to 28% so CEOs can make billions more. We hate this country because we want to control usury? ... dude you have issues!", 
        "threadID": "672198221_5710065122001", 
        "time": "2009-04-23 13:16:00", 
        "title": "Obama slams credit card issuers.", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by 5727609: Why reduce credit card interest at this Obominations direction? Why is anybody falling for this control and type of power these are wheeling who apologize and seem to hate this land. These very ones develop their own fine fine print. as you no doubt well know all to many people DO NOT READ the terms of agreement on these things... just sign on the bottom line. I do not like PO but what I got out of his talk is he wants the \"fine print\" to become readable and halfazz easy to understand AND upfront.. Transparency, you know that thing that everybody else has to do except himself. But I actually agree that what he proposes is carried forward. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090423, 
        "postID": 5, 
        "quote": "Originally posted by 5727609: Why reduce credit card interest at this Obominations direction? Why is anybody falling for this control and type of power these are wheeling who apologize and seem to hate this land. These very ones develop their own fine fine print.", 
        "reply": " as you no doubt well know all to many people DO NOT READ the terms of agreement on these things... just sign on the bottom line. I do not like PO but what I got out of his talk is he wants the \"fine print\" to become readable and halfazz easy to understand AND upfront.. Transparency, you know that thing that everybody else has to do except himself. But I actually agree that what he proposes is carried forward. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_5710065122001", 
        "time": "2009-04-23 13:36:00", 
        "title": "Obama slams credit card issuers.", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "No more fine print is ok with me. Why would anybody with an IQ above 70 not want all that fine print eliminated?", 
        "intTime": 20090423, 
        "postID": 6, 
        "quote": "", 
        "reply": "No more fine print is ok with me. Why would anybody with an IQ above 70 not want all that fine print eliminated?", 
        "threadID": "672198221_5710065122001", 
        "time": "2009-04-23 13:42:00", 
        "title": "Obama slams credit card issuers.", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Duster6: No more fine print is ok with me. Why would anybody with an IQ above 70 not want all that fine print eliminated? doesn't want to eliminate it, he just wants it to be understandable and up front to those who, you know, those who dropped out of school or do not understand our language very well......you know, the one who bought a $180,000 house on a dishwashers wages. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090423, 
        "postID": 7, 
        "quote": "Originally posted by Duster6: No more fine print is ok with me. Why would anybody with an IQ above 70 not want all that fine print eliminated?", 
        "reply": " doesn't want to eliminate it, he just wants it to be understandable and up front to those who, you know, those who dropped out of school or do not understand our language very well......you know, the one who bought a $180,000 house on a dishwashers wages. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_5710065122001", 
        "time": "2009-04-23 13:53:00", 
        "title": "Obama slams credit card issuers.", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by m551sheridan: quote: Originally posted by Duster6: No more fine print is ok with me. Why would anybody with an IQ above 70 not want all that fine print eliminated? doesn't want to eliminate it, he just wants it to be understandable and up front to those who, you know, those who dropped out of school or do not understand our language very well......you know, the one who bought a $180,000 house on a dishwashers wages. ...and maybe for those who can't afford to hire an attorney to interpret for them.", 
        "intTime": 20090423, 
        "postID": 8, 
        "quote": "Originally posted by m551sheridan: quote: Originally posted by Duster6: No more fine print is ok with me. Why would anybody with an IQ above 70 not want all that fine print eliminated? doesn't want to eliminate it, he just wants it to be understandable and up front to those who, you know, those who dropped out of school or do not understand our language very well......you know, the one who bought a $180,000 house on a dishwashers wages.", 
        "reply": " ...and maybe for those who can't afford to hire an attorney to interpret for them.", 
        "threadID": "672198221_5710065122001", 
        "time": "2009-04-23 13:57:00", 
        "title": "Obama slams credit card issuers.", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "I wholeheartedly agree with the POTUS's message. Additionally, I would like the Companies to stop preying on college kids without a job. Problem is, these folks make formidable profits from late fees..and interest hikes... USURY, thou has a new face...consumer credit cards...", 
        "intTime": 20090423, 
        "postID": 9, 
        "quote": "", 
        "reply": "I wholeheartedly agree with the POTUS's message. Additionally, I would like the Companies to stop preying on college kids without a job. Problem is, these folks make formidable profits from late fees..and interest hikes... USURY, thou has a new face...consumer credit cards...", 
        "threadID": "672198221_5710065122001", 
        "time": "2009-04-23 15:58:00", 
        "title": "Obama slams credit card issuers.", 
        "userID": "strobelvets"
    }, 
    {
        "content": "Let's see--I can't think of anything worse in this world than those who run credit card companies. I equate them to people who steal piggy banks from children and the rest of my thoughts can't be printed. I gave up credit cards years ago and haven't missed them one minute. I have seen what they do to people and what the credit card companies do to people. Yep, some people just gotta have them to survive, but the law of average says credit card companies will get to you before you get to them and they won't lose a wink of sleep over your demise--neither will blood sucking bats. Now that Obama has \"threatened\" the major credit card companies---start counting the days before those companies do anything at all", 
        "intTime": 20090423, 
        "postID": 10, 
        "quote": "", 
        "reply": "Let's see--I can't think of anything worse in this world than those who run credit card companies. I equate them to people who steal piggy banks from children and the rest of my thoughts can't be printed. I gave up credit cards years ago and haven't missed them one minute. I have seen what they do to people and what the credit card companies do to people. Yep, some people just gotta have them to survive, but the law of average says credit card companies will get to you before you get to them and they won't lose a wink of sleep over your demise--neither will blood sucking bats. Now that Obama has \"threatened\" the major credit card companies---start counting the days before those companies do anything at all", 
        "threadID": "672198221_5710065122001", 
        "time": "2009-04-23 16:39:00", 
        "title": "Obama slams credit card issuers.", 
        "userID": "JmacOSI"
    }, 
    {
        "content": "quote: Originally posted by JmacOSI: Let's see--I can't think of anything worse in this world than those who run credit card companies. I equate them to people who steal piggy banks from children and the rest of my thoughts can't be printed. I gave up credit cards years ago and haven't missed them one minute. I have seen what they do to people and what the credit card companies do to people. Yep, some people just gotta have them to survive, but the law of average says credit card companies will get to you before you get to them and they won't lose a wink of sleep over your demise--neither will blood sucking bats. Now that Obama has \"threatened\" the major credit card companies---start counting the days before those companies do anything at all I tend to agree...some companies recently/ unexpectedly raised their rates...anyone with any smarts paid em off... Hmmmm...Folks are unemployed in increasing numbers...and need to pay their mortgages...somehow... A vicious cycle...", 
        "intTime": 20090423, 
        "postID": 11, 
        "quote": "Originally posted by JmacOSI: Let's see--I can't think of anything worse in this world than those who run credit card companies. I equate them to people who steal piggy banks from children and the rest of my thoughts can't be printed. I gave up credit cards years ago and haven't missed them one minute. I have seen what they do to people and what the credit card companies do to people. Yep, some people just gotta have them to survive, but the law of average says credit card companies will get to you before you get to them and they won't lose a wink of sleep over your demise--neither will blood sucking bats. Now that Obama has \"threatened\" the major credit card companies---start counting the days before those companies do anything at all", 
        "reply": " I tend to agree...some companies recently/ unexpectedly raised their rates...anyone with any smarts paid em off... Hmmmm...Folks are unemployed in increasing numbers...and need to pay their mortgages...somehow... A vicious cycle...", 
        "threadID": "672198221_5710065122001", 
        "time": "2009-04-23 16:54:00", 
        "title": "Obama slams credit card issuers.", 
        "userID": "strobelvets"
    }, 
    {
        "content": "It is getting so bad with credit card companies now that the guy (like me) who makes his payments on time and always pays a little extra gets his rates jacked up. A credit card is nice to have for car rentals, points for travel and hotel rooms and to order items on line. Last year I bought a HDTV through Amazon.com and saved $900.00 over buying it in the store at Best Buy. I'm not saying Obama has to meddle into banks business but I very much agree with him trying to force them to be fair and put their hand up on top of the table for all to see.", 
        "intTime": 20090423, 
        "postID": 12, 
        "quote": "", 
        "reply": "It is getting so bad with credit card companies now that the guy (like me) who makes his payments on time and always pays a little extra gets his rates jacked up. A credit card is nice to have for car rentals, points for travel and hotel rooms and to order items on line. Last year I bought a HDTV through Amazon.com and saved $900.00 over buying it in the store at Best Buy. I'm not saying Obama has to meddle into banks business but I very much agree with him trying to force them to be fair and put their hand up on top of the table for all to see.", 
        "threadID": "672198221_5710065122001", 
        "time": "2009-04-23 17:13:00", 
        "title": "Obama slams credit card issuers.", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Duster6: It is getting so bad with credit card companies now that the guy (like me) who makes his payments on time and always pays a little extra gets his rates jacked up. A credit card is nice to have for car rentals, points for travel and hotel rooms and to order items on line. Last year I bought a HDTV through Amazon.com and saved $900.00 over buying it in the store at Best Buy. I'm not saying Obama has to meddle into banks business but I very much agree with him trying to force them to be fair and put their hand up on top of the table for all to see. I thought it might have been a \"global\" increase...no reason to hit me... Interesting it came just before the Presidents meeting with the consumer credit pirates...", 
        "intTime": 20090423, 
        "postID": 13, 
        "quote": "Originally posted by Duster6: It is getting so bad with credit card companies now that the guy (like me) who makes his payments on time and always pays a little extra gets his rates jacked up. A credit card is nice to have for car rentals, points for travel and hotel rooms and to order items on line. Last year I bought a HDTV through Amazon.com and saved $900.00 over buying it in the store at Best Buy. I'm not saying Obama has to meddle into banks business but I very much agree with him trying to force them to be fair and put their hand up on top of the table for all to see.", 
        "reply": " I thought it might have been a \"global\" increase...no reason to hit me... Interesting it came just before the Presidents meeting with the consumer credit pirates...", 
        "threadID": "672198221_5710065122001", 
        "time": "2009-04-23 17:46:00", 
        "title": "Obama slams credit card issuers.", 
        "userID": "strobelvets"
    }, 
    {
        "content": "quote: Originally posted by Duster6: My link to this story is Fox news @ 2pm today and a short link on todays USA TODAY web page. Obama told the major credit card issuers that he wanted to see change in the way these banks and credit card issuers do business. He mentioned that he wanted to see fair and responsible rates and that they not double or triple just because hard times are here. He also wants to see no more fine print. Transparent he says. I say if he can pull this off I will give him a big hug. Lets just see how much power he has over these big companies. He stated that if these credit card issuers couldn't come up with a fair plan then he and Congress would. To be continued. I don't know how legal it is but, I agree... As much as I don't care for some of the things that Obama does, on this one, I agree... Respectfully, SUNLINER81", 
        "intTime": 20090423, 
        "postID": 14, 
        "quote": "Originally posted by Duster6: My link to this story is Fox news @ 2pm today and a short link on todays USA TODAY web page. Obama told the major credit card issuers that he wanted to see change in the way these banks and credit card issuers do business. He mentioned that he wanted to see fair and responsible rates and that they not double or triple just because hard times are here. He also wants to see no more fine print. Transparent he says. I say if he can pull this off I will give him a big hug. Lets just see how much power he has over these big companies. He stated that if these credit card issuers couldn't come up with a fair plan then he and Congress would. To be continued.", 
        "reply": " I don't know how legal it is but, I agree... As much as I don't care for some of the things that Obama does, on this one, I agree... Respectfully, SUNLINER81", 
        "threadID": "672198221_5710065122001", 
        "time": "2009-04-23 18:37:00", 
        "title": "Obama slams credit card issuers.", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by 5727609: Why reduce credit card interest at this Obominations direction? Why is anybody falling for this control and type of power these are wheeling who apologize and seem to hate this land. These very ones develop their own fine fine print. Credit where credit is due... No pun intended... LOL Respectfully, SUNLINER81", 
        "intTime": 20090423, 
        "postID": 15, 
        "quote": "Originally posted by 5727609: Why reduce credit card interest at this Obominations direction? Why is anybody falling for this control and type of power these are wheeling who apologize and seem to hate this land. These very ones develop their own fine fine print.", 
        "reply": " Credit where credit is due... No pun intended... LOL Respectfully, SUNLINER81", 
        "threadID": "672198221_5710065122001", 
        "time": "2009-04-23 18:39:00", 
        "title": "Obama slams credit card issuers.", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "I get 2-3 come-ons from Capital One every week. I wonder how much $ they waste on all that marketing that could be used to restrain interest rates and fees? Wuzinmywallet? Not Capital One!", 
        "intTime": 20090423, 
        "postID": 16, 
        "quote": "", 
        "reply": "I get 2-3 come-ons from Capital One every week. I wonder how much $ they waste on all that marketing that could be used to restrain interest rates and fees? Wuzinmywallet? Not Capital One!", 
        "threadID": "672198221_5710065122001", 
        "time": "2009-04-23 18:45:00", 
        "title": "Obama slams credit card issuers.", 
        "userID": "Motive25"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: quote: Originally posted by Duster6: My link to this story is Fox news @ 2pm today and a short link on todays USA TODAY web page. Obama told the major credit card issuers that he wanted to see change in the way these banks and credit card issuers do business. He mentioned that he wanted to see fair and responsible rates and that they not double or triple just because hard times are here. He also wants to see no more fine print. Transparent he says. I say if he can pull this off I will give him a big hug. Lets just see how much power he has over these big companies. He stated that if these credit card issuers couldn't come up with a fair plan then he and Congress would. To be continued. I don't know how legal it is but, I agree... As much as I don't care for some of the things that Obama does, on this one, I agree... Respectfully, SUNLINER81 Government sets interest rates all the time. In fact we USED to regulate the top rates of Credit Card banks - But that got deregulated back in the eighties. Dave", 
        "intTime": 20090423, 
        "postID": 17, 
        "quote": "Originally posted by SUNLINER81: quote: Originally posted by Duster6: My link to this story is Fox news @ 2pm today and a short link on todays USA TODAY web page. Obama told the major credit card issuers that he wanted to see change in the way these banks and credit card issuers do business. He mentioned that he wanted to see fair and responsible rates and that they not double or triple just because hard times are here. He also wants to see no more fine print. Transparent he says. I say if he can pull this off I will give him a big hug. Lets just see how much power he has over these big companies. He stated that if these credit card issuers couldn't come up with a fair plan then he and Congress would. To be continued. I don't know how legal it is but, I agree... As much as I don't care for some of the things that Obama does, on this one, I agree... Respectfully, SUNLINER81", 
        "reply": " Government sets interest rates all the time. In fact we USED to regulate the top rates of Credit Card banks - But that got deregulated back in the eighties. Dave", 
        "threadID": "672198221_5710065122001", 
        "time": "2009-04-23 18:57:00", 
        "title": "Obama slams credit card issuers.", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by SUNLINER81: quote: Originally posted by Duster6: My link to this story is Fox news @ 2pm today and a short link on todays USA TODAY web page. Obama told the major credit card issuers that he wanted to see change in the way these banks and credit card issuers do business. He mentioned that he wanted to see fair and responsible rates and that they not double or triple just because hard times are here. He also wants to see no more fine print. Transparent he says. I say if he can pull this off I will give him a big hug. Lets just see how much power he has over these big companies. He stated that if these credit card issuers couldn't come up with a fair plan then he and Congress would. To be continued. I don't know how legal it is but, I agree... As much as I don't care for some of the things that Obama does, on this one, I agree... Respectfully, SUNLINER81 Government sets interest rates all the time. In fact we USED to regulate the top rates of Credit Card banks - But that got deregulated back in the eighties. Dave Thanks for the info... Respectfully, SUNLINER81", 
        "intTime": 20090423, 
        "postID": 18, 
        "quote": "Originally posted by Grachus: quote: Originally posted by SUNLINER81: quote: Originally posted by Duster6: My link to this story is Fox news @ 2pm today and a short link on todays USA TODAY web page. Obama told the major credit card issuers that he wanted to see change in the way these banks and credit card issuers do business. He mentioned that he wanted to see fair and responsible rates and that they not double or triple just because hard times are here. He also wants to see no more fine print. Transparent he says. I say if he can pull this off I will give him a big hug. Lets just see how much power he has over these big companies. He stated that if these credit card issuers couldn't come up with a fair plan then he and Congress would. To be continued. I don't know how legal it is but, I agree... As much as I don't care for some of the things that Obama does, on this one, I agree... Respectfully, SUNLINER81 Government sets interest rates all the time. In fact we USED to regulate the top rates of Credit Card banks - But that got deregulated back in the eighties. Dave", 
        "reply": " Thanks for the info... Respectfully, SUNLINER81", 
        "threadID": "672198221_5710065122001", 
        "time": "2009-04-23 19:04:00", 
        "title": "Obama slams credit card issuers.", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "Ah, another excuse for The One to expand the Federal Gubmint and \"H\"is power, while simultaneously demonizing the capitalist system \"H\"e hates and encouraging more class warfare. God help us.", 
        "intTime": 20090423, 
        "postID": 19, 
        "quote": "", 
        "reply": "Ah, another excuse for The One to expand the Federal Gubmint and \"H\"is power, while simultaneously demonizing the capitalist system \"H\"e hates and encouraging more class warfare. God help us.", 
        "threadID": "672198221_5710065122001", 
        "time": "2009-04-23 20:37:00", 
        "title": "Obama slams credit card issuers.", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "Mr President, I supplied a picture for my NFCU checks to be put on my checks and the company messed it up. Can you pls give a speech about check publishing companies that make typos and other errors on customer's checks? Thank You, Concerned Citizen", 
        "intTime": 20090423, 
        "postID": 20, 
        "quote": "", 
        "reply": "Mr President, I supplied a picture for my NFCU checks to be put on my checks and the company messed it up. Can you pls give a speech about check publishing companies that make typos and other errors on customer's checks? Thank You, Concerned Citizen", 
        "threadID": "672198221_5710065122001", 
        "time": "2009-04-23 20:47:00", 
        "title": "Obama slams credit card issuers.", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "My link to this story is Fox news @ 2pm today and a short link on todays USA TODAY web page. Obama told the major credit card issuers that he wanted to see change in the way these banks and credit card issuers do business. He mentioned that he wanted to see fair and responsible rates and that they not double or triple just because hard times are here. He also wants to see no more fine print. Transparent he says. I say if he can pull this off I will give him a big hug. Lets just see how much power he has over these big companies. He stated that if these credit card issuers couldn't come up with a fair plan then he and Congress would. To be continued.", 
        "intTime": 20090423, 
        "postID": 21, 
        "quote": "", 
        "reply": "My link to this story is Fox news @ 2pm today and a short link on todays USA TODAY web page. Obama told the major credit card issuers that he wanted to see change in the way these banks and credit card issuers do business. He mentioned that he wanted to see fair and responsible rates and that they not double or triple just because hard times are here. He also wants to see no more fine print. Transparent he says. I say if he can pull this off I will give him a big hug. Lets just see how much power he has over these big companies. He stated that if these credit card issuers couldn't come up with a fair plan then he and Congress would. To be continued.", 
        "threadID": "672198221_5710065122001", 
        "time": "2009-04-23 11:32:00", 
        "title": "Obama slams credit card issuers.", 
        "userID": "Duster6"
    }, 
    {
        "content": "Here is a link. Obama pledges protections for credit-card users President Barack Obama said Thursday his administration is determined to get a credit-card law that eliminates tricky fine print, sudden rate increases and late fees that give millions of consumers headaches. \"I trust that those in the industry who want to act responsibly will engage with us in a constructive fashion, and that we're going to get this done in short order,\" Obama said, delivering a pointed message to leading executives of credit-card issuing companies seated at his side. Both the House and the Senate are pursuing bills to give consumers greater protections. Obama said his economic advisers will examine the various proposals and work with Congress and the industry, but he made clear he intends to sign a law. At issue is how to protect consumers, particularly in a severe recession, while not imposing the kind of rules that could make it harder for banks to offer credit or put credit out of reach for many borrowers. Industry advocates are wary of those consequences and hopeful Obama will listen. more here: \"http://news.yahoo.com/s/ap/20090423/ap_on_go_pr_wh/us_obama_credit_cards\" \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090423, 
        "postID": 22, 
        "quote": "", 
        "reply": "Here is a link. Obama pledges protections for credit-card users President Barack Obama said Thursday his administration is determined to get a credit-card law that eliminates tricky fine print, sudden rate increases and late fees that give millions of consumers headaches. \"I trust that those in the industry who want to act responsibly will engage with us in a constructive fashion, and that we're going to get this done in short order,\" Obama said, delivering a pointed message to leading executives of credit-card issuing companies seated at his side. Both the House and the Senate are pursuing bills to give consumers greater protections. Obama said his economic advisers will examine the various proposals and work with Congress and the industry, but he made clear he intends to sign a law. At issue is how to protect consumers, particularly in a severe recession, while not imposing the kind of rules that could make it harder for banks to offer credit or put credit out of reach for many borrowers. Industry advocates are wary of those consequences and hopeful Obama will listen. more here: \"http://news.yahoo.com/s/ap/20090423/ap_on_go_pr_wh/us_obama_credit_cards\" \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_5710065122001", 
        "time": "2009-04-23 11:48:00", 
        "title": "Obama slams credit card issuers.", 
        "userID": "Anbar7"
    }, 
    {
        "content": "Why reduce credit card interest at this Obominations direction? Why is anybody falling for this control and type of power these are wheeling who apologize and seem to hate this land. These very ones develop their own fine fine print.", 
        "intTime": 20090423, 
        "postID": 23, 
        "quote": "", 
        "reply": "Why reduce credit card interest at this Obominations direction? Why is anybody falling for this control and type of power these are wheeling who apologize and seem to hate this land. These very ones develop their own fine fine print.", 
        "threadID": "672198221_5710065122001", 
        "time": "2009-04-23 13:12:00", 
        "title": "Obama slams credit card issuers.", 
        "userID": "5727609"
    }, 
    {
        "content": "quote: Originally posted by 5727609: Why reduce credit card interest at this Obominations direction? Why is anybody falling for this control and type of power these are wheeling who apologize and seem to hate this land. These very ones develop their own fine fine print. You seem to be saying it is our patriotic duty to passively sit back and watch our interest rates jump from 14% to 28% so CEOs can make billions more. We hate this country because we want to control usury? ... dude you have issues!", 
        "intTime": 20090423, 
        "postID": 24, 
        "quote": "Originally posted by 5727609: Why reduce credit card interest at this Obominations direction? Why is anybody falling for this control and type of power these are wheeling who apologize and seem to hate this land. These very ones develop their own fine fine print.", 
        "reply": " You seem to be saying it is our patriotic duty to passively sit back and watch our interest rates jump from 14% to 28% so CEOs can make billions more. We hate this country because we want to control usury? ... dude you have issues!", 
        "threadID": "672198221_5710065122001", 
        "time": "2009-04-23 13:16:00", 
        "title": "Obama slams credit card issuers.", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by 5727609: Why reduce credit card interest at this Obominations direction? Why is anybody falling for this control and type of power these are wheeling who apologize and seem to hate this land. These very ones develop their own fine fine print. as you no doubt well know all to many people DO NOT READ the terms of agreement on these things... just sign on the bottom line. I do not like PO but what I got out of his talk is he wants the \"fine print\" to become readable and halfazz easy to understand AND upfront.. Transparency, you know that thing that everybody else has to do except himself. But I actually agree that what he proposes is carried forward. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090423, 
        "postID": 25, 
        "quote": "Originally posted by 5727609: Why reduce credit card interest at this Obominations direction? Why is anybody falling for this control and type of power these are wheeling who apologize and seem to hate this land. These very ones develop their own fine fine print.", 
        "reply": " as you no doubt well know all to many people DO NOT READ the terms of agreement on these things... just sign on the bottom line. I do not like PO but what I got out of his talk is he wants the \"fine print\" to become readable and halfazz easy to understand AND upfront.. Transparency, you know that thing that everybody else has to do except himself. But I actually agree that what he proposes is carried forward. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_5710065122001", 
        "time": "2009-04-23 13:36:00", 
        "title": "Obama slams credit card issuers.", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "No more fine print is ok with me. Why would anybody with an IQ above 70 not want all that fine print eliminated?", 
        "intTime": 20090423, 
        "postID": 26, 
        "quote": "", 
        "reply": "No more fine print is ok with me. Why would anybody with an IQ above 70 not want all that fine print eliminated?", 
        "threadID": "672198221_5710065122001", 
        "time": "2009-04-23 13:42:00", 
        "title": "Obama slams credit card issuers.", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Duster6: No more fine print is ok with me. Why would anybody with an IQ above 70 not want all that fine print eliminated? doesn't want to eliminate it, he just wants it to be understandable and up front to those who, you know, those who dropped out of school or do not understand our language very well......you know, the one who bought a $180,000 house on a dishwashers wages. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090423, 
        "postID": 27, 
        "quote": "Originally posted by Duster6: No more fine print is ok with me. Why would anybody with an IQ above 70 not want all that fine print eliminated?", 
        "reply": " doesn't want to eliminate it, he just wants it to be understandable and up front to those who, you know, those who dropped out of school or do not understand our language very well......you know, the one who bought a $180,000 house on a dishwashers wages. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_5710065122001", 
        "time": "2009-04-23 13:53:00", 
        "title": "Obama slams credit card issuers.", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by m551sheridan: quote: Originally posted by Duster6: No more fine print is ok with me. Why would anybody with an IQ above 70 not want all that fine print eliminated? doesn't want to eliminate it, he just wants it to be understandable and up front to those who, you know, those who dropped out of school or do not understand our language very well......you know, the one who bought a $180,000 house on a dishwashers wages. ...and maybe for those who can't afford to hire an attorney to interpret for them.", 
        "intTime": 20090423, 
        "postID": 28, 
        "quote": "Originally posted by m551sheridan: quote: Originally posted by Duster6: No more fine print is ok with me. Why would anybody with an IQ above 70 not want all that fine print eliminated? doesn't want to eliminate it, he just wants it to be understandable and up front to those who, you know, those who dropped out of school or do not understand our language very well......you know, the one who bought a $180,000 house on a dishwashers wages.", 
        "reply": " ...and maybe for those who can't afford to hire an attorney to interpret for them.", 
        "threadID": "672198221_5710065122001", 
        "time": "2009-04-23 13:57:00", 
        "title": "Obama slams credit card issuers.", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "I wholeheartedly agree with the POTUS's message. Additionally, I would like the Companies to stop preying on college kids without a job. Problem is, these folks make formidable profits from late fees..and interest hikes... USURY, thou has a new face...consumer credit cards...", 
        "intTime": 20090423, 
        "postID": 29, 
        "quote": "", 
        "reply": "I wholeheartedly agree with the POTUS's message. Additionally, I would like the Companies to stop preying on college kids without a job. Problem is, these folks make formidable profits from late fees..and interest hikes... USURY, thou has a new face...consumer credit cards...", 
        "threadID": "672198221_5710065122001", 
        "time": "2009-04-23 15:58:00", 
        "title": "Obama slams credit card issuers.", 
        "userID": "strobelvets"
    }, 
    {
        "content": "Let's see--I can't think of anything worse in this world than those who run credit card companies. I equate them to people who steal piggy banks from children and the rest of my thoughts can't be printed. I gave up credit cards years ago and haven't missed them one minute. I have seen what they do to people and what the credit card companies do to people. Yep, some people just gotta have them to survive, but the law of average says credit card companies will get to you before you get to them and they won't lose a wink of sleep over your demise--neither will blood sucking bats. Now that Obama has \"threatened\" the major credit card companies---start counting the days before those companies do anything at all", 
        "intTime": 20090423, 
        "postID": 30, 
        "quote": "", 
        "reply": "Let's see--I can't think of anything worse in this world than those who run credit card companies. I equate them to people who steal piggy banks from children and the rest of my thoughts can't be printed. I gave up credit cards years ago and haven't missed them one minute. I have seen what they do to people and what the credit card companies do to people. Yep, some people just gotta have them to survive, but the law of average says credit card companies will get to you before you get to them and they won't lose a wink of sleep over your demise--neither will blood sucking bats. Now that Obama has \"threatened\" the major credit card companies---start counting the days before those companies do anything at all", 
        "threadID": "672198221_5710065122001", 
        "time": "2009-04-23 16:39:00", 
        "title": "Obama slams credit card issuers.", 
        "userID": "JmacOSI"
    }, 
    {
        "content": "quote: Originally posted by JmacOSI: Let's see--I can't think of anything worse in this world than those who run credit card companies. I equate them to people who steal piggy banks from children and the rest of my thoughts can't be printed. I gave up credit cards years ago and haven't missed them one minute. I have seen what they do to people and what the credit card companies do to people. Yep, some people just gotta have them to survive, but the law of average says credit card companies will get to you before you get to them and they won't lose a wink of sleep over your demise--neither will blood sucking bats. Now that Obama has \"threatened\" the major credit card companies---start counting the days before those companies do anything at all I tend to agree...some companies recently/ unexpectedly raised their rates...anyone with any smarts paid em off... Hmmmm...Folks are unemployed in increasing numbers...and need to pay their mortgages...somehow... A vicious cycle...", 
        "intTime": 20090423, 
        "postID": 31, 
        "quote": "Originally posted by JmacOSI: Let's see--I can't think of anything worse in this world than those who run credit card companies. I equate them to people who steal piggy banks from children and the rest of my thoughts can't be printed. I gave up credit cards years ago and haven't missed them one minute. I have seen what they do to people and what the credit card companies do to people. Yep, some people just gotta have them to survive, but the law of average says credit card companies will get to you before you get to them and they won't lose a wink of sleep over your demise--neither will blood sucking bats. Now that Obama has \"threatened\" the major credit card companies---start counting the days before those companies do anything at all", 
        "reply": " I tend to agree...some companies recently/ unexpectedly raised their rates...anyone with any smarts paid em off... Hmmmm...Folks are unemployed in increasing numbers...and need to pay their mortgages...somehow... A vicious cycle...", 
        "threadID": "672198221_5710065122001", 
        "time": "2009-04-23 16:54:00", 
        "title": "Obama slams credit card issuers.", 
        "userID": "strobelvets"
    }, 
    {
        "content": "It is getting so bad with credit card companies now that the guy (like me) who makes his payments on time and always pays a little extra gets his rates jacked up. A credit card is nice to have for car rentals, points for travel and hotel rooms and to order items on line. Last year I bought a HDTV through Amazon.com and saved $900.00 over buying it in the store at Best Buy. I'm not saying Obama has to meddle into banks business but I very much agree with him trying to force them to be fair and put their hand up on top of the table for all to see.", 
        "intTime": 20090423, 
        "postID": 32, 
        "quote": "", 
        "reply": "It is getting so bad with credit card companies now that the guy (like me) who makes his payments on time and always pays a little extra gets his rates jacked up. A credit card is nice to have for car rentals, points for travel and hotel rooms and to order items on line. Last year I bought a HDTV through Amazon.com and saved $900.00 over buying it in the store at Best Buy. I'm not saying Obama has to meddle into banks business but I very much agree with him trying to force them to be fair and put their hand up on top of the table for all to see.", 
        "threadID": "672198221_5710065122001", 
        "time": "2009-04-23 17:13:00", 
        "title": "Obama slams credit card issuers.", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Duster6: It is getting so bad with credit card companies now that the guy (like me) who makes his payments on time and always pays a little extra gets his rates jacked up. A credit card is nice to have for car rentals, points for travel and hotel rooms and to order items on line. Last year I bought a HDTV through Amazon.com and saved $900.00 over buying it in the store at Best Buy. I'm not saying Obama has to meddle into banks business but I very much agree with him trying to force them to be fair and put their hand up on top of the table for all to see. I thought it might have been a \"global\" increase...no reason to hit me... Interesting it came just before the Presidents meeting with the consumer credit pirates...", 
        "intTime": 20090423, 
        "postID": 33, 
        "quote": "Originally posted by Duster6: It is getting so bad with credit card companies now that the guy (like me) who makes his payments on time and always pays a little extra gets his rates jacked up. A credit card is nice to have for car rentals, points for travel and hotel rooms and to order items on line. Last year I bought a HDTV through Amazon.com and saved $900.00 over buying it in the store at Best Buy. I'm not saying Obama has to meddle into banks business but I very much agree with him trying to force them to be fair and put their hand up on top of the table for all to see.", 
        "reply": " I thought it might have been a \"global\" increase...no reason to hit me... Interesting it came just before the Presidents meeting with the consumer credit pirates...", 
        "threadID": "672198221_5710065122001", 
        "time": "2009-04-23 17:46:00", 
        "title": "Obama slams credit card issuers.", 
        "userID": "strobelvets"
    }, 
    {
        "content": "quote: Originally posted by Duster6: My link to this story is Fox news @ 2pm today and a short link on todays USA TODAY web page. Obama told the major credit card issuers that he wanted to see change in the way these banks and credit card issuers do business. He mentioned that he wanted to see fair and responsible rates and that they not double or triple just because hard times are here. He also wants to see no more fine print. Transparent he says. I say if he can pull this off I will give him a big hug. Lets just see how much power he has over these big companies. He stated that if these credit card issuers couldn't come up with a fair plan then he and Congress would. To be continued. I don't know how legal it is but, I agree... As much as I don't care for some of the things that Obama does, on this one, I agree... Respectfully, SUNLINER81", 
        "intTime": 20090423, 
        "postID": 34, 
        "quote": "Originally posted by Duster6: My link to this story is Fox news @ 2pm today and a short link on todays USA TODAY web page. Obama told the major credit card issuers that he wanted to see change in the way these banks and credit card issuers do business. He mentioned that he wanted to see fair and responsible rates and that they not double or triple just because hard times are here. He also wants to see no more fine print. Transparent he says. I say if he can pull this off I will give him a big hug. Lets just see how much power he has over these big companies. He stated that if these credit card issuers couldn't come up with a fair plan then he and Congress would. To be continued.", 
        "reply": " I don't know how legal it is but, I agree... As much as I don't care for some of the things that Obama does, on this one, I agree... Respectfully, SUNLINER81", 
        "threadID": "672198221_5710065122001", 
        "time": "2009-04-23 18:37:00", 
        "title": "Obama slams credit card issuers.", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by 5727609: Why reduce credit card interest at this Obominations direction? Why is anybody falling for this control and type of power these are wheeling who apologize and seem to hate this land. These very ones develop their own fine fine print. Credit where credit is due... No pun intended... LOL Respectfully, SUNLINER81", 
        "intTime": 20090423, 
        "postID": 35, 
        "quote": "Originally posted by 5727609: Why reduce credit card interest at this Obominations direction? Why is anybody falling for this control and type of power these are wheeling who apologize and seem to hate this land. These very ones develop their own fine fine print.", 
        "reply": " Credit where credit is due... No pun intended... LOL Respectfully, SUNLINER81", 
        "threadID": "672198221_5710065122001", 
        "time": "2009-04-23 18:39:00", 
        "title": "Obama slams credit card issuers.", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "I get 2-3 come-ons from Capital One every week. I wonder how much $ they waste on all that marketing that could be used to restrain interest rates and fees? Wuzinmywallet? Not Capital One!", 
        "intTime": 20090423, 
        "postID": 36, 
        "quote": "", 
        "reply": "I get 2-3 come-ons from Capital One every week. I wonder how much $ they waste on all that marketing that could be used to restrain interest rates and fees? Wuzinmywallet? Not Capital One!", 
        "threadID": "672198221_5710065122001", 
        "time": "2009-04-23 18:45:00", 
        "title": "Obama slams credit card issuers.", 
        "userID": "Motive25"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: quote: Originally posted by Duster6: My link to this story is Fox news @ 2pm today and a short link on todays USA TODAY web page. Obama told the major credit card issuers that he wanted to see change in the way these banks and credit card issuers do business. He mentioned that he wanted to see fair and responsible rates and that they not double or triple just because hard times are here. He also wants to see no more fine print. Transparent he says. I say if he can pull this off I will give him a big hug. Lets just see how much power he has over these big companies. He stated that if these credit card issuers couldn't come up with a fair plan then he and Congress would. To be continued. I don't know how legal it is but, I agree... As much as I don't care for some of the things that Obama does, on this one, I agree... Respectfully, SUNLINER81 Government sets interest rates all the time. In fact we USED to regulate the top rates of Credit Card banks - But that got deregulated back in the eighties. Dave", 
        "intTime": 20090423, 
        "postID": 37, 
        "quote": "Originally posted by SUNLINER81: quote: Originally posted by Duster6: My link to this story is Fox news @ 2pm today and a short link on todays USA TODAY web page. Obama told the major credit card issuers that he wanted to see change in the way these banks and credit card issuers do business. He mentioned that he wanted to see fair and responsible rates and that they not double or triple just because hard times are here. He also wants to see no more fine print. Transparent he says. I say if he can pull this off I will give him a big hug. Lets just see how much power he has over these big companies. He stated that if these credit card issuers couldn't come up with a fair plan then he and Congress would. To be continued. I don't know how legal it is but, I agree... As much as I don't care for some of the things that Obama does, on this one, I agree... Respectfully, SUNLINER81", 
        "reply": " Government sets interest rates all the time. In fact we USED to regulate the top rates of Credit Card banks - But that got deregulated back in the eighties. Dave", 
        "threadID": "672198221_5710065122001", 
        "time": "2009-04-23 18:57:00", 
        "title": "Obama slams credit card issuers.", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by SUNLINER81: quote: Originally posted by Duster6: My link to this story is Fox news @ 2pm today and a short link on todays USA TODAY web page. Obama told the major credit card issuers that he wanted to see change in the way these banks and credit card issuers do business. He mentioned that he wanted to see fair and responsible rates and that they not double or triple just because hard times are here. He also wants to see no more fine print. Transparent he says. I say if he can pull this off I will give him a big hug. Lets just see how much power he has over these big companies. He stated that if these credit card issuers couldn't come up with a fair plan then he and Congress would. To be continued. I don't know how legal it is but, I agree... As much as I don't care for some of the things that Obama does, on this one, I agree... Respectfully, SUNLINER81 Government sets interest rates all the time. In fact we USED to regulate the top rates of Credit Card banks - But that got deregulated back in the eighties. Dave Thanks for the info... Respectfully, SUNLINER81", 
        "intTime": 20090423, 
        "postID": 38, 
        "quote": "Originally posted by Grachus: quote: Originally posted by SUNLINER81: quote: Originally posted by Duster6: My link to this story is Fox news @ 2pm today and a short link on todays USA TODAY web page. Obama told the major credit card issuers that he wanted to see change in the way these banks and credit card issuers do business. He mentioned that he wanted to see fair and responsible rates and that they not double or triple just because hard times are here. He also wants to see no more fine print. Transparent he says. I say if he can pull this off I will give him a big hug. Lets just see how much power he has over these big companies. He stated that if these credit card issuers couldn't come up with a fair plan then he and Congress would. To be continued. I don't know how legal it is but, I agree... As much as I don't care for some of the things that Obama does, on this one, I agree... Respectfully, SUNLINER81 Government sets interest rates all the time. In fact we USED to regulate the top rates of Credit Card banks - But that got deregulated back in the eighties. Dave", 
        "reply": " Thanks for the info... Respectfully, SUNLINER81", 
        "threadID": "672198221_5710065122001", 
        "time": "2009-04-23 19:04:00", 
        "title": "Obama slams credit card issuers.", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "Ah, another excuse for The One to expand the Federal Gubmint and \"H\"is power, while simultaneously demonizing the capitalist system \"H\"e hates and encouraging more class warfare. God help us.", 
        "intTime": 20090423, 
        "postID": 39, 
        "quote": "", 
        "reply": "Ah, another excuse for The One to expand the Federal Gubmint and \"H\"is power, while simultaneously demonizing the capitalist system \"H\"e hates and encouraging more class warfare. God help us.", 
        "threadID": "672198221_5710065122001", 
        "time": "2009-04-23 20:37:00", 
        "title": "Obama slams credit card issuers.", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "Mr President, I supplied a picture for my NFCU checks to be put on my checks and the company messed it up. Can you pls give a speech about check publishing companies that make typos and other errors on customer's checks? Thank You, Concerned Citizen", 
        "intTime": 20090423, 
        "postID": 40, 
        "quote": "", 
        "reply": "Mr President, I supplied a picture for my NFCU checks to be put on my checks and the company messed it up. Can you pls give a speech about check publishing companies that make typos and other errors on customer's checks? Thank You, Concerned Citizen", 
        "threadID": "672198221_5710065122001", 
        "time": "2009-04-23 20:47:00", 
        "title": "Obama slams credit card issuers.", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "My link to this story is Fox news @ 2pm today and a short link on todays USA TODAY web page. Obama told the major credit card issuers that he wanted to see change in the way these banks and credit card issuers do business. He mentioned that he wanted to see fair and responsible rates and that they not double or triple just because hard times are here. He also wants to see no more fine print. Transparent he says. I say if he can pull this off I will give him a big hug. Lets just see how much power he has over these big companies. He stated that if these credit card issuers couldn't come up with a fair plan then he and Congress would. To be continued.", 
        "intTime": 20090423, 
        "postID": 41, 
        "quote": "", 
        "reply": "My link to this story is Fox news @ 2pm today and a short link on todays USA TODAY web page. Obama told the major credit card issuers that he wanted to see change in the way these banks and credit card issuers do business. He mentioned that he wanted to see fair and responsible rates and that they not double or triple just because hard times are here. He also wants to see no more fine print. Transparent he says. I say if he can pull this off I will give him a big hug. Lets just see how much power he has over these big companies. He stated that if these credit card issuers couldn't come up with a fair plan then he and Congress would. To be continued.", 
        "threadID": "672198221_5710065122001", 
        "time": "2009-04-23 11:32:00", 
        "title": "Obama slams credit card issuers.", 
        "userID": "Duster6"
    }, 
    {
        "content": "Here is a link. Obama pledges protections for credit-card users President Barack Obama said Thursday his administration is determined to get a credit-card law that eliminates tricky fine print, sudden rate increases and late fees that give millions of consumers headaches. \"I trust that those in the industry who want to act responsibly will engage with us in a constructive fashion, and that we're going to get this done in short order,\" Obama said, delivering a pointed message to leading executives of credit-card issuing companies seated at his side. Both the House and the Senate are pursuing bills to give consumers greater protections. Obama said his economic advisers will examine the various proposals and work with Congress and the industry, but he made clear he intends to sign a law. At issue is how to protect consumers, particularly in a severe recession, while not imposing the kind of rules that could make it harder for banks to offer credit or put credit out of reach for many borrowers. Industry advocates are wary of those consequences and hopeful Obama will listen. more here: \"http://news.yahoo.com/s/ap/20090423/ap_on_go_pr_wh/us_obama_credit_cards\" \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090423, 
        "postID": 42, 
        "quote": "", 
        "reply": "Here is a link. Obama pledges protections for credit-card users President Barack Obama said Thursday his administration is determined to get a credit-card law that eliminates tricky fine print, sudden rate increases and late fees that give millions of consumers headaches. \"I trust that those in the industry who want to act responsibly will engage with us in a constructive fashion, and that we're going to get this done in short order,\" Obama said, delivering a pointed message to leading executives of credit-card issuing companies seated at his side. Both the House and the Senate are pursuing bills to give consumers greater protections. Obama said his economic advisers will examine the various proposals and work with Congress and the industry, but he made clear he intends to sign a law. At issue is how to protect consumers, particularly in a severe recession, while not imposing the kind of rules that could make it harder for banks to offer credit or put credit out of reach for many borrowers. Industry advocates are wary of those consequences and hopeful Obama will listen. more here: \"http://news.yahoo.com/s/ap/20090423/ap_on_go_pr_wh/us_obama_credit_cards\" \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_5710065122001", 
        "time": "2009-04-23 11:48:00", 
        "title": "Obama slams credit card issuers.", 
        "userID": "Anbar7"
    }, 
    {
        "content": "Why reduce credit card interest at this Obominations direction? Why is anybody falling for this control and type of power these are wheeling who apologize and seem to hate this land. These very ones develop their own fine fine print.", 
        "intTime": 20090423, 
        "postID": 43, 
        "quote": "", 
        "reply": "Why reduce credit card interest at this Obominations direction? Why is anybody falling for this control and type of power these are wheeling who apologize and seem to hate this land. These very ones develop their own fine fine print.", 
        "threadID": "672198221_5710065122001", 
        "time": "2009-04-23 13:12:00", 
        "title": "Obama slams credit card issuers.", 
        "userID": "5727609"
    }, 
    {
        "content": "quote: Originally posted by 5727609: Why reduce credit card interest at this Obominations direction? Why is anybody falling for this control and type of power these are wheeling who apologize and seem to hate this land. These very ones develop their own fine fine print. You seem to be saying it is our patriotic duty to passively sit back and watch our interest rates jump from 14% to 28% so CEOs can make billions more. We hate this country because we want to control usury? ... dude you have issues!", 
        "intTime": 20090423, 
        "postID": 44, 
        "quote": "Originally posted by 5727609: Why reduce credit card interest at this Obominations direction? Why is anybody falling for this control and type of power these are wheeling who apologize and seem to hate this land. These very ones develop their own fine fine print.", 
        "reply": " You seem to be saying it is our patriotic duty to passively sit back and watch our interest rates jump from 14% to 28% so CEOs can make billions more. We hate this country because we want to control usury? ... dude you have issues!", 
        "threadID": "672198221_5710065122001", 
        "time": "2009-04-23 13:16:00", 
        "title": "Obama slams credit card issuers.", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by 5727609: Why reduce credit card interest at this Obominations direction? Why is anybody falling for this control and type of power these are wheeling who apologize and seem to hate this land. These very ones develop their own fine fine print. as you no doubt well know all to many people DO NOT READ the terms of agreement on these things... just sign on the bottom line. I do not like PO but what I got out of his talk is he wants the \"fine print\" to become readable and halfazz easy to understand AND upfront.. Transparency, you know that thing that everybody else has to do except himself. But I actually agree that what he proposes is carried forward. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090423, 
        "postID": 45, 
        "quote": "Originally posted by 5727609: Why reduce credit card interest at this Obominations direction? Why is anybody falling for this control and type of power these are wheeling who apologize and seem to hate this land. These very ones develop their own fine fine print.", 
        "reply": " as you no doubt well know all to many people DO NOT READ the terms of agreement on these things... just sign on the bottom line. I do not like PO but what I got out of his talk is he wants the \"fine print\" to become readable and halfazz easy to understand AND upfront.. Transparency, you know that thing that everybody else has to do except himself. But I actually agree that what he proposes is carried forward. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_5710065122001", 
        "time": "2009-04-23 13:36:00", 
        "title": "Obama slams credit card issuers.", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "No more fine print is ok with me. Why would anybody with an IQ above 70 not want all that fine print eliminated?", 
        "intTime": 20090423, 
        "postID": 46, 
        "quote": "", 
        "reply": "No more fine print is ok with me. Why would anybody with an IQ above 70 not want all that fine print eliminated?", 
        "threadID": "672198221_5710065122001", 
        "time": "2009-04-23 13:42:00", 
        "title": "Obama slams credit card issuers.", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Duster6: No more fine print is ok with me. Why would anybody with an IQ above 70 not want all that fine print eliminated? doesn't want to eliminate it, he just wants it to be understandable and up front to those who, you know, those who dropped out of school or do not understand our language very well......you know, the one who bought a $180,000 house on a dishwashers wages. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090423, 
        "postID": 47, 
        "quote": "Originally posted by Duster6: No more fine print is ok with me. Why would anybody with an IQ above 70 not want all that fine print eliminated?", 
        "reply": " doesn't want to eliminate it, he just wants it to be understandable and up front to those who, you know, those who dropped out of school or do not understand our language very well......you know, the one who bought a $180,000 house on a dishwashers wages. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_5710065122001", 
        "time": "2009-04-23 13:53:00", 
        "title": "Obama slams credit card issuers.", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by m551sheridan: quote: Originally posted by Duster6: No more fine print is ok with me. Why would anybody with an IQ above 70 not want all that fine print eliminated? doesn't want to eliminate it, he just wants it to be understandable and up front to those who, you know, those who dropped out of school or do not understand our language very well......you know, the one who bought a $180,000 house on a dishwashers wages. ...and maybe for those who can't afford to hire an attorney to interpret for them.", 
        "intTime": 20090423, 
        "postID": 48, 
        "quote": "Originally posted by m551sheridan: quote: Originally posted by Duster6: No more fine print is ok with me. Why would anybody with an IQ above 70 not want all that fine print eliminated? doesn't want to eliminate it, he just wants it to be understandable and up front to those who, you know, those who dropped out of school or do not understand our language very well......you know, the one who bought a $180,000 house on a dishwashers wages.", 
        "reply": " ...and maybe for those who can't afford to hire an attorney to interpret for them.", 
        "threadID": "672198221_5710065122001", 
        "time": "2009-04-23 13:57:00", 
        "title": "Obama slams credit card issuers.", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "I wholeheartedly agree with the POTUS's message. Additionally, I would like the Companies to stop preying on college kids without a job. Problem is, these folks make formidable profits from late fees..and interest hikes... USURY, thou has a new face...consumer credit cards...", 
        "intTime": 20090423, 
        "postID": 49, 
        "quote": "", 
        "reply": "I wholeheartedly agree with the POTUS's message. Additionally, I would like the Companies to stop preying on college kids without a job. Problem is, these folks make formidable profits from late fees..and interest hikes... USURY, thou has a new face...consumer credit cards...", 
        "threadID": "672198221_5710065122001", 
        "time": "2009-04-23 15:58:00", 
        "title": "Obama slams credit card issuers.", 
        "userID": "strobelvets"
    }, 
    {
        "content": "Let's see--I can't think of anything worse in this world than those who run credit card companies. I equate them to people who steal piggy banks from children and the rest of my thoughts can't be printed. I gave up credit cards years ago and haven't missed them one minute. I have seen what they do to people and what the credit card companies do to people. Yep, some people just gotta have them to survive, but the law of average says credit card companies will get to you before you get to them and they won't lose a wink of sleep over your demise--neither will blood sucking bats. Now that Obama has \"threatened\" the major credit card companies---start counting the days before those companies do anything at all", 
        "intTime": 20090423, 
        "postID": 50, 
        "quote": "", 
        "reply": "Let's see--I can't think of anything worse in this world than those who run credit card companies. I equate them to people who steal piggy banks from children and the rest of my thoughts can't be printed. I gave up credit cards years ago and haven't missed them one minute. I have seen what they do to people and what the credit card companies do to people. Yep, some people just gotta have them to survive, but the law of average says credit card companies will get to you before you get to them and they won't lose a wink of sleep over your demise--neither will blood sucking bats. Now that Obama has \"threatened\" the major credit card companies---start counting the days before those companies do anything at all", 
        "threadID": "672198221_5710065122001", 
        "time": "2009-04-23 16:39:00", 
        "title": "Obama slams credit card issuers.", 
        "userID": "JmacOSI"
    }, 
    {
        "content": "quote: Originally posted by JmacOSI: Let's see--I can't think of anything worse in this world than those who run credit card companies. I equate them to people who steal piggy banks from children and the rest of my thoughts can't be printed. I gave up credit cards years ago and haven't missed them one minute. I have seen what they do to people and what the credit card companies do to people. Yep, some people just gotta have them to survive, but the law of average says credit card companies will get to you before you get to them and they won't lose a wink of sleep over your demise--neither will blood sucking bats. Now that Obama has \"threatened\" the major credit card companies---start counting the days before those companies do anything at all I tend to agree...some companies recently/ unexpectedly raised their rates...anyone with any smarts paid em off... Hmmmm...Folks are unemployed in increasing numbers...and need to pay their mortgages...somehow... A vicious cycle...", 
        "intTime": 20090423, 
        "postID": 51, 
        "quote": "Originally posted by JmacOSI: Let's see--I can't think of anything worse in this world than those who run credit card companies. I equate them to people who steal piggy banks from children and the rest of my thoughts can't be printed. I gave up credit cards years ago and haven't missed them one minute. I have seen what they do to people and what the credit card companies do to people. Yep, some people just gotta have them to survive, but the law of average says credit card companies will get to you before you get to them and they won't lose a wink of sleep over your demise--neither will blood sucking bats. Now that Obama has \"threatened\" the major credit card companies---start counting the days before those companies do anything at all", 
        "reply": " I tend to agree...some companies recently/ unexpectedly raised their rates...anyone with any smarts paid em off... Hmmmm...Folks are unemployed in increasing numbers...and need to pay their mortgages...somehow... A vicious cycle...", 
        "threadID": "672198221_5710065122001", 
        "time": "2009-04-23 16:54:00", 
        "title": "Obama slams credit card issuers.", 
        "userID": "strobelvets"
    }, 
    {
        "content": "It is getting so bad with credit card companies now that the guy (like me) who makes his payments on time and always pays a little extra gets his rates jacked up. A credit card is nice to have for car rentals, points for travel and hotel rooms and to order items on line. Last year I bought a HDTV through Amazon.com and saved $900.00 over buying it in the store at Best Buy. I'm not saying Obama has to meddle into banks business but I very much agree with him trying to force them to be fair and put their hand up on top of the table for all to see.", 
        "intTime": 20090423, 
        "postID": 52, 
        "quote": "", 
        "reply": "It is getting so bad with credit card companies now that the guy (like me) who makes his payments on time and always pays a little extra gets his rates jacked up. A credit card is nice to have for car rentals, points for travel and hotel rooms and to order items on line. Last year I bought a HDTV through Amazon.com and saved $900.00 over buying it in the store at Best Buy. I'm not saying Obama has to meddle into banks business but I very much agree with him trying to force them to be fair and put their hand up on top of the table for all to see.", 
        "threadID": "672198221_5710065122001", 
        "time": "2009-04-23 17:13:00", 
        "title": "Obama slams credit card issuers.", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Duster6: It is getting so bad with credit card companies now that the guy (like me) who makes his payments on time and always pays a little extra gets his rates jacked up. A credit card is nice to have for car rentals, points for travel and hotel rooms and to order items on line. Last year I bought a HDTV through Amazon.com and saved $900.00 over buying it in the store at Best Buy. I'm not saying Obama has to meddle into banks business but I very much agree with him trying to force them to be fair and put their hand up on top of the table for all to see. I thought it might have been a \"global\" increase...no reason to hit me... Interesting it came just before the Presidents meeting with the consumer credit pirates...", 
        "intTime": 20090423, 
        "postID": 53, 
        "quote": "Originally posted by Duster6: It is getting so bad with credit card companies now that the guy (like me) who makes his payments on time and always pays a little extra gets his rates jacked up. A credit card is nice to have for car rentals, points for travel and hotel rooms and to order items on line. Last year I bought a HDTV through Amazon.com and saved $900.00 over buying it in the store at Best Buy. I'm not saying Obama has to meddle into banks business but I very much agree with him trying to force them to be fair and put their hand up on top of the table for all to see.", 
        "reply": " I thought it might have been a \"global\" increase...no reason to hit me... Interesting it came just before the Presidents meeting with the consumer credit pirates...", 
        "threadID": "672198221_5710065122001", 
        "time": "2009-04-23 17:46:00", 
        "title": "Obama slams credit card issuers.", 
        "userID": "strobelvets"
    }, 
    {
        "content": "quote: Originally posted by Duster6: My link to this story is Fox news @ 2pm today and a short link on todays USA TODAY web page. Obama told the major credit card issuers that he wanted to see change in the way these banks and credit card issuers do business. He mentioned that he wanted to see fair and responsible rates and that they not double or triple just because hard times are here. He also wants to see no more fine print. Transparent he says. I say if he can pull this off I will give him a big hug. Lets just see how much power he has over these big companies. He stated that if these credit card issuers couldn't come up with a fair plan then he and Congress would. To be continued. I don't know how legal it is but, I agree... As much as I don't care for some of the things that Obama does, on this one, I agree... Respectfully, SUNLINER81", 
        "intTime": 20090423, 
        "postID": 54, 
        "quote": "Originally posted by Duster6: My link to this story is Fox news @ 2pm today and a short link on todays USA TODAY web page. Obama told the major credit card issuers that he wanted to see change in the way these banks and credit card issuers do business. He mentioned that he wanted to see fair and responsible rates and that they not double or triple just because hard times are here. He also wants to see no more fine print. Transparent he says. I say if he can pull this off I will give him a big hug. Lets just see how much power he has over these big companies. He stated that if these credit card issuers couldn't come up with a fair plan then he and Congress would. To be continued.", 
        "reply": " I don't know how legal it is but, I agree... As much as I don't care for some of the things that Obama does, on this one, I agree... Respectfully, SUNLINER81", 
        "threadID": "672198221_5710065122001", 
        "time": "2009-04-23 18:37:00", 
        "title": "Obama slams credit card issuers.", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by 5727609: Why reduce credit card interest at this Obominations direction? Why is anybody falling for this control and type of power these are wheeling who apologize and seem to hate this land. These very ones develop their own fine fine print. Credit where credit is due... No pun intended... LOL Respectfully, SUNLINER81", 
        "intTime": 20090423, 
        "postID": 55, 
        "quote": "Originally posted by 5727609: Why reduce credit card interest at this Obominations direction? Why is anybody falling for this control and type of power these are wheeling who apologize and seem to hate this land. These very ones develop their own fine fine print.", 
        "reply": " Credit where credit is due... No pun intended... LOL Respectfully, SUNLINER81", 
        "threadID": "672198221_5710065122001", 
        "time": "2009-04-23 18:39:00", 
        "title": "Obama slams credit card issuers.", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "I get 2-3 come-ons from Capital One every week. I wonder how much $ they waste on all that marketing that could be used to restrain interest rates and fees? Wuzinmywallet? Not Capital One!", 
        "intTime": 20090423, 
        "postID": 56, 
        "quote": "", 
        "reply": "I get 2-3 come-ons from Capital One every week. I wonder how much $ they waste on all that marketing that could be used to restrain interest rates and fees? Wuzinmywallet? Not Capital One!", 
        "threadID": "672198221_5710065122001", 
        "time": "2009-04-23 18:45:00", 
        "title": "Obama slams credit card issuers.", 
        "userID": "Motive25"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: quote: Originally posted by Duster6: My link to this story is Fox news @ 2pm today and a short link on todays USA TODAY web page. Obama told the major credit card issuers that he wanted to see change in the way these banks and credit card issuers do business. He mentioned that he wanted to see fair and responsible rates and that they not double or triple just because hard times are here. He also wants to see no more fine print. Transparent he says. I say if he can pull this off I will give him a big hug. Lets just see how much power he has over these big companies. He stated that if these credit card issuers couldn't come up with a fair plan then he and Congress would. To be continued. I don't know how legal it is but, I agree... As much as I don't care for some of the things that Obama does, on this one, I agree... Respectfully, SUNLINER81 Government sets interest rates all the time. In fact we USED to regulate the top rates of Credit Card banks - But that got deregulated back in the eighties. Dave", 
        "intTime": 20090423, 
        "postID": 57, 
        "quote": "Originally posted by SUNLINER81: quote: Originally posted by Duster6: My link to this story is Fox news @ 2pm today and a short link on todays USA TODAY web page. Obama told the major credit card issuers that he wanted to see change in the way these banks and credit card issuers do business. He mentioned that he wanted to see fair and responsible rates and that they not double or triple just because hard times are here. He also wants to see no more fine print. Transparent he says. I say if he can pull this off I will give him a big hug. Lets just see how much power he has over these big companies. He stated that if these credit card issuers couldn't come up with a fair plan then he and Congress would. To be continued. I don't know how legal it is but, I agree... As much as I don't care for some of the things that Obama does, on this one, I agree... Respectfully, SUNLINER81", 
        "reply": " Government sets interest rates all the time. In fact we USED to regulate the top rates of Credit Card banks - But that got deregulated back in the eighties. Dave", 
        "threadID": "672198221_5710065122001", 
        "time": "2009-04-23 18:57:00", 
        "title": "Obama slams credit card issuers.", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by SUNLINER81: quote: Originally posted by Duster6: My link to this story is Fox news @ 2pm today and a short link on todays USA TODAY web page. Obama told the major credit card issuers that he wanted to see change in the way these banks and credit card issuers do business. He mentioned that he wanted to see fair and responsible rates and that they not double or triple just because hard times are here. He also wants to see no more fine print. Transparent he says. I say if he can pull this off I will give him a big hug. Lets just see how much power he has over these big companies. He stated that if these credit card issuers couldn't come up with a fair plan then he and Congress would. To be continued. I don't know how legal it is but, I agree... As much as I don't care for some of the things that Obama does, on this one, I agree... Respectfully, SUNLINER81 Government sets interest rates all the time. In fact we USED to regulate the top rates of Credit Card banks - But that got deregulated back in the eighties. Dave Thanks for the info... Respectfully, SUNLINER81", 
        "intTime": 20090423, 
        "postID": 58, 
        "quote": "Originally posted by Grachus: quote: Originally posted by SUNLINER81: quote: Originally posted by Duster6: My link to this story is Fox news @ 2pm today and a short link on todays USA TODAY web page. Obama told the major credit card issuers that he wanted to see change in the way these banks and credit card issuers do business. He mentioned that he wanted to see fair and responsible rates and that they not double or triple just because hard times are here. He also wants to see no more fine print. Transparent he says. I say if he can pull this off I will give him a big hug. Lets just see how much power he has over these big companies. He stated that if these credit card issuers couldn't come up with a fair plan then he and Congress would. To be continued. I don't know how legal it is but, I agree... As much as I don't care for some of the things that Obama does, on this one, I agree... Respectfully, SUNLINER81 Government sets interest rates all the time. In fact we USED to regulate the top rates of Credit Card banks - But that got deregulated back in the eighties. Dave", 
        "reply": " Thanks for the info... Respectfully, SUNLINER81", 
        "threadID": "672198221_5710065122001", 
        "time": "2009-04-23 19:04:00", 
        "title": "Obama slams credit card issuers.", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "Ah, another excuse for The One to expand the Federal Gubmint and \"H\"is power, while simultaneously demonizing the capitalist system \"H\"e hates and encouraging more class warfare. God help us.", 
        "intTime": 20090423, 
        "postID": 59, 
        "quote": "", 
        "reply": "Ah, another excuse for The One to expand the Federal Gubmint and \"H\"is power, while simultaneously demonizing the capitalist system \"H\"e hates and encouraging more class warfare. God help us.", 
        "threadID": "672198221_5710065122001", 
        "time": "2009-04-23 20:37:00", 
        "title": "Obama slams credit card issuers.", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "Mr President, I supplied a picture for my NFCU checks to be put on my checks and the company messed it up. Can you pls give a speech about check publishing companies that make typos and other errors on customer's checks? Thank You, Concerned Citizen", 
        "intTime": 20090423, 
        "postID": 60, 
        "quote": "", 
        "reply": "Mr President, I supplied a picture for my NFCU checks to be put on my checks and the company messed it up. Can you pls give a speech about check publishing companies that make typos and other errors on customer's checks? Thank You, Concerned Citizen", 
        "threadID": "672198221_5710065122001", 
        "time": "2009-04-23 20:47:00", 
        "title": "Obama slams credit card issuers.", 
        "userID": "GunnyRet03"
    }
]