[
    {
        "content": "I won't deride Georgia since it wouldn't surprise me a bit to find that other states are much the same ... if not worse. It seems to me that those responsible for spending our tax dollars ... at state and federal level ... should be audited annually and those that are not fiscally responsible with their own money removed from office. quote: ATLANTA — Nearly 10 percent of Georgia state legislators are late filing or paying their state taxes, and state Sen. Robert Brown is apparently among them. Brown, D-Macon, said Wednesday he’s not sure whether he actually owes the state or federal government any money because he hasn’t filed tax returns. He said he’s gotten extensions, but he declined to give more information or say for what years he received filing extensions. He told Atlanta station WXIA-TV that he had not filed his income taxes at least in the past two years, according to a report on the station’s Web site. He volunteered the information while arguing against a change in Senate rules that would make it easier for the body to take action against, or even expel, members who don’t pay their taxes. That effort came in response to the discovery late last week that 19 legislators had failed to pay income taxes, some for several years. Those legislators have not been identified, due to Georgia Department of Revenue and federal Internal Revenue Service privacy policies. But a list, without names, was prepared and given to the chairmen of the House and Senate ethics committees, at their request, Revenue Commissioner Bart Graham said. Graham said Wednesday that the list has grown to 22, with three of the legislators actually having liens levied against them or wages garnished so taxes could be collected. That would make their names public record, but Graham said Wednesday evening that he didn’t know them off the top of his head. <more> \"http://www.macon.com/198/story/640079.html Lately I've been getting the impression that I am one of only a few of us dumbas*es that pay our taxes accurately and on time. Note there is nothing partisan so far ... a mix of both Republicans and Democrats involved. Having said that, I'm sure the Republicans are RINOs ...", 
        "intTime": 20090305, 
        "postID": 1, 
        "quote": "ATLANTA — Nearly 10 percent of Georgia state legislators are late filing or paying their state taxes, and state Sen. Robert Brown is apparently among them. Brown, D-Macon, said Wednesday he’s not sure whether he actually owes the state or federal government any money because he hasn’t filed tax returns. He said he’s gotten extensions, but he declined to give more information or say for what years he received filing extensions. He told Atlanta station WXIA-TV that he had not filed his income taxes at least in the past two years, according to a report on the station’s Web site. He volunteered the information while arguing against a change in Senate rules that would make it easier for the body to take action against, or even expel, members who don’t pay their taxes. That effort came in response to the discovery late last week that 19 legislators had failed to pay income taxes, some for several years. Those legislators have not been identified, due to Georgia Department of Revenue and federal Internal Revenue Service privacy policies. But a list, without names, was prepared and given to the chairmen of the House and Senate ethics committees, at their request, Revenue Commissioner Bart Graham said. Graham said Wednesday that the list has grown to 22, with three of the legislators actually having liens levied against them or wages garnished so taxes could be collected. That would make their names public record, but Graham said Wednesday evening that he didn’t know them off the top of his head. <more> \"http://www.macon.com/198/story/640079.html", 
        "reply": "I won't deride Georgia since it wouldn't surprise me a bit to find that other states are much the same ... if not worse. It seems to me that those responsible for spending our tax dollars ... at state and federal level ... should be audited annually and those that are not fiscally responsible with their own money removed from office.  Lately I've been getting the impression that I am one of only a few of us dumbas*es that pay our taxes accurately and on time. Note there is nothing partisan so far ... a mix of both Republicans and Democrats involved. Having said that, I'm sure the Republicans are RINOs ...", 
        "threadID": "672198221_6020030712001", 
        "time": "2009-03-05 15:05:00", 
        "title": "22 Georgia Legislators Behind on Taxes", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "No H&R Block's in GA????", 
        "intTime": 20090305, 
        "postID": 2, 
        "quote": "", 
        "reply": "No H&R Block's in GA????", 
        "threadID": "672198221_6020030712001", 
        "time": "2009-03-05 15:38:00", 
        "title": "22 Georgia Legislators Behind on Taxes", 
        "userID": "SignalSgtWilliams"
    }
]