[
    {
        "content": "\"http://abcnews.go.com/Politics/Health/story?id=7555066&page=1\" As part of cost savings, primary care physicians would get most of the control over a patient's health care, and there would be better coordination between patients and their primary care doctors, who would serve as a \"coach\" and keep track of their patients' health. Potentially cost-cutting measures would reward \"physicians for working together to keep people healthy and to bring them back to health as quickly and inexpensively as possible,\" Fisher said. A plan would also eliminate unnecessary tests and hospital stays, and provide financial incentives to medical providers so they are encouraged to cut costs by avoiding unnecessary services. The administration also wants to streamline the medical process by having one bill for all the tests rather than separate checks for each medical exam and procedure.", 
        "intTime": 20090511, 
        "postID": 1, 
        "quote": "", 
        "reply": "\"http://abcnews.go.com/Politics/Health/story?id=7555066&page=1\" As part of cost savings, primary care physicians would get most of the control over a patient's health care, and there would be better coordination between patients and their primary care doctors, who would serve as a \"coach\" and keep track of their patients' health. Potentially cost-cutting measures would reward \"physicians for working together to keep people healthy and to bring them back to health as quickly and inexpensively as possible,\" Fisher said. A plan would also eliminate unnecessary tests and hospital stays, and provide financial incentives to medical providers so they are encouraged to cut costs by avoiding unnecessary services. The administration also wants to streamline the medical process by having one bill for all the tests rather than separate checks for each medical exam and procedure.", 
        "threadID": "672198221_2690010322001", 
        "time": "2009-05-11 07:38:00", 
        "title": "National Health Insurance heading your way", 
        "userID": "ss_287"
    }, 
    {
        "content": "National Health. It's what this country needs. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090511, 
        "postID": 2, 
        "quote": "", 
        "reply": "National Health. It's what this country needs. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_2690010322001", 
        "time": "2009-05-11 08:07:00", 
        "title": "National Health Insurance heading your way", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: A plan would also eliminate unnecessary tests and hospital stays, and provide financial incentives to medical providers so they are encouraged to cut costs by avoiding unnecessary services. I think I'd be leery of such a plan. It's easy for an insurance/benefits organization to read such a thing as a license to eliminate *necessary* tests.", 
        "intTime": 20090511, 
        "postID": 3, 
        "quote": "A plan would also eliminate unnecessary tests and hospital stays, and provide financial incentives to medical providers so they are encouraged to cut costs by avoiding unnecessary services.", 
        "reply": " I think I'd be leery of such a plan. It's easy for an insurance/benefits organization to read such a thing as a license to eliminate *necessary* tests.", 
        "threadID": "672198221_2690010322001", 
        "time": "2009-05-11 08:08:00", 
        "title": "National Health Insurance heading your way", 
        "userID": "billbright"
    }, 
    {
        "content": "National Health Care! In countries that have it: the doctors don't like it! the hospitals don't like it! the paitants don't like it! havent heard of any body likeing it!", 
        "intTime": 20090511, 
        "postID": 4, 
        "quote": "", 
        "reply": "National Health Care! In countries that have it: the doctors don't like it! the hospitals don't like it! the paitants don't like it! havent heard of any body likeing it!", 
        "threadID": "672198221_2690010322001", 
        "time": "2009-05-11 10:29:00", 
        "title": "National Health Insurance heading your way", 
        "userID": "EAG154"
    }, 
    {
        "content": "quote: Originally posted by EAG154: National Health Care! In countries that have it: the doctors don't like it! the hospitals don't like it! the paitants don't like it! havent heard of any body likeing it! Do you have any idea just how many other developed nations have national health care? I don't really care about health care. I'm rich. I pay cash when I get sick. But the number of uninsured in this country is staggering.", 
        "intTime": 20090511, 
        "postID": 5, 
        "quote": "Originally posted by EAG154: National Health Care! In countries that have it: the doctors don't like it! the hospitals don't like it! the paitants don't like it! havent heard of any body likeing it!", 
        "reply": " Do you have any idea just how many other developed nations have national health care? I don't really care about health care. I'm rich. I pay cash when I get sick. But the number of uninsured in this country is staggering.", 
        "threadID": "672198221_2690010322001", 
        "time": "2009-05-11 10:36:00", 
        "title": "National Health Insurance heading your way", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "ok. Let's look at it this way. EAG154 is correct. In countries with nationalized health care , yes- you will find doctors, hospitals and patients that don't like it. I'm not sure what their complaints are but I'm sure EAG154 will be happy to explain them for us. In countries with privatized health care , you can find doctors, hospitals and patients that don't like it. Some common complaints: Doctors- \"I spend too much time filling out forms for the insurance companies, not enough time with my patients.\" Hospitals- \"We can't make a buck because our patients don't pay their medical bills .\" (Fun Fact: medical bills are the leading cause of bankruptcy nationwide) Patients- \"I can't afford a doctor's visit so I'll just wait until I'm at death's door then go to the emergency room.\" (If you think about it, we already DO have a nationalized healthcare system. Hospitals are barred by law from refusing you life saving medical service in emergency rooms. The sad thing is, emergency room medical service is the priciest and least effective form of medical care out there. We are America! We can do better! ) man. The Republican's have really sold their constituents a bill of goods. Someone get me their PR man. I've got this bridge in Brooklyn...", 
        "intTime": 20090511, 
        "postID": 6, 
        "quote": "", 
        "reply": "ok. Let's look at it this way. EAG154 is correct. In countries with nationalized health care , yes- you will find doctors, hospitals and patients that don't like it. I'm not sure what their complaints are but I'm sure EAG154 will be happy to explain them for us. In countries with privatized health care , you can find doctors, hospitals and patients that don't like it. Some common complaints: Doctors- \"I spend too much time filling out forms for the insurance companies, not enough time with my patients.\" Hospitals- \"We can't make a buck because our patients don't pay their medical bills .\" (Fun Fact: medical bills are the leading cause of bankruptcy nationwide) Patients- \"I can't afford a doctor's visit so I'll just wait until I'm at death's door then go to the emergency room.\" (If you think about it, we already DO have a nationalized healthcare system. Hospitals are barred by law from refusing you life saving medical service in emergency rooms. The sad thing is, emergency room medical service is the priciest and least effective form of medical care out there. We are America! We can do better! ) man. The Republican's have really sold their constituents a bill of goods. Someone get me their PR man. I've got this bridge in Brooklyn...", 
        "threadID": "672198221_2690010322001", 
        "time": "2009-05-11 11:44:00", 
        "title": "National Health Insurance heading your way", 
        "userID": "Frank_A_Valdez"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by EAG154: National Health Care! In countries that have it: the doctors don't like it! the hospitals don't like it! the paitants don't like it! havent heard of any body likeing it! Do you have any idea just how many other developed nations have national health care? I don't really care about health care. I'm rich. I pay cash when I get sick. But the number of uninsured in this country is staggering. I can't afford Health Imsurance. Eagle will however be correct if he asks me if this was a choice on my part. I choose an apartment over health care insurance. One in Six Americans are in my position. We all choose to do without health care insurance. Dave", 
        "intTime": 20090511, 
        "postID": 7, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by EAG154: National Health Care! In countries that have it: the doctors don't like it! the hospitals don't like it! the paitants don't like it! havent heard of any body likeing it! Do you have any idea just how many other developed nations have national health care? I don't really care about health care. I'm rich. I pay cash when I get sick. But the number of uninsured in this country is staggering.", 
        "reply": " I can't afford Health Imsurance. Eagle will however be correct if he asks me if this was a choice on my part. I choose an apartment over health care insurance. One in Six Americans are in my position. We all choose to do without health care insurance. Dave", 
        "threadID": "672198221_2690010322001", 
        "time": "2009-05-11 12:57:00", 
        "title": "National Health Insurance heading your way", 
        "userID": "Grachus"
    }, 
    {
        "content": "National Health care for those that have no health care or for those who cannot afford their own health care insurance is fine. However, leave me alone. I'm happy with my health care and what I am paying right now.", 
        "intTime": 20090511, 
        "postID": 8, 
        "quote": "", 
        "reply": "National Health care for those that have no health care or for those who cannot afford their own health care insurance is fine. However, leave me alone. I'm happy with my health care and what I am paying right now.", 
        "threadID": "672198221_2690010322001", 
        "time": "2009-05-11 13:08:00", 
        "title": "National Health Insurance heading your way", 
        "userID": "Duster6"
    }, 
    {
        "content": "Rationing health care...thats his only solution. I got an idea for the President and his minions: IF PEOPLE WANT MONEY THEY OUGHT TO GO TO WORK!!", 
        "intTime": 20090511, 
        "postID": 9, 
        "quote": "", 
        "reply": "Rationing health care...thats his only solution. I got an idea for the President and his minions: IF PEOPLE WANT MONEY THEY OUGHT TO GO TO WORK!!", 
        "threadID": "672198221_2690010322001", 
        "time": "2009-05-11 13:14:00", 
        "title": "National Health Insurance heading your way", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Duster6: National Health care for those that have no health care or for those who cannot afford their own health care insurance is fine. However, leave me alone. I'm happy with my health care and what I am paying right now. You take advantage of the VA? You some kind of Socialist? Dave", 
        "intTime": 20090511, 
        "postID": 10, 
        "quote": "Originally posted by Duster6: National Health care for those that have no health care or for those who cannot afford their own health care insurance is fine. However, leave me alone. I'm happy with my health care and what I am paying right now.", 
        "reply": " You take advantage of the VA? You some kind of Socialist? Dave", 
        "threadID": "672198221_2690010322001", 
        "time": "2009-05-11 13:33:00", 
        "title": "National Health Insurance heading your way", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by mrmixitup: quote: Originally posted by EAG154: National Health Care! In countries that have it: the doctors don't like it! the hospitals don't like it! the paitants don't like it! havent heard of any body likeing it! Do you have any idea just how many other developed nations have national health care? I don't really care about health care. I'm rich. I pay cash when I get sick. But the number of uninsured in this country is staggering. I can't afford Health Imsurance. Eagle will however be correct if he asks me if this was a choice on my part. I choose an apartment over health care insurance. One in Six Americans are in my position. We all choose to do without health care insurance. Dave There are many Low cost health insurance plans available, when you get sick , injured, or need emergency care who do you think will pay for it? It will be those that not only keep health insurance for themselves, and our tax dollars at work. I have maintained health insurance my entire career and now live in a state where it is mandatory, they keep part of your state taxes for not having insurance. It should be a mandatory witholding from any employment for health insurance although i do not believe in national health insurance, I believe everyone should be paying something toward a plan.", 
        "intTime": 20090511, 
        "postID": 11, 
        "quote": "Originally posted by Grachus: quote: Originally posted by mrmixitup: quote: Originally posted by EAG154: National Health Care! In countries that have it: the doctors don't like it! the hospitals don't like it! the paitants don't like it! havent heard of any body likeing it! Do you have any idea just how many other developed nations have national health care? I don't really care about health care. I'm rich. I pay cash when I get sick. But the number of uninsured in this country is staggering. I can't afford Health Imsurance. Eagle will however be correct if he asks me if this was a choice on my part. I choose an apartment over health care insurance. One in Six Americans are in my position. We all choose to do without health care insurance. Dave", 
        "reply": " There are many Low cost health insurance plans available, when you get sick , injured, or need emergency care who do you think will pay for it? It will be those that not only keep health insurance for themselves, and our tax dollars at work. I have maintained health insurance my entire career and now live in a state where it is mandatory, they keep part of your state taxes for not having insurance. It should be a mandatory witholding from any employment for health insurance although i do not believe in national health insurance, I believe everyone should be paying something toward a plan.", 
        "threadID": "672198221_2690010322001", 
        "time": "2009-05-11 13:49:00", 
        "title": "National Health Insurance heading your way", 
        "userID": "ss_287"
    }, 
    {
        "content": "quote: Originally posted by ss_287: quote: Originally posted by Grachus: quote: Originally posted by mrmixitup: quote: Originally posted by EAG154: National Health Care! In countries that have it: the doctors don't like it! the hospitals don't like it! the paitants don't like it! havent heard of any body likeing it! Do you have any idea just how many other developed nations have national health care? I don't really care about health care. I'm rich. I pay cash when I get sick. But the number of uninsured in this country is staggering. I can't afford Health Imsurance. Eagle will however be correct if he asks me if this was a choice on my part. I choose an apartment over health care insurance. One in Six Americans are in my position. We all choose to do without health care insurance. Dave There are many Low cost health insurance plans available, when you get sick , injured, or need emergency care who do you think will pay for it? It will be those that not only keep health insurance for themselves, and our tax dollars at work. I have maintained health insurance my entire career and now live in a state where it is mandatory, they keep part of your state taxes for not having insurance. It should be a mandatory witholding from any employment for health insurance although i do not believe in national health insurance, I believe everyone should be paying something toward a plan. No offense, but I have no idea what the above means. In Canada, where they have a single payer system, (What I would like here) people pay for their health care. In Europe where they have variations on Universal Health Care, people pay for their Health care. We are the only modern Western First world country without universal health care. Now while I cannot fork over 5K a year for health care, unlike those who are desperately poor, any trip of mine to an emergency room will come out of my pocket. Unless it's something like a heart transplant - Of course Emergency room care doesn't include tranplants or cancer treatment, or for that matter ANY chronic conditions. Now you have the option of enjoying your Socialised VA hospitals. Well, I'm not jealous, you earned it. Dave", 
        "intTime": 20090511, 
        "postID": 12, 
        "quote": "Originally posted by ss_287: quote: Originally posted by Grachus: quote: Originally posted by mrmixitup: quote: Originally posted by EAG154: National Health Care! In countries that have it: the doctors don't like it! the hospitals don't like it! the paitants don't like it! havent heard of any body likeing it! Do you have any idea just how many other developed nations have national health care? I don't really care about health care. I'm rich. I pay cash when I get sick. But the number of uninsured in this country is staggering. I can't afford Health Imsurance. Eagle will however be correct if he asks me if this was a choice on my part. I choose an apartment over health care insurance. One in Six Americans are in my position. We all choose to do without health care insurance. Dave There are many Low cost health insurance plans available, when you get sick , injured, or need emergency care who do you think will pay for it? It will be those that not only keep health insurance for themselves, and our tax dollars at work. I have maintained health insurance my entire career and now live in a state where it is mandatory, they keep part of your state taxes for not having insurance. It should be a mandatory witholding from any employment for health insurance although i do not believe in national health insurance, I believe everyone should be paying something toward a plan.", 
        "reply": " No offense, but I have no idea what the above means. In Canada, where they have a single payer system, (What I would like here) people pay for their health care. In Europe where they have variations on Universal Health Care, people pay for their Health care. We are the only modern Western First world country without universal health care. Now while I cannot fork over 5K a year for health care, unlike those who are desperately poor, any trip of mine to an emergency room will come out of my pocket. Unless it's something like a heart transplant - Of course Emergency room care doesn't include tranplants or cancer treatment, or for that matter ANY chronic conditions. Now you have the option of enjoying your Socialised VA hospitals. Well, I'm not jealous, you earned it. Dave", 
        "threadID": "672198221_2690010322001", 
        "time": "2009-05-11 14:02:00", 
        "title": "National Health Insurance heading your way", 
        "userID": "Grachus"
    }, 
    {
        "content": "No one is talking about \"nationalizing healthcare\": http://www.whitehouse.gov/omb/fy2010_key_healthcare/", 
        "intTime": 20090511, 
        "postID": 13, 
        "quote": "", 
        "reply": "No one is talking about \"nationalizing healthcare\": http://www.whitehouse.gov/omb/fy2010_key_healthcare/", 
        "threadID": "672198221_2690010322001", 
        "time": "2009-05-11 14:30:00", 
        "title": "National Health Insurance heading your way", 
        "userID": "Esample1"
    }, 
    {
        "content": "quote: Originally posted by Duster6: National Health care for those that have no health care or for those who cannot afford their own health care insurance is fine. However, leave me alone. I'm happy with my health care and what I am paying right now. Same here ....", 
        "intTime": 20090511, 
        "postID": 14, 
        "quote": "Originally posted by Duster6: National Health care for those that have no health care or for those who cannot afford their own health care insurance is fine. However, leave me alone. I'm happy with my health care and what I am paying right now.", 
        "reply": " Same here ....", 
        "threadID": "672198221_2690010322001", 
        "time": "2009-05-11 14:50:00", 
        "title": "National Health Insurance heading your way", 
        "userID": "Boospar"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: National Health. It's what this country needs.", 
        "intTime": 20090511, 
        "postID": 15, 
        "quote": "Originally posted by jack_flats: National Health. It's what this country needs.", 
        "reply": "", 
        "threadID": "672198221_2690010322001", 
        "time": "2009-05-11 15:22:00", 
        "title": "National Health Insurance heading your way", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by EAG154: National Health Care! In countries that have it: the doctors don't like it! the hospitals don't like it! the paitants don't like it! havent heard of any body likeing it! Of course you havn't because conservative talk radio host only talk about the bad cases. Ask the German Drs who could not afford to go to Dr school, but was paid for by the state in exchange for services provided at a cap. I see nothing wrong in that. learn some real facts about health care in other nations... \"http://www.pbs.org/wgbh/pages/frontline/sickaroundtheworld/countries/\" Granted no system is perfect, but any system beats the one we got all to hell.", 
        "intTime": 20090511, 
        "postID": 16, 
        "quote": "Originally posted by EAG154: National Health Care! In countries that have it: the doctors don't like it! the hospitals don't like it! the paitants don't like it! havent heard of any body likeing it!", 
        "reply": " Of course you havn't because conservative talk radio host only talk about the bad cases. Ask the German Drs who could not afford to go to Dr school, but was paid for by the state in exchange for services provided at a cap. I see nothing wrong in that. learn some real facts about health care in other nations... \"http://www.pbs.org/wgbh/pages/frontline/sickaroundtheworld/countries/\" Granted no system is perfect, but any system beats the one we got all to hell.", 
        "threadID": "672198221_2690010322001", 
        "time": "2009-05-11 15:30:00", 
        "title": "National Health Insurance heading your way", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "Single payor nationalized medical is RATIONED CARE. Why are \"liberals\" trying to force EVERYONE into a system of THEIR choosing? \"Choice\" deems only an \"option\" when you are talking about killing. Quit being disgusting bullies. A couple of years back, I spent 5 1/2 MOMTHS hospitalized and damned near died at least two, and likely three times. I am STILL IN PAIN every waking moment as a result. I can guarandamntee you that were I a Canadian, in Canade, I'd be dead. And, rationing will put me on the list to be REFUSED care as a result with National Ration Care. As will MANY of you. Yes, the bureaucrats will FAST become fans of eugenics. YOU have your care, have the common deacency and respect for the right to life to let me have MY CHOICE of care.", 
        "intTime": 20090511, 
        "postID": 17, 
        "quote": "", 
        "reply": "Single payor nationalized medical is RATIONED CARE. Why are \"liberals\" trying to force EVERYONE into a system of THEIR choosing? \"Choice\" deems only an \"option\" when you are talking about killing. Quit being disgusting bullies. A couple of years back, I spent 5 1/2 MOMTHS hospitalized and damned near died at least two, and likely three times. I am STILL IN PAIN every waking moment as a result. I can guarandamntee you that were I a Canadian, in Canade, I'd be dead. And, rationing will put me on the list to be REFUSED care as a result with National Ration Care. As will MANY of you. Yes, the bureaucrats will FAST become fans of eugenics. YOU have your care, have the common deacency and respect for the right to life to let me have MY CHOICE of care.", 
        "threadID": "672198221_2690010322001", 
        "time": "2009-05-11 15:39:00", 
        "title": "National Health Insurance heading your way", 
        "userID": "peter3_1"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by Duster6: National Health care for those that have no health care or for those who cannot afford their own health care insurance is fine. However, leave me alone. I'm happy with my health care and what I am paying right now. You take advantage of the VA? You some kind of Socialist? Dave I go to the VA every 90 days because they require me to do so. I also have Tri-Care which I pay for. Please do not put me in the same category with those who choose a different life for themselves.", 
        "intTime": 20090511, 
        "postID": 18, 
        "quote": "Originally posted by Grachus: quote: Originally posted by Duster6: National Health care for those that have no health care or for those who cannot afford their own health care insurance is fine. However, leave me alone. I'm happy with my health care and what I am paying right now. You take advantage of the VA? You some kind of Socialist? Dave", 
        "reply": " I go to the VA every 90 days because they require me to do so. I also have Tri-Care which I pay for. Please do not put me in the same category with those who choose a different life for themselves.", 
        "threadID": "672198221_2690010322001", 
        "time": "2009-05-11 15:47:00", 
        "title": "National Health Insurance heading your way", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by peter3_1: Single payor nationalized medical is RATIONED CARE. Why are \"liberals\" trying to force EVERYONE into a system of THEIR choosing? \"Choice\" deems only an \"option\" when you are talking about killing. Quit being disgusting bullies. A couple of years back, I spent 5 1/2 MOMTHS hospitalized and damned near died at least two, and likely three times. I am STILL IN PAIN every waking moment as a result. I can guarandamntee you that were I a Canadian, in Canade, I'd be dead. And, rationing will put me on the list to be REFUSED care as a result with National Ration Care. As will MANY of you. Yes, the bureaucrats will FAST become fans of eugenics. YOU have your care, have the common deacency and respect for the right to life to let me have MY CHOICE of care. If denying you a choice saves this country and my wallet on health taxes, so be it. But I do not think they want to take anyones choice away. Other people have rights just as well as you. This country will save mone on NHC, that's the bottom line.", 
        "intTime": 20090511, 
        "postID": 19, 
        "quote": "Originally posted by peter3_1: Single payor nationalized medical is RATIONED CARE. Why are \"liberals\" trying to force EVERYONE into a system of THEIR choosing? \"Choice\" deems only an \"option\" when you are talking about killing. Quit being disgusting bullies. A couple of years back, I spent 5 1/2 MOMTHS hospitalized and damned near died at least two, and likely three times. I am STILL IN PAIN every waking moment as a result. I can guarandamntee you that were I a Canadian, in Canade, I'd be dead. And, rationing will put me on the list to be REFUSED care as a result with National Ration Care. As will MANY of you. Yes, the bureaucrats will FAST become fans of eugenics. YOU have your care, have the common deacency and respect for the right to life to let me have MY CHOICE of care.", 
        "reply": " If denying you a choice saves this country and my wallet on health taxes, so be it. But I do not think they want to take anyones choice away. Other people have rights just as well as you. This country will save mone on NHC, that's the bottom line.", 
        "threadID": "672198221_2690010322001", 
        "time": "2009-05-11 15:48:00", 
        "title": "National Health Insurance heading your way", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by peter3_1: Single payor nationalized medical is RATIONED CARE. Why are \"liberals\" trying to force EVERYONE into a system of THEIR choosing? \"Choice\" deems only an \"option\" when you are talking about killing. Quit being disgusting bullies. A couple of years back, I spent 5 1/2 MOMTHS hospitalized and damned near died at least two, and likely three times. I am STILL IN PAIN every waking moment as a result. I can guarandamntee you that were I a Canadian, in Canade, I'd be dead. And, rationing will put me on the list to be REFUSED care as a result with National Ration Care. As will MANY of you. Yes, the bureaucrats will FAST become fans of eugenics. YOU have your care, have the common deacency and respect for the right to life to let me have MY CHOICE of care. Emergency care is not rationed in Canada. You need it immediately, you get it immediately. While people like Fox like to quote screw-ups that occur in Canada, in the US screw-ups are so common as to not be news. No system can possibly be without flaws. And Canada is no exception. But to those one in six Americans that don't have health insurance, they get nothing at all. Because while you CAN go to an emergency room, if it requires long term care to patch you up, you're going home and not to the operating table. You would have been tossed out on your azz if you didn't have health insurance. Dave", 
        "intTime": 20090511, 
        "postID": 20, 
        "quote": "Originally posted by peter3_1: Single payor nationalized medical is RATIONED CARE. Why are \"liberals\" trying to force EVERYONE into a system of THEIR choosing? \"Choice\" deems only an \"option\" when you are talking about killing. Quit being disgusting bullies. A couple of years back, I spent 5 1/2 MOMTHS hospitalized and damned near died at least two, and likely three times. I am STILL IN PAIN every waking moment as a result. I can guarandamntee you that were I a Canadian, in Canade, I'd be dead. And, rationing will put me on the list to be REFUSED care as a result with National Ration Care. As will MANY of you. Yes, the bureaucrats will FAST become fans of eugenics. YOU have your care, have the common deacency and respect for the right to life to let me have MY CHOICE of care.", 
        "reply": " Emergency care is not rationed in Canada. You need it immediately, you get it immediately. While people like Fox like to quote screw-ups that occur in Canada, in the US screw-ups are so common as to not be news. No system can possibly be without flaws. And Canada is no exception. But to those one in six Americans that don't have health insurance, they get nothing at all. Because while you CAN go to an emergency room, if it requires long term care to patch you up, you're going home and not to the operating table. You would have been tossed out on your azz if you didn't have health insurance. Dave", 
        "threadID": "672198221_2690010322001", 
        "time": "2009-05-11 15:54:00", 
        "title": "National Health Insurance heading your way", 
        "userID": "Grachus"
    }, 
    {
        "content": "\"http://abcnews.go.com/Politics/Health/story?id=7555066&page=1\" As part of cost savings, primary care physicians would get most of the control over a patient's health care, and there would be better coordination between patients and their primary care doctors, who would serve as a \"coach\" and keep track of their patients' health. Potentially cost-cutting measures would reward \"physicians for working together to keep people healthy and to bring them back to health as quickly and inexpensively as possible,\" Fisher said. A plan would also eliminate unnecessary tests and hospital stays, and provide financial incentives to medical providers so they are encouraged to cut costs by avoiding unnecessary services. The administration also wants to streamline the medical process by having one bill for all the tests rather than separate checks for each medical exam and procedure.", 
        "intTime": 20090511, 
        "postID": 21, 
        "quote": "", 
        "reply": "\"http://abcnews.go.com/Politics/Health/story?id=7555066&page=1\" As part of cost savings, primary care physicians would get most of the control over a patient's health care, and there would be better coordination between patients and their primary care doctors, who would serve as a \"coach\" and keep track of their patients' health. Potentially cost-cutting measures would reward \"physicians for working together to keep people healthy and to bring them back to health as quickly and inexpensively as possible,\" Fisher said. A plan would also eliminate unnecessary tests and hospital stays, and provide financial incentives to medical providers so they are encouraged to cut costs by avoiding unnecessary services. The administration also wants to streamline the medical process by having one bill for all the tests rather than separate checks for each medical exam and procedure.", 
        "threadID": "672198221_2690010322001", 
        "time": "2009-05-11 07:38:00", 
        "title": "National Health Insurance heading your way", 
        "userID": "ss_287"
    }, 
    {
        "content": "National Health. It's what this country needs. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090511, 
        "postID": 22, 
        "quote": "", 
        "reply": "National Health. It's what this country needs. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_2690010322001", 
        "time": "2009-05-11 08:07:00", 
        "title": "National Health Insurance heading your way", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: A plan would also eliminate unnecessary tests and hospital stays, and provide financial incentives to medical providers so they are encouraged to cut costs by avoiding unnecessary services. I think I'd be leery of such a plan. It's easy for an insurance/benefits organization to read such a thing as a license to eliminate *necessary* tests.", 
        "intTime": 20090511, 
        "postID": 23, 
        "quote": "A plan would also eliminate unnecessary tests and hospital stays, and provide financial incentives to medical providers so they are encouraged to cut costs by avoiding unnecessary services.", 
        "reply": " I think I'd be leery of such a plan. It's easy for an insurance/benefits organization to read such a thing as a license to eliminate *necessary* tests.", 
        "threadID": "672198221_2690010322001", 
        "time": "2009-05-11 08:08:00", 
        "title": "National Health Insurance heading your way", 
        "userID": "billbright"
    }, 
    {
        "content": "National Health Care! In countries that have it: the doctors don't like it! the hospitals don't like it! the paitants don't like it! havent heard of any body likeing it!", 
        "intTime": 20090511, 
        "postID": 24, 
        "quote": "", 
        "reply": "National Health Care! In countries that have it: the doctors don't like it! the hospitals don't like it! the paitants don't like it! havent heard of any body likeing it!", 
        "threadID": "672198221_2690010322001", 
        "time": "2009-05-11 10:29:00", 
        "title": "National Health Insurance heading your way", 
        "userID": "EAG154"
    }, 
    {
        "content": "quote: Originally posted by EAG154: National Health Care! In countries that have it: the doctors don't like it! the hospitals don't like it! the paitants don't like it! havent heard of any body likeing it! Do you have any idea just how many other developed nations have national health care? I don't really care about health care. I'm rich. I pay cash when I get sick. But the number of uninsured in this country is staggering.", 
        "intTime": 20090511, 
        "postID": 25, 
        "quote": "Originally posted by EAG154: National Health Care! In countries that have it: the doctors don't like it! the hospitals don't like it! the paitants don't like it! havent heard of any body likeing it!", 
        "reply": " Do you have any idea just how many other developed nations have national health care? I don't really care about health care. I'm rich. I pay cash when I get sick. But the number of uninsured in this country is staggering.", 
        "threadID": "672198221_2690010322001", 
        "time": "2009-05-11 10:36:00", 
        "title": "National Health Insurance heading your way", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "ok. Let's look at it this way. EAG154 is correct. In countries with nationalized health care , yes- you will find doctors, hospitals and patients that don't like it. I'm not sure what their complaints are but I'm sure EAG154 will be happy to explain them for us. In countries with privatized health care , you can find doctors, hospitals and patients that don't like it. Some common complaints: Doctors- \"I spend too much time filling out forms for the insurance companies, not enough time with my patients.\" Hospitals- \"We can't make a buck because our patients don't pay their medical bills .\" (Fun Fact: medical bills are the leading cause of bankruptcy nationwide) Patients- \"I can't afford a doctor's visit so I'll just wait until I'm at death's door then go to the emergency room.\" (If you think about it, we already DO have a nationalized healthcare system. Hospitals are barred by law from refusing you life saving medical service in emergency rooms. The sad thing is, emergency room medical service is the priciest and least effective form of medical care out there. We are America! We can do better! ) man. The Republican's have really sold their constituents a bill of goods. Someone get me their PR man. I've got this bridge in Brooklyn...", 
        "intTime": 20090511, 
        "postID": 26, 
        "quote": "", 
        "reply": "ok. Let's look at it this way. EAG154 is correct. In countries with nationalized health care , yes- you will find doctors, hospitals and patients that don't like it. I'm not sure what their complaints are but I'm sure EAG154 will be happy to explain them for us. In countries with privatized health care , you can find doctors, hospitals and patients that don't like it. Some common complaints: Doctors- \"I spend too much time filling out forms for the insurance companies, not enough time with my patients.\" Hospitals- \"We can't make a buck because our patients don't pay their medical bills .\" (Fun Fact: medical bills are the leading cause of bankruptcy nationwide) Patients- \"I can't afford a doctor's visit so I'll just wait until I'm at death's door then go to the emergency room.\" (If you think about it, we already DO have a nationalized healthcare system. Hospitals are barred by law from refusing you life saving medical service in emergency rooms. The sad thing is, emergency room medical service is the priciest and least effective form of medical care out there. We are America! We can do better! ) man. The Republican's have really sold their constituents a bill of goods. Someone get me their PR man. I've got this bridge in Brooklyn...", 
        "threadID": "672198221_2690010322001", 
        "time": "2009-05-11 11:44:00", 
        "title": "National Health Insurance heading your way", 
        "userID": "Frank_A_Valdez"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by EAG154: National Health Care! In countries that have it: the doctors don't like it! the hospitals don't like it! the paitants don't like it! havent heard of any body likeing it! Do you have any idea just how many other developed nations have national health care? I don't really care about health care. I'm rich. I pay cash when I get sick. But the number of uninsured in this country is staggering. I can't afford Health Imsurance. Eagle will however be correct if he asks me if this was a choice on my part. I choose an apartment over health care insurance. One in Six Americans are in my position. We all choose to do without health care insurance. Dave", 
        "intTime": 20090511, 
        "postID": 27, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by EAG154: National Health Care! In countries that have it: the doctors don't like it! the hospitals don't like it! the paitants don't like it! havent heard of any body likeing it! Do you have any idea just how many other developed nations have national health care? I don't really care about health care. I'm rich. I pay cash when I get sick. But the number of uninsured in this country is staggering.", 
        "reply": " I can't afford Health Imsurance. Eagle will however be correct if he asks me if this was a choice on my part. I choose an apartment over health care insurance. One in Six Americans are in my position. We all choose to do without health care insurance. Dave", 
        "threadID": "672198221_2690010322001", 
        "time": "2009-05-11 12:57:00", 
        "title": "National Health Insurance heading your way", 
        "userID": "Grachus"
    }, 
    {
        "content": "National Health care for those that have no health care or for those who cannot afford their own health care insurance is fine. However, leave me alone. I'm happy with my health care and what I am paying right now.", 
        "intTime": 20090511, 
        "postID": 28, 
        "quote": "", 
        "reply": "National Health care for those that have no health care or for those who cannot afford their own health care insurance is fine. However, leave me alone. I'm happy with my health care and what I am paying right now.", 
        "threadID": "672198221_2690010322001", 
        "time": "2009-05-11 13:08:00", 
        "title": "National Health Insurance heading your way", 
        "userID": "Duster6"
    }, 
    {
        "content": "Rationing health care...thats his only solution. I got an idea for the President and his minions: IF PEOPLE WANT MONEY THEY OUGHT TO GO TO WORK!!", 
        "intTime": 20090511, 
        "postID": 29, 
        "quote": "", 
        "reply": "Rationing health care...thats his only solution. I got an idea for the President and his minions: IF PEOPLE WANT MONEY THEY OUGHT TO GO TO WORK!!", 
        "threadID": "672198221_2690010322001", 
        "time": "2009-05-11 13:14:00", 
        "title": "National Health Insurance heading your way", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Duster6: National Health care for those that have no health care or for those who cannot afford their own health care insurance is fine. However, leave me alone. I'm happy with my health care and what I am paying right now. You take advantage of the VA? You some kind of Socialist? Dave", 
        "intTime": 20090511, 
        "postID": 30, 
        "quote": "Originally posted by Duster6: National Health care for those that have no health care or for those who cannot afford their own health care insurance is fine. However, leave me alone. I'm happy with my health care and what I am paying right now.", 
        "reply": " You take advantage of the VA? You some kind of Socialist? Dave", 
        "threadID": "672198221_2690010322001", 
        "time": "2009-05-11 13:33:00", 
        "title": "National Health Insurance heading your way", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by mrmixitup: quote: Originally posted by EAG154: National Health Care! In countries that have it: the doctors don't like it! the hospitals don't like it! the paitants don't like it! havent heard of any body likeing it! Do you have any idea just how many other developed nations have national health care? I don't really care about health care. I'm rich. I pay cash when I get sick. But the number of uninsured in this country is staggering. I can't afford Health Imsurance. Eagle will however be correct if he asks me if this was a choice on my part. I choose an apartment over health care insurance. One in Six Americans are in my position. We all choose to do without health care insurance. Dave There are many Low cost health insurance plans available, when you get sick , injured, or need emergency care who do you think will pay for it? It will be those that not only keep health insurance for themselves, and our tax dollars at work. I have maintained health insurance my entire career and now live in a state where it is mandatory, they keep part of your state taxes for not having insurance. It should be a mandatory witholding from any employment for health insurance although i do not believe in national health insurance, I believe everyone should be paying something toward a plan.", 
        "intTime": 20090511, 
        "postID": 31, 
        "quote": "Originally posted by Grachus: quote: Originally posted by mrmixitup: quote: Originally posted by EAG154: National Health Care! In countries that have it: the doctors don't like it! the hospitals don't like it! the paitants don't like it! havent heard of any body likeing it! Do you have any idea just how many other developed nations have national health care? I don't really care about health care. I'm rich. I pay cash when I get sick. But the number of uninsured in this country is staggering. I can't afford Health Imsurance. Eagle will however be correct if he asks me if this was a choice on my part. I choose an apartment over health care insurance. One in Six Americans are in my position. We all choose to do without health care insurance. Dave", 
        "reply": " There are many Low cost health insurance plans available, when you get sick , injured, or need emergency care who do you think will pay for it? It will be those that not only keep health insurance for themselves, and our tax dollars at work. I have maintained health insurance my entire career and now live in a state where it is mandatory, they keep part of your state taxes for not having insurance. It should be a mandatory witholding from any employment for health insurance although i do not believe in national health insurance, I believe everyone should be paying something toward a plan.", 
        "threadID": "672198221_2690010322001", 
        "time": "2009-05-11 13:49:00", 
        "title": "National Health Insurance heading your way", 
        "userID": "ss_287"
    }, 
    {
        "content": "quote: Originally posted by ss_287: quote: Originally posted by Grachus: quote: Originally posted by mrmixitup: quote: Originally posted by EAG154: National Health Care! In countries that have it: the doctors don't like it! the hospitals don't like it! the paitants don't like it! havent heard of any body likeing it! Do you have any idea just how many other developed nations have national health care? I don't really care about health care. I'm rich. I pay cash when I get sick. But the number of uninsured in this country is staggering. I can't afford Health Imsurance. Eagle will however be correct if he asks me if this was a choice on my part. I choose an apartment over health care insurance. One in Six Americans are in my position. We all choose to do without health care insurance. Dave There are many Low cost health insurance plans available, when you get sick , injured, or need emergency care who do you think will pay for it? It will be those that not only keep health insurance for themselves, and our tax dollars at work. I have maintained health insurance my entire career and now live in a state where it is mandatory, they keep part of your state taxes for not having insurance. It should be a mandatory witholding from any employment for health insurance although i do not believe in national health insurance, I believe everyone should be paying something toward a plan. No offense, but I have no idea what the above means. In Canada, where they have a single payer system, (What I would like here) people pay for their health care. In Europe where they have variations on Universal Health Care, people pay for their Health care. We are the only modern Western First world country without universal health care. Now while I cannot fork over 5K a year for health care, unlike those who are desperately poor, any trip of mine to an emergency room will come out of my pocket. Unless it's something like a heart transplant - Of course Emergency room care doesn't include tranplants or cancer treatment, or for that matter ANY chronic conditions. Now you have the option of enjoying your Socialised VA hospitals. Well, I'm not jealous, you earned it. Dave", 
        "intTime": 20090511, 
        "postID": 32, 
        "quote": "Originally posted by ss_287: quote: Originally posted by Grachus: quote: Originally posted by mrmixitup: quote: Originally posted by EAG154: National Health Care! In countries that have it: the doctors don't like it! the hospitals don't like it! the paitants don't like it! havent heard of any body likeing it! Do you have any idea just how many other developed nations have national health care? I don't really care about health care. I'm rich. I pay cash when I get sick. But the number of uninsured in this country is staggering. I can't afford Health Imsurance. Eagle will however be correct if he asks me if this was a choice on my part. I choose an apartment over health care insurance. One in Six Americans are in my position. We all choose to do without health care insurance. Dave There are many Low cost health insurance plans available, when you get sick , injured, or need emergency care who do you think will pay for it? It will be those that not only keep health insurance for themselves, and our tax dollars at work. I have maintained health insurance my entire career and now live in a state where it is mandatory, they keep part of your state taxes for not having insurance. It should be a mandatory witholding from any employment for health insurance although i do not believe in national health insurance, I believe everyone should be paying something toward a plan.", 
        "reply": " No offense, but I have no idea what the above means. In Canada, where they have a single payer system, (What I would like here) people pay for their health care. In Europe where they have variations on Universal Health Care, people pay for their Health care. We are the only modern Western First world country without universal health care. Now while I cannot fork over 5K a year for health care, unlike those who are desperately poor, any trip of mine to an emergency room will come out of my pocket. Unless it's something like a heart transplant - Of course Emergency room care doesn't include tranplants or cancer treatment, or for that matter ANY chronic conditions. Now you have the option of enjoying your Socialised VA hospitals. Well, I'm not jealous, you earned it. Dave", 
        "threadID": "672198221_2690010322001", 
        "time": "2009-05-11 14:02:00", 
        "title": "National Health Insurance heading your way", 
        "userID": "Grachus"
    }, 
    {
        "content": "No one is talking about \"nationalizing healthcare\": http://www.whitehouse.gov/omb/fy2010_key_healthcare/", 
        "intTime": 20090511, 
        "postID": 33, 
        "quote": "", 
        "reply": "No one is talking about \"nationalizing healthcare\": http://www.whitehouse.gov/omb/fy2010_key_healthcare/", 
        "threadID": "672198221_2690010322001", 
        "time": "2009-05-11 14:30:00", 
        "title": "National Health Insurance heading your way", 
        "userID": "Esample1"
    }, 
    {
        "content": "quote: Originally posted by Duster6: National Health care for those that have no health care or for those who cannot afford their own health care insurance is fine. However, leave me alone. I'm happy with my health care and what I am paying right now. Same here ....", 
        "intTime": 20090511, 
        "postID": 34, 
        "quote": "Originally posted by Duster6: National Health care for those that have no health care or for those who cannot afford their own health care insurance is fine. However, leave me alone. I'm happy with my health care and what I am paying right now.", 
        "reply": " Same here ....", 
        "threadID": "672198221_2690010322001", 
        "time": "2009-05-11 14:50:00", 
        "title": "National Health Insurance heading your way", 
        "userID": "Boospar"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: National Health. It's what this country needs.", 
        "intTime": 20090511, 
        "postID": 35, 
        "quote": "Originally posted by jack_flats: National Health. It's what this country needs.", 
        "reply": "", 
        "threadID": "672198221_2690010322001", 
        "time": "2009-05-11 15:22:00", 
        "title": "National Health Insurance heading your way", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by EAG154: National Health Care! In countries that have it: the doctors don't like it! the hospitals don't like it! the paitants don't like it! havent heard of any body likeing it! Of course you havn't because conservative talk radio host only talk about the bad cases. Ask the German Drs who could not afford to go to Dr school, but was paid for by the state in exchange for services provided at a cap. I see nothing wrong in that. learn some real facts about health care in other nations... \"http://www.pbs.org/wgbh/pages/frontline/sickaroundtheworld/countries/\" Granted no system is perfect, but any system beats the one we got all to hell.", 
        "intTime": 20090511, 
        "postID": 36, 
        "quote": "Originally posted by EAG154: National Health Care! In countries that have it: the doctors don't like it! the hospitals don't like it! the paitants don't like it! havent heard of any body likeing it!", 
        "reply": " Of course you havn't because conservative talk radio host only talk about the bad cases. Ask the German Drs who could not afford to go to Dr school, but was paid for by the state in exchange for services provided at a cap. I see nothing wrong in that. learn some real facts about health care in other nations... \"http://www.pbs.org/wgbh/pages/frontline/sickaroundtheworld/countries/\" Granted no system is perfect, but any system beats the one we got all to hell.", 
        "threadID": "672198221_2690010322001", 
        "time": "2009-05-11 15:30:00", 
        "title": "National Health Insurance heading your way", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "Single payor nationalized medical is RATIONED CARE. Why are \"liberals\" trying to force EVERYONE into a system of THEIR choosing? \"Choice\" deems only an \"option\" when you are talking about killing. Quit being disgusting bullies. A couple of years back, I spent 5 1/2 MOMTHS hospitalized and damned near died at least two, and likely three times. I am STILL IN PAIN every waking moment as a result. I can guarandamntee you that were I a Canadian, in Canade, I'd be dead. And, rationing will put me on the list to be REFUSED care as a result with National Ration Care. As will MANY of you. Yes, the bureaucrats will FAST become fans of eugenics. YOU have your care, have the common deacency and respect for the right to life to let me have MY CHOICE of care.", 
        "intTime": 20090511, 
        "postID": 37, 
        "quote": "", 
        "reply": "Single payor nationalized medical is RATIONED CARE. Why are \"liberals\" trying to force EVERYONE into a system of THEIR choosing? \"Choice\" deems only an \"option\" when you are talking about killing. Quit being disgusting bullies. A couple of years back, I spent 5 1/2 MOMTHS hospitalized and damned near died at least two, and likely three times. I am STILL IN PAIN every waking moment as a result. I can guarandamntee you that were I a Canadian, in Canade, I'd be dead. And, rationing will put me on the list to be REFUSED care as a result with National Ration Care. As will MANY of you. Yes, the bureaucrats will FAST become fans of eugenics. YOU have your care, have the common deacency and respect for the right to life to let me have MY CHOICE of care.", 
        "threadID": "672198221_2690010322001", 
        "time": "2009-05-11 15:39:00", 
        "title": "National Health Insurance heading your way", 
        "userID": "peter3_1"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by Duster6: National Health care for those that have no health care or for those who cannot afford their own health care insurance is fine. However, leave me alone. I'm happy with my health care and what I am paying right now. You take advantage of the VA? You some kind of Socialist? Dave I go to the VA every 90 days because they require me to do so. I also have Tri-Care which I pay for. Please do not put me in the same category with those who choose a different life for themselves.", 
        "intTime": 20090511, 
        "postID": 38, 
        "quote": "Originally posted by Grachus: quote: Originally posted by Duster6: National Health care for those that have no health care or for those who cannot afford their own health care insurance is fine. However, leave me alone. I'm happy with my health care and what I am paying right now. You take advantage of the VA? You some kind of Socialist? Dave", 
        "reply": " I go to the VA every 90 days because they require me to do so. I also have Tri-Care which I pay for. Please do not put me in the same category with those who choose a different life for themselves.", 
        "threadID": "672198221_2690010322001", 
        "time": "2009-05-11 15:47:00", 
        "title": "National Health Insurance heading your way", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by peter3_1: Single payor nationalized medical is RATIONED CARE. Why are \"liberals\" trying to force EVERYONE into a system of THEIR choosing? \"Choice\" deems only an \"option\" when you are talking about killing. Quit being disgusting bullies. A couple of years back, I spent 5 1/2 MOMTHS hospitalized and damned near died at least two, and likely three times. I am STILL IN PAIN every waking moment as a result. I can guarandamntee you that were I a Canadian, in Canade, I'd be dead. And, rationing will put me on the list to be REFUSED care as a result with National Ration Care. As will MANY of you. Yes, the bureaucrats will FAST become fans of eugenics. YOU have your care, have the common deacency and respect for the right to life to let me have MY CHOICE of care. If denying you a choice saves this country and my wallet on health taxes, so be it. But I do not think they want to take anyones choice away. Other people have rights just as well as you. This country will save mone on NHC, that's the bottom line.", 
        "intTime": 20090511, 
        "postID": 39, 
        "quote": "Originally posted by peter3_1: Single payor nationalized medical is RATIONED CARE. Why are \"liberals\" trying to force EVERYONE into a system of THEIR choosing? \"Choice\" deems only an \"option\" when you are talking about killing. Quit being disgusting bullies. A couple of years back, I spent 5 1/2 MOMTHS hospitalized and damned near died at least two, and likely three times. I am STILL IN PAIN every waking moment as a result. I can guarandamntee you that were I a Canadian, in Canade, I'd be dead. And, rationing will put me on the list to be REFUSED care as a result with National Ration Care. As will MANY of you. Yes, the bureaucrats will FAST become fans of eugenics. YOU have your care, have the common deacency and respect for the right to life to let me have MY CHOICE of care.", 
        "reply": " If denying you a choice saves this country and my wallet on health taxes, so be it. But I do not think they want to take anyones choice away. Other people have rights just as well as you. This country will save mone on NHC, that's the bottom line.", 
        "threadID": "672198221_2690010322001", 
        "time": "2009-05-11 15:48:00", 
        "title": "National Health Insurance heading your way", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by peter3_1: Single payor nationalized medical is RATIONED CARE. Why are \"liberals\" trying to force EVERYONE into a system of THEIR choosing? \"Choice\" deems only an \"option\" when you are talking about killing. Quit being disgusting bullies. A couple of years back, I spent 5 1/2 MOMTHS hospitalized and damned near died at least two, and likely three times. I am STILL IN PAIN every waking moment as a result. I can guarandamntee you that were I a Canadian, in Canade, I'd be dead. And, rationing will put me on the list to be REFUSED care as a result with National Ration Care. As will MANY of you. Yes, the bureaucrats will FAST become fans of eugenics. YOU have your care, have the common deacency and respect for the right to life to let me have MY CHOICE of care. Emergency care is not rationed in Canada. You need it immediately, you get it immediately. While people like Fox like to quote screw-ups that occur in Canada, in the US screw-ups are so common as to not be news. No system can possibly be without flaws. And Canada is no exception. But to those one in six Americans that don't have health insurance, they get nothing at all. Because while you CAN go to an emergency room, if it requires long term care to patch you up, you're going home and not to the operating table. You would have been tossed out on your azz if you didn't have health insurance. Dave", 
        "intTime": 20090511, 
        "postID": 40, 
        "quote": "Originally posted by peter3_1: Single payor nationalized medical is RATIONED CARE. Why are \"liberals\" trying to force EVERYONE into a system of THEIR choosing? \"Choice\" deems only an \"option\" when you are talking about killing. Quit being disgusting bullies. A couple of years back, I spent 5 1/2 MOMTHS hospitalized and damned near died at least two, and likely three times. I am STILL IN PAIN every waking moment as a result. I can guarandamntee you that were I a Canadian, in Canade, I'd be dead. And, rationing will put me on the list to be REFUSED care as a result with National Ration Care. As will MANY of you. Yes, the bureaucrats will FAST become fans of eugenics. YOU have your care, have the common deacency and respect for the right to life to let me have MY CHOICE of care.", 
        "reply": " Emergency care is not rationed in Canada. You need it immediately, you get it immediately. While people like Fox like to quote screw-ups that occur in Canada, in the US screw-ups are so common as to not be news. No system can possibly be without flaws. And Canada is no exception. But to those one in six Americans that don't have health insurance, they get nothing at all. Because while you CAN go to an emergency room, if it requires long term care to patch you up, you're going home and not to the operating table. You would have been tossed out on your azz if you didn't have health insurance. Dave", 
        "threadID": "672198221_2690010322001", 
        "time": "2009-05-11 15:54:00", 
        "title": "National Health Insurance heading your way", 
        "userID": "Grachus"
    }, 
    {
        "content": "\"http://abcnews.go.com/Politics/Health/story?id=7555066&page=1\" As part of cost savings, primary care physicians would get most of the control over a patient's health care, and there would be better coordination between patients and their primary care doctors, who would serve as a \"coach\" and keep track of their patients' health. Potentially cost-cutting measures would reward \"physicians for working together to keep people healthy and to bring them back to health as quickly and inexpensively as possible,\" Fisher said. A plan would also eliminate unnecessary tests and hospital stays, and provide financial incentives to medical providers so they are encouraged to cut costs by avoiding unnecessary services. The administration also wants to streamline the medical process by having one bill for all the tests rather than separate checks for each medical exam and procedure.", 
        "intTime": 20090511, 
        "postID": 41, 
        "quote": "", 
        "reply": "\"http://abcnews.go.com/Politics/Health/story?id=7555066&page=1\" As part of cost savings, primary care physicians would get most of the control over a patient's health care, and there would be better coordination between patients and their primary care doctors, who would serve as a \"coach\" and keep track of their patients' health. Potentially cost-cutting measures would reward \"physicians for working together to keep people healthy and to bring them back to health as quickly and inexpensively as possible,\" Fisher said. A plan would also eliminate unnecessary tests and hospital stays, and provide financial incentives to medical providers so they are encouraged to cut costs by avoiding unnecessary services. The administration also wants to streamline the medical process by having one bill for all the tests rather than separate checks for each medical exam and procedure.", 
        "threadID": "672198221_2690010322001", 
        "time": "2009-05-11 07:38:00", 
        "title": "National Health Insurance heading your way", 
        "userID": "ss_287"
    }, 
    {
        "content": "National Health. It's what this country needs. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090511, 
        "postID": 42, 
        "quote": "", 
        "reply": "National Health. It's what this country needs. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_2690010322001", 
        "time": "2009-05-11 08:07:00", 
        "title": "National Health Insurance heading your way", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: A plan would also eliminate unnecessary tests and hospital stays, and provide financial incentives to medical providers so they are encouraged to cut costs by avoiding unnecessary services. I think I'd be leery of such a plan. It's easy for an insurance/benefits organization to read such a thing as a license to eliminate *necessary* tests.", 
        "intTime": 20090511, 
        "postID": 43, 
        "quote": "A plan would also eliminate unnecessary tests and hospital stays, and provide financial incentives to medical providers so they are encouraged to cut costs by avoiding unnecessary services.", 
        "reply": " I think I'd be leery of such a plan. It's easy for an insurance/benefits organization to read such a thing as a license to eliminate *necessary* tests.", 
        "threadID": "672198221_2690010322001", 
        "time": "2009-05-11 08:08:00", 
        "title": "National Health Insurance heading your way", 
        "userID": "billbright"
    }, 
    {
        "content": "National Health Care! In countries that have it: the doctors don't like it! the hospitals don't like it! the paitants don't like it! havent heard of any body likeing it!", 
        "intTime": 20090511, 
        "postID": 44, 
        "quote": "", 
        "reply": "National Health Care! In countries that have it: the doctors don't like it! the hospitals don't like it! the paitants don't like it! havent heard of any body likeing it!", 
        "threadID": "672198221_2690010322001", 
        "time": "2009-05-11 10:29:00", 
        "title": "National Health Insurance heading your way", 
        "userID": "EAG154"
    }, 
    {
        "content": "quote: Originally posted by EAG154: National Health Care! In countries that have it: the doctors don't like it! the hospitals don't like it! the paitants don't like it! havent heard of any body likeing it! Do you have any idea just how many other developed nations have national health care? I don't really care about health care. I'm rich. I pay cash when I get sick. But the number of uninsured in this country is staggering.", 
        "intTime": 20090511, 
        "postID": 45, 
        "quote": "Originally posted by EAG154: National Health Care! In countries that have it: the doctors don't like it! the hospitals don't like it! the paitants don't like it! havent heard of any body likeing it!", 
        "reply": " Do you have any idea just how many other developed nations have national health care? I don't really care about health care. I'm rich. I pay cash when I get sick. But the number of uninsured in this country is staggering.", 
        "threadID": "672198221_2690010322001", 
        "time": "2009-05-11 10:36:00", 
        "title": "National Health Insurance heading your way", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "ok. Let's look at it this way. EAG154 is correct. In countries with nationalized health care , yes- you will find doctors, hospitals and patients that don't like it. I'm not sure what their complaints are but I'm sure EAG154 will be happy to explain them for us. In countries with privatized health care , you can find doctors, hospitals and patients that don't like it. Some common complaints: Doctors- \"I spend too much time filling out forms for the insurance companies, not enough time with my patients.\" Hospitals- \"We can't make a buck because our patients don't pay their medical bills .\" (Fun Fact: medical bills are the leading cause of bankruptcy nationwide) Patients- \"I can't afford a doctor's visit so I'll just wait until I'm at death's door then go to the emergency room.\" (If you think about it, we already DO have a nationalized healthcare system. Hospitals are barred by law from refusing you life saving medical service in emergency rooms. The sad thing is, emergency room medical service is the priciest and least effective form of medical care out there. We are America! We can do better! ) man. The Republican's have really sold their constituents a bill of goods. Someone get me their PR man. I've got this bridge in Brooklyn...", 
        "intTime": 20090511, 
        "postID": 46, 
        "quote": "", 
        "reply": "ok. Let's look at it this way. EAG154 is correct. In countries with nationalized health care , yes- you will find doctors, hospitals and patients that don't like it. I'm not sure what their complaints are but I'm sure EAG154 will be happy to explain them for us. In countries with privatized health care , you can find doctors, hospitals and patients that don't like it. Some common complaints: Doctors- \"I spend too much time filling out forms for the insurance companies, not enough time with my patients.\" Hospitals- \"We can't make a buck because our patients don't pay their medical bills .\" (Fun Fact: medical bills are the leading cause of bankruptcy nationwide) Patients- \"I can't afford a doctor's visit so I'll just wait until I'm at death's door then go to the emergency room.\" (If you think about it, we already DO have a nationalized healthcare system. Hospitals are barred by law from refusing you life saving medical service in emergency rooms. The sad thing is, emergency room medical service is the priciest and least effective form of medical care out there. We are America! We can do better! ) man. The Republican's have really sold their constituents a bill of goods. Someone get me their PR man. I've got this bridge in Brooklyn...", 
        "threadID": "672198221_2690010322001", 
        "time": "2009-05-11 11:44:00", 
        "title": "National Health Insurance heading your way", 
        "userID": "Frank_A_Valdez"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by EAG154: National Health Care! In countries that have it: the doctors don't like it! the hospitals don't like it! the paitants don't like it! havent heard of any body likeing it! Do you have any idea just how many other developed nations have national health care? I don't really care about health care. I'm rich. I pay cash when I get sick. But the number of uninsured in this country is staggering. I can't afford Health Imsurance. Eagle will however be correct if he asks me if this was a choice on my part. I choose an apartment over health care insurance. One in Six Americans are in my position. We all choose to do without health care insurance. Dave", 
        "intTime": 20090511, 
        "postID": 47, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by EAG154: National Health Care! In countries that have it: the doctors don't like it! the hospitals don't like it! the paitants don't like it! havent heard of any body likeing it! Do you have any idea just how many other developed nations have national health care? I don't really care about health care. I'm rich. I pay cash when I get sick. But the number of uninsured in this country is staggering.", 
        "reply": " I can't afford Health Imsurance. Eagle will however be correct if he asks me if this was a choice on my part. I choose an apartment over health care insurance. One in Six Americans are in my position. We all choose to do without health care insurance. Dave", 
        "threadID": "672198221_2690010322001", 
        "time": "2009-05-11 12:57:00", 
        "title": "National Health Insurance heading your way", 
        "userID": "Grachus"
    }, 
    {
        "content": "National Health care for those that have no health care or for those who cannot afford their own health care insurance is fine. However, leave me alone. I'm happy with my health care and what I am paying right now.", 
        "intTime": 20090511, 
        "postID": 48, 
        "quote": "", 
        "reply": "National Health care for those that have no health care or for those who cannot afford their own health care insurance is fine. However, leave me alone. I'm happy with my health care and what I am paying right now.", 
        "threadID": "672198221_2690010322001", 
        "time": "2009-05-11 13:08:00", 
        "title": "National Health Insurance heading your way", 
        "userID": "Duster6"
    }, 
    {
        "content": "Rationing health care...thats his only solution. I got an idea for the President and his minions: IF PEOPLE WANT MONEY THEY OUGHT TO GO TO WORK!!", 
        "intTime": 20090511, 
        "postID": 49, 
        "quote": "", 
        "reply": "Rationing health care...thats his only solution. I got an idea for the President and his minions: IF PEOPLE WANT MONEY THEY OUGHT TO GO TO WORK!!", 
        "threadID": "672198221_2690010322001", 
        "time": "2009-05-11 13:14:00", 
        "title": "National Health Insurance heading your way", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Duster6: National Health care for those that have no health care or for those who cannot afford their own health care insurance is fine. However, leave me alone. I'm happy with my health care and what I am paying right now. You take advantage of the VA? You some kind of Socialist? Dave", 
        "intTime": 20090511, 
        "postID": 50, 
        "quote": "Originally posted by Duster6: National Health care for those that have no health care or for those who cannot afford their own health care insurance is fine. However, leave me alone. I'm happy with my health care and what I am paying right now.", 
        "reply": " You take advantage of the VA? You some kind of Socialist? Dave", 
        "threadID": "672198221_2690010322001", 
        "time": "2009-05-11 13:33:00", 
        "title": "National Health Insurance heading your way", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by mrmixitup: quote: Originally posted by EAG154: National Health Care! In countries that have it: the doctors don't like it! the hospitals don't like it! the paitants don't like it! havent heard of any body likeing it! Do you have any idea just how many other developed nations have national health care? I don't really care about health care. I'm rich. I pay cash when I get sick. But the number of uninsured in this country is staggering. I can't afford Health Imsurance. Eagle will however be correct if he asks me if this was a choice on my part. I choose an apartment over health care insurance. One in Six Americans are in my position. We all choose to do without health care insurance. Dave There are many Low cost health insurance plans available, when you get sick , injured, or need emergency care who do you think will pay for it? It will be those that not only keep health insurance for themselves, and our tax dollars at work. I have maintained health insurance my entire career and now live in a state where it is mandatory, they keep part of your state taxes for not having insurance. It should be a mandatory witholding from any employment for health insurance although i do not believe in national health insurance, I believe everyone should be paying something toward a plan.", 
        "intTime": 20090511, 
        "postID": 51, 
        "quote": "Originally posted by Grachus: quote: Originally posted by mrmixitup: quote: Originally posted by EAG154: National Health Care! In countries that have it: the doctors don't like it! the hospitals don't like it! the paitants don't like it! havent heard of any body likeing it! Do you have any idea just how many other developed nations have national health care? I don't really care about health care. I'm rich. I pay cash when I get sick. But the number of uninsured in this country is staggering. I can't afford Health Imsurance. Eagle will however be correct if he asks me if this was a choice on my part. I choose an apartment over health care insurance. One in Six Americans are in my position. We all choose to do without health care insurance. Dave", 
        "reply": " There are many Low cost health insurance plans available, when you get sick , injured, or need emergency care who do you think will pay for it? It will be those that not only keep health insurance for themselves, and our tax dollars at work. I have maintained health insurance my entire career and now live in a state where it is mandatory, they keep part of your state taxes for not having insurance. It should be a mandatory witholding from any employment for health insurance although i do not believe in national health insurance, I believe everyone should be paying something toward a plan.", 
        "threadID": "672198221_2690010322001", 
        "time": "2009-05-11 13:49:00", 
        "title": "National Health Insurance heading your way", 
        "userID": "ss_287"
    }, 
    {
        "content": "quote: Originally posted by ss_287: quote: Originally posted by Grachus: quote: Originally posted by mrmixitup: quote: Originally posted by EAG154: National Health Care! In countries that have it: the doctors don't like it! the hospitals don't like it! the paitants don't like it! havent heard of any body likeing it! Do you have any idea just how many other developed nations have national health care? I don't really care about health care. I'm rich. I pay cash when I get sick. But the number of uninsured in this country is staggering. I can't afford Health Imsurance. Eagle will however be correct if he asks me if this was a choice on my part. I choose an apartment over health care insurance. One in Six Americans are in my position. We all choose to do without health care insurance. Dave There are many Low cost health insurance plans available, when you get sick , injured, or need emergency care who do you think will pay for it? It will be those that not only keep health insurance for themselves, and our tax dollars at work. I have maintained health insurance my entire career and now live in a state where it is mandatory, they keep part of your state taxes for not having insurance. It should be a mandatory witholding from any employment for health insurance although i do not believe in national health insurance, I believe everyone should be paying something toward a plan. No offense, but I have no idea what the above means. In Canada, where they have a single payer system, (What I would like here) people pay for their health care. In Europe where they have variations on Universal Health Care, people pay for their Health care. We are the only modern Western First world country without universal health care. Now while I cannot fork over 5K a year for health care, unlike those who are desperately poor, any trip of mine to an emergency room will come out of my pocket. Unless it's something like a heart transplant - Of course Emergency room care doesn't include tranplants or cancer treatment, or for that matter ANY chronic conditions. Now you have the option of enjoying your Socialised VA hospitals. Well, I'm not jealous, you earned it. Dave", 
        "intTime": 20090511, 
        "postID": 52, 
        "quote": "Originally posted by ss_287: quote: Originally posted by Grachus: quote: Originally posted by mrmixitup: quote: Originally posted by EAG154: National Health Care! In countries that have it: the doctors don't like it! the hospitals don't like it! the paitants don't like it! havent heard of any body likeing it! Do you have any idea just how many other developed nations have national health care? I don't really care about health care. I'm rich. I pay cash when I get sick. But the number of uninsured in this country is staggering. I can't afford Health Imsurance. Eagle will however be correct if he asks me if this was a choice on my part. I choose an apartment over health care insurance. One in Six Americans are in my position. We all choose to do without health care insurance. Dave There are many Low cost health insurance plans available, when you get sick , injured, or need emergency care who do you think will pay for it? It will be those that not only keep health insurance for themselves, and our tax dollars at work. I have maintained health insurance my entire career and now live in a state where it is mandatory, they keep part of your state taxes for not having insurance. It should be a mandatory witholding from any employment for health insurance although i do not believe in national health insurance, I believe everyone should be paying something toward a plan.", 
        "reply": " No offense, but I have no idea what the above means. In Canada, where they have a single payer system, (What I would like here) people pay for their health care. In Europe where they have variations on Universal Health Care, people pay for their Health care. We are the only modern Western First world country without universal health care. Now while I cannot fork over 5K a year for health care, unlike those who are desperately poor, any trip of mine to an emergency room will come out of my pocket. Unless it's something like a heart transplant - Of course Emergency room care doesn't include tranplants or cancer treatment, or for that matter ANY chronic conditions. Now you have the option of enjoying your Socialised VA hospitals. Well, I'm not jealous, you earned it. Dave", 
        "threadID": "672198221_2690010322001", 
        "time": "2009-05-11 14:02:00", 
        "title": "National Health Insurance heading your way", 
        "userID": "Grachus"
    }, 
    {
        "content": "No one is talking about \"nationalizing healthcare\": http://www.whitehouse.gov/omb/fy2010_key_healthcare/", 
        "intTime": 20090511, 
        "postID": 53, 
        "quote": "", 
        "reply": "No one is talking about \"nationalizing healthcare\": http://www.whitehouse.gov/omb/fy2010_key_healthcare/", 
        "threadID": "672198221_2690010322001", 
        "time": "2009-05-11 14:30:00", 
        "title": "National Health Insurance heading your way", 
        "userID": "Esample1"
    }, 
    {
        "content": "quote: Originally posted by Duster6: National Health care for those that have no health care or for those who cannot afford their own health care insurance is fine. However, leave me alone. I'm happy with my health care and what I am paying right now. Same here ....", 
        "intTime": 20090511, 
        "postID": 54, 
        "quote": "Originally posted by Duster6: National Health care for those that have no health care or for those who cannot afford their own health care insurance is fine. However, leave me alone. I'm happy with my health care and what I am paying right now.", 
        "reply": " Same here ....", 
        "threadID": "672198221_2690010322001", 
        "time": "2009-05-11 14:50:00", 
        "title": "National Health Insurance heading your way", 
        "userID": "Boospar"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: National Health. It's what this country needs.", 
        "intTime": 20090511, 
        "postID": 55, 
        "quote": "Originally posted by jack_flats: National Health. It's what this country needs.", 
        "reply": "", 
        "threadID": "672198221_2690010322001", 
        "time": "2009-05-11 15:22:00", 
        "title": "National Health Insurance heading your way", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by EAG154: National Health Care! In countries that have it: the doctors don't like it! the hospitals don't like it! the paitants don't like it! havent heard of any body likeing it! Of course you havn't because conservative talk radio host only talk about the bad cases. Ask the German Drs who could not afford to go to Dr school, but was paid for by the state in exchange for services provided at a cap. I see nothing wrong in that. learn some real facts about health care in other nations... \"http://www.pbs.org/wgbh/pages/frontline/sickaroundtheworld/countries/\" Granted no system is perfect, but any system beats the one we got all to hell.", 
        "intTime": 20090511, 
        "postID": 56, 
        "quote": "Originally posted by EAG154: National Health Care! In countries that have it: the doctors don't like it! the hospitals don't like it! the paitants don't like it! havent heard of any body likeing it!", 
        "reply": " Of course you havn't because conservative talk radio host only talk about the bad cases. Ask the German Drs who could not afford to go to Dr school, but was paid for by the state in exchange for services provided at a cap. I see nothing wrong in that. learn some real facts about health care in other nations... \"http://www.pbs.org/wgbh/pages/frontline/sickaroundtheworld/countries/\" Granted no system is perfect, but any system beats the one we got all to hell.", 
        "threadID": "672198221_2690010322001", 
        "time": "2009-05-11 15:30:00", 
        "title": "National Health Insurance heading your way", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "Single payor nationalized medical is RATIONED CARE. Why are \"liberals\" trying to force EVERYONE into a system of THEIR choosing? \"Choice\" deems only an \"option\" when you are talking about killing. Quit being disgusting bullies. A couple of years back, I spent 5 1/2 MOMTHS hospitalized and damned near died at least two, and likely three times. I am STILL IN PAIN every waking moment as a result. I can guarandamntee you that were I a Canadian, in Canade, I'd be dead. And, rationing will put me on the list to be REFUSED care as a result with National Ration Care. As will MANY of you. Yes, the bureaucrats will FAST become fans of eugenics. YOU have your care, have the common deacency and respect for the right to life to let me have MY CHOICE of care.", 
        "intTime": 20090511, 
        "postID": 57, 
        "quote": "", 
        "reply": "Single payor nationalized medical is RATIONED CARE. Why are \"liberals\" trying to force EVERYONE into a system of THEIR choosing? \"Choice\" deems only an \"option\" when you are talking about killing. Quit being disgusting bullies. A couple of years back, I spent 5 1/2 MOMTHS hospitalized and damned near died at least two, and likely three times. I am STILL IN PAIN every waking moment as a result. I can guarandamntee you that were I a Canadian, in Canade, I'd be dead. And, rationing will put me on the list to be REFUSED care as a result with National Ration Care. As will MANY of you. Yes, the bureaucrats will FAST become fans of eugenics. YOU have your care, have the common deacency and respect for the right to life to let me have MY CHOICE of care.", 
        "threadID": "672198221_2690010322001", 
        "time": "2009-05-11 15:39:00", 
        "title": "National Health Insurance heading your way", 
        "userID": "peter3_1"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by Duster6: National Health care for those that have no health care or for those who cannot afford their own health care insurance is fine. However, leave me alone. I'm happy with my health care and what I am paying right now. You take advantage of the VA? You some kind of Socialist? Dave I go to the VA every 90 days because they require me to do so. I also have Tri-Care which I pay for. Please do not put me in the same category with those who choose a different life for themselves.", 
        "intTime": 20090511, 
        "postID": 58, 
        "quote": "Originally posted by Grachus: quote: Originally posted by Duster6: National Health care for those that have no health care or for those who cannot afford their own health care insurance is fine. However, leave me alone. I'm happy with my health care and what I am paying right now. You take advantage of the VA? You some kind of Socialist? Dave", 
        "reply": " I go to the VA every 90 days because they require me to do so. I also have Tri-Care which I pay for. Please do not put me in the same category with those who choose a different life for themselves.", 
        "threadID": "672198221_2690010322001", 
        "time": "2009-05-11 15:47:00", 
        "title": "National Health Insurance heading your way", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by peter3_1: Single payor nationalized medical is RATIONED CARE. Why are \"liberals\" trying to force EVERYONE into a system of THEIR choosing? \"Choice\" deems only an \"option\" when you are talking about killing. Quit being disgusting bullies. A couple of years back, I spent 5 1/2 MOMTHS hospitalized and damned near died at least two, and likely three times. I am STILL IN PAIN every waking moment as a result. I can guarandamntee you that were I a Canadian, in Canade, I'd be dead. And, rationing will put me on the list to be REFUSED care as a result with National Ration Care. As will MANY of you. Yes, the bureaucrats will FAST become fans of eugenics. YOU have your care, have the common deacency and respect for the right to life to let me have MY CHOICE of care. If denying you a choice saves this country and my wallet on health taxes, so be it. But I do not think they want to take anyones choice away. Other people have rights just as well as you. This country will save mone on NHC, that's the bottom line.", 
        "intTime": 20090511, 
        "postID": 59, 
        "quote": "Originally posted by peter3_1: Single payor nationalized medical is RATIONED CARE. Why are \"liberals\" trying to force EVERYONE into a system of THEIR choosing? \"Choice\" deems only an \"option\" when you are talking about killing. Quit being disgusting bullies. A couple of years back, I spent 5 1/2 MOMTHS hospitalized and damned near died at least two, and likely three times. I am STILL IN PAIN every waking moment as a result. I can guarandamntee you that were I a Canadian, in Canade, I'd be dead. And, rationing will put me on the list to be REFUSED care as a result with National Ration Care. As will MANY of you. Yes, the bureaucrats will FAST become fans of eugenics. YOU have your care, have the common deacency and respect for the right to life to let me have MY CHOICE of care.", 
        "reply": " If denying you a choice saves this country and my wallet on health taxes, so be it. But I do not think they want to take anyones choice away. Other people have rights just as well as you. This country will save mone on NHC, that's the bottom line.", 
        "threadID": "672198221_2690010322001", 
        "time": "2009-05-11 15:48:00", 
        "title": "National Health Insurance heading your way", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by peter3_1: Single payor nationalized medical is RATIONED CARE. Why are \"liberals\" trying to force EVERYONE into a system of THEIR choosing? \"Choice\" deems only an \"option\" when you are talking about killing. Quit being disgusting bullies. A couple of years back, I spent 5 1/2 MOMTHS hospitalized and damned near died at least two, and likely three times. I am STILL IN PAIN every waking moment as a result. I can guarandamntee you that were I a Canadian, in Canade, I'd be dead. And, rationing will put me on the list to be REFUSED care as a result with National Ration Care. As will MANY of you. Yes, the bureaucrats will FAST become fans of eugenics. YOU have your care, have the common deacency and respect for the right to life to let me have MY CHOICE of care. Emergency care is not rationed in Canada. You need it immediately, you get it immediately. While people like Fox like to quote screw-ups that occur in Canada, in the US screw-ups are so common as to not be news. No system can possibly be without flaws. And Canada is no exception. But to those one in six Americans that don't have health insurance, they get nothing at all. Because while you CAN go to an emergency room, if it requires long term care to patch you up, you're going home and not to the operating table. You would have been tossed out on your azz if you didn't have health insurance. Dave", 
        "intTime": 20090511, 
        "postID": 60, 
        "quote": "Originally posted by peter3_1: Single payor nationalized medical is RATIONED CARE. Why are \"liberals\" trying to force EVERYONE into a system of THEIR choosing? \"Choice\" deems only an \"option\" when you are talking about killing. Quit being disgusting bullies. A couple of years back, I spent 5 1/2 MOMTHS hospitalized and damned near died at least two, and likely three times. I am STILL IN PAIN every waking moment as a result. I can guarandamntee you that were I a Canadian, in Canade, I'd be dead. And, rationing will put me on the list to be REFUSED care as a result with National Ration Care. As will MANY of you. Yes, the bureaucrats will FAST become fans of eugenics. YOU have your care, have the common deacency and respect for the right to life to let me have MY CHOICE of care.", 
        "reply": " Emergency care is not rationed in Canada. You need it immediately, you get it immediately. While people like Fox like to quote screw-ups that occur in Canada, in the US screw-ups are so common as to not be news. No system can possibly be without flaws. And Canada is no exception. But to those one in six Americans that don't have health insurance, they get nothing at all. Because while you CAN go to an emergency room, if it requires long term care to patch you up, you're going home and not to the operating table. You would have been tossed out on your azz if you didn't have health insurance. Dave", 
        "threadID": "672198221_2690010322001", 
        "time": "2009-05-11 15:54:00", 
        "title": "National Health Insurance heading your way", 
        "userID": "Grachus"
    }, 
    {
        "content": "\"http://abcnews.go.com/Politics/Health/story?id=7555066&page=1\" As part of cost savings, primary care physicians would get most of the control over a patient's health care, and there would be better coordination between patients and their primary care doctors, who would serve as a \"coach\" and keep track of their patients' health. Potentially cost-cutting measures would reward \"physicians for working together to keep people healthy and to bring them back to health as quickly and inexpensively as possible,\" Fisher said. A plan would also eliminate unnecessary tests and hospital stays, and provide financial incentives to medical providers so they are encouraged to cut costs by avoiding unnecessary services. The administration also wants to streamline the medical process by having one bill for all the tests rather than separate checks for each medical exam and procedure.", 
        "intTime": 20090511, 
        "postID": 61, 
        "quote": "", 
        "reply": "\"http://abcnews.go.com/Politics/Health/story?id=7555066&page=1\" As part of cost savings, primary care physicians would get most of the control over a patient's health care, and there would be better coordination between patients and their primary care doctors, who would serve as a \"coach\" and keep track of their patients' health. Potentially cost-cutting measures would reward \"physicians for working together to keep people healthy and to bring them back to health as quickly and inexpensively as possible,\" Fisher said. A plan would also eliminate unnecessary tests and hospital stays, and provide financial incentives to medical providers so they are encouraged to cut costs by avoiding unnecessary services. The administration also wants to streamline the medical process by having one bill for all the tests rather than separate checks for each medical exam and procedure.", 
        "threadID": "672198221_2690010322001", 
        "time": "2009-05-11 07:38:00", 
        "title": "National Health Insurance heading your way", 
        "userID": "ss_287"
    }, 
    {
        "content": "National Health. It's what this country needs. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090511, 
        "postID": 62, 
        "quote": "", 
        "reply": "National Health. It's what this country needs. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_2690010322001", 
        "time": "2009-05-11 08:07:00", 
        "title": "National Health Insurance heading your way", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: A plan would also eliminate unnecessary tests and hospital stays, and provide financial incentives to medical providers so they are encouraged to cut costs by avoiding unnecessary services. I think I'd be leery of such a plan. It's easy for an insurance/benefits organization to read such a thing as a license to eliminate *necessary* tests.", 
        "intTime": 20090511, 
        "postID": 63, 
        "quote": "A plan would also eliminate unnecessary tests and hospital stays, and provide financial incentives to medical providers so they are encouraged to cut costs by avoiding unnecessary services.", 
        "reply": " I think I'd be leery of such a plan. It's easy for an insurance/benefits organization to read such a thing as a license to eliminate *necessary* tests.", 
        "threadID": "672198221_2690010322001", 
        "time": "2009-05-11 08:08:00", 
        "title": "National Health Insurance heading your way", 
        "userID": "billbright"
    }, 
    {
        "content": "National Health Care! In countries that have it: the doctors don't like it! the hospitals don't like it! the paitants don't like it! havent heard of any body likeing it!", 
        "intTime": 20090511, 
        "postID": 64, 
        "quote": "", 
        "reply": "National Health Care! In countries that have it: the doctors don't like it! the hospitals don't like it! the paitants don't like it! havent heard of any body likeing it!", 
        "threadID": "672198221_2690010322001", 
        "time": "2009-05-11 10:29:00", 
        "title": "National Health Insurance heading your way", 
        "userID": "EAG154"
    }, 
    {
        "content": "quote: Originally posted by EAG154: National Health Care! In countries that have it: the doctors don't like it! the hospitals don't like it! the paitants don't like it! havent heard of any body likeing it! Do you have any idea just how many other developed nations have national health care? I don't really care about health care. I'm rich. I pay cash when I get sick. But the number of uninsured in this country is staggering.", 
        "intTime": 20090511, 
        "postID": 65, 
        "quote": "Originally posted by EAG154: National Health Care! In countries that have it: the doctors don't like it! the hospitals don't like it! the paitants don't like it! havent heard of any body likeing it!", 
        "reply": " Do you have any idea just how many other developed nations have national health care? I don't really care about health care. I'm rich. I pay cash when I get sick. But the number of uninsured in this country is staggering.", 
        "threadID": "672198221_2690010322001", 
        "time": "2009-05-11 10:36:00", 
        "title": "National Health Insurance heading your way", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "ok. Let's look at it this way. EAG154 is correct. In countries with nationalized health care , yes- you will find doctors, hospitals and patients that don't like it. I'm not sure what their complaints are but I'm sure EAG154 will be happy to explain them for us. In countries with privatized health care , you can find doctors, hospitals and patients that don't like it. Some common complaints: Doctors- \"I spend too much time filling out forms for the insurance companies, not enough time with my patients.\" Hospitals- \"We can't make a buck because our patients don't pay their medical bills .\" (Fun Fact: medical bills are the leading cause of bankruptcy nationwide) Patients- \"I can't afford a doctor's visit so I'll just wait until I'm at death's door then go to the emergency room.\" (If you think about it, we already DO have a nationalized healthcare system. Hospitals are barred by law from refusing you life saving medical service in emergency rooms. The sad thing is, emergency room medical service is the priciest and least effective form of medical care out there. We are America! We can do better! ) man. The Republican's have really sold their constituents a bill of goods. Someone get me their PR man. I've got this bridge in Brooklyn...", 
        "intTime": 20090511, 
        "postID": 66, 
        "quote": "", 
        "reply": "ok. Let's look at it this way. EAG154 is correct. In countries with nationalized health care , yes- you will find doctors, hospitals and patients that don't like it. I'm not sure what their complaints are but I'm sure EAG154 will be happy to explain them for us. In countries with privatized health care , you can find doctors, hospitals and patients that don't like it. Some common complaints: Doctors- \"I spend too much time filling out forms for the insurance companies, not enough time with my patients.\" Hospitals- \"We can't make a buck because our patients don't pay their medical bills .\" (Fun Fact: medical bills are the leading cause of bankruptcy nationwide) Patients- \"I can't afford a doctor's visit so I'll just wait until I'm at death's door then go to the emergency room.\" (If you think about it, we already DO have a nationalized healthcare system. Hospitals are barred by law from refusing you life saving medical service in emergency rooms. The sad thing is, emergency room medical service is the priciest and least effective form of medical care out there. We are America! We can do better! ) man. The Republican's have really sold their constituents a bill of goods. Someone get me their PR man. I've got this bridge in Brooklyn...", 
        "threadID": "672198221_2690010322001", 
        "time": "2009-05-11 11:44:00", 
        "title": "National Health Insurance heading your way", 
        "userID": "Frank_A_Valdez"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by EAG154: National Health Care! In countries that have it: the doctors don't like it! the hospitals don't like it! the paitants don't like it! havent heard of any body likeing it! Do you have any idea just how many other developed nations have national health care? I don't really care about health care. I'm rich. I pay cash when I get sick. But the number of uninsured in this country is staggering. I can't afford Health Imsurance. Eagle will however be correct if he asks me if this was a choice on my part. I choose an apartment over health care insurance. One in Six Americans are in my position. We all choose to do without health care insurance. Dave", 
        "intTime": 20090511, 
        "postID": 67, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by EAG154: National Health Care! In countries that have it: the doctors don't like it! the hospitals don't like it! the paitants don't like it! havent heard of any body likeing it! Do you have any idea just how many other developed nations have national health care? I don't really care about health care. I'm rich. I pay cash when I get sick. But the number of uninsured in this country is staggering.", 
        "reply": " I can't afford Health Imsurance. Eagle will however be correct if he asks me if this was a choice on my part. I choose an apartment over health care insurance. One in Six Americans are in my position. We all choose to do without health care insurance. Dave", 
        "threadID": "672198221_2690010322001", 
        "time": "2009-05-11 12:57:00", 
        "title": "National Health Insurance heading your way", 
        "userID": "Grachus"
    }, 
    {
        "content": "National Health care for those that have no health care or for those who cannot afford their own health care insurance is fine. However, leave me alone. I'm happy with my health care and what I am paying right now.", 
        "intTime": 20090511, 
        "postID": 68, 
        "quote": "", 
        "reply": "National Health care for those that have no health care or for those who cannot afford their own health care insurance is fine. However, leave me alone. I'm happy with my health care and what I am paying right now.", 
        "threadID": "672198221_2690010322001", 
        "time": "2009-05-11 13:08:00", 
        "title": "National Health Insurance heading your way", 
        "userID": "Duster6"
    }, 
    {
        "content": "Rationing health care...thats his only solution. I got an idea for the President and his minions: IF PEOPLE WANT MONEY THEY OUGHT TO GO TO WORK!!", 
        "intTime": 20090511, 
        "postID": 69, 
        "quote": "", 
        "reply": "Rationing health care...thats his only solution. I got an idea for the President and his minions: IF PEOPLE WANT MONEY THEY OUGHT TO GO TO WORK!!", 
        "threadID": "672198221_2690010322001", 
        "time": "2009-05-11 13:14:00", 
        "title": "National Health Insurance heading your way", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Duster6: National Health care for those that have no health care or for those who cannot afford their own health care insurance is fine. However, leave me alone. I'm happy with my health care and what I am paying right now. You take advantage of the VA? You some kind of Socialist? Dave", 
        "intTime": 20090511, 
        "postID": 70, 
        "quote": "Originally posted by Duster6: National Health care for those that have no health care or for those who cannot afford their own health care insurance is fine. However, leave me alone. I'm happy with my health care and what I am paying right now.", 
        "reply": " You take advantage of the VA? You some kind of Socialist? Dave", 
        "threadID": "672198221_2690010322001", 
        "time": "2009-05-11 13:33:00", 
        "title": "National Health Insurance heading your way", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by mrmixitup: quote: Originally posted by EAG154: National Health Care! In countries that have it: the doctors don't like it! the hospitals don't like it! the paitants don't like it! havent heard of any body likeing it! Do you have any idea just how many other developed nations have national health care? I don't really care about health care. I'm rich. I pay cash when I get sick. But the number of uninsured in this country is staggering. I can't afford Health Imsurance. Eagle will however be correct if he asks me if this was a choice on my part. I choose an apartment over health care insurance. One in Six Americans are in my position. We all choose to do without health care insurance. Dave There are many Low cost health insurance plans available, when you get sick , injured, or need emergency care who do you think will pay for it? It will be those that not only keep health insurance for themselves, and our tax dollars at work. I have maintained health insurance my entire career and now live in a state where it is mandatory, they keep part of your state taxes for not having insurance. It should be a mandatory witholding from any employment for health insurance although i do not believe in national health insurance, I believe everyone should be paying something toward a plan.", 
        "intTime": 20090511, 
        "postID": 71, 
        "quote": "Originally posted by Grachus: quote: Originally posted by mrmixitup: quote: Originally posted by EAG154: National Health Care! In countries that have it: the doctors don't like it! the hospitals don't like it! the paitants don't like it! havent heard of any body likeing it! Do you have any idea just how many other developed nations have national health care? I don't really care about health care. I'm rich. I pay cash when I get sick. But the number of uninsured in this country is staggering. I can't afford Health Imsurance. Eagle will however be correct if he asks me if this was a choice on my part. I choose an apartment over health care insurance. One in Six Americans are in my position. We all choose to do without health care insurance. Dave", 
        "reply": " There are many Low cost health insurance plans available, when you get sick , injured, or need emergency care who do you think will pay for it? It will be those that not only keep health insurance for themselves, and our tax dollars at work. I have maintained health insurance my entire career and now live in a state where it is mandatory, they keep part of your state taxes for not having insurance. It should be a mandatory witholding from any employment for health insurance although i do not believe in national health insurance, I believe everyone should be paying something toward a plan.", 
        "threadID": "672198221_2690010322001", 
        "time": "2009-05-11 13:49:00", 
        "title": "National Health Insurance heading your way", 
        "userID": "ss_287"
    }, 
    {
        "content": "quote: Originally posted by ss_287: quote: Originally posted by Grachus: quote: Originally posted by mrmixitup: quote: Originally posted by EAG154: National Health Care! In countries that have it: the doctors don't like it! the hospitals don't like it! the paitants don't like it! havent heard of any body likeing it! Do you have any idea just how many other developed nations have national health care? I don't really care about health care. I'm rich. I pay cash when I get sick. But the number of uninsured in this country is staggering. I can't afford Health Imsurance. Eagle will however be correct if he asks me if this was a choice on my part. I choose an apartment over health care insurance. One in Six Americans are in my position. We all choose to do without health care insurance. Dave There are many Low cost health insurance plans available, when you get sick , injured, or need emergency care who do you think will pay for it? It will be those that not only keep health insurance for themselves, and our tax dollars at work. I have maintained health insurance my entire career and now live in a state where it is mandatory, they keep part of your state taxes for not having insurance. It should be a mandatory witholding from any employment for health insurance although i do not believe in national health insurance, I believe everyone should be paying something toward a plan. No offense, but I have no idea what the above means. In Canada, where they have a single payer system, (What I would like here) people pay for their health care. In Europe where they have variations on Universal Health Care, people pay for their Health care. We are the only modern Western First world country without universal health care. Now while I cannot fork over 5K a year for health care, unlike those who are desperately poor, any trip of mine to an emergency room will come out of my pocket. Unless it's something like a heart transplant - Of course Emergency room care doesn't include tranplants or cancer treatment, or for that matter ANY chronic conditions. Now you have the option of enjoying your Socialised VA hospitals. Well, I'm not jealous, you earned it. Dave", 
        "intTime": 20090511, 
        "postID": 72, 
        "quote": "Originally posted by ss_287: quote: Originally posted by Grachus: quote: Originally posted by mrmixitup: quote: Originally posted by EAG154: National Health Care! In countries that have it: the doctors don't like it! the hospitals don't like it! the paitants don't like it! havent heard of any body likeing it! Do you have any idea just how many other developed nations have national health care? I don't really care about health care. I'm rich. I pay cash when I get sick. But the number of uninsured in this country is staggering. I can't afford Health Imsurance. Eagle will however be correct if he asks me if this was a choice on my part. I choose an apartment over health care insurance. One in Six Americans are in my position. We all choose to do without health care insurance. Dave There are many Low cost health insurance plans available, when you get sick , injured, or need emergency care who do you think will pay for it? It will be those that not only keep health insurance for themselves, and our tax dollars at work. I have maintained health insurance my entire career and now live in a state where it is mandatory, they keep part of your state taxes for not having insurance. It should be a mandatory witholding from any employment for health insurance although i do not believe in national health insurance, I believe everyone should be paying something toward a plan.", 
        "reply": " No offense, but I have no idea what the above means. In Canada, where they have a single payer system, (What I would like here) people pay for their health care. In Europe where they have variations on Universal Health Care, people pay for their Health care. We are the only modern Western First world country without universal health care. Now while I cannot fork over 5K a year for health care, unlike those who are desperately poor, any trip of mine to an emergency room will come out of my pocket. Unless it's something like a heart transplant - Of course Emergency room care doesn't include tranplants or cancer treatment, or for that matter ANY chronic conditions. Now you have the option of enjoying your Socialised VA hospitals. Well, I'm not jealous, you earned it. Dave", 
        "threadID": "672198221_2690010322001", 
        "time": "2009-05-11 14:02:00", 
        "title": "National Health Insurance heading your way", 
        "userID": "Grachus"
    }, 
    {
        "content": "No one is talking about \"nationalizing healthcare\": http://www.whitehouse.gov/omb/fy2010_key_healthcare/", 
        "intTime": 20090511, 
        "postID": 73, 
        "quote": "", 
        "reply": "No one is talking about \"nationalizing healthcare\": http://www.whitehouse.gov/omb/fy2010_key_healthcare/", 
        "threadID": "672198221_2690010322001", 
        "time": "2009-05-11 14:30:00", 
        "title": "National Health Insurance heading your way", 
        "userID": "Esample1"
    }, 
    {
        "content": "quote: Originally posted by Duster6: National Health care for those that have no health care or for those who cannot afford their own health care insurance is fine. However, leave me alone. I'm happy with my health care and what I am paying right now. Same here ....", 
        "intTime": 20090511, 
        "postID": 74, 
        "quote": "Originally posted by Duster6: National Health care for those that have no health care or for those who cannot afford their own health care insurance is fine. However, leave me alone. I'm happy with my health care and what I am paying right now.", 
        "reply": " Same here ....", 
        "threadID": "672198221_2690010322001", 
        "time": "2009-05-11 14:50:00", 
        "title": "National Health Insurance heading your way", 
        "userID": "Boospar"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: National Health. It's what this country needs.", 
        "intTime": 20090511, 
        "postID": 75, 
        "quote": "Originally posted by jack_flats: National Health. It's what this country needs.", 
        "reply": "", 
        "threadID": "672198221_2690010322001", 
        "time": "2009-05-11 15:22:00", 
        "title": "National Health Insurance heading your way", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by EAG154: National Health Care! In countries that have it: the doctors don't like it! the hospitals don't like it! the paitants don't like it! havent heard of any body likeing it! Of course you havn't because conservative talk radio host only talk about the bad cases. Ask the German Drs who could not afford to go to Dr school, but was paid for by the state in exchange for services provided at a cap. I see nothing wrong in that. learn some real facts about health care in other nations... \"http://www.pbs.org/wgbh/pages/frontline/sickaroundtheworld/countries/\" Granted no system is perfect, but any system beats the one we got all to hell.", 
        "intTime": 20090511, 
        "postID": 76, 
        "quote": "Originally posted by EAG154: National Health Care! In countries that have it: the doctors don't like it! the hospitals don't like it! the paitants don't like it! havent heard of any body likeing it!", 
        "reply": " Of course you havn't because conservative talk radio host only talk about the bad cases. Ask the German Drs who could not afford to go to Dr school, but was paid for by the state in exchange for services provided at a cap. I see nothing wrong in that. learn some real facts about health care in other nations... \"http://www.pbs.org/wgbh/pages/frontline/sickaroundtheworld/countries/\" Granted no system is perfect, but any system beats the one we got all to hell.", 
        "threadID": "672198221_2690010322001", 
        "time": "2009-05-11 15:30:00", 
        "title": "National Health Insurance heading your way", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "Single payor nationalized medical is RATIONED CARE. Why are \"liberals\" trying to force EVERYONE into a system of THEIR choosing? \"Choice\" deems only an \"option\" when you are talking about killing. Quit being disgusting bullies. A couple of years back, I spent 5 1/2 MOMTHS hospitalized and damned near died at least two, and likely three times. I am STILL IN PAIN every waking moment as a result. I can guarandamntee you that were I a Canadian, in Canade, I'd be dead. And, rationing will put me on the list to be REFUSED care as a result with National Ration Care. As will MANY of you. Yes, the bureaucrats will FAST become fans of eugenics. YOU have your care, have the common deacency and respect for the right to life to let me have MY CHOICE of care.", 
        "intTime": 20090511, 
        "postID": 77, 
        "quote": "", 
        "reply": "Single payor nationalized medical is RATIONED CARE. Why are \"liberals\" trying to force EVERYONE into a system of THEIR choosing? \"Choice\" deems only an \"option\" when you are talking about killing. Quit being disgusting bullies. A couple of years back, I spent 5 1/2 MOMTHS hospitalized and damned near died at least two, and likely three times. I am STILL IN PAIN every waking moment as a result. I can guarandamntee you that were I a Canadian, in Canade, I'd be dead. And, rationing will put me on the list to be REFUSED care as a result with National Ration Care. As will MANY of you. Yes, the bureaucrats will FAST become fans of eugenics. YOU have your care, have the common deacency and respect for the right to life to let me have MY CHOICE of care.", 
        "threadID": "672198221_2690010322001", 
        "time": "2009-05-11 15:39:00", 
        "title": "National Health Insurance heading your way", 
        "userID": "peter3_1"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by Duster6: National Health care for those that have no health care or for those who cannot afford their own health care insurance is fine. However, leave me alone. I'm happy with my health care and what I am paying right now. You take advantage of the VA? You some kind of Socialist? Dave I go to the VA every 90 days because they require me to do so. I also have Tri-Care which I pay for. Please do not put me in the same category with those who choose a different life for themselves.", 
        "intTime": 20090511, 
        "postID": 78, 
        "quote": "Originally posted by Grachus: quote: Originally posted by Duster6: National Health care for those that have no health care or for those who cannot afford their own health care insurance is fine. However, leave me alone. I'm happy with my health care and what I am paying right now. You take advantage of the VA? You some kind of Socialist? Dave", 
        "reply": " I go to the VA every 90 days because they require me to do so. I also have Tri-Care which I pay for. Please do not put me in the same category with those who choose a different life for themselves.", 
        "threadID": "672198221_2690010322001", 
        "time": "2009-05-11 15:47:00", 
        "title": "National Health Insurance heading your way", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by peter3_1: Single payor nationalized medical is RATIONED CARE. Why are \"liberals\" trying to force EVERYONE into a system of THEIR choosing? \"Choice\" deems only an \"option\" when you are talking about killing. Quit being disgusting bullies. A couple of years back, I spent 5 1/2 MOMTHS hospitalized and damned near died at least two, and likely three times. I am STILL IN PAIN every waking moment as a result. I can guarandamntee you that were I a Canadian, in Canade, I'd be dead. And, rationing will put me on the list to be REFUSED care as a result with National Ration Care. As will MANY of you. Yes, the bureaucrats will FAST become fans of eugenics. YOU have your care, have the common deacency and respect for the right to life to let me have MY CHOICE of care. If denying you a choice saves this country and my wallet on health taxes, so be it. But I do not think they want to take anyones choice away. Other people have rights just as well as you. This country will save mone on NHC, that's the bottom line.", 
        "intTime": 20090511, 
        "postID": 79, 
        "quote": "Originally posted by peter3_1: Single payor nationalized medical is RATIONED CARE. Why are \"liberals\" trying to force EVERYONE into a system of THEIR choosing? \"Choice\" deems only an \"option\" when you are talking about killing. Quit being disgusting bullies. A couple of years back, I spent 5 1/2 MOMTHS hospitalized and damned near died at least two, and likely three times. I am STILL IN PAIN every waking moment as a result. I can guarandamntee you that were I a Canadian, in Canade, I'd be dead. And, rationing will put me on the list to be REFUSED care as a result with National Ration Care. As will MANY of you. Yes, the bureaucrats will FAST become fans of eugenics. YOU have your care, have the common deacency and respect for the right to life to let me have MY CHOICE of care.", 
        "reply": " If denying you a choice saves this country and my wallet on health taxes, so be it. But I do not think they want to take anyones choice away. Other people have rights just as well as you. This country will save mone on NHC, that's the bottom line.", 
        "threadID": "672198221_2690010322001", 
        "time": "2009-05-11 15:48:00", 
        "title": "National Health Insurance heading your way", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by peter3_1: Single payor nationalized medical is RATIONED CARE. Why are \"liberals\" trying to force EVERYONE into a system of THEIR choosing? \"Choice\" deems only an \"option\" when you are talking about killing. Quit being disgusting bullies. A couple of years back, I spent 5 1/2 MOMTHS hospitalized and damned near died at least two, and likely three times. I am STILL IN PAIN every waking moment as a result. I can guarandamntee you that were I a Canadian, in Canade, I'd be dead. And, rationing will put me on the list to be REFUSED care as a result with National Ration Care. As will MANY of you. Yes, the bureaucrats will FAST become fans of eugenics. YOU have your care, have the common deacency and respect for the right to life to let me have MY CHOICE of care. Emergency care is not rationed in Canada. You need it immediately, you get it immediately. While people like Fox like to quote screw-ups that occur in Canada, in the US screw-ups are so common as to not be news. No system can possibly be without flaws. And Canada is no exception. But to those one in six Americans that don't have health insurance, they get nothing at all. Because while you CAN go to an emergency room, if it requires long term care to patch you up, you're going home and not to the operating table. You would have been tossed out on your azz if you didn't have health insurance. Dave", 
        "intTime": 20090511, 
        "postID": 80, 
        "quote": "Originally posted by peter3_1: Single payor nationalized medical is RATIONED CARE. Why are \"liberals\" trying to force EVERYONE into a system of THEIR choosing? \"Choice\" deems only an \"option\" when you are talking about killing. Quit being disgusting bullies. A couple of years back, I spent 5 1/2 MOMTHS hospitalized and damned near died at least two, and likely three times. I am STILL IN PAIN every waking moment as a result. I can guarandamntee you that were I a Canadian, in Canade, I'd be dead. And, rationing will put me on the list to be REFUSED care as a result with National Ration Care. As will MANY of you. Yes, the bureaucrats will FAST become fans of eugenics. YOU have your care, have the common deacency and respect for the right to life to let me have MY CHOICE of care.", 
        "reply": " Emergency care is not rationed in Canada. You need it immediately, you get it immediately. While people like Fox like to quote screw-ups that occur in Canada, in the US screw-ups are so common as to not be news. No system can possibly be without flaws. And Canada is no exception. But to those one in six Americans that don't have health insurance, they get nothing at all. Because while you CAN go to an emergency room, if it requires long term care to patch you up, you're going home and not to the operating table. You would have been tossed out on your azz if you didn't have health insurance. Dave", 
        "threadID": "672198221_2690010322001", 
        "time": "2009-05-11 15:54:00", 
        "title": "National Health Insurance heading your way", 
        "userID": "Grachus"
    }
]