[
    {
        "content": "quote: Since World War II, U.S. military dominance has underpinned the Asia-Pacific region’s prosperity and relative peace. So it is cause for concern when one of America’s closest allies sees that power ebbing amid unstable nuclear regimes such as Pakistan and North Korea and the expanding military power of China. Australia currently spends around $13.1 billion a year on defense, not counting money for new equipment. Now, a new policy paper says spending will increase by 3 percent annually until 2018, which is not much. But the importance of Canberra’s message is about priorities. Australia is worried about the end of the “unipolar moment.” (Wall Street Journal, May 8, 2009, Pg. 12) \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090508, 
        "postID": 1, 
        "quote": "Since World War II, U.S. military dominance has underpinned the Asia-Pacific region’s prosperity and relative peace. So it is cause for concern when one of America’s closest allies sees that power ebbing amid unstable nuclear regimes such as Pakistan and North Korea and the expanding military power of China. Australia currently spends around $13.1 billion a year on defense, not counting money for new equipment. Now, a new policy paper says spending will increase by 3 percent annually until 2018, which is not much. But the importance of Canberra’s message is about priorities. Australia is worried about the end of the “unipolar moment.” (Wall Street Journal, May 8, 2009, Pg. 12)", 
        "reply": " \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_7430018222001", 
        "time": "2009-05-08 07:20:00", 
        "title": "Australia Prepares For U.S. Decline.", 
        "userID": "NSNN"
    }, 
    {
        "content": "As such, it seems the Aussie MoD has prepared for that, as discussed in the ff. thread: \"report: Australia may be next regional power\" thread of military.com", 
        "intTime": 20090508, 
        "postID": 2, 
        "quote": "", 
        "reply": "As such, it seems the Aussie MoD has prepared for that, as discussed in the ff. thread: \"report: Australia may be next regional power\" thread of military.com", 
        "threadID": "672198221_7430018222001", 
        "time": "2009-05-08 07:27:00", 
        "title": "Australia Prepares For U.S. Decline.", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "quote: Originally posted by NSNN: quote: Since World War II, U.S. military dominance has underpinned the Asia-Pacific region’s prosperity and relative peace. So it is cause for concern when one of America’s closest allies sees that power ebbing amid unstable nuclear regimes such as Pakistan and North Korea and the expanding military power of China. Australia currently spends around $13.1 billion a year on defense, not counting money for new equipment. Now, a new policy paper says spending will increase by 3 percent annually until 2018, which is not much. But the importance of Canberra’s message is about priorities. Australia is worried about the end of the “unipolar moment.” (Wall Street Journal, May 8, 2009, Pg. 12) Australia is increasing their spending and while we are cutting ours. Obiously Australia doen't realize the the President will just be nice to everyone so they don't need to build up their military.", 
        "intTime": 20090508, 
        "postID": 3, 
        "quote": "Originally posted by NSNN: quote: Since World War II, U.S. military dominance has underpinned the Asia-Pacific region’s prosperity and relative peace. So it is cause for concern when one of America’s closest allies sees that power ebbing amid unstable nuclear regimes such as Pakistan and North Korea and the expanding military power of China. Australia currently spends around $13.1 billion a year on defense, not counting money for new equipment. Now, a new policy paper says spending will increase by 3 percent annually until 2018, which is not much. But the importance of Canberra’s message is about priorities. Australia is worried about the end of the “unipolar moment.” (Wall Street Journal, May 8, 2009, Pg. 12)", 
        "reply": " Australia is increasing their spending and while we are cutting ours. Obiously Australia doen't realize the the President will just be nice to everyone so they don't need to build up their military.", 
        "threadID": "672198221_7430018222001", 
        "time": "2009-05-08 07:31:00", 
        "title": "Australia Prepares For U.S. Decline.", 
        "userID": "athos20"
    }, 
    {
        "content": "quote: Originally posted by athos20: Australia is increasing their spending and while we are cutting ours. Obiously Australia doen't realize the the President will just be nice to everyone so they don't need to build up their military. He wouldn’t need to cut spending if the previous village idiot didn’t bury the economy. But, you're right….**** the economy…..just keep on spending on Military……hm, where have I seen that before? \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090508, 
        "postID": 4, 
        "quote": "Originally posted by athos20: Australia is increasing their spending and while we are cutting ours. Obiously Australia doen't realize the the President will just be nice to everyone so they don't need to build up their military.", 
        "reply": " He wouldn’t need to cut spending if the previous village idiot didn’t bury the economy. But, you're right….**** the economy…..just keep on spending on Military……hm, where have I seen that before? \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_7430018222001", 
        "time": "2009-05-08 07:40:00", 
        "title": "Australia Prepares For U.S. Decline.", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by NSNN: quote: Originally posted by athos20: Australia is increasing their spending and while we are cutting ours. Obiously Australia doen't realize the the President will just be nice to everyone so they don't need to build up their military. He wouldn’t need to cut spending if the previous village idiot didn’t bury the economy. He had a good deal of help from the village idiots on The Hill.", 
        "intTime": 20090508, 
        "postID": 5, 
        "quote": "Originally posted by NSNN: quote: Originally posted by athos20: Australia is increasing their spending and while we are cutting ours. Obiously Australia doen't realize the the President will just be nice to everyone so they don't need to build up their military. He wouldn’t need to cut spending if the previous village idiot didn’t bury the economy.", 
        "reply": " He had a good deal of help from the village idiots on The Hill.", 
        "threadID": "672198221_7430018222001", 
        "time": "2009-05-08 07:45:00", 
        "title": "Australia Prepares For U.S. Decline.", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by NSNN: quote: Originally posted by athos20: Australia is increasing their spending and while we are cutting ours. Obiously Australia doen't realize the the President will just be nice to everyone so they don't need to build up their military. He wouldn’t need to cut spending if the previous village idiot didn’t bury the economy. But, you're right….**** the economy…..just keep on spending on Military……hm, where have I seen that before? Yep that's why defense is the only major program that is getting cut. How about cutting all the programs. Wouldn't that speed up the economy rebounding?", 
        "intTime": 20090508, 
        "postID": 6, 
        "quote": "Originally posted by NSNN: quote: Originally posted by athos20: Australia is increasing their spending and while we are cutting ours. Obiously Australia doen't realize the the President will just be nice to everyone so they don't need to build up their military. He wouldn’t need to cut spending if the previous village idiot didn’t bury the economy. But, you're right….**** the economy…..just keep on spending on Military……hm, where have I seen that before?", 
        "reply": " Yep that's why defense is the only major program that is getting cut. How about cutting all the programs. Wouldn't that speed up the economy rebounding?", 
        "threadID": "672198221_7430018222001", 
        "time": "2009-05-08 07:47:00", 
        "title": "Australia Prepares For U.S. Decline.", 
        "userID": "athos20"
    }, 
    {
        "content": "quote: Originally posted by athos20: quote: Originally posted by NSNN: quote: Originally posted by athos20: Australia is increasing their spending and while we are cutting ours. Obiously Australia doen't realize the the President will just be nice to everyone so they don't need to build up their military. He wouldn’t need to cut spending if the previous village idiot didn’t bury the economy. But, you're right….**** the economy…..just keep on spending on Military……hm, where have I seen that before? Yep that's why defense is the only major program that is getting cut. How about cutting all the programs. Wouldn't that speed up the economy rebounding? Some useless and/or over-bloated programs are getting cut, but the defense budget is actually going up…..focusing primarily on our most valuable asset(s): people. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090508, 
        "postID": 7, 
        "quote": "Originally posted by athos20: quote: Originally posted by NSNN: quote: Originally posted by athos20: Australia is increasing their spending and while we are cutting ours. Obiously Australia doen't realize the the President will just be nice to everyone so they don't need to build up their military. He wouldn’t need to cut spending if the previous village idiot didn’t bury the economy. But, you're right….**** the economy…..just keep on spending on Military……hm, where have I seen that before? Yep that's why defense is the only major program that is getting cut. How about cutting all the programs. Wouldn't that speed up the economy rebounding?", 
        "reply": " Some useless and/or over-bloated programs are getting cut, but the defense budget is actually going up…..focusing primarily on our most valuable asset(s): people. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_7430018222001", 
        "time": "2009-05-08 07:54:00", 
        "title": "Australia Prepares For U.S. Decline.", 
        "userID": "NSNN"
    }, 
    {
        "content": "Australia GDP for 2009 forcasted at 0% real growth. The Presidency think they can eliminate systems worth 9 Billion from DOD. Congress and Senators have a habit of reinstating them. The MV-22 Osprey has died a thousand budgetary deaths, Rumsfeld as head mortician but has today has become a favorite with Marines especially with upgrades of firepower. As one Senator was heard to say, the ear marks of Administration is found at the beginning of the Federal Budget, Congress at the end.", 
        "intTime": 20090508, 
        "postID": 8, 
        "quote": "", 
        "reply": "Australia GDP for 2009 forcasted at 0% real growth. The Presidency think they can eliminate systems worth 9 Billion from DOD. Congress and Senators have a habit of reinstating them. The MV-22 Osprey has died a thousand budgetary deaths, Rumsfeld as head mortician but has today has become a favorite with Marines especially with upgrades of firepower. As one Senator was heard to say, the ear marks of Administration is found at the beginning of the Federal Budget, Congress at the end.", 
        "threadID": "672198221_7430018222001", 
        "time": "2009-05-08 11:16:00", 
        "title": "Australia Prepares For U.S. Decline.", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "Look how much money would be saved , if all the politicians cut their pay in half.", 
        "intTime": 20090508, 
        "postID": 9, 
        "quote": "", 
        "reply": "Look how much money would be saved , if all the politicians cut their pay in half.", 
        "threadID": "672198221_7430018222001", 
        "time": "2009-05-08 11:29:00", 
        "title": "Australia Prepares For U.S. Decline.", 
        "userID": "coh75inf"
    }, 
    {
        "content": "quote: Originally posted by NSNN: quote: Originally posted by athos20: Australia is increasing their spending and while we are cutting ours. Obiously Australia doen't realize the the President will just be nice to everyone so they don't need to build up their military. He wouldn’t need to cut spending if the previous village idiot didn’t bury the economy. But, you're right….**** the economy…..just keep on spending on Military……hm, where have I seen that before? Can you cite the policy or policies of President Bush that caused the economy to go south the way it did? You actually think the house of cards was built in less than 8 years? And one look at President Obama'a budget shows where money is being increased, and it isn't just the military. I find it amusing that people want to blame a portion of the budget that is less than 20% (actually 18.6% counting request for ongoing opersations, 15% without based on budget request of $3.552 trillion) for budget ills. You could stop all defense spending for the next couple fo years and still have an outrageous defict. Numbers from White House website.", 
        "intTime": 20090508, 
        "postID": 10, 
        "quote": "Originally posted by NSNN: quote: Originally posted by athos20: Australia is increasing their spending and while we are cutting ours. Obiously Australia doen't realize the the President will just be nice to everyone so they don't need to build up their military. He wouldn’t need to cut spending if the previous village idiot didn’t bury the economy. But, you're right….**** the economy…..just keep on spending on Military……hm, where have I seen that before?", 
        "reply": " Can you cite the policy or policies of President Bush that caused the economy to go south the way it did? You actually think the house of cards was built in less than 8 years? And one look at President Obama'a budget shows where money is being increased, and it isn't just the military. I find it amusing that people want to blame a portion of the budget that is less than 20% (actually 18.6% counting request for ongoing opersations, 15% without based on budget request of $3.552 trillion) for budget ills. You could stop all defense spending for the next couple fo years and still have an outrageous defict. Numbers from White House website.", 
        "threadID": "672198221_7430018222001", 
        "time": "2009-05-08 12:06:00", 
        "title": "Australia Prepares For U.S. Decline.", 
        "userID": "sw614"
    }, 
    {
        "content": "America has been in decline since 1975. Empires don't fall overnight. Personally, I'm sick and tired of trying to rule the world. No political entity has ever done it for very long and America is no exception.", 
        "intTime": 20090508, 
        "postID": 11, 
        "quote": "", 
        "reply": "America has been in decline since 1975. Empires don't fall overnight. Personally, I'm sick and tired of trying to rule the world. No political entity has ever done it for very long and America is no exception.", 
        "threadID": "672198221_7430018222001", 
        "time": "2009-05-08 12:15:00", 
        "title": "Australia Prepares For U.S. Decline.", 
        "userID": "Dublin1916"
    }, 
    {
        "content": "quote: Originally posted by sw614: Can you cite the policy or policies of President Bush that caused the economy to go south the way it did? I'll cite just one. After the Enron scandal, Mr. Bush announced he was strenthening the SEC, in fact he weakened it and appointed a new Chairperson, who after the collapse of Banks and Insurance companies, said, \"It's not the job of the SEC to protect investors.\" How right he was is demonstrated that despite repeated warnings, a little Hedge Fund run by Bernie Madeoff actually passed every yearly review of the SEC, even though the company never bought one share of any stock. Let's here it for deregualtion!!! Dave", 
        "intTime": 20090508, 
        "postID": 12, 
        "quote": "Originally posted by sw614: Can you cite the policy or policies of President Bush that caused the economy to go south the way it did?", 
        "reply": " I'll cite just one. After the Enron scandal, Mr. Bush announced he was strenthening the SEC, in fact he weakened it and appointed a new Chairperson, who after the collapse of Banks and Insurance companies, said, \"It's not the job of the SEC to protect investors.\" How right he was is demonstrated that despite repeated warnings, a little Hedge Fund run by Bernie Madeoff actually passed every yearly review of the SEC, even though the company never bought one share of any stock. Let's here it for deregualtion!!! Dave", 
        "threadID": "672198221_7430018222001", 
        "time": "2009-05-08 12:27:00", 
        "title": "Australia Prepares For U.S. Decline.", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by sw614: Can you cite the policy or policies of President Bush that caused the economy to go south the way it did? I'll cite just one. After the Enron scandal, Mr. Bush announced he was strenthening the SEC, in fact he weakened it and appointed a new Chairperson, who after the collapse of Banks and Insurance companies, said, \"It's not the job of the SEC to protect investors.\" How right he was is demonstrated that despite repeated warnings, a little Hedge Fund run by Bernie Madeoff actually passed every yearly review of the SEC, even though the company never bought one share of any stock. Let's here it for deregualtion!!! Dave Well, is it the responsibility of the SEC to look out after investors? I thought their charter was to enforce regulations. There can be no excuse for Madoff going unnoticed or unchallanged for as long as he did. It is interesting to note that Madoff has admitted that he started the scheme in the early 90s. Glad you choise ole Bernie - I just wrote a paper for school about this chump. I have always been against deregulation of anything that can impact the nation as a whole. What else can to attribute the current economic situation to?", 
        "intTime": 20090508, 
        "postID": 13, 
        "quote": "Originally posted by Grachus: quote: Originally posted by sw614: Can you cite the policy or policies of President Bush that caused the economy to go south the way it did? I'll cite just one. After the Enron scandal, Mr. Bush announced he was strenthening the SEC, in fact he weakened it and appointed a new Chairperson, who after the collapse of Banks and Insurance companies, said, \"It's not the job of the SEC to protect investors.\" How right he was is demonstrated that despite repeated warnings, a little Hedge Fund run by Bernie Madeoff actually passed every yearly review of the SEC, even though the company never bought one share of any stock. Let's here it for deregualtion!!! Dave", 
        "reply": " Well, is it the responsibility of the SEC to look out after investors? I thought their charter was to enforce regulations. There can be no excuse for Madoff going unnoticed or unchallanged for as long as he did. It is interesting to note that Madoff has admitted that he started the scheme in the early 90s. Glad you choise ole Bernie - I just wrote a paper for school about this chump. I have always been against deregulation of anything that can impact the nation as a whole. What else can to attribute the current economic situation to?", 
        "threadID": "672198221_7430018222001", 
        "time": "2009-05-08 13:13:00", 
        "title": "Australia Prepares For U.S. Decline.", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by sw614: quote: Originally posted by Grachus: quote: Originally posted by sw614: Can you cite the policy or policies of President Bush that caused the economy to go south the way it did? I'll cite just one. After the Enron scandal, Mr. Bush announced he was strenthening the SEC, in fact he weakened it and appointed a new Chairperson, who after the collapse of Banks and Insurance companies, said, \"It's not the job of the SEC to protect investors.\" How right he was is demonstrated that despite repeated warnings, a little Hedge Fund run by Bernie Madeoff actually passed every yearly review of the SEC, even though the company never bought one share of any stock. Let's here it for deregualtion!!! Dave Well, is it the responsibility of the SEC to look out after investors? I thought their charter was to enforce regulations. There can be no excuse for Madoff going unnoticed or unchallanged for as long as he did. It is interesting to note that Madoff has admitted that he started the scheme in the early 90s. Glad you choise ole Bernie - I just wrote a paper for school about this chump. I have always been against deregulation of anything that can impact the nation as a whole. What else can to attribute the current economic situation to? This is from their Mission Statement as of 12/2008 quote: Introduction The mission of the U.S. Securities and Exchange Commission is to protect investors, maintain fair, orderly, and efficient markets, and facilitate capital formation. http://www.sec.gov/about/whatwedo.shtml You might find the entire link to be interesting. They sure as hell didn't do any of the above. Dave", 
        "intTime": 20090508, 
        "postID": 14, 
        "quote": "Originally posted by sw614: quote: Originally posted by Grachus: quote: Originally posted by sw614: Can you cite the policy or policies of President Bush that caused the economy to go south the way it did? I'll cite just one. After the Enron scandal, Mr. Bush announced he was strenthening the SEC, in fact he weakened it and appointed a new Chairperson, who after the collapse of Banks and Insurance companies, said, \"It's not the job of the SEC to protect investors.\" How right he was is demonstrated that despite repeated warnings, a little Hedge Fund run by Bernie Madeoff actually passed every yearly review of the SEC, even though the company never bought one share of any stock. Let's here it for deregualtion!!! Dave Well, is it the responsibility of the SEC to look out after investors? I thought their charter was to enforce regulations. There can be no excuse for Madoff going unnoticed or unchallanged for as long as he did. It is interesting to note that Madoff has admitted that he started the scheme in the early 90s. Glad you choise ole Bernie - I just wrote a paper for school about this chump. I have always been against deregulation of anything that can impact the nation as a whole. What else can to attribute the current economic situation to?", 
        "reply": " This is from their Mission Statement as of 12/2008 quote: Introduction The mission of the U.S. Securities and Exchange Commission is to protect investors, maintain fair, orderly, and efficient markets, and facilitate capital formation. http://www.sec.gov/about/whatwedo.shtml You might find the entire link to be interesting. They sure as hell didn't do any of the above. Dave", 
        "threadID": "672198221_7430018222001", 
        "time": "2009-05-08 13:47:00", 
        "title": "Australia Prepares For U.S. Decline.", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: He wouldn’t need to cut spending if the previous village idiot didn’t bury the economy. But, you're right….**** the economy…..just keep on spending on Military……hm, where have I seen that before? Your cute with the Hillary Clinton bumper sticker slogans. Bleah...", 
        "intTime": 20090508, 
        "postID": 15, 
        "quote": "He wouldn’t need to cut spending if the previous village idiot didn’t bury the economy. But, you're right….**** the economy…..just keep on spending on Military……hm, where have I seen that before?", 
        "reply": " Your cute with the Hillary Clinton bumper sticker slogans. Bleah...", 
        "threadID": "672198221_7430018222001", 
        "time": "2009-05-08 14:17:00", 
        "title": "Australia Prepares For U.S. Decline.", 
        "userID": "ACR26"
    }, 
    {
        "content": "You would think by looking at how we got to the top, the Congress would see the dangers, easily on several occasions adapted to kept the country from going down. Agreed with your premise up to a point but Bush is far from the culprit that got us on the road to subprime and free wheeling stocks and hedge funds. The simplicity of attacking one division of government or one person over this scheme of layered fraud started before Bush or Enron, Fannie, Freddie or the 110th Congress. The more you read the history the more abusive the money changers are. Legislation in the 1990's and signed into law produced the lack of regulation. No finger pointing, just a complaint that no one is looking out for our interest, the little guy. SEC is a government agency, cannot make law, only Congress. I'm afraid to say deregulated standards place in effect in 1930's were overshadowed, allowed the Fannie, Freddie and Enron's to run wild . The control of money is held by the greedy. Not even controlled by our government. In fact it's not In God We Trust, or silver certificates of the United States, It's comparibly few money institutions outside the government that actually feed on our interest and supply our monetary system. Research the Constitution on who shall provide legal tender Section 8 and then enter the world of the Federal Reserve.", 
        "intTime": 20090508, 
        "postID": 16, 
        "quote": "", 
        "reply": "You would think by looking at how we got to the top, the Congress would see the dangers, easily on several occasions adapted to kept the country from going down. Agreed with your premise up to a point but Bush is far from the culprit that got us on the road to subprime and free wheeling stocks and hedge funds. The simplicity of attacking one division of government or one person over this scheme of layered fraud started before Bush or Enron, Fannie, Freddie or the 110th Congress. The more you read the history the more abusive the money changers are. Legislation in the 1990's and signed into law produced the lack of regulation. No finger pointing, just a complaint that no one is looking out for our interest, the little guy. SEC is a government agency, cannot make law, only Congress. I'm afraid to say deregulated standards place in effect in 1930's were overshadowed, allowed the Fannie, Freddie and Enron's to run wild . The control of money is held by the greedy. Not even controlled by our government. In fact it's not In God We Trust, or silver certificates of the United States, It's comparibly few money institutions outside the government that actually feed on our interest and supply our monetary system. Research the Constitution on who shall provide legal tender Section 8 and then enter the world of the Federal Reserve.", 
        "threadID": "672198221_7430018222001", 
        "time": "2009-05-08 17:08:00", 
        "title": "Australia Prepares For U.S. Decline.", 
        "userID": "rayevinsonsr"
    }
]