[
    {
        "content": "Many of the \"French\" division which led the liberation of Paris were Spanish quote: Papers unearthed by the BBC reveal that British and American commanders ensured that the liberation of Paris on 25 August 1944 was seen as a \"whites only\" victory. Many who fought Nazi Germany during World War II did so to defeat the vicious racism that left millions of Jews dead. Yet the BBC's Document programme has seen evidence that black colonial soldiers - who made up around two-thirds of Free French forces - were deliberately removed from the unit that led the Allied advance into the French capital. By the time France fell in June 1940, 17,000 of its black, mainly West African colonial troops, known as the Tirailleurs Senegalais, lay dead. Many of them were simply shot where they stood soon after surrendering to German troops who often regarded them as sub-human savages. Their chance for revenge came in August 1944 as Allied troops prepared to retake Paris. But despite their overwhelming numbers, they were not to get it. 'More desirable' The leader of the Free French forces, Charles de Gaulle, made it clear that he wanted his Frenchmen to lead the liberation of Paris. Allied High Command agreed, but only on one condition: De Gaulle's division must not contain any black soldiers. In January 1944 Eisenhower's Chief of Staff, Major General Walter Bedell Smith, was to write in a memo stamped, \"confidential\": \"It is more desirable that the division mentioned above consist of white personnel. \"This would indicate the Second Armoured Division, which with only one fourth native personnel, is the only French division operationally available that could be made one hundred percent white.\" At the time America segregated its own troops along racial lines and did not allow black GIs to fight alongside their white comrades until the late stages of the war. Morocco division Given the fact that Britain did not segregate its forces and had a large and valued Indian army, one might have expected London to object to such a racist policy. Yet this does not appear to have been the case. A document written by the British General, Frederick Morgan, to Allied Supreme Command stated: \"It is unfortunate that the only French formation that is 100% white is an armoured division in Morocco. \"Every other French division is only about 40% white. I have told Colonel de Chevene that his chances of getting what he wants will be vastly improved if he can produce a white infantry division.\" Finding an all-white division that was available proved to be impossible due to the enormous contribution made to the French Army by West African conscripts. So, Allied Command insisted that all black soldiers be taken out and replaced by white ones from other units. When it became clear that there were not enough white soldiers to fill the gaps, soldiers from parts of North Africa and the Middle East were used instead. Pensions cut In the end, nearly everyone was happy. De Gaulle got his wish to have a French division lead the liberation of Paris, even though the shortage of white troops meant that many of his men were actually Spanish. The British and Americans got their \"Whites Only\" Liberation even though many of the troops involved were North African or Syrian. For France's West African Tirailleurs Senegalais, however, there was little to celebrate. Despite forming 65% of Free French Forces and dying in large numbers for France, they were to have no heroes' welcome in Paris. After the liberation of the French capital many were simply stripped of their uniforms and sent home. To make matters even worse, in 1959 their pensions were cut. ..... I watched a good movie on this topic (Africans fighting for France)a while ago and it was quite disheartening.....cant remeber the name now! *http://news.bbc.co.uk/2/hi/europe/7984436.stm", 
        "intTime": 20090406, 
        "postID": 1, 
        "quote": "Papers unearthed by the BBC reveal that British and American commanders ensured that the liberation of Paris on 25 August 1944 was seen as a \"whites only\" victory. Many who fought Nazi Germany during World War II did so to defeat the vicious racism that left millions of Jews dead. Yet the BBC's Document programme has seen evidence that black colonial soldiers - who made up around two-thirds of Free French forces - were deliberately removed from the unit that led the Allied advance into the French capital. By the time France fell in June 1940, 17,000 of its black, mainly West African colonial troops, known as the Tirailleurs Senegalais, lay dead. Many of them were simply shot where they stood soon after surrendering to German troops who often regarded them as sub-human savages. Their chance for revenge came in August 1944 as Allied troops prepared to retake Paris. But despite their overwhelming numbers, they were not to get it. 'More desirable' The leader of the Free French forces, Charles de Gaulle, made it clear that he wanted his Frenchmen to lead the liberation of Paris. Allied High Command agreed, but only on one condition: De Gaulle's division must not contain any black soldiers. In January 1944 Eisenhower's Chief of Staff, Major General Walter Bedell Smith, was to write in a memo stamped, \"confidential\": \"It is more desirable that the division mentioned above consist of white personnel. \"This would indicate the Second Armoured Division, which with only one fourth native personnel, is the only French division operationally available that could be made one hundred percent white.\" At the time America segregated its own troops along racial lines and did not allow black GIs to fight alongside their white comrades until the late stages of the war. Morocco division Given the fact that Britain did not segregate its forces and had a large and valued Indian army, one might have expected London to object to such a racist policy. Yet this does not appear to have been the case. A document written by the British General, Frederick Morgan, to Allied Supreme Command stated: \"It is unfortunate that the only French formation that is 100% white is an armoured division in Morocco. \"Every other French division is only about 40% white. I have told Colonel de Chevene that his chances of getting what he wants will be vastly improved if he can produce a white infantry division.\" Finding an all-white division that was available proved to be impossible due to the enormous contribution made to the French Army by West African conscripts. So, Allied Command insisted that all black soldiers be taken out and replaced by white ones from other units. When it became clear that there were not enough white soldiers to fill the gaps, soldiers from parts of North Africa and the Middle East were used instead. Pensions cut In the end, nearly everyone was happy. De Gaulle got his wish to have a French division lead the liberation of Paris, even though the shortage of white troops meant that many of his men were actually Spanish. The British and Americans got their \"Whites Only\" Liberation even though many of the troops involved were North African or Syrian. For France's West African Tirailleurs Senegalais, however, there was little to celebrate. Despite forming 65% of Free French Forces and dying in large numbers for France, they were to have no heroes' welcome in Paris. After the liberation of the French capital many were simply stripped of their uniforms and sent home. To make matters even worse, in 1959 their pensions were cut. .....", 
        "reply": "Many of the \"French\" division which led the liberation of Paris were Spanish  I watched a good movie on this topic (Africans fighting for France)a while ago and it was quite disheartening.....cant remeber the name now! *http://news.bbc.co.uk/2/hi/europe/7984436.stm", 
        "threadID": "672198221_1960069912001", 
        "time": "2009-04-06 06:51:00", 
        "title": "Paris liberation made 'whites only'", 
        "userID": "21116357"
    }, 
    {
        "content": "\"Days of Glory \" +http://en.wikipedia.org/wiki/Days_of_Glory_(2006_film) Very good movie! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090406, 
        "postID": 2, 
        "quote": "", 
        "reply": "\"Days of Glory \" +http://en.wikipedia.org/wiki/Days_of_Glory_(2006_film) Very good movie! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_1960069912001", 
        "time": "2009-04-06 08:03:00", 
        "title": "Paris liberation made 'whites only'", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by 21116357: I watched a good movie on this topic (Africans fighting for France)a while ago and it was quite disheartening.....cant remeber the name now! *http://news.bbc.co.uk/2/hi/europe/7984436.stm I am a history buff apparently like you are. However, I am wondering, WADR your point is now?", 
        "intTime": 20090406, 
        "postID": 3, 
        "quote": "Originally posted by 21116357: I watched a good movie on this topic (Africans fighting for France)a while ago and it was quite disheartening.....cant remeber the name now! *http://news.bbc.co.uk/2/hi/europe/7984436.stm", 
        "reply": " I am a history buff apparently like you are. However, I am wondering, WADR your point is now?", 
        "threadID": "672198221_1960069912001", 
        "time": "2009-04-06 08:32:00", 
        "title": "Paris liberation made 'whites only'", 
        "userID": "busnrete8"
    }, 
    {
        "content": "Did you know that in 1933 in this United States of America that many states had a law that ONLY A WHITE PERSON COULD OWN A HOME!!! CA, still has the law on their books as with many other states. In 1948 the S.C. pretty much made the law useless, but still the same its there. Ca won't take it off their books because they said it would cost 7 million dollars to do a strike out or white out... And just think how LIBERAL CA is!!! But they won't take that law off their books....", 
        "intTime": 20090406, 
        "postID": 4, 
        "quote": "", 
        "reply": "Did you know that in 1933 in this United States of America that many states had a law that ONLY A WHITE PERSON COULD OWN A HOME!!! CA, still has the law on their books as with many other states. In 1948 the S.C. pretty much made the law useless, but still the same its there. Ca won't take it off their books because they said it would cost 7 million dollars to do a strike out or white out... And just think how LIBERAL CA is!!! But they won't take that law off their books....", 
        "threadID": "672198221_1960069912001", 
        "time": "2009-04-06 15:33:00", 
        "title": "Paris liberation made 'whites only'", 
        "userID": "dman1948"
    }, 
    {
        "content": "quote: Originally posted by dman1948: Did you know that in 1933 in this United States of America that many states had a law that ONLY A WHITE PERSON COULD OWN A HOME!!! CA, still has the law on their books as with many other states. In 1948 the S.C. pretty much made the law useless, but still the same its there. Ca won't take it off their books because they said it would cost 7 million dollars to do a strike out or white out... Seriously? LOL That's funny if true.... And just think how LIBERAL CA is!!! But they won't take that law off their books.... \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090406, 
        "postID": 5, 
        "quote": "Originally posted by dman1948: Did you know that in 1933 in this United States of America that many states had a law that ONLY A WHITE PERSON COULD OWN A HOME!!! CA, still has the law on their books as with many other states. In 1948 the S.C. pretty much made the law useless, but still the same its there. Ca won't take it off their books because they said it would cost 7 million dollars to do a strike out or white out... Seriously? LOL That's funny if true.... And just think how LIBERAL CA is!!! But they won't take that law off their books....", 
        "reply": " \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_1960069912001", 
        "time": "2009-04-06 15:36:00", 
        "title": "Paris liberation made 'whites only'", 
        "userID": "NSNN"
    }
]