[
    {
        "content": "quote: BIRMINGHAM, Ala. - The actor best known as \"Borat\" tricked the Alabama National Guard into allowing him onto a post, giving him a military uniform and briefly letting him train - all, supposedly, for a German TV documentary. The ruse, which included comedian Sacha Baron Cohen exposing his thong underwear while changing clothes, was going well until a young cadet recognized Cohen and notified older officers who weren't familiar with the actor. \"It's an embarrassment to the Alabama National Guard,\" Staff Sgt. Katrina Timmons said Monday. \"Since then we have put in protocols to make sure this doesn't happen again.\" A film crew pulled the stunt Feb. 13 at the Alabama Military Academy, which trains officer candidates from across the nation. The school is located at the Army's old Fort McClellan in Anniston, about 65 miles east of Birmingham. Footage from the visit could be included in Cohen's upcoming movie featuring his character Bruno, a gay Austrian fashion writer. The reported title is \"Bruno: Delicious Journeys Through America For The Purpose Of Making Heterosexual Males Visibly Uncomfortable In The Presence Of A Gay Foreigner In A Mesh T-Shirt.\" Mil.com",
        "intTime": 20090317,
        "postID": 1,
        "quote": "BIRMINGHAM, Ala. - The actor best known as \"Borat\" tricked the Alabama National Guard into allowing him onto a post, giving him a military uniform and briefly letting him train - all, supposedly, for a German TV documentary. The ruse, which included comedian Sacha Baron Cohen exposing his thong underwear while changing clothes, was going well until a young cadet recognized Cohen and notified older officers who weren't familiar with the actor. \"It's an embarrassment to the Alabama National Guard,\" Staff Sgt. Katrina Timmons said Monday. \"Since then we have put in protocols to make sure this doesn't happen again.\" A film crew pulled the stunt Feb. 13 at the Alabama Military Academy, which trains officer candidates from across the nation. The school is located at the Army's old Fort McClellan in Anniston, about 65 miles east of Birmingham. Footage from the visit could be included in Cohen's upcoming movie featuring his character Bruno, a gay Austrian fashion writer. The reported title is \"Bruno: Delicious Journeys Through America For The Purpose Of Making Heterosexual Males Visibly Uncomfortable In The Presence Of A Gay Foreigner In A Mesh T-Shirt.\"",
        "reply": " Mil.com",
        "threadID": "672198221_8580080812001",
        "time": "2009-03-17 08:31:00",
        "title": "'Borat' Star Fools Ala. National Guard",
        "userID": "Knele"
    },
    {
        "content": "What an idiot!! Funny as hell, but an idiot still the same. LOL Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin",
        "intTime": 20090317,
        "postID": 2,
        "quote": "",
        "reply": "What an idiot!! Funny as hell, but an idiot still the same. LOL Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin",
        "threadID": "672198221_8580080812001",
        "time": "2009-03-17 08:35:00",
        "title": "'Borat' Star Fools Ala. National Guard",
        "userID": "L0A1"
    },
    {
        "content": "quote: Originally posted by L0A1: What an idiot!! Funny as hell, but an idiot still the same. LOL I agree, but if you or I did this, we would be looking at the world through a jail cell. I'd like to see this guy charged, and then see how funny him and his production crew find this. Dave",
        "intTime": 20090317,
        "postID": 3,
        "quote": "Originally posted by L0A1: What an idiot!! Funny as hell, but an idiot still the same. LOL",
        "reply": " I agree, but if you or I did this, we would be looking at the world through a jail cell. I'd like to see this guy charged, and then see how funny him and his production crew find this. Dave",
        "threadID": "672198221_8580080812001",
        "time": "2009-03-17 10:07:00",
        "title": "'Borat' Star Fools Ala. National Guard",
        "userID": "Grachus"
    },
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by L0A1: What an idiot!! Funny as hell, but an idiot still the same. LOL I agree, but if you or I did this, we would be looking at the world through a jail cell. I'd like to see this guy charged, and then see how funny him and his production crew find this. Dave Oh, I have to agree, but I doubt anything will happen. I would like to see him romming with bubba, just don't see it happening. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin",
        "intTime": 20090317,
        "postID": 4,
        "quote": "Originally posted by Grachus: quote: Originally posted by L0A1: What an idiot!! Funny as hell, but an idiot still the same. LOL I agree, but if you or I did this, we would be looking at the world through a jail cell. I'd like to see this guy charged, and then see how funny him and his production crew find this. Dave",
        "reply": " Oh, I have to agree, but I doubt anything will happen. I would like to see him romming with bubba, just don't see it happening. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin",
        "threadID": "672198221_8580080812001",
        "time": "2009-03-17 10:09:00",
        "title": "'Borat' Star Fools Ala. National Guard",
        "userID": "L0A1"
    },
    {
        "content": "MY GOD,,,,I loath hollywood and their ilk. Whatever happened to the Hollywood of Dean Martin,Bob Hope,Bogart,..... Hollywood has turned into a cesspool for the last 35 years, vermon.",
        "intTime": 20090317,
        "postID": 5,
        "quote": "",
        "reply": "MY GOD,,,,I loath hollywood and their ilk. Whatever happened to the Hollywood of Dean Martin,Bob Hope,Bogart,..... Hollywood has turned into a cesspool for the last 35 years, vermon.",
        "threadID": "672198221_8580080812001",
        "time": "2009-03-17 10:14:00",
        "title": "'Borat' Star Fools Ala. National Guard",
        "userID": "BAGodbehere"
    },
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by L0A1: What an idiot!! Funny as hell, but an idiot still the same. LOL I agree, but if you or I did this, we would be looking at the world through a jail cell. I'd like to see this guy charged, and then see how funny him and his production crew find this. Dave Why? He claims to be a German journalist and nobody bothers to checks his credentials before giving him access to the base?! Who’s the idiot?",
        "intTime": 20090317,
        "postID": 6,
        "quote": "Originally posted by Grachus: quote: Originally posted by L0A1: What an idiot!! Funny as hell, but an idiot still the same. LOL I agree, but if you or I did this, we would be looking at the world through a jail cell. I'd like to see this guy charged, and then see how funny him and his production crew find this. Dave",
        "reply": " Why? He claims to be a German journalist and nobody bothers to checks his credentials before giving him access to the base?! Who’s the idiot?",
        "threadID": "672198221_8580080812001",
        "time": "2009-03-17 10:43:00",
        "title": "'Borat' Star Fools Ala. National Guard",
        "userID": "Knele"
    },
    {
        "content": "quote: Originally posted by Knele: quote: Originally posted by Grachus: quote: Originally posted by L0A1: What an idiot!! Funny as hell, but an idiot still the same. LOL I agree, but if you or I did this, we would be looking at the world through a jail cell. I'd like to see this guy charged, and then see how funny him and his production crew find this. Dave Why? He claims to be a German journalist and nobody bothers to checks his credentials before giving him access to the base?! Who’s the idiot? If I get away with a crime because the authorities blew it, doesn't make the crime go away. Now mind you, he's going to be making money off of this. Dave",
        "intTime": 20090317,
        "postID": 7,
        "quote": "Originally posted by Knele: quote: Originally posted by Grachus: quote: Originally posted by L0A1: What an idiot!! Funny as hell, but an idiot still the same. LOL I agree, but if you or I did this, we would be looking at the world through a jail cell. I'd like to see this guy charged, and then see how funny him and his production crew find this. Dave Why? He claims to be a German journalist and nobody bothers to checks his credentials before giving him access to the base?! Who’s the idiot?",
        "reply": " If I get away with a crime because the authorities blew it, doesn't make the crime go away. Now mind you, he's going to be making money off of this. Dave",
        "threadID": "672198221_8580080812001",
        "time": "2009-03-17 10:47:00",
        "title": "'Borat' Star Fools Ala. National Guard",
        "userID": "Grachus"
    },
    {
        "content": "My only question is why the hell didn't they check his paperwork to make sure he belonged there? Some security guard was absolutely SLACKING on his responsibilities. Half of me wants to laugh my tail off over this, and the other half of me is furious about the pizz-poor security this implies.",
        "intTime": 20090317,
        "postID": 8,
        "quote": "",
        "reply": "My only question is why the hell didn't they check his paperwork to make sure he belonged there? Some security guard was absolutely SLACKING on his responsibilities. Half of me wants to laugh my tail off over this, and the other half of me is furious about the pizz-poor security this implies.",
        "threadID": "672198221_8580080812001",
        "time": "2009-03-17 11:47:00",
        "title": "'Borat' Star Fools Ala. National Guard",
        "userID": "Whirled_Peas"
    },
    {
        "content": "It's a military academy and not a military post but it's good that somebody was 'on watch'. Maybe it was because he started 'acting gay'. >http://www.examiner.com/x-4107-SF-Gay--Lesbian-Examiner~y2009m3d12-10000-US-soldiers-discharged-for-being-gay PS: When did they notice the 'production crew'?",
        "intTime": 20090317,
        "postID": 9,
        "quote": "",
        "reply": "It's a military academy and not a military post but it's good that somebody was 'on watch'. Maybe it was because he started 'acting gay'. >http://www.examiner.com/x-4107-SF-Gay--Lesbian-Examiner~y2009m3d12-10000-US-soldiers-discharged-for-being-gay PS: When did they notice the 'production crew'?",
        "threadID": "672198221_8580080812001",
        "time": "2009-03-17 13:07:00",
        "title": "'Borat' Star Fools Ala. National Guard",
        "userID": "popsiq"
    },
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by L0A1: What an idiot!! Funny as hell, but an idiot still the same. LOL I agree, but if you or I did this, we would be looking at the world through a jail cell. I'd like to see this guy charged, and then see how funny him and his production crew find this. Dave What are you going to charge him with?",
        "intTime": 20090317,
        "postID": 10,
        "quote": "Originally posted by Grachus: quote: Originally posted by L0A1: What an idiot!! Funny as hell, but an idiot still the same. LOL I agree, but if you or I did this, we would be looking at the world through a jail cell. I'd like to see this guy charged, and then see how funny him and his production crew find this. Dave",
        "reply": " What are you going to charge him with?",
        "threadID": "672198221_8580080812001",
        "time": "2009-03-17 13:20:00",
        "title": "'Borat' Star Fools Ala. National Guard",
        "userID": "foxred03"
    },
    {
        "content": "quote: Originally posted by Knele: quote: BIRMINGHAM, Ala. - The actor best known as \"Borat\" tricked the Alabama National Guard into allowing him onto a post, giving him a military uniform and briefly letting him train - all, supposedly, for a German TV documentary. <snipped> Mil.com A national guardsman (or his commanders) let him on base and gave him a uniform. We give these guys guns and expect them to protect us from terrorists ???",
        "intTime": 20090317,
        "postID": 11,
        "quote": "Originally posted by Knele: quote: BIRMINGHAM, Ala. - The actor best known as \"Borat\" tricked the Alabama National Guard into allowing him onto a post, giving him a military uniform and briefly letting him train - all, supposedly, for a German TV documentary. <snipped> Mil.com",
        "reply": " A national guardsman (or his commanders) let him on base and gave him a uniform. We give these guys guns and expect them to protect us from terrorists ???",
        "threadID": "672198221_8580080812001",
        "time": "2009-03-17 13:59:00",
        "title": "'Borat' Star Fools Ala. National Guard",
        "userID": "MaddogK"
    },
    {
        "content": "quote: Originally posted by foxred03: quote: Originally posted by Grachus: quote: Originally posted by L0A1: What an idiot!! Funny as hell, but an idiot still the same. LOL I agree, but if you or I did this, we would be looking at the world through a jail cell. I'd like to see this guy charged, and then see how funny him and his production crew find this. Dave What are you going to charge him with? It's a crime to enter a military base under false pretenses. The reason being obvious. What's the difference between him doing this and a terrorist doing it? - Which is WHY it's a crime. Dave",
        "intTime": 20090317,
        "postID": 12,
        "quote": "Originally posted by foxred03: quote: Originally posted by Grachus: quote: Originally posted by L0A1: What an idiot!! Funny as hell, but an idiot still the same. LOL I agree, but if you or I did this, we would be looking at the world through a jail cell. I'd like to see this guy charged, and then see how funny him and his production crew find this. Dave What are you going to charge him with?",
        "reply": " It's a crime to enter a military base under false pretenses. The reason being obvious. What's the difference between him doing this and a terrorist doing it? - Which is WHY it's a crime. Dave",
        "threadID": "672198221_8580080812001",
        "time": "2009-03-17 14:38:00",
        "title": "'Borat' Star Fools Ala. National Guard",
        "userID": "Grachus"
    },
    {
        "content": "quote: Reply I guess the difference is that he is an actor not a terrorist. And if I read the article correctly, this wasn't a military base it was a state military academy.",
        "intTime": 20090317,
        "postID": 13,
        "quote": "Reply",
        "reply": " I guess the difference is that he is an actor not a terrorist. And if I read the article correctly, this wasn't a military base it was a state military academy.",
        "threadID": "672198221_8580080812001",
        "time": "2009-03-17 21:57:00",
        "title": "'Borat' Star Fools Ala. National Guard",
        "userID": "foxred03"
    },
    {
        "content": "I do not know if any laws were broken. but it should be investigated. Off hand, he impersinated an member of the armed forces, maybe not ours, but someones. he misappropriated government property, in wearing a uniform. His enclusion in training was a misuse of government resources. Since the National gaurd is a major factor in TGWOT, and may or may not be encluded as a Federalized portion of war effort, at the time of the act. I see little differance in entering an Army base, and pulling the same stunt. Should any of the funding for that acadamy be provided by DOD funding, he misappropriated Federal resources. I would want a pound of flesh if he should have provided enough drain, distraction, that the quality of traing should have been impacted.",
        "intTime": 20090317,
        "postID": 14,
        "quote": "",
        "reply": "I do not know if any laws were broken. but it should be investigated. Off hand, he impersinated an member of the armed forces, maybe not ours, but someones. he misappropriated government property, in wearing a uniform. His enclusion in training was a misuse of government resources. Since the National gaurd is a major factor in TGWOT, and may or may not be encluded as a Federalized portion of war effort, at the time of the act. I see little differance in entering an Army base, and pulling the same stunt. Should any of the funding for that acadamy be provided by DOD funding, he misappropriated Federal resources. I would want a pound of flesh if he should have provided enough drain, distraction, that the quality of traing should have been impacted.",
        "threadID": "672198221_8580080812001",
        "time": "2009-03-17 23:00:00",
        "title": "'Borat' Star Fools Ala. National Guard",
        "userID": "snipechief"
    },
    {
        "content": "quote: Originally posted by MaddogK: quote: Originally posted by Knele: [QUOTE] BIRMINGHAM, Ala. - The actor best known as \"Borat\" tricked the Alabama National Guard into allowing him onto a post, giving him a military uniform and briefly letting him train - all, supposedly, for a German TV documentary. <snipped> Mil.com A national guardsman (or his commanders) let him on base and gave him a uniform. We give these guys guns and expect them to protect us from terrorists ??? Do not judge us guardsman for the action of a few who made a mistake.Many of us fought with honor in Iraq and Afghanistan.For 8 years we have protected this country from terrorists,so please get the facts straight.",
        "intTime": 20090325,
        "postID": 15,
        "quote": "Originally posted by MaddogK: quote: Originally posted by Knele: [QUOTE] BIRMINGHAM, Ala. - The actor best known as \"Borat\" tricked the Alabama National Guard into allowing him onto a post, giving him a military uniform and briefly letting him train - all, supposedly, for a German TV documentary. <snipped> Mil.com A national guardsman (or his commanders) let him on base and gave him a uniform. We give these guys guns and expect them to protect us from terrorists ???",
        "reply": " Do not judge us guardsman for the action of a few who made a mistake.Many of us fought with honor in Iraq and Afghanistan.For 8 years we have protected this country from terrorists,so please get the facts straight.",
        "threadID": "672198221_8580080812001",
        "time": "2009-03-25 01:48:00",
        "title": "'Borat' Star Fools Ala. National Guard",
        "userID": "stormtiger39"
    },
    {
        "content": "I guess none of you ever seen borat? He pretty far out there.",
        "intTime": 20090325,
        "postID": 16,
        "quote": "",
        "reply": "I guess none of you ever seen borat? He pretty far out there.",
        "threadID": "672198221_8580080812001",
        "time": "2009-03-25 02:01:00",
        "title": "'Borat' Star Fools Ala. National Guard",
        "userID": "world_king377"
    },
    {
        "content": "I'd like to see how far he gets if he tried that stunt in Black Water's compound.",
        "intTime": 20090325,
        "postID": 17,
        "quote": "",
        "reply": "I'd like to see how far he gets if he tried that stunt in Black Water's compound.",
        "threadID": "672198221_8580080812001",
        "time": "2009-03-25 02:38:00",
        "title": "'Borat' Star Fools Ala. National Guard",
        "userID": "Duster6"
    },
    {
        "content": "quote: 'Borat' Star Fools Ala. National Guard Sheesh ... that's so minor league. He's got a long way to go before he makes it to Obama's level of deception.",
        "intTime": 20090325,
        "postID": 18,
        "quote": "'Borat' Star Fools Ala. National Guard",
        "reply": " Sheesh ... that's so minor league. He's got a long way to go before he makes it to Obama's level of deception.",
        "threadID": "672198221_8580080812001",
        "time": "2009-03-25 04:21:00",
        "title": "'Borat' Star Fools Ala. National Guard",
        "userID": "I_M_Qwerty"
    }
]