[
    {
        "content": "GEITHNER & RANGEL TO BE SUBPOENAED IN TAX FRAUD CASE Federal Case Alleges Political Elite Get Favorable Tax Treatment Over Ordinary Citizens On 5 March 2009 a Motion was filed in U.S. v. David Jacquot, Case # CR 08-1171, in the Federal District Court, in San Diego, California seeking to dismiss a false tax return indictment on the grounds that the Defendant was not treated in the same manner as politically prominent individuals. A hearing on this matter is set for 30 March 2009 in San Diego and the Defendant in this case intends to subpoena Secretary of the Treasury Timothy Geithner, House Ways and Means Chairman Charles Rangel, former Senate Majority Leader Tom Daschle, and others. The Defendant in this case is David Jacquot, an attorney and retired Army Officer. He is a decorated disabled Desert Storm veteran living in rural Idaho with his family. This “Geithner Motion” cites HR 735 titled the “Rangel Rule Act of 2009,” which if enacted, would eliminate penalties and interest for common citizens to allow them to be treated in the same manner as House Ways and Means Chairman Representative Charles Rangel. The Geithner Motion also quotes President Obama stressing the need to “treat common citizens in the same manner as politically prominent individuals in regards to tax matters”. The Geithner Motion details how Mr. Jacquot was vindictively indicted in retaliation for his successful defense of his clients against the IRS. The tax returns of his corporate law firm for the four (4) years of 2001 to 2004 were investigated and the government alleges that the law firm declared almost $200,000 TOO MUCH income during this time period. The Geithner Motion contains descriptions of numerous actions by the government and Assistant U.S. Attorney (AUSA) Faith Devine that are the basis for the claim of retaliation against Mr. Jacquot for his zealous representation of his client’s Constitutional and statutory rights. The improper actions of AUSA Devine have been reported to the DOJ Office of Professional Responsibility for disciplinary action and are currently under review. A copy of the Geithner Motion can be downloaded at: PLEASE VISIT THE SITE & PASS THE WORD ON TO OTHERS!!! This message has been edited. Last edited by: stillkit, Sat 14 March 2009 12:22 PM", 
        "intTime": 20090314, 
        "postID": 1, 
        "quote": "", 
        "reply": "GEITHNER & RANGEL TO BE SUBPOENAED IN TAX FRAUD CASE Federal Case Alleges Political Elite Get Favorable Tax Treatment Over Ordinary Citizens On 5 March 2009 a Motion was filed in U.S. v. David Jacquot, Case # CR 08-1171, in the Federal District Court, in San Diego, California seeking to dismiss a false tax return indictment on the grounds that the Defendant was not treated in the same manner as politically prominent individuals. A hearing on this matter is set for 30 March 2009 in San Diego and the Defendant in this case intends to subpoena Secretary of the Treasury Timothy Geithner, House Ways and Means Chairman Charles Rangel, former Senate Majority Leader Tom Daschle, and others. The Defendant in this case is David Jacquot, an attorney and retired Army Officer. He is a decorated disabled Desert Storm veteran living in rural Idaho with his family. This “Geithner Motion” cites HR 735 titled the “Rangel Rule Act of 2009,” which if enacted, would eliminate penalties and interest for common citizens to allow them to be treated in the same manner as House Ways and Means Chairman Representative Charles Rangel. The Geithner Motion also quotes President Obama stressing the need to “treat common citizens in the same manner as politically prominent individuals in regards to tax matters”. The Geithner Motion details how Mr. Jacquot was vindictively indicted in retaliation for his successful defense of his clients against the IRS. The tax returns of his corporate law firm for the four (4) years of 2001 to 2004 were investigated and the government alleges that the law firm declared almost $200,000 TOO MUCH income during this time period. The Geithner Motion contains descriptions of numerous actions by the government and Assistant U.S. Attorney (AUSA) Faith Devine that are the basis for the claim of retaliation against Mr. Jacquot for his zealous representation of his client’s Constitutional and statutory rights. The improper actions of AUSA Devine have been reported to the DOJ Office of Professional Responsibility for disciplinary action and are currently under review. A copy of the Geithner Motion can be downloaded at: PLEASE VISIT THE SITE & PASS THE WORD ON TO OTHERS!!! This message has been edited. Last edited by: stillkit, Sat 14 March 2009 12:22 PM", 
        "threadID": "672198221_3380048712001", 
        "time": "2009-03-14 10:04:00", 
        "title": "Disabled Vet Subpoena Geithner Over Tax Problems", 
        "userID": "RiflesJudgeActual"
    }, 
    {
        "content": "quote: Federal Case Alleges Political Elite Get Favorable Tax Treatment Over Ordinary Citizens Dave, I know I keep posting this because it is the only viable answer. \"www.fairtax.org\" Not perfect, but viable. Much better than the current system.", 
        "intTime": 20090314, 
        "postID": 2, 
        "quote": "Federal Case Alleges Political Elite Get Favorable Tax Treatment Over Ordinary Citizens", 
        "reply": " Dave, I know I keep posting this because it is the only viable answer. \"www.fairtax.org\" Not perfect, but viable. Much better than the current system.", 
        "threadID": "672198221_3380048712001", 
        "time": "2009-03-14 10:10:00", 
        "title": "Disabled Vet Subpoena Geithner Over Tax Problems", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: quote: Federal Case Alleges Political Elite Get Favorable Tax Treatment Over Ordinary Citizens Dave, I know I keep posting this because it is the only viable answer. \"www.fairtax.org\" Not perfect, but viable. Much better than the current system. The current system is a result of Democratic and Republican cooperation for over sixty years to roll back the New Deal. Truman was the Last Liberal to be in the White House. They turned Public Housing from a right to a charity, and institutionalised Poverty. They turned Welfare from a program to aid the physically disabled into a charity which institutionalised poverty. They turned the minimum wage, which was originally a Living Wage, into lunch money. Both parties have nothing against \"charity,\" but they are short on solutions to WHY we need charity in the first place. And I personally regard the attempts to totally eliminate the progressive income tax as just one more coffin in the nail of New Deal reforms. Bad as the present implementation is, once it's gone, the \"solutions\" to the failure of the fair tax, will simply be extensions of it. When the smoke clears, there will either be a larger tax or less services, or both. Dave", 
        "intTime": 20090314, 
        "postID": 3, 
        "quote": "Originally posted by crackerjacks61: quote: Federal Case Alleges Political Elite Get Favorable Tax Treatment Over Ordinary Citizens Dave, I know I keep posting this because it is the only viable answer. \"www.fairtax.org\" Not perfect, but viable. Much better than the current system.", 
        "reply": " The current system is a result of Democratic and Republican cooperation for over sixty years to roll back the New Deal. Truman was the Last Liberal to be in the White House. They turned Public Housing from a right to a charity, and institutionalised Poverty. They turned Welfare from a program to aid the physically disabled into a charity which institutionalised poverty. They turned the minimum wage, which was originally a Living Wage, into lunch money. Both parties have nothing against \"charity,\" but they are short on solutions to WHY we need charity in the first place. And I personally regard the attempts to totally eliminate the progressive income tax as just one more coffin in the nail of New Deal reforms. Bad as the present implementation is, once it's gone, the \"solutions\" to the failure of the fair tax, will simply be extensions of it. When the smoke clears, there will either be a larger tax or less services, or both. Dave", 
        "threadID": "672198221_3380048712001", 
        "time": "2009-03-14 10:57:00", 
        "title": "Disabled Vet Subpoena Geithner Over Tax Problems", 
        "userID": "Grachus"
    }
]