[
    {
        "content": "Why should they worry? How many times do they have to tell people that you can't get Swine Flu from eating pork? Not that anyone in an Islamic country like Afghanistan would eat pork. quote: Afghanistan's Only Pig Quarantined in Flu Fear ++http://abcnews.go.com/US/wireStory?id=7508617 By Golnar Motevalli May 5, 2009 KABUL (Reuters) - Afghanistan's only known pig has been locked in a room, away from visitors to Kabul zoo where it normally grazes beside deer and goats, because people are worried it could infect them with the virus popularly known as swine flu. The pig is a curiosity in Muslim Afghanistan, where pork and pig products are illegal because they are considered irreligious, and has been in quarantine since Sunday after visitors expressed alarm it could spread the new flu strain. \"For now the pig is under quarantine, we built it a room because of swine influenza,\" Aziz Gul Saqib, director of Kabul Zoo, told Reuters. \"We've done this because people are worried about getting the flu.\" Worldwide, more than 1,000 people have been infected with the virus, according to the World Health Organization, which also says 26 people have so far died from the strain. All but one of the deaths were in Mexico, the epicenter of the outbreak. There are no pig farms in Afghanistan and no direct civilian flights between Kabul and Mexico...", 
        "intTime": 20090505, 
        "postID": 1, 
        "quote": "Afghanistan's Only Pig Quarantined in Flu Fear ++http://abcnews.go.com/US/wireStory?id=7508617 By Golnar Motevalli May 5, 2009 KABUL (Reuters) - Afghanistan's only known pig has been locked in a room, away from visitors to Kabul zoo where it normally grazes beside deer and goats, because people are worried it could infect them with the virus popularly known as swine flu. The pig is a curiosity in Muslim Afghanistan, where pork and pig products are illegal because they are considered irreligious, and has been in quarantine since Sunday after visitors expressed alarm it could spread the new flu strain. \"For now the pig is under quarantine, we built it a room because of swine influenza,\" Aziz Gul Saqib, director of Kabul Zoo, told Reuters. \"We've done this because people are worried about getting the flu.\" Worldwide, more than 1,000 people have been infected with the virus, according to the World Health Organization, which also says 26 people have so far died from the strain. All but one of the deaths were in Mexico, the epicenter of the outbreak. There are no pig farms in Afghanistan and no direct civilian flights between Kabul and Mexico...", 
        "reply": "Why should they worry? How many times do they have to tell people that you can't get Swine Flu from eating pork? Not that anyone in an Islamic country like Afghanistan would eat pork. ", 
        "threadID": "672198221_7050085222001", 
        "time": "2009-05-05 18:36:00", 
        "title": "Afghanistan's only pig quarantined due to Swine Flu fear", 
        "userID": "Canuck_Centaur"
    }
]