[
    {
        "content": "Definately Worth a read and some consideration But they have been pretty accurate in thier predictions over the years so see what you think? [«] Money and Markets 2009 Archive View This Issue On Our Website [»] \"www.moneyandmarkets.com.\" Scamalot: The Worst Con Jobs Are Yet To Come by Larry Edelson I'm taking a different path in this issue. I'm going to discuss a few things that hardly anyone is warning you about. Yet, they're so important, they simply cannot be overlooked. To do so would be foolhardy. But first, a quick update on what I'm seeing in the markets ... A. The broad stock markets are now within an important timing window for a major low. The month of March should mark the low for stocks for the year. I can't tell you exactly where the low will come in on the Dow, but I do know that it will bottom this month and then begin a multi-month powerful rally. B. Oil has bottomed. It will likely hit $50 next, then the $75 to $80 level. What will drive oil higher? The fundamental explanations from the media will come after the fact. Keep in mind oil, like gold, tends to lead the economy, not lag it. C. Gold is consolidating and likely preparing for a move to new record highs. It must hold the $891 level to do so. As long as it does, gold should move to as high as $1,250 an ounce on its next leg up. D. The dollar is firm on a short-term basis, but remains in a long-term bear market. I expect a top in the dollar this month, then the beginning of a protracted decline in the greenback as the Fed's flooding of the economy and monetization of debt begins to inflate asset prices and deflate the dollar. E. Long-term bond markets are a disaster in the making. Especially long-term U.S. treasury bonds. Continue to steer clear of them. There is simply no way they are going to hold their value in the face of at least $2 TRILLION in debt auctions this year from the Treasury. Even if the Fed buys those bonds to try and support the market. If you've been following my column, and especially my Real Wealth Report, you're positioned nicely for the markets and for what's going to unfold over the rest of this year. Targets of Vulnerability Now, let's take a look at something I find terribly troublesome ... that very few are talking about ... yet is critically important ... Most people think the era of scams in the markets and investments is over. Kaput. After all, from the tech bubble to Enron and WorldCom ... from the real estate and mortgage train wreck, to Madoff's $50 billion Ponzi scheme ... we've seen every kind of scam possible, right? Wrong! Fact is, beneath the surface of every bear market lies new scams being hatched ... scores more dishonest operators and flimflam con artists ... ... and sadly, tens of millions of vulnerable investors ready willing and able to try and grab any opportunity to make back even just a fraction of what they've lost in the markets. Or keep their job. Or supplement their income. Madoff may be the biggest scam revealed so far, but there are tens of thousands of smaller scams going on now that involve billions more. \"Hope\" is a wonderfully positive emotion. But it can also be deadly to your finances, especially when you're vulnerable. All told, I count at least 124 new scams lurking out there right now — along with many old scams with new twists — that you need to be acutely aware of. Even the economic stimulus package, which was only signed last month, is already spawning numerous scams trying to entice people with promises of free government cash. Chief amongst the victims ... Homeowners having trouble paying their mortgages or in default. This group is especially vulnerable to newly-hatched scams that promise to forestall foreclosures, help with mortgage payments, refinancing, and more. Investors who have suffered enormous losses, which is just about everyone today. The unemployed, desperate to find new jobs. Even those gainfully employed, but worried about their jobs, and those seeking second incomes from part-time jobs and even home-biz opportunities. Senior citizens, who are especially vulnerable to scams today because they largely rely on fixed incomes ... where interest rates are now effectively zero. Small and medium-sized businesses looking for short-term credit lines and financing needs. Students, many of whom are having a tougher time financing their educations and recent grads looking for jobs. Internal Sponsorship It doesn't matter if you're age 20 or 70 ... RIGHT NOW Is the Time to Take Charge of Your Retirement! The financial crisis and ensuing stock market crash have wiped out at least $7 trillion in wealth. Your ability to retire has never been more threatened than it is today. While the outlook might seem bleak, this is actually the perfect time to take a look at your retirement strategy! Click here for more information on a worry-free retirement ... Beware of These Major Scams Sadly, the above groups comprise just about everyone under the sun. So this issue, in my opinion, couldn't be timelier. The scams unfolding today? Here are some of the most prevalent ones that I think you need to be aware of and some that are just getting started — all of which are rapidly on the rise ... Foreclosure scams: Here are 3 most common: Phony Counseling or \"Phantom Help\": The \"counselor\" tells the homeowner that he can negotiate a deal with their lender to save their home. In exchange for an exorbitant fee, the scam artist claims he will handle all the details. But once the fee is paid, the phony counselor disappears with the homeowner's money as well as with their personal financial information. The lease/buy back: Homeowners are deceived into signing over the deed to their home to a scam artist who tells them they will be able to remain in the house as a renter and eventually buy it back. Usually, the terms of this scheme are so demanding that the buy-back becomes impossible, the homeowner gets evicted, and the \"rescuer\" walks off with most or all of the equity. The bait-and-switch: Homeowners are duped into signing documents for what they think is a new loan to bring their mortgage current. But what they are really signing are forged documents ceding the title of their house to the scammer. Homeowners usually don't know they've been scammed until they get an eviction notice. Foreclosure scams are rampant in today's depressed housing market. Also included, a new rash of home improvement scams, where operators try to prove to you that by spending a few bucks on improving your home, with convincing pitches that you'll be able to sell it more quickly and at a much higher price. While in many cases home improvements do help, don't make any improvements unless A) you can afford it, B) you're not borrowing money to do it, and C) you thoroughly check out who you're dealing with. Examples: I recently read of operators on the East coast preying on homeowners telling them if they don't change their outside cable and telephone lines to comply with the requirements of the upcoming change to digital TV, their homes will lose value and be more difficult to sell. I've also read of HVAC trades people preying on homeowners to get them to replace their older air conditioning unit and compressors over to Puron, a more environmentally friendly refrigerant than Freon. The pitch: The investment offers tax credits and also makes a home more marketable. How to protect yourself: Do your homework. Check references. Be sure any company you work with is appropriately licensed (and insured) to do business. Check for complaints against the company. Debt elimination/reduction scams. These are all over the place now, and unfortunately, wrought with illegitimate operators who claim they can reduce or even eliminate credit card or other debt, but charge excessively high fees, fail to pay creditors as promised, or do other shady things that put you in a worse financial position. If you need help with debt problems, take time to seek out a legitimate credit counseling organization. High-return investment and savings pitches: Preying on investors' desire to earn back losses or get higher returns on savings. The pitches can run the gamut from \"risk-free\" investments in the stock market ... to Certificates of Deposit yielding 6 percent ... 7 percent ... 9 percent or even more. If you're offered, say, a savings interest rate that's more than 3 percent or 4 percent above market rates, it's probably a scam — or at best, a legitimate investment that carries some hidden large risk, either spelled out in very-hard-to-find-or-understand fine print. Or by locking your money up much longer than you ever thought or are being told, and likely in a weak, vulnerable financial institution. Your best defense: Use common sense — if an investment sounds too good to be true, it probably is. Job, unemployment, and income-related scams: Running the gamut now to include everything from offering \"job insurance,\" which allegedly covers you if you're laid off ... to filing unemployment claims for you (by charging you unnecessary fees) ... to \"guaranteeing\" they'll find you a job ... to promises of riches from part-time home-biz opportunities. Facts: Don't pay anyone a red cent to file unemployment claims on your behalf or to anyone promising you they'll find you a job. As for home biz-opportunities, many are terrific and legitimate. Many are not. The best way to tell: If a home-biz opportunity requires you to pay significant money upfront to start the business, or to buy loads of inventory to keep in stock, chances are, it's not a legit business. Be sure to check out the company with your state's Attorney General's office or the local BBB. Tax scams: On the rise, organizations promising you — for a fee — tax rebates ... access to bogus government programs ... past due tax settlements, and more. And not just on the Federal level, but also on the state and local levels. Beware. New fangled insurance products and related annuity pitches: The insurance industry is in the dumps, but there's no shortage of new products coming out of this industry, ranging from job insurance to annuity products for your savings that promise high rates of return. Many of these products are being offered by legitimate companies. Many are not. My best advice here: Steer clear of all of them, including legitimate offers. Primary reason: As I just noted, the insurance industry is in the dumps, and some of the biggest names in the industry, like AIG, are failing. So other than homeowner's insurance and life insurance and medical coverage needs, I would just simply steer clear of all insurance offers and annuity policies offered by insurance companies. Be wary of offers that promise relief for debt, investment, tax or insurance problems. Reverse mortgages: One of the most worrying of all to me, reverse mortgages, which allow older homeowners over 62 years of age to convert part of the equity in their homes into cash without having to sell their homes or take on additional monthly bills. In a \"reverse\" mortgage, you receive tax-free money from the lender and generally don't have to pay it back for as long as you live in your home. Instead, the loan must be repaid when you die, sell your home, or no longer live there as your principal residence. Reverse mortgages can be a great way for older homeowners who are house-rich but cash-poor to stay in their homes, but boost their financial liquidity. The catches ... A) Reverse mortgages have very high up-front fees, as much as 8 percent of the home's value, plus monthly service fees. So if you're an older homeowner and you own your home outright, you might be better off taking out a home equity loan. Even though you'll have to make monthly payments to repay a home equity loan, in many cases, it can turn out to be less expensive than a reverse mortgage. B) With a reverse mortgage (and also a home equity loan), you're tapping the equity in your home and taking on debt. So if you have any plans of leaving your home in your estate to your children or grandchildren, just keep in mind you might be jeopardizing that, or, leaving your heirs an encumbered property. Many senior citizens are jumping at the opportunity to cash out some equity in their homes. For many, it's a big help. But for many others, it's nothing more than going deeply into debt and hocking your home. So, think this decision through carefully before you entertain a reverse mortgage, comparing its costs to that of just getting a plain old home equity line instead. Also be aware of ... Mystery shopping scams. Classified ads or unsolicited emails where the scammer claims they are sending you a check but instructing you to make purchases and then, after deducting a \"commission,\" to wire the remaining funds back. The check is fake, but the victim has withdrawn real money and sent it to the scammer. Fake checks are now showing up in lottery scams, internet auction scams, and rental scams. These checks look real, but they are just a way to steal your money. Prize and sweepstakes scams. Also on the rise now, the victim is told he or she has won something and just has to send a check to cover the taxes. Or the victim is sent a fake check for $5,000 and told to deposit the check and send back $2,000 to cover the taxes. By the time the victim figures out the check is bogus it's too late. In addition to the above, please be acutely aware that identity theft — already growing rapidly before this financial crisis hit — is exploding exponentially higher. In fact, it was the top consumer scam complaint in 2008. One reason is plain, old-fashioned greed. But another reason is the confusion in the market place caused by the increase in bank and credit card mergers. For instance, WaMu credit cards were just merged with Chase. I have a WaMu card and have received at least eight notices from WaMu urging me to go to a Chase website via a link provided in the email to verify my card. All of the notices I received were scams, so-called \"phishing\" attacks to try and get my credit card and other personal information. Identity theft is soaring more than ever. How could I tell? First, every single one of the emails I received contained either multiple spelling errors or multiple formatting errors, none of which a legitimate company would most likely ever make. Second, legitimate institutions or companies will never ask for your personal information via email or request you click a link to provide such information. Bottom line: Email and online scammers are now taking advantage of the huge uncertainty and rash of mergers in the banking and financial industries to prey on innocent victims. Indeed, according to a recent study by fraud-tracking firm Javelin Research, identity theft soared 22 percent from 2007 to 2008 ... while spyware attacks from November 2008 through January 2009 soared 169 percent according to analysts at the internet security firm Lavasoft. How to Play It Safe I've been doing all of my banking and bill paying online for over nine years now, and have never had a problem. The safety measures I take ... 1. I NEVER respond to any emails I receive regarding any of my accounts. 2. When I get any email notifications of any kind from one of my financial institutions, I NEVER click through the email. Instead, I go directly to the institutions website to check the bill, the message, whatever the subject of the email is. 3. Whenever I go to any of my financial institutions' websites, or make a purchase online, I always check to be sure the beginning of the URL has a \"https\" prefix, the \"s\" meaning it's a secure website. 4. I follow all prudent online safety measures, such as using different usernames and passwords (which I keep track of in a spreadsheet) ... never divulging them to anyone ... frequently changing them ... and more, including always having up-to-date virus and spyware software. For virus software, I use Norton Anti-virus. Their 2009 edition is excellent and does not slow your computer down. For anti-spyware, I use Spybot, shareware that's available with updates at \"www.safer-networking.org/en/home/index\" Now is the time to be more vigilantly protecting your money than ever before! Be safe and best wishes, Larry P.S. For more of my thoughts and insights directly from the front lines as I travel the world, sign up for our new free ezine, Global Wealth Report, with daily updates and recommendations to preserve and grow your wealth — no matter what markets or doing, or where the profits are.", 
        "intTime": 20090312, 
        "postID": 1, 
        "quote": "", 
        "reply": "Definately Worth a read and some consideration But they have been pretty accurate in thier predictions over the years so see what you think? [«] Money and Markets 2009 Archive View This Issue On Our Website [»] \"www.moneyandmarkets.com.\" Scamalot: The Worst Con Jobs Are Yet To Come by Larry Edelson I'm taking a different path in this issue. I'm going to discuss a few things that hardly anyone is warning you about. Yet, they're so important, they simply cannot be overlooked. To do so would be foolhardy. But first, a quick update on what I'm seeing in the markets ... A. The broad stock markets are now within an important timing window for a major low. The month of March should mark the low for stocks for the year. I can't tell you exactly where the low will come in on the Dow, but I do know that it will bottom this month and then begin a multi-month powerful rally. B. Oil has bottomed. It will likely hit $50 next, then the $75 to $80 level. What will drive oil higher? The fundamental explanations from the media will come after the fact. Keep in mind oil, like gold, tends to lead the economy, not lag it. C. Gold is consolidating and likely preparing for a move to new record highs. It must hold the $891 level to do so. As long as it does, gold should move to as high as $1,250 an ounce on its next leg up. D. The dollar is firm on a short-term basis, but remains in a long-term bear market. I expect a top in the dollar this month, then the beginning of a protracted decline in the greenback as the Fed's flooding of the economy and monetization of debt begins to inflate asset prices and deflate the dollar. E. Long-term bond markets are a disaster in the making. Especially long-term U.S. treasury bonds. Continue to steer clear of them. There is simply no way they are going to hold their value in the face of at least $2 TRILLION in debt auctions this year from the Treasury. Even if the Fed buys those bonds to try and support the market. If you've been following my column, and especially my Real Wealth Report, you're positioned nicely for the markets and for what's going to unfold over the rest of this year. Targets of Vulnerability Now, let's take a look at something I find terribly troublesome ... that very few are talking about ... yet is critically important ... Most people think the era of scams in the markets and investments is over. Kaput. After all, from the tech bubble to Enron and WorldCom ... from the real estate and mortgage train wreck, to Madoff's $50 billion Ponzi scheme ... we've seen every kind of scam possible, right? Wrong! Fact is, beneath the surface of every bear market lies new scams being hatched ... scores more dishonest operators and flimflam con artists ... ... and sadly, tens of millions of vulnerable investors ready willing and able to try and grab any opportunity to make back even just a fraction of what they've lost in the markets. Or keep their job. Or supplement their income. Madoff may be the biggest scam revealed so far, but there are tens of thousands of smaller scams going on now that involve billions more. \"Hope\" is a wonderfully positive emotion. But it can also be deadly to your finances, especially when you're vulnerable. All told, I count at least 124 new scams lurking out there right now — along with many old scams with new twists — that you need to be acutely aware of. Even the economic stimulus package, which was only signed last month, is already spawning numerous scams trying to entice people with promises of free government cash. Chief amongst the victims ... Homeowners having trouble paying their mortgages or in default. This group is especially vulnerable to newly-hatched scams that promise to forestall foreclosures, help with mortgage payments, refinancing, and more. Investors who have suffered enormous losses, which is just about everyone today. The unemployed, desperate to find new jobs. Even those gainfully employed, but worried about their jobs, and those seeking second incomes from part-time jobs and even home-biz opportunities. Senior citizens, who are especially vulnerable to scams today because they largely rely on fixed incomes ... where interest rates are now effectively zero. Small and medium-sized businesses looking for short-term credit lines and financing needs. Students, many of whom are having a tougher time financing their educations and recent grads looking for jobs. Internal Sponsorship It doesn't matter if you're age 20 or 70 ... RIGHT NOW Is the Time to Take Charge of Your Retirement! The financial crisis and ensuing stock market crash have wiped out at least $7 trillion in wealth. Your ability to retire has never been more threatened than it is today. While the outlook might seem bleak, this is actually the perfect time to take a look at your retirement strategy! Click here for more information on a worry-free retirement ... Beware of These Major Scams Sadly, the above groups comprise just about everyone under the sun. So this issue, in my opinion, couldn't be timelier. The scams unfolding today? Here are some of the most prevalent ones that I think you need to be aware of and some that are just getting started — all of which are rapidly on the rise ... Foreclosure scams: Here are 3 most common: Phony Counseling or \"Phantom Help\": The \"counselor\" tells the homeowner that he can negotiate a deal with their lender to save their home. In exchange for an exorbitant fee, the scam artist claims he will handle all the details. But once the fee is paid, the phony counselor disappears with the homeowner's money as well as with their personal financial information. The lease/buy back: Homeowners are deceived into signing over the deed to their home to a scam artist who tells them they will be able to remain in the house as a renter and eventually buy it back. Usually, the terms of this scheme are so demanding that the buy-back becomes impossible, the homeowner gets evicted, and the \"rescuer\" walks off with most or all of the equity. The bait-and-switch: Homeowners are duped into signing documents for what they think is a new loan to bring their mortgage current. But what they are really signing are forged documents ceding the title of their house to the scammer. Homeowners usually don't know they've been scammed until they get an eviction notice. Foreclosure scams are rampant in today's depressed housing market. Also included, a new rash of home improvement scams, where operators try to prove to you that by spending a few bucks on improving your home, with convincing pitches that you'll be able to sell it more quickly and at a much higher price. While in many cases home improvements do help, don't make any improvements unless A) you can afford it, B) you're not borrowing money to do it, and C) you thoroughly check out who you're dealing with. Examples: I recently read of operators on the East coast preying on homeowners telling them if they don't change their outside cable and telephone lines to comply with the requirements of the upcoming change to digital TV, their homes will lose value and be more difficult to sell. I've also read of HVAC trades people preying on homeowners to get them to replace their older air conditioning unit and compressors over to Puron, a more environmentally friendly refrigerant than Freon. The pitch: The investment offers tax credits and also makes a home more marketable. How to protect yourself: Do your homework. Check references. Be sure any company you work with is appropriately licensed (and insured) to do business. Check for complaints against the company. Debt elimination/reduction scams. These are all over the place now, and unfortunately, wrought with illegitimate operators who claim they can reduce or even eliminate credit card or other debt, but charge excessively high fees, fail to pay creditors as promised, or do other shady things that put you in a worse financial position. If you need help with debt problems, take time to seek out a legitimate credit counseling organization. High-return investment and savings pitches: Preying on investors' desire to earn back losses or get higher returns on savings. The pitches can run the gamut from \"risk-free\" investments in the stock market ... to Certificates of Deposit yielding 6 percent ... 7 percent ... 9 percent or even more. If you're offered, say, a savings interest rate that's more than 3 percent or 4 percent above market rates, it's probably a scam — or at best, a legitimate investment that carries some hidden large risk, either spelled out in very-hard-to-find-or-understand fine print. Or by locking your money up much longer than you ever thought or are being told, and likely in a weak, vulnerable financial institution. Your best defense: Use common sense — if an investment sounds too good to be true, it probably is. Job, unemployment, and income-related scams: Running the gamut now to include everything from offering \"job insurance,\" which allegedly covers you if you're laid off ... to filing unemployment claims for you (by charging you unnecessary fees) ... to \"guaranteeing\" they'll find you a job ... to promises of riches from part-time home-biz opportunities. Facts: Don't pay anyone a red cent to file unemployment claims on your behalf or to anyone promising you they'll find you a job. As for home biz-opportunities, many are terrific and legitimate. Many are not. The best way to tell: If a home-biz opportunity requires you to pay significant money upfront to start the business, or to buy loads of inventory to keep in stock, chances are, it's not a legit business. Be sure to check out the company with your state's Attorney General's office or the local BBB. Tax scams: On the rise, organizations promising you — for a fee — tax rebates ... access to bogus government programs ... past due tax settlements, and more. And not just on the Federal level, but also on the state and local levels. Beware. New fangled insurance products and related annuity pitches: The insurance industry is in the dumps, but there's no shortage of new products coming out of this industry, ranging from job insurance to annuity products for your savings that promise high rates of return. Many of these products are being offered by legitimate companies. Many are not. My best advice here: Steer clear of all of them, including legitimate offers. Primary reason: As I just noted, the insurance industry is in the dumps, and some of the biggest names in the industry, like AIG, are failing. So other than homeowner's insurance and life insurance and medical coverage needs, I would just simply steer clear of all insurance offers and annuity policies offered by insurance companies. Be wary of offers that promise relief for debt, investment, tax or insurance problems. Reverse mortgages: One of the most worrying of all to me, reverse mortgages, which allow older homeowners over 62 years of age to convert part of the equity in their homes into cash without having to sell their homes or take on additional monthly bills. In a \"reverse\" mortgage, you receive tax-free money from the lender and generally don't have to pay it back for as long as you live in your home. Instead, the loan must be repaid when you die, sell your home, or no longer live there as your principal residence. Reverse mortgages can be a great way for older homeowners who are house-rich but cash-poor to stay in their homes, but boost their financial liquidity. The catches ... A) Reverse mortgages have very high up-front fees, as much as 8 percent of the home's value, plus monthly service fees. So if you're an older homeowner and you own your home outright, you might be better off taking out a home equity loan. Even though you'll have to make monthly payments to repay a home equity loan, in many cases, it can turn out to be less expensive than a reverse mortgage. B) With a reverse mortgage (and also a home equity loan), you're tapping the equity in your home and taking on debt. So if you have any plans of leaving your home in your estate to your children or grandchildren, just keep in mind you might be jeopardizing that, or, leaving your heirs an encumbered property. Many senior citizens are jumping at the opportunity to cash out some equity in their homes. For many, it's a big help. But for many others, it's nothing more than going deeply into debt and hocking your home. So, think this decision through carefully before you entertain a reverse mortgage, comparing its costs to that of just getting a plain old home equity line instead. Also be aware of ... Mystery shopping scams. Classified ads or unsolicited emails where the scammer claims they are sending you a check but instructing you to make purchases and then, after deducting a \"commission,\" to wire the remaining funds back. The check is fake, but the victim has withdrawn real money and sent it to the scammer. Fake checks are now showing up in lottery scams, internet auction scams, and rental scams. These checks look real, but they are just a way to steal your money. Prize and sweepstakes scams. Also on the rise now, the victim is told he or she has won something and just has to send a check to cover the taxes. Or the victim is sent a fake check for $5,000 and told to deposit the check and send back $2,000 to cover the taxes. By the time the victim figures out the check is bogus it's too late. In addition to the above, please be acutely aware that identity theft — already growing rapidly before this financial crisis hit — is exploding exponentially higher. In fact, it was the top consumer scam complaint in 2008. One reason is plain, old-fashioned greed. But another reason is the confusion in the market place caused by the increase in bank and credit card mergers. For instance, WaMu credit cards were just merged with Chase. I have a WaMu card and have received at least eight notices from WaMu urging me to go to a Chase website via a link provided in the email to verify my card. All of the notices I received were scams, so-called \"phishing\" attacks to try and get my credit card and other personal information. Identity theft is soaring more than ever. How could I tell? First, every single one of the emails I received contained either multiple spelling errors or multiple formatting errors, none of which a legitimate company would most likely ever make. Second, legitimate institutions or companies will never ask for your personal information via email or request you click a link to provide such information. Bottom line: Email and online scammers are now taking advantage of the huge uncertainty and rash of mergers in the banking and financial industries to prey on innocent victims. Indeed, according to a recent study by fraud-tracking firm Javelin Research, identity theft soared 22 percent from 2007 to 2008 ... while spyware attacks from November 2008 through January 2009 soared 169 percent according to analysts at the internet security firm Lavasoft. How to Play It Safe I've been doing all of my banking and bill paying online for over nine years now, and have never had a problem. The safety measures I take ... 1. I NEVER respond to any emails I receive regarding any of my accounts. 2. When I get any email notifications of any kind from one of my financial institutions, I NEVER click through the email. Instead, I go directly to the institutions website to check the bill, the message, whatever the subject of the email is. 3. Whenever I go to any of my financial institutions' websites, or make a purchase online, I always check to be sure the beginning of the URL has a \"https\" prefix, the \"s\" meaning it's a secure website. 4. I follow all prudent online safety measures, such as using different usernames and passwords (which I keep track of in a spreadsheet) ... never divulging them to anyone ... frequently changing them ... and more, including always having up-to-date virus and spyware software. For virus software, I use Norton Anti-virus. Their 2009 edition is excellent and does not slow your computer down. For anti-spyware, I use Spybot, shareware that's available with updates at \"www.safer-networking.org/en/home/index\" Now is the time to be more vigilantly protecting your money than ever before! Be safe and best wishes, Larry P.S. For more of my thoughts and insights directly from the front lines as I travel the world, sign up for our new free ezine, Global Wealth Report, with daily updates and recommendations to preserve and grow your wealth — no matter what markets or doing, or where the profits are.", 
        "threadID": "672198221_3150046712001", 
        "time": "2009-03-12 08:23:00", 
        "title": "The Worst scams yet to come", 
        "userID": "john2x"
    }
]