[
    {
        "content": "\"\"http://news.yahoo.com/s/ap/20090503/ap_on_re_us/us_obit_kemp_5\"\" One of the last \"true\" conservatives. RIP Jack..... \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090502, 
        "postID": 1, 
        "quote": "", 
        "reply": "\"\"http://news.yahoo.com/s/ap/20090503/ap_on_re_us/us_obit_kemp_5\"\" One of the last \"true\" conservatives. RIP Jack..... \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_5110073222001", 
        "time": "2009-05-02 20:56:00", 
        "title": "Jack Kemp, a True Conservative, Dies...", 
        "userID": "jack_flats"
    }, 
    {
        "content": "May God be with his family right now. He was one of the good guys.", 
        "intTime": 20090502, 
        "postID": 2, 
        "quote": "", 
        "reply": "May God be with his family right now. He was one of the good guys.", 
        "threadID": "672198221_5110073222001", 
        "time": "2009-05-02 21:00:00", 
        "title": "Jack Kemp, a True Conservative, Dies...", 
        "userID": "FlankerFlyer"
    }, 
    {
        "content": "A good man. RIP", 
        "intTime": 20090502, 
        "postID": 3, 
        "quote": "", 
        "reply": "A good man. RIP", 
        "threadID": "672198221_5110073222001", 
        "time": "2009-05-02 21:38:00", 
        "title": "Jack Kemp, a True Conservative, Dies...", 
        "userID": "jdksfcret"
    }, 
    {
        "content": "quote: Originally posted by jdksfcret: A good man. RIP In the new Republican Party, he wouldn't have lasted much longer... quote: Jack Kemp rebukes Hannity on Obama-Wright issue You know, it's almost enough to give you faith in democracy in our republic. Jack Kemp is a former NFL quarterback who became a Republican Congressman from upstate New York and who was Bob Dole's running mate in the 1996 Presidential election. He appeared tonight on Fox News Hannity and Colmes, not normally a bastion of intellectually well-founded political discourse. Jack Kemp was appearing on behalf of John McCain, trying to persuade Sean Hannity that John McCain is a candidate worthy of his active support. That much is par for the course. However, it seems he has been taking Hannity to task for the way he is mischaracterizing the situation with Rev. Wright as it relates to Barack Obama's candidacy. A portion of the video in question, ©2008 Fox News, via YouTube.com: Here is the exchange I found most noteworthy, starting at about 2m43s into the video clip (about 40%): Sean Hannity: I want to go back to your comments about Reverend Wright, because — Jack Kemp: Okay. [slight chuckle] Hannity: This is really important here, though. I don't know — should I call you Quarterback or Congressman? I never know what to say, but, ah — Kemp: Sir. Hannity: Sir. Kemp: Recovering politician. Hannity: Okay, but there you go. Here's what's important: this comes down to — and you've seemed willing to give Barack Obama a pass that I'm not willing to give him, and let me explain this. This was his pastor for 20 years, the most incendiary anti-American language you would ever hear from the pulpit. He claims that he didn't know, but that he did know, but that he disinvited him to the invocation when he was announcing he's running for President here. Jack, I don't believe him, number one, and secondly, I question the judgment of this man. Kemp: He denounced the racism. He denounced the anti-Israel statements of Rev. Wright. He denounced the off-the-wall belief that America is the worst killing machine — Hannity: Yeah, but he sat there twenty years; do you really — Kemp: He didn't believe that. I don't believe he — The Wall Street Journal, no \"soft on liberals\" editorial, said they don't for a minute think that he believed any of that stuff. So, look — Hannity: No, no, no, no, that's not the question. [Barack Obama] is saying he didn't know. Now, this church, his pastor went to Tripoli with Louis Farrakhan — Kemp: [loud sigh] Hannity: No, Jack, this is important. They gave him a lifetime achievement award and said Farrkhan \"epitomized greatness,\" and he didn't know any of this? Kemp: Barack Obama didn't do any of that. Barack didn't do that. Hannity: His church did. He didn't know his pastor was like this? Kemp: [sigh] Sean, I can't do this every night with you. I mean, you and I disagree with this. I think he's denounced it. I disagree with so many of his positions. For instance, he blamed the lack of economic opportunity that young black men and women have. You know what? I agree with him. We have not done enough to democratize our capitalistic system, to make more capital available to start businesses. He wants to raise taxes on capital gains, dividends, income tax by 52%. He's gonna squeeze — not me, I'm already wealthy at 72. He's gonna squeeze the young black entrepreneur. He's hurting them. Hannity: Let's go down this road, because I think this is important, and I know I'm pressin' ya — Kemp: I don't want to stay on ad hominem attacks. Hannity: I don't want an ad hominem argument here. I find it — I'll use the term that Hillary Clinton used about General Petraeus — this, for me, is the willing suspension of disbelief. And what I mean by this is, if he really didn't know his pastor had these associations with Farrakhan, he went to this church for twenty years, the pastor was saying these controversial things, as he would have us believe — We discovered and broke the story last night that he's friends with another pastor who has used \"the N-word\" repeatedly, talked about the mayor of Chicago as a \"slavemaster\" — It's very — I'm hard-pressed to think maybe he has some agreement with this, which is a scary scenario for a President. Kemp: I don't think he does. He's in a tight spot, 'cause he's gotta answer this, again and again and again, particularly in the general. Having said that, I told you on your radio show this week that I hope that, if he is defeated, it's on the basis of bad economic policy, raising taxes, waving a white flag to our enemy in the Middle East, and things like that, not what Pastor Wright said. Hannity: I think you've taken on the role of the \"external conscience\" of Sean Hannity. Boy, you've been after me a lot lately. Kemp: I'm not \"after you\"; I'm a fan of yours, but I want to hold you accountable! \"http://lincmad.blogspot.com/2008/03/jack-kemp-rebukes-hannity-on-obama.html\" A good man indeed, let him rest in peace. Dave", 
        "intTime": 20090503, 
        "postID": 4, 
        "quote": "Originally posted by jdksfcret: A good man. RIP", 
        "reply": " In the new Republican Party, he wouldn't have lasted much longer... quote: Jack Kemp rebukes Hannity on Obama-Wright issue You know, it's almost enough to give you faith in democracy in our republic. Jack Kemp is a former NFL quarterback who became a Republican Congressman from upstate New York and who was Bob Dole's running mate in the 1996 Presidential election. He appeared tonight on Fox News Hannity and Colmes, not normally a bastion of intellectually well-founded political discourse. Jack Kemp was appearing on behalf of John McCain, trying to persuade Sean Hannity that John McCain is a candidate worthy of his active support. That much is par for the course. However, it seems he has been taking Hannity to task for the way he is mischaracterizing the situation with Rev. Wright as it relates to Barack Obama's candidacy. A portion of the video in question, ©2008 Fox News, via YouTube.com: Here is the exchange I found most noteworthy, starting at about 2m43s into the video clip (about 40%): Sean Hannity: I want to go back to your comments about Reverend Wright, because — Jack Kemp: Okay. [slight chuckle] Hannity: This is really important here, though. I don't know — should I call you Quarterback or Congressman? I never know what to say, but, ah — Kemp: Sir. Hannity: Sir. Kemp: Recovering politician. Hannity: Okay, but there you go. Here's what's important: this comes down to — and you've seemed willing to give Barack Obama a pass that I'm not willing to give him, and let me explain this. This was his pastor for 20 years, the most incendiary anti-American language you would ever hear from the pulpit. He claims that he didn't know, but that he did know, but that he disinvited him to the invocation when he was announcing he's running for President here. Jack, I don't believe him, number one, and secondly, I question the judgment of this man. Kemp: He denounced the racism. He denounced the anti-Israel statements of Rev. Wright. He denounced the off-the-wall belief that America is the worst killing machine — Hannity: Yeah, but he sat there twenty years; do you really — Kemp: He didn't believe that. I don't believe he — The Wall Street Journal, no \"soft on liberals\" editorial, said they don't for a minute think that he believed any of that stuff. So, look — Hannity: No, no, no, no, that's not the question. [Barack Obama] is saying he didn't know. Now, this church, his pastor went to Tripoli with Louis Farrakhan — Kemp: [loud sigh] Hannity: No, Jack, this is important. They gave him a lifetime achievement award and said Farrkhan \"epitomized greatness,\" and he didn't know any of this? Kemp: Barack Obama didn't do any of that. Barack didn't do that. Hannity: His church did. He didn't know his pastor was like this? Kemp: [sigh] Sean, I can't do this every night with you. I mean, you and I disagree with this. I think he's denounced it. I disagree with so many of his positions. For instance, he blamed the lack of economic opportunity that young black men and women have. You know what? I agree with him. We have not done enough to democratize our capitalistic system, to make more capital available to start businesses. He wants to raise taxes on capital gains, dividends, income tax by 52%. He's gonna squeeze — not me, I'm already wealthy at 72. He's gonna squeeze the young black entrepreneur. He's hurting them. Hannity: Let's go down this road, because I think this is important, and I know I'm pressin' ya — Kemp: I don't want to stay on ad hominem attacks. Hannity: I don't want an ad hominem argument here. I find it — I'll use the term that Hillary Clinton used about General Petraeus — this, for me, is the willing suspension of disbelief. And what I mean by this is, if he really didn't know his pastor had these associations with Farrakhan, he went to this church for twenty years, the pastor was saying these controversial things, as he would have us believe — We discovered and broke the story last night that he's friends with another pastor who has used \"the N-word\" repeatedly, talked about the mayor of Chicago as a \"slavemaster\" — It's very — I'm hard-pressed to think maybe he has some agreement with this, which is a scary scenario for a President. Kemp: I don't think he does. He's in a tight spot, 'cause he's gotta answer this, again and again and again, particularly in the general. Having said that, I told you on your radio show this week that I hope that, if he is defeated, it's on the basis of bad economic policy, raising taxes, waving a white flag to our enemy in the Middle East, and things like that, not what Pastor Wright said. Hannity: I think you've taken on the role of the \"external conscience\" of Sean Hannity. Boy, you've been after me a lot lately. Kemp: I'm not \"after you\"; I'm a fan of yours, but I want to hold you accountable! \"http://lincmad.blogspot.com/2008/03/jack-kemp-rebukes-hannity-on-obama.html\" A good man indeed, let him rest in peace. Dave", 
        "threadID": "672198221_5110073222001", 
        "time": "2009-05-03 11:20:00", 
        "title": "Jack Kemp, a True Conservative, Dies...", 
        "userID": "Grachus"
    }, 
    {
        "content": "Jack Kemp was a true conservative and he would have done just fine in the \"New Republican Party\". He stood by his beliefs. He never backed down from a fight and let everyone in the room know what he was thinking, popular or not. He was a champion for supply side economics, tax cuts, and fiscal responsibility. If the \"New Republican Party\" had more people like Jack Kemp, they wouldn't be in the mess they are in now. Rest in Peace, Mr. Kemp.", 
        "intTime": 20090503, 
        "postID": 5, 
        "quote": "", 
        "reply": "Jack Kemp was a true conservative and he would have done just fine in the \"New Republican Party\". He stood by his beliefs. He never backed down from a fight and let everyone in the room know what he was thinking, popular or not. He was a champion for supply side economics, tax cuts, and fiscal responsibility. If the \"New Republican Party\" had more people like Jack Kemp, they wouldn't be in the mess they are in now. Rest in Peace, Mr. Kemp.", 
        "threadID": "672198221_5110073222001", 
        "time": "2009-05-03 13:42:00", 
        "title": "Jack Kemp, a True Conservative, Dies...", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Originally posted by stec74: Jack Kemp was a true conservative and he would have done just fine in the \"New Republican Party\". He stood by his beliefs. He never backed down from a fight and let everyone in the room know what he was thinking, popular or not. He was a champion for supply side economics, tax cuts, and fiscal responsibility. If the \"New Republican Party\" had more people like Jack Kemp, they wouldn't be in the mess they are in now. Rest in Peace, Mr. Kemp. Well, who am I to argue about this? You may very well be right. Even so I have a hard time thinking that the author of the Big Tent policy of the Republican Party, would back the new pup tent philosophy of ideological purity. Just my opinion. I wont argue it with you. In any event, he demonstrated that he was a decent human being - And that will be the way I remember him. Dave", 
        "intTime": 20090503, 
        "postID": 6, 
        "quote": "Originally posted by stec74: Jack Kemp was a true conservative and he would have done just fine in the \"New Republican Party\". He stood by his beliefs. He never backed down from a fight and let everyone in the room know what he was thinking, popular or not. He was a champion for supply side economics, tax cuts, and fiscal responsibility. If the \"New Republican Party\" had more people like Jack Kemp, they wouldn't be in the mess they are in now. Rest in Peace, Mr. Kemp.", 
        "reply": " Well, who am I to argue about this? You may very well be right. Even so I have a hard time thinking that the author of the Big Tent policy of the Republican Party, would back the new pup tent philosophy of ideological purity. Just my opinion. I wont argue it with you. In any event, he demonstrated that he was a decent human being - And that will be the way I remember him. Dave", 
        "threadID": "672198221_5110073222001", 
        "time": "2009-05-03 14:30:00", 
        "title": "Jack Kemp, a True Conservative, Dies...", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by stec74: Jack Kemp was a true conservative and he would have done just fine in the \"New Republican Party\". He stood by his beliefs. He never backed down from a fight and let everyone in the room know what he was thinking, popular or not. He was a champion for supply side economics, tax cuts, and fiscal responsibility. If the \"New Republican Party\" had more people like Jack Kemp, they wouldn't be in the mess they are in now. Rest in Peace, Mr. Kemp. If they listened to more people like Mr. Kemp the current Republican party would be COMPLETELY different than it is. It would NOT be controlled by single issue groups and would be running on ideals not empty atacks.", 
        "intTime": 20090503, 
        "postID": 7, 
        "quote": "Originally posted by stec74: Jack Kemp was a true conservative and he would have done just fine in the \"New Republican Party\". He stood by his beliefs. He never backed down from a fight and let everyone in the room know what he was thinking, popular or not. He was a champion for supply side economics, tax cuts, and fiscal responsibility. If the \"New Republican Party\" had more people like Jack Kemp, they wouldn't be in the mess they are in now. Rest in Peace, Mr. Kemp.", 
        "reply": " If they listened to more people like Mr. Kemp the current Republican party would be COMPLETELY different than it is. It would NOT be controlled by single issue groups and would be running on ideals not empty atacks.", 
        "threadID": "672198221_5110073222001", 
        "time": "2009-05-03 18:24:00", 
        "title": "Jack Kemp, a True Conservative, Dies...", 
        "userID": "rayld2"
    }, 
    {
        "content": "Even wishing the man well is being politicized here... Shame on us!... May God receive you into His loving embrace and keep you safe in His loving arms for all eternity and may your loved ones be comforted by His love and grace... Most Respectfully, SUNLINER81", 
        "intTime": 20090503, 
        "postID": 8, 
        "quote": "", 
        "reply": "Even wishing the man well is being politicized here... Shame on us!... May God receive you into His loving embrace and keep you safe in His loving arms for all eternity and may your loved ones be comforted by His love and grace... Most Respectfully, SUNLINER81", 
        "threadID": "672198221_5110073222001", 
        "time": "2009-05-03 21:43:00", 
        "title": "Jack Kemp, a True Conservative, Dies...", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "Please read the letter below that Jack Kemp wrote his 17 grandchildren after the election of Barrack Obama. Two night, among the accolades that Brian Williams of NBC News heaped on Kemp was Williams' comment that no one in the GOP better reflected or promoted the values of Ronald Reagan than Jack Kemp. Then Williams mentioned this letter. Sadly, the loss of Kemp and his levelheaded approach along with the disappearance of reasonable folks like GOP Senator(s) Warren Rudman, Howard Baker and Jack Danforth and Jacob Javits has left us with the shrill of GOP entertainment: Rush Limbaugh, Sean Hanity and Glenn Beck. Perhaps going forward the measure of GOP success should be measured by TV and radio audience ratings and the advertising revenue attached to them rather than actually having to winning elections. In any case, Kemp's letter and recall a more civil time in U.S. politics. November 12, 2008 Dear Kemp grandchildren -- all 17 of you, spread out from the East Coast to the West Coast, and from Wheaton College in Illinois, to Wake Forest University in North Carolina: My first thought last week upon learning that a 47-year-old African-American Democrat had won the presidency was, \"Is this a great country or not?\" You may have expected your grandfather to be disappointed that his friend John McCain lost (and I was), but there's a difference between disappointment over a lost election and the historical perspective of a monumental event in the life of our nation. Let me explain. First of all, the election was free, fair and transformational, in terms of our democracy and given the history of race relations in our nation. What do I mean? Just think, a little over 40 years ago, blacks in America had trouble even voting in our country, much less thinking about running for the highest office in the land. A little over 40 years ago, in some parts of America, blacks couldn't eat, sleep or even get a drink of water using facilities available to everyone else in the public sphere. We are celebrating, this year, the 40th anniversary of our Fair Housing Laws, which helped put an end to the blatant racism and prejudice against blacks in rental housing and homeownership opportunities. As an old professional football quarterback, in my days there were no black coaches, no black quarterbacks, and certainly no blacks in the front offices of football and other professional sports. For the record, there were great black quarterbacks and coaches -- they just weren't given the opportunity to showcase their talent. And pro-football (and America) was the worse off for it. I remember quarterbacking the old San Diego Chargers and playing for the AFL championship in Houston. My father sat on the 50-yard line, while my co-captain's father, who happened to be black, had to sit in a small, roped-off section of the end zone. Today, we can't imagine the NFL without the amazing contributions of blacks at every level of this great enterprise. I could go on and on, but just imagine that in the face of all these indignities and deprivations, Dr. Martin Luther King could say 44 years ago, \"I have an abiding faith in America and an audacious faith in mankind.\" He described his vision for America, even as he and his people were being denied their God-given human rights guaranteed under our Constitution. You see, real leadership is not just seeing the realities of what we are temporarily faced with, but seeing the possibilities and potential that can be realized by lifting up peoples' vision of what they can be. When President-elect Obama quoted Abraham Lincoln on the night of his election, he was acknowledging the transcendent qualities of vision and leadership that are always present, but often overlooked and neglected by pettiness, partisanship and petulance. As president, I believe Barack Obama can help lift us out of a narrow view of America into the ultimate vision of an America where, if you're born to be a mezzo-soprano or a master carpenter, nothing stands in your way of realizing your God-given potential. Both Obama in his Chicago speech, and McCain in his marvelous concession speech, rose to this historic occasion by celebrating the things that unite us irrespective of our political party, our race or our socio-economic background. My advice for you all is to understand that unity for our nation doesn't require uniformity or unanimity; it does require putting the good of our people ahead of what's good for mere political or personal advantage. The party of Lincoln, (i.e., the GOP), needs to rethink and revisit its historic roots as a party of emancipation, liberation, civil rights and equality of opportunity for all. On the other hand, the party of Franklin Roosevelt, John Kennedy and now Obama must put forth an agenda that understands that getting American growing again will require both Keynesian and classical incentive-oriented (supply-side) economic ideas. But there's time for political and economic advice in a later column (or two). Let me end with an equally great historical irony of this election. Next year, as Obama is sworn in as our 44th president, we will celebrate the 200th anniversary of Abraham Lincoln's birth. I'm serving, along with former Rep. Bill Gray of Pennsylvania, on the Abraham Lincoln Bicentennial Board to help raise funds for this historic occasion. President-elect Obama's honoring of Lincoln in many of his speeches reminds us of how vital it is to elevate these ideas and ideals to our nation's consciousness and inculcate his principles at a time of such great challenges and even greater opportunities. In fact, we kick off the Lincoln bicentennial celebration on Wednesday, Nov. 19, in Gettysburg, Pa. The great filmmaker Ken Burns will speak at the Soldier's National Cemetery on the 145th anniversary of Lincoln's Gettysburg Address. On Thursday, Nov. 20, at Gettysburg College, we will have the first of 10 town hall forums, titled \"Race, Freedom and Equality of Opportunity.\" I have the high honor of joining Rep. Jesse Jackson Jr., Professor Allen Guezlo and Norman Bristol-Colon on the panel, with Professor Charles Branham as the moderator. President-elect Obama talks of Abraham Lincoln's view of our nation as an \"unfinished work.\" Well, isn't that equally true of all of us? Therefore let all of us strive to help him be a successful president, so as to help make America an even greater nation. ---------- Jack Kemp, good men like you will be, and are missed. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090507, 
        "postID": 9, 
        "quote": "", 
        "reply": "Please read the letter below that Jack Kemp wrote his 17 grandchildren after the election of Barrack Obama. Two night, among the accolades that Brian Williams of NBC News heaped on Kemp was Williams' comment that no one in the GOP better reflected or promoted the values of Ronald Reagan than Jack Kemp. Then Williams mentioned this letter. Sadly, the loss of Kemp and his levelheaded approach along with the disappearance of reasonable folks like GOP Senator(s) Warren Rudman, Howard Baker and Jack Danforth and Jacob Javits has left us with the shrill of GOP entertainment: Rush Limbaugh, Sean Hanity and Glenn Beck. Perhaps going forward the measure of GOP success should be measured by TV and radio audience ratings and the advertising revenue attached to them rather than actually having to winning elections. In any case, Kemp's letter and recall a more civil time in U.S. politics. November 12, 2008 Dear Kemp grandchildren -- all 17 of you, spread out from the East Coast to the West Coast, and from Wheaton College in Illinois, to Wake Forest University in North Carolina: My first thought last week upon learning that a 47-year-old African-American Democrat had won the presidency was, \"Is this a great country or not?\" You may have expected your grandfather to be disappointed that his friend John McCain lost (and I was), but there's a difference between disappointment over a lost election and the historical perspective of a monumental event in the life of our nation. Let me explain. First of all, the election was free, fair and transformational, in terms of our democracy and given the history of race relations in our nation. What do I mean? Just think, a little over 40 years ago, blacks in America had trouble even voting in our country, much less thinking about running for the highest office in the land. A little over 40 years ago, in some parts of America, blacks couldn't eat, sleep or even get a drink of water using facilities available to everyone else in the public sphere. We are celebrating, this year, the 40th anniversary of our Fair Housing Laws, which helped put an end to the blatant racism and prejudice against blacks in rental housing and homeownership opportunities. As an old professional football quarterback, in my days there were no black coaches, no black quarterbacks, and certainly no blacks in the front offices of football and other professional sports. For the record, there were great black quarterbacks and coaches -- they just weren't given the opportunity to showcase their talent. And pro-football (and America) was the worse off for it. I remember quarterbacking the old San Diego Chargers and playing for the AFL championship in Houston. My father sat on the 50-yard line, while my co-captain's father, who happened to be black, had to sit in a small, roped-off section of the end zone. Today, we can't imagine the NFL without the amazing contributions of blacks at every level of this great enterprise. I could go on and on, but just imagine that in the face of all these indignities and deprivations, Dr. Martin Luther King could say 44 years ago, \"I have an abiding faith in America and an audacious faith in mankind.\" He described his vision for America, even as he and his people were being denied their God-given human rights guaranteed under our Constitution. You see, real leadership is not just seeing the realities of what we are temporarily faced with, but seeing the possibilities and potential that can be realized by lifting up peoples' vision of what they can be. When President-elect Obama quoted Abraham Lincoln on the night of his election, he was acknowledging the transcendent qualities of vision and leadership that are always present, but often overlooked and neglected by pettiness, partisanship and petulance. As president, I believe Barack Obama can help lift us out of a narrow view of America into the ultimate vision of an America where, if you're born to be a mezzo-soprano or a master carpenter, nothing stands in your way of realizing your God-given potential. Both Obama in his Chicago speech, and McCain in his marvelous concession speech, rose to this historic occasion by celebrating the things that unite us irrespective of our political party, our race or our socio-economic background. My advice for you all is to understand that unity for our nation doesn't require uniformity or unanimity; it does require putting the good of our people ahead of what's good for mere political or personal advantage. The party of Lincoln, (i.e., the GOP), needs to rethink and revisit its historic roots as a party of emancipation, liberation, civil rights and equality of opportunity for all. On the other hand, the party of Franklin Roosevelt, John Kennedy and now Obama must put forth an agenda that understands that getting American growing again will require both Keynesian and classical incentive-oriented (supply-side) economic ideas. But there's time for political and economic advice in a later column (or two). Let me end with an equally great historical irony of this election. Next year, as Obama is sworn in as our 44th president, we will celebrate the 200th anniversary of Abraham Lincoln's birth. I'm serving, along with former Rep. Bill Gray of Pennsylvania, on the Abraham Lincoln Bicentennial Board to help raise funds for this historic occasion. President-elect Obama's honoring of Lincoln in many of his speeches reminds us of how vital it is to elevate these ideas and ideals to our nation's consciousness and inculcate his principles at a time of such great challenges and even greater opportunities. In fact, we kick off the Lincoln bicentennial celebration on Wednesday, Nov. 19, in Gettysburg, Pa. The great filmmaker Ken Burns will speak at the Soldier's National Cemetery on the 145th anniversary of Lincoln's Gettysburg Address. On Thursday, Nov. 20, at Gettysburg College, we will have the first of 10 town hall forums, titled \"Race, Freedom and Equality of Opportunity.\" I have the high honor of joining Rep. Jesse Jackson Jr., Professor Allen Guezlo and Norman Bristol-Colon on the panel, with Professor Charles Branham as the moderator. President-elect Obama talks of Abraham Lincoln's view of our nation as an \"unfinished work.\" Well, isn't that equally true of all of us? Therefore let all of us strive to help him be a successful president, so as to help make America an even greater nation. ---------- Jack Kemp, good men like you will be, and are missed. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_5110073222001", 
        "time": "2009-05-07 11:37:00", 
        "title": "Jack Kemp, a True Conservative, Dies...", 
        "userID": "jack_flats"
    }
]