[
    {
        "content": "quote: A New York City police officer who had just gotten off duty was fatally shot late Thursday night in East Harlem by a fellow officer who mistook him for an armed criminal, Police Commissioner Raymond W. Kelly said. The slain officer, Omar J. Edwards, 25, who was assigned to patrol housing projects and was wearing plain clothes, was shot in the arm and chest after a team of three other plainclothes officers in a car saw him chasing a man on East 125th Street between First and Second Avenues with his gun drawn, Mr. Kelly said. Sources identified the officer who fired the shot as Andrew Dunton, a four-year veteran of the force from Long Island. Officer Dunton and the two other officers assigned to the anticrime unit in the 25th Precinct got out of their vehicle and confronted Officer Edwards. The department on Friday was investigating whether the officers had identified themselves or demanded that Officer Edwards drop his weapon before Officer Dunton opened fire. Mr. Kelly said two of six bullets fired from the officer’s 9-millimeter Glock struck Officer Edwards. Officer Edwards, a recently married father of two from Brooklyn, was taken to Harlem Hospital Center, where he was pronounced dead at 11:21 p.m. No one else was injured. \"While we don’t know all of the details of what happened tonight, this is a tragedy,” Mayor Bloomberg said during an early morning news conference at the hospital. “Rest assured we will find out exactly what happened here and see what we can learn from it so it can never happen again.” The shooting is likely to raise questions again about departmental procedures involving communications among plainclothes officers — particularly those in different units — as well as issues of race. Officer Edwards is black, and Officer Dunton is white. While a source in a position to know said that he had come across nothing so far that raised questions about the conduct of Officer Dunton or his fellow officers, the Rev. Al Sharpton said he was “concerned of a growing pattern of black officers being killed with the assumption that they are the criminals.” “This calls for federal investigation and intervention to sort out the facts and bring about a just resolve,” Mr. Sharpton said. “Can police investigate themselves fairly and impartially? It would seem very difficult at best and unlikely in fact.” Mayor Bloomberg said on his radio show on Friday that investigators were reviewing security tapes of the shooting, which he maintained was not deliberate, and interviewing witnesses. Investigators were also questioning the man Officer Edwards had been chasing. \"The only thing that can come out of this is to improve procedures so perhaps it doesn’t happen again,\" the mayor said. \"We all know policing is a dangerous job and accidents happen when people have guns in their hands, even legal guns in this case which they are authorized and trained to use.\" The department’s policy manual — the Patrol Guide — is specific in putting the responsibility on the off-duty officer in such situations. In one section, titled \"confrontation situations,\" it says that if an off-duty officer is trying to make a arrest and is confronted by an on-duty officer, that the off-duty officer must abandon the arrest effort and comply with the on-duty officer’s orders. \"In such encounters, the actions of the members in the first few seconds are of vital importance,\" the guide states. \"It must be absolutely clear in the minds of all members of the service that in any confrontation, the burden of proving identity rests on the confronted officer, whether on or off duty. The challenging officer, however, also has a responsibility to use sound tactics and judgment in approaching the situation.\" For member of the Police Department, the tragedy was compounded because Officer Edwards’s father-in-law is also a police officer stationed in the 67th Precinct in Brooklyn, officials said. Officer Edwards, who joined the force in July 2007, was working as part of an Impact Response Team, a roving team of officers that supplement the department’s prime crime-suppression program: Operation Impact. That program teams new officers with seasoned supervisors to flood areas where crime is surging. So in places where a city experiencing historic crime declines is still facing stubborn pockets of lawlessness, Officer Edwards was in the thick of that fight, officials said. +http://www.nytimes.com/2009/05/30/nyregion/30cop.html?hp \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090529, 
        "postID": 1, 
        "quote": "A New York City police officer who had just gotten off duty was fatally shot late Thursday night in East Harlem by a fellow officer who mistook him for an armed criminal, Police Commissioner Raymond W. Kelly said. The slain officer, Omar J. Edwards, 25, who was assigned to patrol housing projects and was wearing plain clothes, was shot in the arm and chest after a team of three other plainclothes officers in a car saw him chasing a man on East 125th Street between First and Second Avenues with his gun drawn, Mr. Kelly said. Sources identified the officer who fired the shot as Andrew Dunton, a four-year veteran of the force from Long Island. Officer Dunton and the two other officers assigned to the anticrime unit in the 25th Precinct got out of their vehicle and confronted Officer Edwards. The department on Friday was investigating whether the officers had identified themselves or demanded that Officer Edwards drop his weapon before Officer Dunton opened fire. Mr. Kelly said two of six bullets fired from the officer’s 9-millimeter Glock struck Officer Edwards. Officer Edwards, a recently married father of two from Brooklyn, was taken to Harlem Hospital Center, where he was pronounced dead at 11:21 p.m. No one else was injured. \"While we don’t know all of the details of what happened tonight, this is a tragedy,” Mayor Bloomberg said during an early morning news conference at the hospital. “Rest assured we will find out exactly what happened here and see what we can learn from it so it can never happen again.” The shooting is likely to raise questions again about departmental procedures involving communications among plainclothes officers — particularly those in different units — as well as issues of race. Officer Edwards is black, and Officer Dunton is white. While a source in a position to know said that he had come across nothing so far that raised questions about the conduct of Officer Dunton or his fellow officers, the Rev. Al Sharpton said he was “concerned of a growing pattern of black officers being killed with the assumption that they are the criminals.” “This calls for federal investigation and intervention to sort out the facts and bring about a just resolve,” Mr. Sharpton said. “Can police investigate themselves fairly and impartially? It would seem very difficult at best and unlikely in fact.” Mayor Bloomberg said on his radio show on Friday that investigators were reviewing security tapes of the shooting, which he maintained was not deliberate, and interviewing witnesses. Investigators were also questioning the man Officer Edwards had been chasing. \"The only thing that can come out of this is to improve procedures so perhaps it doesn’t happen again,\" the mayor said. \"We all know policing is a dangerous job and accidents happen when people have guns in their hands, even legal guns in this case which they are authorized and trained to use.\" The department’s policy manual — the Patrol Guide — is specific in putting the responsibility on the off-duty officer in such situations. In one section, titled \"confrontation situations,\" it says that if an off-duty officer is trying to make a arrest and is confronted by an on-duty officer, that the off-duty officer must abandon the arrest effort and comply with the on-duty officer’s orders. \"In such encounters, the actions of the members in the first few seconds are of vital importance,\" the guide states. \"It must be absolutely clear in the minds of all members of the service that in any confrontation, the burden of proving identity rests on the confronted officer, whether on or off duty. The challenging officer, however, also has a responsibility to use sound tactics and judgment in approaching the situation.\" For member of the Police Department, the tragedy was compounded because Officer Edwards’s father-in-law is also a police officer stationed in the 67th Precinct in Brooklyn, officials said. Officer Edwards, who joined the force in July 2007, was working as part of an Impact Response Team, a roving team of officers that supplement the department’s prime crime-suppression program: Operation Impact. That program teams new officers with seasoned supervisors to flood areas where crime is surging. So in places where a city experiencing historic crime declines is still facing stubborn pockets of lawlessness, Officer Edwards was in the thick of that fight, officials said.", 
        "reply": " +http://www.nytimes.com/2009/05/30/nyregion/30cop.html?hp \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_8380085422001", 
        "time": "2009-05-29 08:31:00", 
        "title": "Off-Duty Officer Is Fatally Shot by Police in Harlem", 
        "userID": "NSNN"
    }, 
    {
        "content": "Watch for AL Sharpton to insinuate his azz into this as the days go by.", 
        "intTime": 20090529, 
        "postID": 2, 
        "quote": "", 
        "reply": "Watch for AL Sharpton to insinuate his azz into this as the days go by.", 
        "threadID": "672198221_8380085422001", 
        "time": "2009-05-29 08:39:00", 
        "title": "Off-Duty Officer Is Fatally Shot by Police in Harlem", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "quote: Originally posted by LineDoggie: Watch for AL Sharpton to insinuate his azz into this as the days go by. Yep! RIP Officer Edwards.", 
        "intTime": 20090529, 
        "postID": 3, 
        "quote": "Originally posted by LineDoggie: Watch for AL Sharpton to insinuate his azz into this as the days go by.", 
        "reply": " Yep! RIP Officer Edwards.", 
        "threadID": "672198221_8380085422001", 
        "time": "2009-05-29 08:42:00", 
        "title": "Off-Duty Officer Is Fatally Shot by Police in Harlem", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "- Reminds me of season 3 (?) of the wire when Prez shoots the other cop. No matter how much the guy who shot his colleague was to blame, it still must have been awful to have pulled back his shirt and see the police t-shirt.... Terrible.", 
        "intTime": 20090530, 
        "postID": 4, 
        "quote": "", 
        "reply": "- Reminds me of season 3 (?) of the wire when Prez shoots the other cop. No matter how much the guy who shot his colleague was to blame, it still must have been awful to have pulled back his shirt and see the police t-shirt.... Terrible.", 
        "threadID": "672198221_8380085422001", 
        "time": "2009-05-30 00:43:00", 
        "title": "Off-Duty Officer Is Fatally Shot by Police in Harlem", 
        "userID": "ANZACbiscuit"
    }, 
    {
        "content": "This is a very sad terrible tragedy. And no doubt there will be people like Sharpton trying to make hay over it. And while no one should be \"blamed\" for one of these \"schit happens\" mistakes. The biggest mistake made was chasing one of these punch and run criminals with your gun drawn. He had already wrestled with this guy, and didn't need to run with a gun in his hand. Easy for me to say of course, but I've never met one of these pathetic crack heads who had anything resembling a weapon. If the guy had had a weapon, he would have sold it for dope. I'm not blaming the dead officer, but that WAS the main mistake he made. Dave", 
        "intTime": 20090530, 
        "postID": 5, 
        "quote": "", 
        "reply": "This is a very sad terrible tragedy. And no doubt there will be people like Sharpton trying to make hay over it. And while no one should be \"blamed\" for one of these \"schit happens\" mistakes. The biggest mistake made was chasing one of these punch and run criminals with your gun drawn. He had already wrestled with this guy, and didn't need to run with a gun in his hand. Easy for me to say of course, but I've never met one of these pathetic crack heads who had anything resembling a weapon. If the guy had had a weapon, he would have sold it for dope. I'm not blaming the dead officer, but that WAS the main mistake he made. Dave", 
        "threadID": "672198221_8380085422001", 
        "time": "2009-05-30 09:28:00", 
        "title": "Off-Duty Officer Is Fatally Shot by Police in Harlem", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: This is a very sad terrible tragedy. And no doubt there will be people like Sharpton trying to make hay over it. And while no one should be \"blamed\" for one of these \"schit happens\" mistakes. The biggest mistake made was chasing one of these punch and run criminals with your gun drawn. He had already wrestled with this guy, and didn't need to run with a gun in his hand. Easy for me to say of course, but I've never met one of these pathetic crack heads who had anything resembling a weapon. If the guy had had a weapon, he would have sold it for dope. I'm not blaming the dead officer, but that WAS the main mistake he made. Dave I don't think we know enough yet. They are still investigating it. Some things I need to know. 1. Did he identify himself as a police officer? 2. Did the Police just fire on him or did they identfy themselves? 3. As you pointed out, why was he running with his gun drawn, since there was no evidence the crack head had a weapon. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090530, 
        "postID": 6, 
        "quote": "Originally posted by Grachus: This is a very sad terrible tragedy. And no doubt there will be people like Sharpton trying to make hay over it. And while no one should be \"blamed\" for one of these \"schit happens\" mistakes. The biggest mistake made was chasing one of these punch and run criminals with your gun drawn. He had already wrestled with this guy, and didn't need to run with a gun in his hand. Easy for me to say of course, but I've never met one of these pathetic crack heads who had anything resembling a weapon. If the guy had had a weapon, he would have sold it for dope. I'm not blaming the dead officer, but that WAS the main mistake he made. Dave", 
        "reply": " I don't think we know enough yet. They are still investigating it. Some things I need to know. 1. Did he identify himself as a police officer? 2. Did the Police just fire on him or did they identfy themselves? 3. As you pointed out, why was he running with his gun drawn, since there was no evidence the crack head had a weapon. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_8380085422001", 
        "time": "2009-05-30 09:41:00", 
        "title": "Off-Duty Officer Is Fatally Shot by Police in Harlem", 
        "userID": "L0A1"
    }, 
    {
        "content": "1. Did he identify himself as a police officer? It doesn't seem so. 2. Did the Police just fire on him or did they identfy themselves? The pertetrator is a witness that claims the on duty unit did identify themselves. 3. As you pointed out, why was he running with his gun drawn, since there was no evidence the crack head had a weapon. Omar both ran with his gun drawn and turned when he was told to freeze. Santiago, who ran past the officers, said later that he heard Dunton yell, \"Police! Stop! Drop the gun!\" That's when Edwards, in front of the police car, turned toward the officers with his service weapon in hand, police said. Dunton fired six times from behind the passenger's door; Edwards was hit in the left arm, hip and back. He died at the Harlem Hospital Center about an hour after the shooting. Though the official cause of death was a gunshot to the chest, the bullet that caused the fatal injury entered the left side of Edward's back before hitting his heart and left lung, said medical examiner spokeswoman Ellen Borakove. It lodged in the front of his chest. Edwards did not fire his weapon, and Browne said that so far, no witnesses say he identified himself as an officer. The other two officers ran after Santiago and arrested him on charges of petit larceny and resisting arrest. He was briefly hospitalized Friday but was being held at the 25th Precinct, police said. He was apparently living at a shelter. Dunton, 30, has been an officer for four years. \"http://www.google.com/hostednews/ap/article/ALeqM5hukB39v7Mf3fg4YCE7bpzlgRNUKwD98G73T01\"", 
        "intTime": 20090530, 
        "postID": 7, 
        "quote": "", 
        "reply": "1. Did he identify himself as a police officer? It doesn't seem so. 2. Did the Police just fire on him or did they identfy themselves? The pertetrator is a witness that claims the on duty unit did identify themselves. 3. As you pointed out, why was he running with his gun drawn, since there was no evidence the crack head had a weapon. Omar both ran with his gun drawn and turned when he was told to freeze. Santiago, who ran past the officers, said later that he heard Dunton yell, \"Police! Stop! Drop the gun!\" That's when Edwards, in front of the police car, turned toward the officers with his service weapon in hand, police said. Dunton fired six times from behind the passenger's door; Edwards was hit in the left arm, hip and back. He died at the Harlem Hospital Center about an hour after the shooting. Though the official cause of death was a gunshot to the chest, the bullet that caused the fatal injury entered the left side of Edward's back before hitting his heart and left lung, said medical examiner spokeswoman Ellen Borakove. It lodged in the front of his chest. Edwards did not fire his weapon, and Browne said that so far, no witnesses say he identified himself as an officer. The other two officers ran after Santiago and arrested him on charges of petit larceny and resisting arrest. He was briefly hospitalized Friday but was being held at the 25th Precinct, police said. He was apparently living at a shelter. Dunton, 30, has been an officer for four years. \"http://www.google.com/hostednews/ap/article/ALeqM5hukB39v7Mf3fg4YCE7bpzlgRNUKwD98G73T01\"", 
        "threadID": "672198221_8380085422001", 
        "time": "2009-05-30 13:11:00", 
        "title": "Off-Duty Officer Is Fatally Shot by Police in Harlem", 
        "userID": "AngryPuppy"
    }, 
    {
        "content": "The days of stop or I'll fire on you would have saved his life, there would be no chasing the bad guy, the bad guy would have got a bullet in the back. When the Supreme Court changed that back in the 60's, it may have saved a lot of lives since then but it has cost a lot of lives also. I prefer the days previous to the ruling,,,stop or I'll shoot your azz. Tragic what happened here, a real shame and I blame no one except the bad guy for running, give him some extra prison time for creating a deadly situation.", 
        "intTime": 20090531, 
        "postID": 8, 
        "quote": "", 
        "reply": "The days of stop or I'll fire on you would have saved his life, there would be no chasing the bad guy, the bad guy would have got a bullet in the back. When the Supreme Court changed that back in the 60's, it may have saved a lot of lives since then but it has cost a lot of lives also. I prefer the days previous to the ruling,,,stop or I'll shoot your azz. Tragic what happened here, a real shame and I blame no one except the bad guy for running, give him some extra prison time for creating a deadly situation.", 
        "threadID": "672198221_8380085422001", 
        "time": "2009-05-31 12:16:00", 
        "title": "Off-Duty Officer Is Fatally Shot by Police in Harlem", 
        "userID": "BAGodbehere"
    }, 
    {
        "content": "quote: Originally posted by BAGodbehere: The days of stop or I'll fire on you would have saved his life, there would be no chasing the bad guy, the bad guy would have got a bullet in the back. When the Supreme Court changed that back in the 60's, it may have saved a lot of lives since then but it has cost a lot of lives also. I prefer the days previous to the ruling,,,stop or I'll shoot your azz. Tragic what happened here, a real shame and I blame no one except the bad guy for running, give him some extra prison time for creating a deadly situation. You can't take a life for as stupid a crime as poping a car window... My neighborhood is VERY safe for things like violent crime, but drug addicts routinly pop a window and grab whatever is visible. You can't just shoot someone for this... Dave", 
        "intTime": 20090531, 
        "postID": 9, 
        "quote": "Originally posted by BAGodbehere: The days of stop or I'll fire on you would have saved his life, there would be no chasing the bad guy, the bad guy would have got a bullet in the back. When the Supreme Court changed that back in the 60's, it may have saved a lot of lives since then but it has cost a lot of lives also. I prefer the days previous to the ruling,,,stop or I'll shoot your azz. Tragic what happened here, a real shame and I blame no one except the bad guy for running, give him some extra prison time for creating a deadly situation.", 
        "reply": " You can't take a life for as stupid a crime as poping a car window... My neighborhood is VERY safe for things like violent crime, but drug addicts routinly pop a window and grab whatever is visible. You can't just shoot someone for this... Dave", 
        "threadID": "672198221_8380085422001", 
        "time": "2009-05-31 16:08:00", 
        "title": "Off-Duty Officer Is Fatally Shot by Police in Harlem", 
        "userID": "Grachus"
    }, 
    {
        "content": "May God accept this brave Officer into his ever lasting love and may his family be comforted at this time of great tragedy... THANK YOU TO THIS FINE, BRAVE, OFFICER OF THE LAW... Yes, may the other Officers be comforted too, this is a horrible tragedy... It takes a high sense of morality and courage to put on the badge and swear the Oath to Protect and Serve and Heaven forbid, to be willing to lay down your life for those you have never even met... God Bless such fine men and women as these, who swear the oath... Most Respectfully, SUNLINER81", 
        "intTime": 20090531, 
        "postID": 10, 
        "quote": "", 
        "reply": "May God accept this brave Officer into his ever lasting love and may his family be comforted at this time of great tragedy... THANK YOU TO THIS FINE, BRAVE, OFFICER OF THE LAW... Yes, may the other Officers be comforted too, this is a horrible tragedy... It takes a high sense of morality and courage to put on the badge and swear the Oath to Protect and Serve and Heaven forbid, to be willing to lay down your life for those you have never even met... God Bless such fine men and women as these, who swear the oath... Most Respectfully, SUNLINER81", 
        "threadID": "672198221_8380085422001", 
        "time": "2009-05-31 18:59:00", 
        "title": "Off-Duty Officer Is Fatally Shot by Police in Harlem", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: You can't take a life for as stupid a crime as poping a car window... Okay,,,killing someone for that may be a liittlle over the top, I agree. They used to shoot felons though.", 
        "intTime": 20090531, 
        "postID": 11, 
        "quote": "You can't take a life for as stupid a crime as poping a car window...", 
        "reply": " Okay,,,killing someone for that may be a liittlle over the top, I agree. They used to shoot felons though.", 
        "threadID": "672198221_8380085422001", 
        "time": "2009-05-31 20:28:00", 
        "title": "Off-Duty Officer Is Fatally Shot by Police in Harlem", 
        "userID": "BAGodbehere"
    }
]