[
    {
        "content": "quote: Serbians will gather on Tuesday to lay wreaths in remembrance of people killed in Nato's bombing against Serbia 10 years ago. Nato ordered the 11-week bombing on March 24 1999 after Slobodan Milosevic, the then Serbian president, refused to sign an internationally brokered peace plan for Kosovo. Nato's forces sought to force Serbia out of the province of Kosovo, where Serbs were being accused of persecuting the Albanian majority. Boris Tadic, Serbia's president, in a speech on the eve of the anniversary before the UN Security Council in New York, described Nato's intervention as a \"tragic military campaign\". \"The lesson for Serbia is that it must not get into a situation in which its citizens are punished and killed ever again,\" he said. \"Some 2,500 civilians were killed, among them 89 children, while 12,500 were injured,\" said Tadic, whose governing Democratic Party opposes Kosovo's independence. Serbia estimates that the campaign cost $30bn from direct damage alone. At least 15,000 Nato-led peacekeepers remain in Kosovo, which 56 nations recognise after its ethnic Albanian-dominated parliament declared unilateral independence from Serbia in February 2008. Kosovo Albanians widely believe that the bombing of the forces helped them realise their independence. I still think Clinton & Co. should answer for their actions in former Yugoslavia. +http://english.aljazeera.net/news/europe/2009/03/200932463532546974.html +http://news.bbc.co.uk/2/hi/europe/7960116.stm \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090324, 
        "postID": 1, 
        "quote": "Serbians will gather on Tuesday to lay wreaths in remembrance of people killed in Nato's bombing against Serbia 10 years ago. Nato ordered the 11-week bombing on March 24 1999 after Slobodan Milosevic, the then Serbian president, refused to sign an internationally brokered peace plan for Kosovo. Nato's forces sought to force Serbia out of the province of Kosovo, where Serbs were being accused of persecuting the Albanian majority. Boris Tadic, Serbia's president, in a speech on the eve of the anniversary before the UN Security Council in New York, described Nato's intervention as a \"tragic military campaign\". \"The lesson for Serbia is that it must not get into a situation in which its citizens are punished and killed ever again,\" he said. \"Some 2,500 civilians were killed, among them 89 children, while 12,500 were injured,\" said Tadic, whose governing Democratic Party opposes Kosovo's independence. Serbia estimates that the campaign cost $30bn from direct damage alone. At least 15,000 Nato-led peacekeepers remain in Kosovo, which 56 nations recognise after its ethnic Albanian-dominated parliament declared unilateral independence from Serbia in February 2008. Kosovo Albanians widely believe that the bombing of the forces helped them realise their independence.", 
        "reply": " I still think Clinton & Co. should answer for their actions in former Yugoslavia. +http://english.aljazeera.net/news/europe/2009/03/200932463532546974.html +http://news.bbc.co.uk/2/hi/europe/7960116.stm \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_2300037812001", 
        "time": "2009-03-24 04:49:00", 
        "title": "Serbia marks Nato raid anniversary", 
        "userID": "NSNN"
    }, 
    {
        "content": "Unfortunately that’s never going to happen.....", 
        "intTime": 20090325, 
        "postID": 2, 
        "quote": "", 
        "reply": "Unfortunately that’s never going to happen.....", 
        "threadID": "672198221_2300037812001", 
        "time": "2009-03-25 06:33:00", 
        "title": "Serbia marks Nato raid anniversary", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by NSNN: [QUOTE] Serbians will gather on Tuesday to lay wreaths in remembrance of people killed in Nato's bombing against Serbia 10 years ago. Clinton should have been impeached over this matter - But both Liberals and Conservatives finally found something to agree on - and allowed the dismemberment of Yugoslavia to proceed. To most Americans Yugoslav history started with the takeover of Kossovo, and what happened before that simply doesn't exist. Meanwhile the only group that has been ethnically \"purged\" has been the Serbs. Dave", 
        "intTime": 20090326, 
        "postID": 3, 
        "quote": "Originally posted by NSNN: [QUOTE] Serbians will gather on Tuesday to lay wreaths in remembrance of people killed in Nato's bombing against Serbia 10 years ago.", 
        "reply": " Clinton should have been impeached over this matter - But both Liberals and Conservatives finally found something to agree on - and allowed the dismemberment of Yugoslavia to proceed. To most Americans Yugoslav history started with the takeover of Kossovo, and what happened before that simply doesn't exist. Meanwhile the only group that has been ethnically \"purged\" has been the Serbs. Dave", 
        "threadID": "672198221_2300037812001", 
        "time": "2009-03-26 15:02:00", 
        "title": "Serbia marks Nato raid anniversary", 
        "userID": "Grachus"
    }
]