[
    {
        "content": "\"http://www.politico.com/news/stories/0509/22568.html\" quote: Al Gore said Friday that fellow former Vice President Dick Cheney has jumped back into the political fray too soon into the new administration’s term. “I waited two years after I left office to make statements that were critical,” Gore said during an interview on CNN, pointing out that his critiques were focused on “policy\". Guess this is a case of another Democrat with selective memory. quote: Boston Globe, 4/14/2002: \"'They are wrong to vilify honorable men and women who oppose their right-wing domestic agenda and oppose a blatantly dishonest budget,' Gore said. 'They are wrong to imply that those who stand up to them are somehow unpatriotic.'\" (Headline -- \"Combative Gore Lashes Out At Administration Policies In Fla. Speech, He Hits Bush For 'Radical Agenda'\") [Note: So much for his assertion today that his early criticsm of the Bush Administration focused on policy.] USA Today, 4/15/2002: \"Gore's speech was the emotional peak of the convention. With practiced skill, humor and a passion some delegates said they did not see during the campaign, Gore denounced virtually every element of Bush's domestic policy.\" (Headline -- \"Gore's fiery speech raises questions of plans\") NY Times, 4/23/2002: \"Sounding very much like the candidate he was and may become again, Al Gore said today that the environment was a moral issue and the Bush administration was giving 'policy payoffs to polluters.' 'Our environment is under siege,' Mr. Gore , the former vice president, said in an Earth Day speech here to 400 students at Vanderbilt University. 'The Bush administration has chosen to serve the special interests instead of the public interests and subsidize the obsolete failed approaches of the past instead of the exciting new solutions of the future. Instead of ensuring that our water is clean to drink, they thought that maybe there wasn't enough arsenic in the drinking water.'\" LA Times, 6/30/2002: \"In a speech Saturday night to local Democrats, Gore attacked Bush's economic policies as \"a total catastrophe.\" He also noted that in the war on terrorism, the U.S. has yet to catch Al Qaeda leader Osama bin Laden, and he denounced the White House for \"trying to use the war for political purposes.'\" [I guess that's just more pure criticsm of policy ... .] \"http://www.weeklystandard.com/weblogs/TWSFP/2009/05/al_gore_hypocritically_attacks.asp\" Maybe he learned his note taking skills from Speaker Pelosi or maybe all of the CO2 we release into the atmosphere is rotting his brain.", 
        "intTime": 20090516, 
        "postID": 1, 
        "quote": "Al Gore said Friday that fellow former Vice President Dick Cheney has jumped back into the political fray too soon into the new administration’s term. “I waited two years after I left office to make statements that were critical,” Gore said during an interview on CNN, pointing out that his critiques were focused on “policy\".", 
        "reply": "\"http://www.politico.com/news/stories/0509/22568.html\"  Guess this is a case of another Democrat with selective memory. quote: Boston Globe, 4/14/2002: \"'They are wrong to vilify honorable men and women who oppose their right-wing domestic agenda and oppose a blatantly dishonest budget,' Gore said. 'They are wrong to imply that those who stand up to them are somehow unpatriotic.'\" (Headline -- \"Combative Gore Lashes Out At Administration Policies In Fla. Speech, He Hits Bush For 'Radical Agenda'\") [Note: So much for his assertion today that his early criticsm of the Bush Administration focused on policy.] USA Today, 4/15/2002: \"Gore's speech was the emotional peak of the convention. With practiced skill, humor and a passion some delegates said they did not see during the campaign, Gore denounced virtually every element of Bush's domestic policy.\" (Headline -- \"Gore's fiery speech raises questions of plans\") NY Times, 4/23/2002: \"Sounding very much like the candidate he was and may become again, Al Gore said today that the environment was a moral issue and the Bush administration was giving 'policy payoffs to polluters.' 'Our environment is under siege,' Mr. Gore , the former vice president, said in an Earth Day speech here to 400 students at Vanderbilt University. 'The Bush administration has chosen to serve the special interests instead of the public interests and subsidize the obsolete failed approaches of the past instead of the exciting new solutions of the future. Instead of ensuring that our water is clean to drink, they thought that maybe there wasn't enough arsenic in the drinking water.'\" LA Times, 6/30/2002: \"In a speech Saturday night to local Democrats, Gore attacked Bush's economic policies as \"a total catastrophe.\" He also noted that in the war on terrorism, the U.S. has yet to catch Al Qaeda leader Osama bin Laden, and he denounced the White House for \"trying to use the war for political purposes.'\" [I guess that's just more pure criticsm of policy ... .] \"http://www.weeklystandard.com/weblogs/TWSFP/2009/05/al_gore_hypocritically_attacks.asp\" Maybe he learned his note taking skills from Speaker Pelosi or maybe all of the CO2 we release into the atmosphere is rotting his brain.", 
        "threadID": "672198221_6210044322001", 
        "time": "2009-05-16 05:49:00", 
        "title": "Al Gore to Dick Cheney: 'I waited two years'", 
        "userID": "stec74"
    }, 
    {
        "content": "Well, he left office in January, 2001. Although it may not be two years, it was certainly far longer than Cheney waited to emerge from his undisclosed hole in the ground. If Limbaugh and Cheney are the faces of the GOP these days, then it's no wonder that the party is facing a serious decline.", 
        "intTime": 20090516, 
        "postID": 2, 
        "quote": "", 
        "reply": "Well, he left office in January, 2001. Although it may not be two years, it was certainly far longer than Cheney waited to emerge from his undisclosed hole in the ground. If Limbaugh and Cheney are the faces of the GOP these days, then it's no wonder that the party is facing a serious decline.", 
        "threadID": "672198221_6210044322001", 
        "time": "2009-05-16 06:11:00", 
        "title": "Al Gore to Dick Cheney: 'I waited two years'", 
        "userID": "Motive25"
    }, 
    {
        "content": "Cheney is certainly not setting any precedent... \"The World's Finest\"", 
        "intTime": 20090516, 
        "postID": 3, 
        "quote": "", 
        "reply": "Cheney is certainly not setting any precedent... \"The World's Finest\"", 
        "threadID": "672198221_6210044322001", 
        "time": "2009-05-16 06:26:00", 
        "title": "Al Gore to Dick Cheney: 'I waited two years'", 
        "userID": "Kegler300"
    }, 
    {
        "content": "stec74; And who said Cheney was ANYTHING like Gore??? Why does Gore assume he should be just like him???? How silly..", 
        "intTime": 20090516, 
        "postID": 4, 
        "quote": "", 
        "reply": "stec74; And who said Cheney was ANYTHING like Gore??? Why does Gore assume he should be just like him???? How silly..", 
        "threadID": "672198221_6210044322001", 
        "time": "2009-05-16 08:54:00", 
        "title": "Al Gore to Dick Cheney: 'I waited two years'", 
        "userID": "3678131"
    }, 
    {
        "content": "I don't recall the goon squads of McCain going into a State and demanding recounts time, time and again. Wanting ballots counted for himself, where the voter mark every candidate. Worse of all discounting the military oversea's because they overlook a stamp. Gore being the arse he is, didn't wait until Cheney was inaugerated to start his crying.", 
        "intTime": 20090516, 
        "postID": 5, 
        "quote": "", 
        "reply": "I don't recall the goon squads of McCain going into a State and demanding recounts time, time and again. Wanting ballots counted for himself, where the voter mark every candidate. Worse of all discounting the military oversea's because they overlook a stamp. Gore being the arse he is, didn't wait until Cheney was inaugerated to start his crying.", 
        "threadID": "672198221_6210044322001", 
        "time": "2009-05-16 13:42:00", 
        "title": "Al Gore to Dick Cheney: 'I waited two years'", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "Gore is a sore loser and still is today...He lost at \"Inventing the Internet\", He lost his bid to be President, and he is losing the \"Global Warming\" thing he has going on. And he just took a lie (very much like democrats) about waiting 2 yrs. Three strikes and your out of here..loser..", 
        "intTime": 20090516, 
        "postID": 6, 
        "quote": "", 
        "reply": "Gore is a sore loser and still is today...He lost at \"Inventing the Internet\", He lost his bid to be President, and he is losing the \"Global Warming\" thing he has going on. And he just took a lie (very much like democrats) about waiting 2 yrs. Three strikes and your out of here..loser..", 
        "threadID": "672198221_6210044322001", 
        "time": "2009-05-16 17:07:00", 
        "title": "Al Gore to Dick Cheney: 'I waited two years'", 
        "userID": "dman1948"
    }, 
    {
        "content": "quote: Originally posted by dman1948: Gore is a sore loser and still is today...He lost at \"Inventing the Internet\", He lost his bid to be President, and he is losing the \"Global Warming\" thing he has going on. And he just took a lie (very much like democrats) about waiting 2 yrs. Three strikes and your out of here..loser.. Clearly you haven't read the Constitution. It's in the 47 Amendment, and I quote: \"The Vice President after leaving office must keep his mouth shut about politics for the period of two years, or 50,000 miles (whichever comes first), or forfit his annual free tune up, and heart transplant.\" So you don't know what you're talking about. Dave", 
        "intTime": 20090516, 
        "postID": 7, 
        "quote": "Originally posted by dman1948: Gore is a sore loser and still is today...He lost at \"Inventing the Internet\", He lost his bid to be President, and he is losing the \"Global Warming\" thing he has going on. And he just took a lie (very much like democrats) about waiting 2 yrs. Three strikes and your out of here..loser..", 
        "reply": " Clearly you haven't read the Constitution. It's in the 47 Amendment, and I quote: \"The Vice President after leaving office must keep his mouth shut about politics for the period of two years, or 50,000 miles (whichever comes first), or forfit his annual free tune up, and heart transplant.\" So you don't know what you're talking about. Dave", 
        "threadID": "672198221_6210044322001", 
        "time": "2009-05-16 17:16:00", 
        "title": "Al Gore to Dick Cheney: 'I waited two years'", 
        "userID": "Grachus"
    }, 
    {
        "content": "Knowing how the love of the Constitution plays on the well being of ultra-rightous, try this on for size. Article II Section 1. The executive power shall be vested in a President of the United States of America. He shall hold his office during the term of four years, and, together with the Vice President, chosen for the same term, be elected, as follows: Didn't say eight years, says four. Both Cheney and Gore overstayed their welcome.", 
        "intTime": 20090516, 
        "postID": 8, 
        "quote": "", 
        "reply": "Knowing how the love of the Constitution plays on the well being of ultra-rightous, try this on for size. Article II Section 1. The executive power shall be vested in a President of the United States of America. He shall hold his office during the term of four years, and, together with the Vice President, chosen for the same term, be elected, as follows: Didn't say eight years, says four. Both Cheney and Gore overstayed their welcome.", 
        "threadID": "672198221_6210044322001", 
        "time": "2009-05-16 18:38:00", 
        "title": "Al Gore to Dick Cheney: 'I waited two years'", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: Originally posted by rayevinsonsr: Knowing how the love of the Constitution plays on the well being of ultra-rightous, try this on for size. Article II Section 1. The executive power shall be vested in a President of the United States of America. He shall hold his office during the term of four years, and, together with the Vice President, chosen for the same term, be elected, as follows: Didn't say eight years, says four. Both Cheney and Gore overstayed their welcome. Didn't say that a President is limited to four years. The pendant in me kicks in. As far as the orginal Constitution goes, you can be elected until you drop dead of old age. The change came in 1952 with the 22nd Amendment. And I personally have little use for term limits. But Ray, didn't you read the 47 Amendment? It shows that Gore was right... Dave", 
        "intTime": 20090516, 
        "postID": 9, 
        "quote": "Originally posted by rayevinsonsr: Knowing how the love of the Constitution plays on the well being of ultra-rightous, try this on for size. Article II Section 1. The executive power shall be vested in a President of the United States of America. He shall hold his office during the term of four years, and, together with the Vice President, chosen for the same term, be elected, as follows: Didn't say eight years, says four. Both Cheney and Gore overstayed their welcome.", 
        "reply": " Didn't say that a President is limited to four years. The pendant in me kicks in. As far as the orginal Constitution goes, you can be elected until you drop dead of old age. The change came in 1952 with the 22nd Amendment. And I personally have little use for term limits. But Ray, didn't you read the 47 Amendment? It shows that Gore was right... Dave", 
        "threadID": "672198221_6210044322001", 
        "time": "2009-05-16 18:46:00", 
        "title": "Al Gore to Dick Cheney: 'I waited two years'", 
        "userID": "Grachus"
    }, 
    {
        "content": "How so? They were voted in both times. quote: Originally posted by rayevinsonsr: Knowing how the love of the Constitution plays on the well being of ultra-rightous, try this on for size. Article II Section 1. The executive power shall be vested in a President of the United States of America. He shall hold his office during the term of four years, and, together with the Vice President, chosen for the same term, be elected, as follows: Didn't say eight years, says four. Both Cheney and Gore overstayed their welcome.", 
        "intTime": 20090516, 
        "postID": 10, 
        "quote": "Originally posted by rayevinsonsr: Knowing how the love of the Constitution plays on the well being of ultra-rightous, try this on for size. Article II Section 1. The executive power shall be vested in a President of the United States of America. He shall hold his office during the term of four years, and, together with the Vice President, chosen for the same term, be elected, as follows: Didn't say eight years, says four. Both Cheney and Gore overstayed their welcome.", 
        "reply": "How so? They were voted in both times. ", 
        "threadID": "672198221_6210044322001", 
        "time": "2009-05-16 19:47:00", 
        "title": "Al Gore to Dick Cheney: 'I waited two years'", 
        "userID": "fishnfanatic"
    }, 
    {
        "content": "quote: Originally posted by Motive25: Well, he left office in January, 2001. Although it may not be two years, it was certainly far longer than Cheney waited to emerge from his undisclosed hole in the ground. It was about a year. Probably took him that long to think of something to say... If Limbaugh and Cheney are the faces of the GOP these days, then it's no wonder that the party is facing a serious decline. In my opinion Mike Huckabee is the face and the base of the GOP.", 
        "intTime": 20090517, 
        "postID": 11, 
        "quote": "Originally posted by Motive25: Well, he left office in January, 2001. Although it may not be two years, it was certainly far longer than Cheney waited to emerge from his undisclosed hole in the ground. It was about a year. Probably took him that long to think of something to say... If Limbaugh and Cheney are the faces of the GOP these days, then it's no wonder that the party is facing a serious decline. In my opinion Mike Huckabee is the face and the base of the GOP.", 
        "reply": "", 
        "threadID": "672198221_6210044322001", 
        "time": "2009-05-17 11:45:00", 
        "title": "Al Gore to Dick Cheney: 'I waited two years'", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "Who cares what Gore says? Cheney is just making himself look worse if that's even possible and hurting the GOP.", 
        "intTime": 20090517, 
        "postID": 12, 
        "quote": "", 
        "reply": "Who cares what Gore says? Cheney is just making himself look worse if that's even possible and hurting the GOP.", 
        "threadID": "672198221_6210044322001", 
        "time": "2009-05-17 11:50:00", 
        "title": "Al Gore to Dick Cheney: 'I waited two years'", 
        "userID": "foxred03"
    }, 
    {
        "content": "Just playing with words Fish. The document says he shall serve one term, 4 years, until the 22nd Amendment limiting two terms. Thank FDR. Mr. Washington didn't care for the second term added to him but reluctant set a precedent until Roosevelt broke the unwritten rule. Yes Dave I read all 47 of your amendments. The 27 acknowledged by the Congress and States and the twenty only known to you. I agree, Gore was right on keeping quite, but needs work on torture and weather reports. (The Bill of Rights original was more than ten than were accepted. Some failed to see the reason for any)", 
        "intTime": 20090517, 
        "postID": 13, 
        "quote": "", 
        "reply": "Just playing with words Fish. The document says he shall serve one term, 4 years, until the 22nd Amendment limiting two terms. Thank FDR. Mr. Washington didn't care for the second term added to him but reluctant set a precedent until Roosevelt broke the unwritten rule. Yes Dave I read all 47 of your amendments. The 27 acknowledged by the Congress and States and the twenty only known to you. I agree, Gore was right on keeping quite, but needs work on torture and weather reports. (The Bill of Rights original was more than ten than were accepted. Some failed to see the reason for any)", 
        "threadID": "672198221_6210044322001", 
        "time": "2009-05-17 12:00:00", 
        "title": "Al Gore to Dick Cheney: 'I waited two years'", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: Originally posted by rayevinsonsr: Just playing with words Fish. The document says he shall serve one term, 4 years, until the 22nd Amendment limiting two terms. Thank FDR. Mr. Washington didn't care for the second term added to him but reluctant set a precedent until Roosevelt broke the unwritten rule. Yes Dave I read all 47 of your amendments. The 27 acknowledged by the Congress and States and the twenty only known to you. I agree, Gore was right on keeping quite, but needs work on torture and weather reports. (The Bill of Rights original was more than ten than were accepted. Some failed to see the reason for any) Grant and one other President wanted to run for a third term. As for the 47th Amendement, which I reported verbatim to you, you'll just have to take my word for it's validty. You just don't want to believe it because it backs up Mr. Gore... Dave", 
        "intTime": 20090517, 
        "postID": 14, 
        "quote": "Originally posted by rayevinsonsr: Just playing with words Fish. The document says he shall serve one term, 4 years, until the 22nd Amendment limiting two terms. Thank FDR. Mr. Washington didn't care for the second term added to him but reluctant set a precedent until Roosevelt broke the unwritten rule. Yes Dave I read all 47 of your amendments. The 27 acknowledged by the Congress and States and the twenty only known to you. I agree, Gore was right on keeping quite, but needs work on torture and weather reports. (The Bill of Rights original was more than ten than were accepted. Some failed to see the reason for any)", 
        "reply": " Grant and one other President wanted to run for a third term. As for the 47th Amendement, which I reported verbatim to you, you'll just have to take my word for it's validty. You just don't want to believe it because it backs up Mr. Gore... Dave", 
        "threadID": "672198221_6210044322001", 
        "time": "2009-05-17 12:56:00", 
        "title": "Al Gore to Dick Cheney: 'I waited two years'", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Grant and one other President wanted to run for a third term. Grant and Roosevelt and Roosevelt. Teddy as well, but in his case he hated the Republican ultra rich ruining his party. People talk about neo-cons. It was old and new at the turn of the turn of the 20th century. The GM motor cars, Goodyear tires, Standard oil were buying out the competition and the future of our country. The anti-trust of the 70's replaced by deregulation of the 106th Congress 1998, so the sympathy of the demise of big business today is strictly for the employee's.", 
        "intTime": 20090517, 
        "postID": 15, 
        "quote": "Grant and one other President wanted to run for a third term.", 
        "reply": " Grant and Roosevelt and Roosevelt. Teddy as well, but in his case he hated the Republican ultra rich ruining his party. People talk about neo-cons. It was old and new at the turn of the turn of the 20th century. The GM motor cars, Goodyear tires, Standard oil were buying out the competition and the future of our country. The anti-trust of the 70's replaced by deregulation of the 106th Congress 1998, so the sympathy of the demise of big business today is strictly for the employee's.", 
        "threadID": "672198221_6210044322001", 
        "time": "2009-05-17 17:54:00", 
        "title": "Al Gore to Dick Cheney: 'I waited two years'", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: Grant and one other President wanted to run for a third term. Grant was lucky to have served two terms. He may have been an honerable man but his cabinet was perhaps the most corrupt in the nations history. \"http://www.u-s-history.com/pages/h234.html\"", 
        "intTime": 20090517, 
        "postID": 16, 
        "quote": "Grant and one other President wanted to run for a third term.", 
        "reply": " Grant was lucky to have served two terms. He may have been an honerable man but his cabinet was perhaps the most corrupt in the nations history. \"http://www.u-s-history.com/pages/h234.html\"", 
        "threadID": "672198221_6210044322001", 
        "time": "2009-05-17 21:40:00", 
        "title": "Al Gore to Dick Cheney: 'I waited two years'", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "I don't think Cheney actually wants to be out speaking. I think it is more like poking a sleeping bear. When the Obama admi starting releasing selective photo's or info with regard to torture when the libs are calling for war crimes, I think it forced his hand to come out and make a case. If you think about it, he was never a big fan of talking to the press or explaining anything the Bush admin was doing. They certainly never defended anything they were doing which came back to bite them in the behind in the end.", 
        "intTime": 20090517, 
        "postID": 17, 
        "quote": "", 
        "reply": "I don't think Cheney actually wants to be out speaking. I think it is more like poking a sleeping bear. When the Obama admi starting releasing selective photo's or info with regard to torture when the libs are calling for war crimes, I think it forced his hand to come out and make a case. If you think about it, he was never a big fan of talking to the press or explaining anything the Bush admin was doing. They certainly never defended anything they were doing which came back to bite them in the behind in the end.", 
        "threadID": "672198221_6210044322001", 
        "time": "2009-05-17 23:31:00", 
        "title": "Al Gore to Dick Cheney: 'I waited two years'", 
        "userID": "usa_girl"
    }, 
    {
        "content": "quote: Originally posted by stec74: \"http://www.weeklystandard.com/weblogs/TWSFP/2009/05/al_gore_hypocritically_attacks.asp\" Maybe he learned his note taking skills from Speaker Pelosi or maybe all of the CO2 we release into the atmosphere is rotting his brain. Agree! Dam, I wish I'd kept my 'chad'!", 
        "intTime": 20090518, 
        "postID": 18, 
        "quote": "Originally posted by stec74: \"http://www.weeklystandard.com/weblogs/TWSFP/2009/05/al_gore_hypocritically_attacks.asp\" Maybe he learned his note taking skills from Speaker Pelosi or maybe all of the CO2 we release into the atmosphere is rotting his brain.", 
        "reply": " Agree! Dam, I wish I'd kept my 'chad'!", 
        "threadID": "672198221_6210044322001", 
        "time": "2009-05-18 03:17:00", 
        "title": "Al Gore to Dick Cheney: 'I waited two years'", 
        "userID": "busnrete8"
    }, 
    {
        "content": "quote: Originally posted by Motive25: Well, he left office in January, 2001. Although it may not be two years, it was certainly far longer than Cheney waited to emerge from his undisclosed hole in the ground. If Limbaugh and Cheney are the faces of the GOP these days, then it's no wonder that the party is facing a serious decline. I didn't see the Republicans calling for VP Gore's head on a plate like the liberal democratic wing is currently. I doubt anyone in his position wouldn't speak out in defense of themselves in the same situation.", 
        "intTime": 20090518, 
        "postID": 19, 
        "quote": "Originally posted by Motive25: Well, he left office in January, 2001. Although it may not be two years, it was certainly far longer than Cheney waited to emerge from his undisclosed hole in the ground. If Limbaugh and Cheney are the faces of the GOP these days, then it's no wonder that the party is facing a serious decline.", 
        "reply": " I didn't see the Republicans calling for VP Gore's head on a plate like the liberal democratic wing is currently. I doubt anyone in his position wouldn't speak out in defense of themselves in the same situation.", 
        "threadID": "672198221_6210044322001", 
        "time": "2009-05-18 05:23:00", 
        "title": "Al Gore to Dick Cheney: 'I waited two years'", 
        "userID": "NickBrand"
    }, 
    {
        "content": "Cheney sure seems justified to me fighting off the attacks from the new \"Klan\". Maybe something Bush coulda shoulda woulda picked up on in 2003.", 
        "intTime": 20090518, 
        "postID": 20, 
        "quote": "", 
        "reply": "Cheney sure seems justified to me fighting off the attacks from the new \"Klan\". Maybe something Bush coulda shoulda woulda picked up on in 2003.", 
        "threadID": "672198221_6210044322001", 
        "time": "2009-05-18 06:13:00", 
        "title": "Al Gore to Dick Cheney: 'I waited two years'", 
        "userID": "AngryPuppy"
    }, 
    {
        "content": "\"http://www.politico.com/news/stories/0509/22568.html\" quote: Al Gore said Friday that fellow former Vice President Dick Cheney has jumped back into the political fray too soon into the new administration’s term. “I waited two years after I left office to make statements that were critical,” Gore said during an interview on CNN, pointing out that his critiques were focused on “policy\". Guess this is a case of another Democrat with selective memory. quote: Boston Globe, 4/14/2002: \"'They are wrong to vilify honorable men and women who oppose their right-wing domestic agenda and oppose a blatantly dishonest budget,' Gore said. 'They are wrong to imply that those who stand up to them are somehow unpatriotic.'\" (Headline -- \"Combative Gore Lashes Out At Administration Policies In Fla. Speech, He Hits Bush For 'Radical Agenda'\") [Note: So much for his assertion today that his early criticsm of the Bush Administration focused on policy.] USA Today, 4/15/2002: \"Gore's speech was the emotional peak of the convention. With practiced skill, humor and a passion some delegates said they did not see during the campaign, Gore denounced virtually every element of Bush's domestic policy.\" (Headline -- \"Gore's fiery speech raises questions of plans\") NY Times, 4/23/2002: \"Sounding very much like the candidate he was and may become again, Al Gore said today that the environment was a moral issue and the Bush administration was giving 'policy payoffs to polluters.' 'Our environment is under siege,' Mr. Gore , the former vice president, said in an Earth Day speech here to 400 students at Vanderbilt University. 'The Bush administration has chosen to serve the special interests instead of the public interests and subsidize the obsolete failed approaches of the past instead of the exciting new solutions of the future. Instead of ensuring that our water is clean to drink, they thought that maybe there wasn't enough arsenic in the drinking water.'\" LA Times, 6/30/2002: \"In a speech Saturday night to local Democrats, Gore attacked Bush's economic policies as \"a total catastrophe.\" He also noted that in the war on terrorism, the U.S. has yet to catch Al Qaeda leader Osama bin Laden, and he denounced the White House for \"trying to use the war for political purposes.'\" [I guess that's just more pure criticsm of policy ... .] \"http://www.weeklystandard.com/weblogs/TWSFP/2009/05/al_gore_hypocritically_attacks.asp\" Maybe he learned his note taking skills from Speaker Pelosi or maybe all of the CO2 we release into the atmosphere is rotting his brain.", 
        "intTime": 20090516, 
        "postID": 21, 
        "quote": "Al Gore said Friday that fellow former Vice President Dick Cheney has jumped back into the political fray too soon into the new administration’s term. “I waited two years after I left office to make statements that were critical,” Gore said during an interview on CNN, pointing out that his critiques were focused on “policy\".", 
        "reply": "\"http://www.politico.com/news/stories/0509/22568.html\"  Guess this is a case of another Democrat with selective memory. quote: Boston Globe, 4/14/2002: \"'They are wrong to vilify honorable men and women who oppose their right-wing domestic agenda and oppose a blatantly dishonest budget,' Gore said. 'They are wrong to imply that those who stand up to them are somehow unpatriotic.'\" (Headline -- \"Combative Gore Lashes Out At Administration Policies In Fla. Speech, He Hits Bush For 'Radical Agenda'\") [Note: So much for his assertion today that his early criticsm of the Bush Administration focused on policy.] USA Today, 4/15/2002: \"Gore's speech was the emotional peak of the convention. With practiced skill, humor and a passion some delegates said they did not see during the campaign, Gore denounced virtually every element of Bush's domestic policy.\" (Headline -- \"Gore's fiery speech raises questions of plans\") NY Times, 4/23/2002: \"Sounding very much like the candidate he was and may become again, Al Gore said today that the environment was a moral issue and the Bush administration was giving 'policy payoffs to polluters.' 'Our environment is under siege,' Mr. Gore , the former vice president, said in an Earth Day speech here to 400 students at Vanderbilt University. 'The Bush administration has chosen to serve the special interests instead of the public interests and subsidize the obsolete failed approaches of the past instead of the exciting new solutions of the future. Instead of ensuring that our water is clean to drink, they thought that maybe there wasn't enough arsenic in the drinking water.'\" LA Times, 6/30/2002: \"In a speech Saturday night to local Democrats, Gore attacked Bush's economic policies as \"a total catastrophe.\" He also noted that in the war on terrorism, the U.S. has yet to catch Al Qaeda leader Osama bin Laden, and he denounced the White House for \"trying to use the war for political purposes.'\" [I guess that's just more pure criticsm of policy ... .] \"http://www.weeklystandard.com/weblogs/TWSFP/2009/05/al_gore_hypocritically_attacks.asp\" Maybe he learned his note taking skills from Speaker Pelosi or maybe all of the CO2 we release into the atmosphere is rotting his brain.", 
        "threadID": "672198221_6210044322001", 
        "time": "2009-05-16 05:49:00", 
        "title": "Al Gore to Dick Cheney: 'I waited two years'", 
        "userID": "stec74"
    }, 
    {
        "content": "Well, he left office in January, 2001. Although it may not be two years, it was certainly far longer than Cheney waited to emerge from his undisclosed hole in the ground. If Limbaugh and Cheney are the faces of the GOP these days, then it's no wonder that the party is facing a serious decline.", 
        "intTime": 20090516, 
        "postID": 22, 
        "quote": "", 
        "reply": "Well, he left office in January, 2001. Although it may not be two years, it was certainly far longer than Cheney waited to emerge from his undisclosed hole in the ground. If Limbaugh and Cheney are the faces of the GOP these days, then it's no wonder that the party is facing a serious decline.", 
        "threadID": "672198221_6210044322001", 
        "time": "2009-05-16 06:11:00", 
        "title": "Al Gore to Dick Cheney: 'I waited two years'", 
        "userID": "Motive25"
    }, 
    {
        "content": "Cheney is certainly not setting any precedent... \"The World's Finest\"", 
        "intTime": 20090516, 
        "postID": 23, 
        "quote": "", 
        "reply": "Cheney is certainly not setting any precedent... \"The World's Finest\"", 
        "threadID": "672198221_6210044322001", 
        "time": "2009-05-16 06:26:00", 
        "title": "Al Gore to Dick Cheney: 'I waited two years'", 
        "userID": "Kegler300"
    }, 
    {
        "content": "stec74; And who said Cheney was ANYTHING like Gore??? Why does Gore assume he should be just like him???? How silly..", 
        "intTime": 20090516, 
        "postID": 24, 
        "quote": "", 
        "reply": "stec74; And who said Cheney was ANYTHING like Gore??? Why does Gore assume he should be just like him???? How silly..", 
        "threadID": "672198221_6210044322001", 
        "time": "2009-05-16 08:54:00", 
        "title": "Al Gore to Dick Cheney: 'I waited two years'", 
        "userID": "3678131"
    }, 
    {
        "content": "I don't recall the goon squads of McCain going into a State and demanding recounts time, time and again. Wanting ballots counted for himself, where the voter mark every candidate. Worse of all discounting the military oversea's because they overlook a stamp. Gore being the arse he is, didn't wait until Cheney was inaugerated to start his crying.", 
        "intTime": 20090516, 
        "postID": 25, 
        "quote": "", 
        "reply": "I don't recall the goon squads of McCain going into a State and demanding recounts time, time and again. Wanting ballots counted for himself, where the voter mark every candidate. Worse of all discounting the military oversea's because they overlook a stamp. Gore being the arse he is, didn't wait until Cheney was inaugerated to start his crying.", 
        "threadID": "672198221_6210044322001", 
        "time": "2009-05-16 13:42:00", 
        "title": "Al Gore to Dick Cheney: 'I waited two years'", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "Gore is a sore loser and still is today...He lost at \"Inventing the Internet\", He lost his bid to be President, and he is losing the \"Global Warming\" thing he has going on. And he just took a lie (very much like democrats) about waiting 2 yrs. Three strikes and your out of here..loser..", 
        "intTime": 20090516, 
        "postID": 26, 
        "quote": "", 
        "reply": "Gore is a sore loser and still is today...He lost at \"Inventing the Internet\", He lost his bid to be President, and he is losing the \"Global Warming\" thing he has going on. And he just took a lie (very much like democrats) about waiting 2 yrs. Three strikes and your out of here..loser..", 
        "threadID": "672198221_6210044322001", 
        "time": "2009-05-16 17:07:00", 
        "title": "Al Gore to Dick Cheney: 'I waited two years'", 
        "userID": "dman1948"
    }, 
    {
        "content": "quote: Originally posted by dman1948: Gore is a sore loser and still is today...He lost at \"Inventing the Internet\", He lost his bid to be President, and he is losing the \"Global Warming\" thing he has going on. And he just took a lie (very much like democrats) about waiting 2 yrs. Three strikes and your out of here..loser.. Clearly you haven't read the Constitution. It's in the 47 Amendment, and I quote: \"The Vice President after leaving office must keep his mouth shut about politics for the period of two years, or 50,000 miles (whichever comes first), or forfit his annual free tune up, and heart transplant.\" So you don't know what you're talking about. Dave", 
        "intTime": 20090516, 
        "postID": 27, 
        "quote": "Originally posted by dman1948: Gore is a sore loser and still is today...He lost at \"Inventing the Internet\", He lost his bid to be President, and he is losing the \"Global Warming\" thing he has going on. And he just took a lie (very much like democrats) about waiting 2 yrs. Three strikes and your out of here..loser..", 
        "reply": " Clearly you haven't read the Constitution. It's in the 47 Amendment, and I quote: \"The Vice President after leaving office must keep his mouth shut about politics for the period of two years, or 50,000 miles (whichever comes first), or forfit his annual free tune up, and heart transplant.\" So you don't know what you're talking about. Dave", 
        "threadID": "672198221_6210044322001", 
        "time": "2009-05-16 17:16:00", 
        "title": "Al Gore to Dick Cheney: 'I waited two years'", 
        "userID": "Grachus"
    }, 
    {
        "content": "Knowing how the love of the Constitution plays on the well being of ultra-rightous, try this on for size. Article II Section 1. The executive power shall be vested in a President of the United States of America. He shall hold his office during the term of four years, and, together with the Vice President, chosen for the same term, be elected, as follows: Didn't say eight years, says four. Both Cheney and Gore overstayed their welcome.", 
        "intTime": 20090516, 
        "postID": 28, 
        "quote": "", 
        "reply": "Knowing how the love of the Constitution plays on the well being of ultra-rightous, try this on for size. Article II Section 1. The executive power shall be vested in a President of the United States of America. He shall hold his office during the term of four years, and, together with the Vice President, chosen for the same term, be elected, as follows: Didn't say eight years, says four. Both Cheney and Gore overstayed their welcome.", 
        "threadID": "672198221_6210044322001", 
        "time": "2009-05-16 18:38:00", 
        "title": "Al Gore to Dick Cheney: 'I waited two years'", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: Originally posted by rayevinsonsr: Knowing how the love of the Constitution plays on the well being of ultra-rightous, try this on for size. Article II Section 1. The executive power shall be vested in a President of the United States of America. He shall hold his office during the term of four years, and, together with the Vice President, chosen for the same term, be elected, as follows: Didn't say eight years, says four. Both Cheney and Gore overstayed their welcome. Didn't say that a President is limited to four years. The pendant in me kicks in. As far as the orginal Constitution goes, you can be elected until you drop dead of old age. The change came in 1952 with the 22nd Amendment. And I personally have little use for term limits. But Ray, didn't you read the 47 Amendment? It shows that Gore was right... Dave", 
        "intTime": 20090516, 
        "postID": 29, 
        "quote": "Originally posted by rayevinsonsr: Knowing how the love of the Constitution plays on the well being of ultra-rightous, try this on for size. Article II Section 1. The executive power shall be vested in a President of the United States of America. He shall hold his office during the term of four years, and, together with the Vice President, chosen for the same term, be elected, as follows: Didn't say eight years, says four. Both Cheney and Gore overstayed their welcome.", 
        "reply": " Didn't say that a President is limited to four years. The pendant in me kicks in. As far as the orginal Constitution goes, you can be elected until you drop dead of old age. The change came in 1952 with the 22nd Amendment. And I personally have little use for term limits. But Ray, didn't you read the 47 Amendment? It shows that Gore was right... Dave", 
        "threadID": "672198221_6210044322001", 
        "time": "2009-05-16 18:46:00", 
        "title": "Al Gore to Dick Cheney: 'I waited two years'", 
        "userID": "Grachus"
    }, 
    {
        "content": "How so? They were voted in both times. quote: Originally posted by rayevinsonsr: Knowing how the love of the Constitution plays on the well being of ultra-rightous, try this on for size. Article II Section 1. The executive power shall be vested in a President of the United States of America. He shall hold his office during the term of four years, and, together with the Vice President, chosen for the same term, be elected, as follows: Didn't say eight years, says four. Both Cheney and Gore overstayed their welcome.", 
        "intTime": 20090516, 
        "postID": 30, 
        "quote": "Originally posted by rayevinsonsr: Knowing how the love of the Constitution plays on the well being of ultra-rightous, try this on for size. Article II Section 1. The executive power shall be vested in a President of the United States of America. He shall hold his office during the term of four years, and, together with the Vice President, chosen for the same term, be elected, as follows: Didn't say eight years, says four. Both Cheney and Gore overstayed their welcome.", 
        "reply": "How so? They were voted in both times. ", 
        "threadID": "672198221_6210044322001", 
        "time": "2009-05-16 19:47:00", 
        "title": "Al Gore to Dick Cheney: 'I waited two years'", 
        "userID": "fishnfanatic"
    }, 
    {
        "content": "quote: Originally posted by Motive25: Well, he left office in January, 2001. Although it may not be two years, it was certainly far longer than Cheney waited to emerge from his undisclosed hole in the ground. It was about a year. Probably took him that long to think of something to say... If Limbaugh and Cheney are the faces of the GOP these days, then it's no wonder that the party is facing a serious decline. In my opinion Mike Huckabee is the face and the base of the GOP.", 
        "intTime": 20090517, 
        "postID": 31, 
        "quote": "Originally posted by Motive25: Well, he left office in January, 2001. Although it may not be two years, it was certainly far longer than Cheney waited to emerge from his undisclosed hole in the ground. It was about a year. Probably took him that long to think of something to say... If Limbaugh and Cheney are the faces of the GOP these days, then it's no wonder that the party is facing a serious decline. In my opinion Mike Huckabee is the face and the base of the GOP.", 
        "reply": "", 
        "threadID": "672198221_6210044322001", 
        "time": "2009-05-17 11:45:00", 
        "title": "Al Gore to Dick Cheney: 'I waited two years'", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "Who cares what Gore says? Cheney is just making himself look worse if that's even possible and hurting the GOP.", 
        "intTime": 20090517, 
        "postID": 32, 
        "quote": "", 
        "reply": "Who cares what Gore says? Cheney is just making himself look worse if that's even possible and hurting the GOP.", 
        "threadID": "672198221_6210044322001", 
        "time": "2009-05-17 11:50:00", 
        "title": "Al Gore to Dick Cheney: 'I waited two years'", 
        "userID": "foxred03"
    }, 
    {
        "content": "Just playing with words Fish. The document says he shall serve one term, 4 years, until the 22nd Amendment limiting two terms. Thank FDR. Mr. Washington didn't care for the second term added to him but reluctant set a precedent until Roosevelt broke the unwritten rule. Yes Dave I read all 47 of your amendments. The 27 acknowledged by the Congress and States and the twenty only known to you. I agree, Gore was right on keeping quite, but needs work on torture and weather reports. (The Bill of Rights original was more than ten than were accepted. Some failed to see the reason for any)", 
        "intTime": 20090517, 
        "postID": 33, 
        "quote": "", 
        "reply": "Just playing with words Fish. The document says he shall serve one term, 4 years, until the 22nd Amendment limiting two terms. Thank FDR. Mr. Washington didn't care for the second term added to him but reluctant set a precedent until Roosevelt broke the unwritten rule. Yes Dave I read all 47 of your amendments. The 27 acknowledged by the Congress and States and the twenty only known to you. I agree, Gore was right on keeping quite, but needs work on torture and weather reports. (The Bill of Rights original was more than ten than were accepted. Some failed to see the reason for any)", 
        "threadID": "672198221_6210044322001", 
        "time": "2009-05-17 12:00:00", 
        "title": "Al Gore to Dick Cheney: 'I waited two years'", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: Originally posted by rayevinsonsr: Just playing with words Fish. The document says he shall serve one term, 4 years, until the 22nd Amendment limiting two terms. Thank FDR. Mr. Washington didn't care for the second term added to him but reluctant set a precedent until Roosevelt broke the unwritten rule. Yes Dave I read all 47 of your amendments. The 27 acknowledged by the Congress and States and the twenty only known to you. I agree, Gore was right on keeping quite, but needs work on torture and weather reports. (The Bill of Rights original was more than ten than were accepted. Some failed to see the reason for any) Grant and one other President wanted to run for a third term. As for the 47th Amendement, which I reported verbatim to you, you'll just have to take my word for it's validty. You just don't want to believe it because it backs up Mr. Gore... Dave", 
        "intTime": 20090517, 
        "postID": 34, 
        "quote": "Originally posted by rayevinsonsr: Just playing with words Fish. The document says he shall serve one term, 4 years, until the 22nd Amendment limiting two terms. Thank FDR. Mr. Washington didn't care for the second term added to him but reluctant set a precedent until Roosevelt broke the unwritten rule. Yes Dave I read all 47 of your amendments. The 27 acknowledged by the Congress and States and the twenty only known to you. I agree, Gore was right on keeping quite, but needs work on torture and weather reports. (The Bill of Rights original was more than ten than were accepted. Some failed to see the reason for any)", 
        "reply": " Grant and one other President wanted to run for a third term. As for the 47th Amendement, which I reported verbatim to you, you'll just have to take my word for it's validty. You just don't want to believe it because it backs up Mr. Gore... Dave", 
        "threadID": "672198221_6210044322001", 
        "time": "2009-05-17 12:56:00", 
        "title": "Al Gore to Dick Cheney: 'I waited two years'", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Grant and one other President wanted to run for a third term. Grant and Roosevelt and Roosevelt. Teddy as well, but in his case he hated the Republican ultra rich ruining his party. People talk about neo-cons. It was old and new at the turn of the turn of the 20th century. The GM motor cars, Goodyear tires, Standard oil were buying out the competition and the future of our country. The anti-trust of the 70's replaced by deregulation of the 106th Congress 1998, so the sympathy of the demise of big business today is strictly for the employee's.", 
        "intTime": 20090517, 
        "postID": 35, 
        "quote": "Grant and one other President wanted to run for a third term.", 
        "reply": " Grant and Roosevelt and Roosevelt. Teddy as well, but in his case he hated the Republican ultra rich ruining his party. People talk about neo-cons. It was old and new at the turn of the turn of the 20th century. The GM motor cars, Goodyear tires, Standard oil were buying out the competition and the future of our country. The anti-trust of the 70's replaced by deregulation of the 106th Congress 1998, so the sympathy of the demise of big business today is strictly for the employee's.", 
        "threadID": "672198221_6210044322001", 
        "time": "2009-05-17 17:54:00", 
        "title": "Al Gore to Dick Cheney: 'I waited two years'", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: Grant and one other President wanted to run for a third term. Grant was lucky to have served two terms. He may have been an honerable man but his cabinet was perhaps the most corrupt in the nations history. \"http://www.u-s-history.com/pages/h234.html\"", 
        "intTime": 20090517, 
        "postID": 36, 
        "quote": "Grant and one other President wanted to run for a third term.", 
        "reply": " Grant was lucky to have served two terms. He may have been an honerable man but his cabinet was perhaps the most corrupt in the nations history. \"http://www.u-s-history.com/pages/h234.html\"", 
        "threadID": "672198221_6210044322001", 
        "time": "2009-05-17 21:40:00", 
        "title": "Al Gore to Dick Cheney: 'I waited two years'", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "I don't think Cheney actually wants to be out speaking. I think it is more like poking a sleeping bear. When the Obama admi starting releasing selective photo's or info with regard to torture when the libs are calling for war crimes, I think it forced his hand to come out and make a case. If you think about it, he was never a big fan of talking to the press or explaining anything the Bush admin was doing. They certainly never defended anything they were doing which came back to bite them in the behind in the end.", 
        "intTime": 20090517, 
        "postID": 37, 
        "quote": "", 
        "reply": "I don't think Cheney actually wants to be out speaking. I think it is more like poking a sleeping bear. When the Obama admi starting releasing selective photo's or info with regard to torture when the libs are calling for war crimes, I think it forced his hand to come out and make a case. If you think about it, he was never a big fan of talking to the press or explaining anything the Bush admin was doing. They certainly never defended anything they were doing which came back to bite them in the behind in the end.", 
        "threadID": "672198221_6210044322001", 
        "time": "2009-05-17 23:31:00", 
        "title": "Al Gore to Dick Cheney: 'I waited two years'", 
        "userID": "usa_girl"
    }, 
    {
        "content": "quote: Originally posted by stec74: \"http://www.weeklystandard.com/weblogs/TWSFP/2009/05/al_gore_hypocritically_attacks.asp\" Maybe he learned his note taking skills from Speaker Pelosi or maybe all of the CO2 we release into the atmosphere is rotting his brain. Agree! Dam, I wish I'd kept my 'chad'!", 
        "intTime": 20090518, 
        "postID": 38, 
        "quote": "Originally posted by stec74: \"http://www.weeklystandard.com/weblogs/TWSFP/2009/05/al_gore_hypocritically_attacks.asp\" Maybe he learned his note taking skills from Speaker Pelosi or maybe all of the CO2 we release into the atmosphere is rotting his brain.", 
        "reply": " Agree! Dam, I wish I'd kept my 'chad'!", 
        "threadID": "672198221_6210044322001", 
        "time": "2009-05-18 03:17:00", 
        "title": "Al Gore to Dick Cheney: 'I waited two years'", 
        "userID": "busnrete8"
    }, 
    {
        "content": "quote: Originally posted by Motive25: Well, he left office in January, 2001. Although it may not be two years, it was certainly far longer than Cheney waited to emerge from his undisclosed hole in the ground. If Limbaugh and Cheney are the faces of the GOP these days, then it's no wonder that the party is facing a serious decline. I didn't see the Republicans calling for VP Gore's head on a plate like the liberal democratic wing is currently. I doubt anyone in his position wouldn't speak out in defense of themselves in the same situation.", 
        "intTime": 20090518, 
        "postID": 39, 
        "quote": "Originally posted by Motive25: Well, he left office in January, 2001. Although it may not be two years, it was certainly far longer than Cheney waited to emerge from his undisclosed hole in the ground. If Limbaugh and Cheney are the faces of the GOP these days, then it's no wonder that the party is facing a serious decline.", 
        "reply": " I didn't see the Republicans calling for VP Gore's head on a plate like the liberal democratic wing is currently. I doubt anyone in his position wouldn't speak out in defense of themselves in the same situation.", 
        "threadID": "672198221_6210044322001", 
        "time": "2009-05-18 05:23:00", 
        "title": "Al Gore to Dick Cheney: 'I waited two years'", 
        "userID": "NickBrand"
    }, 
    {
        "content": "Cheney sure seems justified to me fighting off the attacks from the new \"Klan\". Maybe something Bush coulda shoulda woulda picked up on in 2003.", 
        "intTime": 20090518, 
        "postID": 40, 
        "quote": "", 
        "reply": "Cheney sure seems justified to me fighting off the attacks from the new \"Klan\". Maybe something Bush coulda shoulda woulda picked up on in 2003.", 
        "threadID": "672198221_6210044322001", 
        "time": "2009-05-18 06:13:00", 
        "title": "Al Gore to Dick Cheney: 'I waited two years'", 
        "userID": "AngryPuppy"
    }
]