[
    {
        "content": "quote: French President Nicolas Sarkozy has pledged to help Mexico in its battle against organised crime during an official visit to the country Mr Sarkozy offered his Mexican counterpart Felipe Calderon help with police training and technology for gathering intelligence. The two leaders also unveiled plans to build a $550m (£397m) Franco-European helicopter factory in Mexico. (...) +http://news.bbc.co.uk/2/hi/americas/7934889.stm", 
        "intTime": 20090310, 
        "postID": 1, 
        "quote": "French President Nicolas Sarkozy has pledged to help Mexico in its battle against organised crime during an official visit to the country Mr Sarkozy offered his Mexican counterpart Felipe Calderon help with police training and technology for gathering intelligence. The two leaders also unveiled plans to build a $550m (£397m) Franco-European helicopter factory in Mexico. (...)", 
        "reply": " +http://news.bbc.co.uk/2/hi/americas/7934889.stm", 
        "threadID": "672198221_4690024712001", 
        "time": "2009-03-10 06:41:00", 
        "title": "France offers Mexico police aid", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by Knele: quote: French President Nicolas Sarkozy has pledged to help Mexico in its battle against organised crime during an official visit to the country Mr Sarkozy offered his Mexican counterpart Felipe Calderon help with police training and technology for gathering intelligence. The two leaders also unveiled plans to build a $550m (£397m) Franco-European helicopter factory in Mexico. (...) +http://news.bbc.co.uk/2/hi/americas/7934889.stm I didn't know France was still in the political field. I thought they gave up a long time ago. Maybe they are just trying to save face with the rest of the world by saying \"OH, OH, look what I did\" \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090310, 
        "postID": 2, 
        "quote": "Originally posted by Knele: quote: French President Nicolas Sarkozy has pledged to help Mexico in its battle against organised crime during an official visit to the country Mr Sarkozy offered his Mexican counterpart Felipe Calderon help with police training and technology for gathering intelligence. The two leaders also unveiled plans to build a $550m (£397m) Franco-European helicopter factory in Mexico. (...) +http://news.bbc.co.uk/2/hi/americas/7934889.stm", 
        "reply": " I didn't know France was still in the political field. I thought they gave up a long time ago. Maybe they are just trying to save face with the rest of the world by saying \"OH, OH, look what I did\" \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_4690024712001", 
        "time": "2009-03-10 10:31:00", 
        "title": "France offers Mexico police aid", 
        "userID": "Anbar7"
    }, 
    {
        "content": "The last time frenchy visited Mexico Benito Juarez provided a warm reception. I can guess what the narco-gangs will have planned today.", 
        "intTime": 20090310, 
        "postID": 3, 
        "quote": "", 
        "reply": "The last time frenchy visited Mexico Benito Juarez provided a warm reception. I can guess what the narco-gangs will have planned today.", 
        "threadID": "672198221_4690024712001", 
        "time": "2009-03-10 11:07:00", 
        "title": "France offers Mexico police aid", 
        "userID": "Sand_Flea"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by Knele: quote: French President Nicolas Sarkozy has pledged to help Mexico in its battle against organised crime during an official visit to the country Mr Sarkozy offered his Mexican counterpart Felipe Calderon help with police training and technology for gathering intelligence. The two leaders also unveiled plans to build a $550m (£397m) Franco-European helicopter factory in Mexico. (...) +http://news.bbc.co.uk/2/hi/americas/7934889.stm I didn't know France was still in the political field. I thought they gave up a long time ago. Maybe they are just trying to save face with the rest of the world by saying \"OH, OH, look what I did\" I am not aware of any recent events France should be ashamed of?", 
        "intTime": 20090310, 
        "postID": 4, 
        "quote": "Originally posted by Anbar7: quote: Originally posted by Knele: quote: French President Nicolas Sarkozy has pledged to help Mexico in its battle against organised crime during an official visit to the country Mr Sarkozy offered his Mexican counterpart Felipe Calderon help with police training and technology for gathering intelligence. The two leaders also unveiled plans to build a $550m (£397m) Franco-European helicopter factory in Mexico. (...) +http://news.bbc.co.uk/2/hi/americas/7934889.stm I didn't know France was still in the political field. I thought they gave up a long time ago. Maybe they are just trying to save face with the rest of the world by saying \"OH, OH, look what I did\"", 
        "reply": " I am not aware of any recent events France should be ashamed of?", 
        "threadID": "672198221_4690024712001", 
        "time": "2009-03-10 11:34:00", 
        "title": "France offers Mexico police aid", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by Knele: quote: Originally posted by Anbar7: quote: Originally posted by Knele: quote: French President Nicolas Sarkozy has pledged to help Mexico in its battle against organised crime during an official visit to the country Mr Sarkozy offered his Mexican counterpart Felipe Calderon help with police training and technology for gathering intelligence. The two leaders also unveiled plans to build a $550m (£397m) Franco-European helicopter factory in Mexico. (...) +http://news.bbc.co.uk/2/hi/americas/7934889.stm I didn't know France was still in the political field. I thought they gave up a long time ago. Maybe they are just trying to save face with the rest of the world by saying \"OH, OH, look what I did\" I am not aware of any recent events France should be ashamed of? they haven't done much for the war. They have a few troops there, but not as many as they could. It is disappointing. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090310, 
        "postID": 5, 
        "quote": "Originally posted by Knele: quote: Originally posted by Anbar7: quote: Originally posted by Knele: quote: French President Nicolas Sarkozy has pledged to help Mexico in its battle against organised crime during an official visit to the country Mr Sarkozy offered his Mexican counterpart Felipe Calderon help with police training and technology for gathering intelligence. The two leaders also unveiled plans to build a $550m (£397m) Franco-European helicopter factory in Mexico. (...) +http://news.bbc.co.uk/2/hi/americas/7934889.stm I didn't know France was still in the political field. I thought they gave up a long time ago. Maybe they are just trying to save face with the rest of the world by saying \"OH, OH, look what I did\" I am not aware of any recent events France should be ashamed of?", 
        "reply": " they haven't done much for the war. They have a few troops there, but not as many as they could. It is disappointing. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_4690024712001", 
        "time": "2009-03-10 11:37:00", 
        "title": "France offers Mexico police aid", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: they haven't done much for the war. They have a few troops there, but not as many as they could. It is disappointing. Who is France at war with?", 
        "intTime": 20090310, 
        "postID": 6, 
        "quote": "Originally posted by Anbar7: they haven't done much for the war. They have a few troops there, but not as many as they could. It is disappointing.", 
        "reply": " Who is France at war with?", 
        "threadID": "672198221_4690024712001", 
        "time": "2009-03-10 11:40:00", 
        "title": "France offers Mexico police aid", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by Knele: quote: Originally posted by Anbar7: they haven't done much for the war. They have a few troops there, but not as many as they could. It is disappointing. Who is France at war with? I hope your not being serious. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090310, 
        "postID": 7, 
        "quote": "Originally posted by Knele: quote: Originally posted by Anbar7: they haven't done much for the war. They have a few troops there, but not as many as they could. It is disappointing. Who is France at war with?", 
        "reply": " I hope your not being serious. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_4690024712001", 
        "time": "2009-03-10 11:42:00", 
        "title": "France offers Mexico police aid", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by Knele: quote: Originally posted by Anbar7: they haven't done much for the war. They have a few troops there, but not as many as they could. It is disappointing. Who is France at war with? I hope your not being serious. I am! France is not required or obligated to help us out in either (especially) Iraq or Afghanistan....but however minuscule, they are!", 
        "intTime": 20090310, 
        "postID": 8, 
        "quote": "Originally posted by Anbar7: quote: Originally posted by Knele: quote: Originally posted by Anbar7: they haven't done much for the war. They have a few troops there, but not as many as they could. It is disappointing. Who is France at war with? I hope your not being serious.", 
        "reply": " I am! France is not required or obligated to help us out in either (especially) Iraq or Afghanistan....but however minuscule, they are!", 
        "threadID": "672198221_4690024712001", 
        "time": "2009-03-10 11:46:00", 
        "title": "France offers Mexico police aid", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by Knele: quote: Originally posted by Anbar7: quote: Originally posted by Knele: quote: Originally posted by Anbar7: they haven't done much for the war. They have a few troops there, but not as many as they could. It is disappointing. Who is France at war with? I hope your not being serious. I am! France is not required or obligated to help us out in either Iraq or Afghanistan....but however minuscule, they are! Your right they are not required, but other countries are doing more than they are. It is disappointing, but France has never been one for war anyways. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090310, 
        "postID": 9, 
        "quote": "Originally posted by Knele: quote: Originally posted by Anbar7: quote: Originally posted by Knele: quote: Originally posted by Anbar7: they haven't done much for the war. They have a few troops there, but not as many as they could. It is disappointing. Who is France at war with? I hope your not being serious. I am! France is not required or obligated to help us out in either Iraq or Afghanistan....but however minuscule, they are!", 
        "reply": " Your right they are not required, but other countries are doing more than they are. It is disappointing, but France has never been one for war anyways. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_4690024712001", 
        "time": "2009-03-10 11:48:00", 
        "title": "France offers Mexico police aid", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Sand_Flea: The last time frenchy visited Mexico Benito Juarez provided a warm reception. I can guess what the narco-gangs will have planned today. A new Cinco de Mayo?... LOL Respectfully, SUNLINER81", 
        "intTime": 20090310, 
        "postID": 10, 
        "quote": "Originally posted by Sand_Flea: The last time frenchy visited Mexico Benito Juarez provided a warm reception. I can guess what the narco-gangs will have planned today.", 
        "reply": " A new Cinco de Mayo?... LOL Respectfully, SUNLINER81", 
        "threadID": "672198221_4690024712001", 
        "time": "2009-03-10 11:58:00", 
        "title": "France offers Mexico police aid", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by Knele: quote: Originally posted by Anbar7: they haven't done much for the war. They have a few troops there, but not as many as they could. It is disappointing. Who is France at war with? France has troops in Afghanistan. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090310, 
        "postID": 11, 
        "quote": "Originally posted by Knele: quote: Originally posted by Anbar7: they haven't done much for the war. They have a few troops there, but not as many as they could. It is disappointing. Who is France at war with?", 
        "reply": " France has troops in Afghanistan. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_4690024712001", 
        "time": "2009-03-10 11:59:00", 
        "title": "France offers Mexico police aid", 
        "userID": "jack_flats"
    }, 
    {
        "content": "Not at all sure what the justification for this would be as the French have not been particularly successful in military matters for nearly 200 years. Since Trafalgar and Waterloo it has been one disaster after the other, with only the occasional bright spot of slaughtering a bunch of peasants before predictably loosing once again.", 
        "intTime": 20090310, 
        "postID": 12, 
        "quote": "", 
        "reply": "Not at all sure what the justification for this would be as the French have not been particularly successful in military matters for nearly 200 years. Since Trafalgar and Waterloo it has been one disaster after the other, with only the occasional bright spot of slaughtering a bunch of peasants before predictably loosing once again.", 
        "threadID": "672198221_4690024712001", 
        "time": "2009-03-10 12:55:00", 
        "title": "France offers Mexico police aid", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: Not at all sure what the justification for this would be as the French have not been particularly successful in military matters for nearly 200 years. Since Trafalgar and Waterloo it has been one disaster after the other, with only the occasional bright spot of slaughtering a bunch of peasants before predictably loosing once again. That’s why they are offering Police aid. Training and technology for gathering intelligence!", 
        "intTime": 20090310, 
        "postID": 13, 
        "quote": "Originally posted by adminnco1: Not at all sure what the justification for this would be as the French have not been particularly successful in military matters for nearly 200 years. Since Trafalgar and Waterloo it has been one disaster after the other, with only the occasional bright spot of slaughtering a bunch of peasants before predictably loosing once again.", 
        "reply": " That’s why they are offering Police aid. Training and technology for gathering intelligence!", 
        "threadID": "672198221_4690024712001", 
        "time": "2009-03-10 13:00:00", 
        "title": "France offers Mexico police aid", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by Knele: quote: Originally posted by adminnco1: Not at all sure what the justification for this would be as the French have not been particularly successful in military matters for nearly 200 years. Since Trafalgar and Waterloo it has been one disaster after the other, with only the occasional bright spot of slaughtering a bunch of peasants before predictably loosing once again. That’s why they are offering Police aid. Training and technology for gathering intelligence! and of course there has never been a connection between the two From what my family members in southern Texas have told me the situation in northern Mexico is rapidly spinning out of control. It is hardly a time to send in the amateurs.", 
        "intTime": 20090310, 
        "postID": 14, 
        "quote": "Originally posted by Knele: quote: Originally posted by adminnco1: Not at all sure what the justification for this would be as the French have not been particularly successful in military matters for nearly 200 years. Since Trafalgar and Waterloo it has been one disaster after the other, with only the occasional bright spot of slaughtering a bunch of peasants before predictably loosing once again. That’s why they are offering Police aid. Training and technology for gathering intelligence!", 
        "reply": " and of course there has never been a connection between the two From what my family members in southern Texas have told me the situation in northern Mexico is rapidly spinning out of control. It is hardly a time to send in the amateurs.", 
        "threadID": "672198221_4690024712001", 
        "time": "2009-03-10 13:06:00", 
        "title": "France offers Mexico police aid", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Your right they are not required, but other countries are doing more than they are. It is disappointing, but France has never been one for war anyways. Yep only the fourth largest contingent. Maybe it's all the appreciation that's getting more troops committed.", 
        "intTime": 20090310, 
        "postID": 15, 
        "quote": "Your right they are not required, but other countries are doing more than they are. It is disappointing, but France has never been one for war anyways.", 
        "reply": " Yep only the fourth largest contingent. Maybe it's all the appreciation that's getting more troops committed.", 
        "threadID": "672198221_4690024712001", 
        "time": "2009-03-10 13:15:00", 
        "title": "France offers Mexico police aid", 
        "userID": "2nd_freedomfighter"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by Knele: quote: Originally posted by adminnco1: Not at all sure what the justification for this would be as the French have not been particularly successful in military matters for nearly 200 years. Since Trafalgar and Waterloo it has been one disaster after the other, with only the occasional bright spot of slaughtering a bunch of peasants before predictably loosing once again. That’s why they are offering Police aid. Training and technology for gathering intelligence! and of course there has never been a connection between the two From what my family members in southern Texas have told me the situation in northern Mexico is rapidly spinning out of control. It is hardly a time to send in the amateurs. Yeah there's nothing to learn from French intelligence gathering or police work.", 
        "intTime": 20090310, 
        "postID": 16, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by Knele: quote: Originally posted by adminnco1: Not at all sure what the justification for this would be as the French have not been particularly successful in military matters for nearly 200 years. Since Trafalgar and Waterloo it has been one disaster after the other, with only the occasional bright spot of slaughtering a bunch of peasants before predictably loosing once again. That’s why they are offering Police aid. Training and technology for gathering intelligence! and of course there has never been a connection between the two From what my family members in southern Texas have told me the situation in northern Mexico is rapidly spinning out of control. It is hardly a time to send in the amateurs.", 
        "reply": " Yeah there's nothing to learn from French intelligence gathering or police work.", 
        "threadID": "672198221_4690024712001", 
        "time": "2009-03-10 13:17:00", 
        "title": "France offers Mexico police aid", 
        "userID": "2nd_freedomfighter"
    }, 
    {
        "content": "quote: Originally posted by 2nd_freedomfighter: quote: Your right they are not required, but other countries are doing more than they are. It is disappointing, but France has never been one for war anyways. Yep only the fourth largest contingent. Maybe it's all the appreciation that's getting more troops committed. What, you have a problem with “Old Europe”?", 
        "intTime": 20090310, 
        "postID": 17, 
        "quote": "Originally posted by 2nd_freedomfighter: quote: Your right they are not required, but other countries are doing more than they are. It is disappointing, but France has never been one for war anyways. Yep only the fourth largest contingent. Maybe it's all the appreciation that's getting more troops committed.", 
        "reply": " What, you have a problem with “Old Europe”?", 
        "threadID": "672198221_4690024712001", 
        "time": "2009-03-10 13:27:00", 
        "title": "France offers Mexico police aid", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by Knele: quote: Originally posted by adminnco1: Not at all sure what the justification for this would be as the French have not been particularly successful in military matters for nearly 200 years. Since Trafalgar and Waterloo it has been one disaster after the other, with only the occasional bright spot of slaughtering a bunch of peasants before predictably loosing once again. That’s why they are offering Police aid. Training and technology for gathering intelligence! and of course there has never been a connection between the two From what my family members in southern Texas have told me the situation in northern Mexico is rapidly spinning out of control. It is hardly a time to send in the amateurs. what makes you think that french police are amateurs? ever hear of Interpol? Europol? the french Gendarme are VERY qualified. as i foresaw, foreigh help will be made available to mexico . i fully expect to see a multi national force being made up to aid Mexico. and theis MFO will not include the United States.", 
        "intTime": 20090310, 
        "postID": 18, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by Knele: quote: Originally posted by adminnco1: Not at all sure what the justification for this would be as the French have not been particularly successful in military matters for nearly 200 years. Since Trafalgar and Waterloo it has been one disaster after the other, with only the occasional bright spot of slaughtering a bunch of peasants before predictably loosing once again. That’s why they are offering Police aid. Training and technology for gathering intelligence! and of course there has never been a connection between the two From what my family members in southern Texas have told me the situation in northern Mexico is rapidly spinning out of control. It is hardly a time to send in the amateurs.", 
        "reply": " what makes you think that french police are amateurs? ever hear of Interpol? Europol? the french Gendarme are VERY qualified. as i foresaw, foreigh help will be made available to mexico . i fully expect to see a multi national force being made up to aid Mexico. and theis MFO will not include the United States.", 
        "threadID": "672198221_4690024712001", 
        "time": "2009-03-10 13:34:00", 
        "title": "France offers Mexico police aid", 
        "userID": "Elesso"
    }, 
    {
        "content": "Don't forget the French Foreign legion- they will go in when the U.S. Marines deem the situation to risky. I think the French have a good idea with this bit of diplomacy.", 
        "intTime": 20090310, 
        "postID": 19, 
        "quote": "", 
        "reply": "Don't forget the French Foreign legion- they will go in when the U.S. Marines deem the situation to risky. I think the French have a good idea with this bit of diplomacy.", 
        "threadID": "672198221_4690024712001", 
        "time": "2009-03-10 13:40:00", 
        "title": "France offers Mexico police aid", 
        "userID": "MaddogK"
    }, 
    {
        "content": "quote: Originally posted by MaddogK: I think the French have a good idea with this bit of diplomacy. Sarkozy has been right on target so far…….", 
        "intTime": 20090310, 
        "postID": 20, 
        "quote": "Originally posted by MaddogK: I think the French have a good idea with this bit of diplomacy.", 
        "reply": " Sarkozy has been right on target so far…….", 
        "threadID": "672198221_4690024712001", 
        "time": "2009-03-10 13:45:00", 
        "title": "France offers Mexico police aid", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: French President Nicolas Sarkozy has pledged to help Mexico in its battle against organised crime during an official visit to the country Mr Sarkozy offered his Mexican counterpart Felipe Calderon help with police training and technology for gathering intelligence. The two leaders also unveiled plans to build a $550m (£397m) Franco-European helicopter factory in Mexico. (...) +http://news.bbc.co.uk/2/hi/americas/7934889.stm", 
        "intTime": 20090310, 
        "postID": 21, 
        "quote": "French President Nicolas Sarkozy has pledged to help Mexico in its battle against organised crime during an official visit to the country Mr Sarkozy offered his Mexican counterpart Felipe Calderon help with police training and technology for gathering intelligence. The two leaders also unveiled plans to build a $550m (£397m) Franco-European helicopter factory in Mexico. (...)", 
        "reply": " +http://news.bbc.co.uk/2/hi/americas/7934889.stm", 
        "threadID": "672198221_4690024712001", 
        "time": "2009-03-10 06:41:00", 
        "title": "France offers Mexico police aid", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by Knele: quote: French President Nicolas Sarkozy has pledged to help Mexico in its battle against organised crime during an official visit to the country Mr Sarkozy offered his Mexican counterpart Felipe Calderon help with police training and technology for gathering intelligence. The two leaders also unveiled plans to build a $550m (£397m) Franco-European helicopter factory in Mexico. (...) +http://news.bbc.co.uk/2/hi/americas/7934889.stm I didn't know France was still in the political field. I thought they gave up a long time ago. Maybe they are just trying to save face with the rest of the world by saying \"OH, OH, look what I did\" \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090310, 
        "postID": 22, 
        "quote": "Originally posted by Knele: quote: French President Nicolas Sarkozy has pledged to help Mexico in its battle against organised crime during an official visit to the country Mr Sarkozy offered his Mexican counterpart Felipe Calderon help with police training and technology for gathering intelligence. The two leaders also unveiled plans to build a $550m (£397m) Franco-European helicopter factory in Mexico. (...) +http://news.bbc.co.uk/2/hi/americas/7934889.stm", 
        "reply": " I didn't know France was still in the political field. I thought they gave up a long time ago. Maybe they are just trying to save face with the rest of the world by saying \"OH, OH, look what I did\" \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_4690024712001", 
        "time": "2009-03-10 10:31:00", 
        "title": "France offers Mexico police aid", 
        "userID": "Anbar7"
    }, 
    {
        "content": "The last time frenchy visited Mexico Benito Juarez provided a warm reception. I can guess what the narco-gangs will have planned today.", 
        "intTime": 20090310, 
        "postID": 23, 
        "quote": "", 
        "reply": "The last time frenchy visited Mexico Benito Juarez provided a warm reception. I can guess what the narco-gangs will have planned today.", 
        "threadID": "672198221_4690024712001", 
        "time": "2009-03-10 11:07:00", 
        "title": "France offers Mexico police aid", 
        "userID": "Sand_Flea"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by Knele: quote: French President Nicolas Sarkozy has pledged to help Mexico in its battle against organised crime during an official visit to the country Mr Sarkozy offered his Mexican counterpart Felipe Calderon help with police training and technology for gathering intelligence. The two leaders also unveiled plans to build a $550m (£397m) Franco-European helicopter factory in Mexico. (...) +http://news.bbc.co.uk/2/hi/americas/7934889.stm I didn't know France was still in the political field. I thought they gave up a long time ago. Maybe they are just trying to save face with the rest of the world by saying \"OH, OH, look what I did\" I am not aware of any recent events France should be ashamed of?", 
        "intTime": 20090310, 
        "postID": 24, 
        "quote": "Originally posted by Anbar7: quote: Originally posted by Knele: quote: French President Nicolas Sarkozy has pledged to help Mexico in its battle against organised crime during an official visit to the country Mr Sarkozy offered his Mexican counterpart Felipe Calderon help with police training and technology for gathering intelligence. The two leaders also unveiled plans to build a $550m (£397m) Franco-European helicopter factory in Mexico. (...) +http://news.bbc.co.uk/2/hi/americas/7934889.stm I didn't know France was still in the political field. I thought they gave up a long time ago. Maybe they are just trying to save face with the rest of the world by saying \"OH, OH, look what I did\"", 
        "reply": " I am not aware of any recent events France should be ashamed of?", 
        "threadID": "672198221_4690024712001", 
        "time": "2009-03-10 11:34:00", 
        "title": "France offers Mexico police aid", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by Knele: quote: Originally posted by Anbar7: quote: Originally posted by Knele: quote: French President Nicolas Sarkozy has pledged to help Mexico in its battle against organised crime during an official visit to the country Mr Sarkozy offered his Mexican counterpart Felipe Calderon help with police training and technology for gathering intelligence. The two leaders also unveiled plans to build a $550m (£397m) Franco-European helicopter factory in Mexico. (...) +http://news.bbc.co.uk/2/hi/americas/7934889.stm I didn't know France was still in the political field. I thought they gave up a long time ago. Maybe they are just trying to save face with the rest of the world by saying \"OH, OH, look what I did\" I am not aware of any recent events France should be ashamed of? they haven't done much for the war. They have a few troops there, but not as many as they could. It is disappointing. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090310, 
        "postID": 25, 
        "quote": "Originally posted by Knele: quote: Originally posted by Anbar7: quote: Originally posted by Knele: quote: French President Nicolas Sarkozy has pledged to help Mexico in its battle against organised crime during an official visit to the country Mr Sarkozy offered his Mexican counterpart Felipe Calderon help with police training and technology for gathering intelligence. The two leaders also unveiled plans to build a $550m (£397m) Franco-European helicopter factory in Mexico. (...) +http://news.bbc.co.uk/2/hi/americas/7934889.stm I didn't know France was still in the political field. I thought they gave up a long time ago. Maybe they are just trying to save face with the rest of the world by saying \"OH, OH, look what I did\" I am not aware of any recent events France should be ashamed of?", 
        "reply": " they haven't done much for the war. They have a few troops there, but not as many as they could. It is disappointing. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_4690024712001", 
        "time": "2009-03-10 11:37:00", 
        "title": "France offers Mexico police aid", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: they haven't done much for the war. They have a few troops there, but not as many as they could. It is disappointing. Who is France at war with?", 
        "intTime": 20090310, 
        "postID": 26, 
        "quote": "Originally posted by Anbar7: they haven't done much for the war. They have a few troops there, but not as many as they could. It is disappointing.", 
        "reply": " Who is France at war with?", 
        "threadID": "672198221_4690024712001", 
        "time": "2009-03-10 11:40:00", 
        "title": "France offers Mexico police aid", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by Knele: quote: Originally posted by Anbar7: they haven't done much for the war. They have a few troops there, but not as many as they could. It is disappointing. Who is France at war with? I hope your not being serious. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090310, 
        "postID": 27, 
        "quote": "Originally posted by Knele: quote: Originally posted by Anbar7: they haven't done much for the war. They have a few troops there, but not as many as they could. It is disappointing. Who is France at war with?", 
        "reply": " I hope your not being serious. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_4690024712001", 
        "time": "2009-03-10 11:42:00", 
        "title": "France offers Mexico police aid", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by Knele: quote: Originally posted by Anbar7: they haven't done much for the war. They have a few troops there, but not as many as they could. It is disappointing. Who is France at war with? I hope your not being serious. I am! France is not required or obligated to help us out in either (especially) Iraq or Afghanistan....but however minuscule, they are!", 
        "intTime": 20090310, 
        "postID": 28, 
        "quote": "Originally posted by Anbar7: quote: Originally posted by Knele: quote: Originally posted by Anbar7: they haven't done much for the war. They have a few troops there, but not as many as they could. It is disappointing. Who is France at war with? I hope your not being serious.", 
        "reply": " I am! France is not required or obligated to help us out in either (especially) Iraq or Afghanistan....but however minuscule, they are!", 
        "threadID": "672198221_4690024712001", 
        "time": "2009-03-10 11:46:00", 
        "title": "France offers Mexico police aid", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by Knele: quote: Originally posted by Anbar7: quote: Originally posted by Knele: quote: Originally posted by Anbar7: they haven't done much for the war. They have a few troops there, but not as many as they could. It is disappointing. Who is France at war with? I hope your not being serious. I am! France is not required or obligated to help us out in either Iraq or Afghanistan....but however minuscule, they are! Your right they are not required, but other countries are doing more than they are. It is disappointing, but France has never been one for war anyways. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090310, 
        "postID": 29, 
        "quote": "Originally posted by Knele: quote: Originally posted by Anbar7: quote: Originally posted by Knele: quote: Originally posted by Anbar7: they haven't done much for the war. They have a few troops there, but not as many as they could. It is disappointing. Who is France at war with? I hope your not being serious. I am! France is not required or obligated to help us out in either Iraq or Afghanistan....but however minuscule, they are!", 
        "reply": " Your right they are not required, but other countries are doing more than they are. It is disappointing, but France has never been one for war anyways. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_4690024712001", 
        "time": "2009-03-10 11:48:00", 
        "title": "France offers Mexico police aid", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Sand_Flea: The last time frenchy visited Mexico Benito Juarez provided a warm reception. I can guess what the narco-gangs will have planned today. A new Cinco de Mayo?... LOL Respectfully, SUNLINER81", 
        "intTime": 20090310, 
        "postID": 30, 
        "quote": "Originally posted by Sand_Flea: The last time frenchy visited Mexico Benito Juarez provided a warm reception. I can guess what the narco-gangs will have planned today.", 
        "reply": " A new Cinco de Mayo?... LOL Respectfully, SUNLINER81", 
        "threadID": "672198221_4690024712001", 
        "time": "2009-03-10 11:58:00", 
        "title": "France offers Mexico police aid", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by Knele: quote: Originally posted by Anbar7: they haven't done much for the war. They have a few troops there, but not as many as they could. It is disappointing. Who is France at war with? France has troops in Afghanistan. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090310, 
        "postID": 31, 
        "quote": "Originally posted by Knele: quote: Originally posted by Anbar7: they haven't done much for the war. They have a few troops there, but not as many as they could. It is disappointing. Who is France at war with?", 
        "reply": " France has troops in Afghanistan. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_4690024712001", 
        "time": "2009-03-10 11:59:00", 
        "title": "France offers Mexico police aid", 
        "userID": "jack_flats"
    }, 
    {
        "content": "Not at all sure what the justification for this would be as the French have not been particularly successful in military matters for nearly 200 years. Since Trafalgar and Waterloo it has been one disaster after the other, with only the occasional bright spot of slaughtering a bunch of peasants before predictably loosing once again.", 
        "intTime": 20090310, 
        "postID": 32, 
        "quote": "", 
        "reply": "Not at all sure what the justification for this would be as the French have not been particularly successful in military matters for nearly 200 years. Since Trafalgar and Waterloo it has been one disaster after the other, with only the occasional bright spot of slaughtering a bunch of peasants before predictably loosing once again.", 
        "threadID": "672198221_4690024712001", 
        "time": "2009-03-10 12:55:00", 
        "title": "France offers Mexico police aid", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: Not at all sure what the justification for this would be as the French have not been particularly successful in military matters for nearly 200 years. Since Trafalgar and Waterloo it has been one disaster after the other, with only the occasional bright spot of slaughtering a bunch of peasants before predictably loosing once again. That’s why they are offering Police aid. Training and technology for gathering intelligence!", 
        "intTime": 20090310, 
        "postID": 33, 
        "quote": "Originally posted by adminnco1: Not at all sure what the justification for this would be as the French have not been particularly successful in military matters for nearly 200 years. Since Trafalgar and Waterloo it has been one disaster after the other, with only the occasional bright spot of slaughtering a bunch of peasants before predictably loosing once again.", 
        "reply": " That’s why they are offering Police aid. Training and technology for gathering intelligence!", 
        "threadID": "672198221_4690024712001", 
        "time": "2009-03-10 13:00:00", 
        "title": "France offers Mexico police aid", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by Knele: quote: Originally posted by adminnco1: Not at all sure what the justification for this would be as the French have not been particularly successful in military matters for nearly 200 years. Since Trafalgar and Waterloo it has been one disaster after the other, with only the occasional bright spot of slaughtering a bunch of peasants before predictably loosing once again. That’s why they are offering Police aid. Training and technology for gathering intelligence! and of course there has never been a connection between the two From what my family members in southern Texas have told me the situation in northern Mexico is rapidly spinning out of control. It is hardly a time to send in the amateurs.", 
        "intTime": 20090310, 
        "postID": 34, 
        "quote": "Originally posted by Knele: quote: Originally posted by adminnco1: Not at all sure what the justification for this would be as the French have not been particularly successful in military matters for nearly 200 years. Since Trafalgar and Waterloo it has been one disaster after the other, with only the occasional bright spot of slaughtering a bunch of peasants before predictably loosing once again. That’s why they are offering Police aid. Training and technology for gathering intelligence!", 
        "reply": " and of course there has never been a connection between the two From what my family members in southern Texas have told me the situation in northern Mexico is rapidly spinning out of control. It is hardly a time to send in the amateurs.", 
        "threadID": "672198221_4690024712001", 
        "time": "2009-03-10 13:06:00", 
        "title": "France offers Mexico police aid", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Your right they are not required, but other countries are doing more than they are. It is disappointing, but France has never been one for war anyways. Yep only the fourth largest contingent. Maybe it's all the appreciation that's getting more troops committed.", 
        "intTime": 20090310, 
        "postID": 35, 
        "quote": "Your right they are not required, but other countries are doing more than they are. It is disappointing, but France has never been one for war anyways.", 
        "reply": " Yep only the fourth largest contingent. Maybe it's all the appreciation that's getting more troops committed.", 
        "threadID": "672198221_4690024712001", 
        "time": "2009-03-10 13:15:00", 
        "title": "France offers Mexico police aid", 
        "userID": "2nd_freedomfighter"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by Knele: quote: Originally posted by adminnco1: Not at all sure what the justification for this would be as the French have not been particularly successful in military matters for nearly 200 years. Since Trafalgar and Waterloo it has been one disaster after the other, with only the occasional bright spot of slaughtering a bunch of peasants before predictably loosing once again. That’s why they are offering Police aid. Training and technology for gathering intelligence! and of course there has never been a connection between the two From what my family members in southern Texas have told me the situation in northern Mexico is rapidly spinning out of control. It is hardly a time to send in the amateurs. Yeah there's nothing to learn from French intelligence gathering or police work.", 
        "intTime": 20090310, 
        "postID": 36, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by Knele: quote: Originally posted by adminnco1: Not at all sure what the justification for this would be as the French have not been particularly successful in military matters for nearly 200 years. Since Trafalgar and Waterloo it has been one disaster after the other, with only the occasional bright spot of slaughtering a bunch of peasants before predictably loosing once again. That’s why they are offering Police aid. Training and technology for gathering intelligence! and of course there has never been a connection between the two From what my family members in southern Texas have told me the situation in northern Mexico is rapidly spinning out of control. It is hardly a time to send in the amateurs.", 
        "reply": " Yeah there's nothing to learn from French intelligence gathering or police work.", 
        "threadID": "672198221_4690024712001", 
        "time": "2009-03-10 13:17:00", 
        "title": "France offers Mexico police aid", 
        "userID": "2nd_freedomfighter"
    }, 
    {
        "content": "quote: Originally posted by 2nd_freedomfighter: quote: Your right they are not required, but other countries are doing more than they are. It is disappointing, but France has never been one for war anyways. Yep only the fourth largest contingent. Maybe it's all the appreciation that's getting more troops committed. What, you have a problem with “Old Europe”?", 
        "intTime": 20090310, 
        "postID": 37, 
        "quote": "Originally posted by 2nd_freedomfighter: quote: Your right they are not required, but other countries are doing more than they are. It is disappointing, but France has never been one for war anyways. Yep only the fourth largest contingent. Maybe it's all the appreciation that's getting more troops committed.", 
        "reply": " What, you have a problem with “Old Europe”?", 
        "threadID": "672198221_4690024712001", 
        "time": "2009-03-10 13:27:00", 
        "title": "France offers Mexico police aid", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by Knele: quote: Originally posted by adminnco1: Not at all sure what the justification for this would be as the French have not been particularly successful in military matters for nearly 200 years. Since Trafalgar and Waterloo it has been one disaster after the other, with only the occasional bright spot of slaughtering a bunch of peasants before predictably loosing once again. That’s why they are offering Police aid. Training and technology for gathering intelligence! and of course there has never been a connection between the two From what my family members in southern Texas have told me the situation in northern Mexico is rapidly spinning out of control. It is hardly a time to send in the amateurs. what makes you think that french police are amateurs? ever hear of Interpol? Europol? the french Gendarme are VERY qualified. as i foresaw, foreigh help will be made available to mexico . i fully expect to see a multi national force being made up to aid Mexico. and theis MFO will not include the United States.", 
        "intTime": 20090310, 
        "postID": 38, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by Knele: quote: Originally posted by adminnco1: Not at all sure what the justification for this would be as the French have not been particularly successful in military matters for nearly 200 years. Since Trafalgar and Waterloo it has been one disaster after the other, with only the occasional bright spot of slaughtering a bunch of peasants before predictably loosing once again. That’s why they are offering Police aid. Training and technology for gathering intelligence! and of course there has never been a connection between the two From what my family members in southern Texas have told me the situation in northern Mexico is rapidly spinning out of control. It is hardly a time to send in the amateurs.", 
        "reply": " what makes you think that french police are amateurs? ever hear of Interpol? Europol? the french Gendarme are VERY qualified. as i foresaw, foreigh help will be made available to mexico . i fully expect to see a multi national force being made up to aid Mexico. and theis MFO will not include the United States.", 
        "threadID": "672198221_4690024712001", 
        "time": "2009-03-10 13:34:00", 
        "title": "France offers Mexico police aid", 
        "userID": "Elesso"
    }, 
    {
        "content": "Don't forget the French Foreign legion- they will go in when the U.S. Marines deem the situation to risky. I think the French have a good idea with this bit of diplomacy.", 
        "intTime": 20090310, 
        "postID": 39, 
        "quote": "", 
        "reply": "Don't forget the French Foreign legion- they will go in when the U.S. Marines deem the situation to risky. I think the French have a good idea with this bit of diplomacy.", 
        "threadID": "672198221_4690024712001", 
        "time": "2009-03-10 13:40:00", 
        "title": "France offers Mexico police aid", 
        "userID": "MaddogK"
    }, 
    {
        "content": "quote: Originally posted by MaddogK: I think the French have a good idea with this bit of diplomacy. Sarkozy has been right on target so far…….", 
        "intTime": 20090310, 
        "postID": 40, 
        "quote": "Originally posted by MaddogK: I think the French have a good idea with this bit of diplomacy.", 
        "reply": " Sarkozy has been right on target so far…….", 
        "threadID": "672198221_4690024712001", 
        "time": "2009-03-10 13:45:00", 
        "title": "France offers Mexico police aid", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: French President Nicolas Sarkozy has pledged to help Mexico in its battle against organised crime during an official visit to the country Mr Sarkozy offered his Mexican counterpart Felipe Calderon help with police training and technology for gathering intelligence. The two leaders also unveiled plans to build a $550m (£397m) Franco-European helicopter factory in Mexico. (...) +http://news.bbc.co.uk/2/hi/americas/7934889.stm", 
        "intTime": 20090310, 
        "postID": 41, 
        "quote": "French President Nicolas Sarkozy has pledged to help Mexico in its battle against organised crime during an official visit to the country Mr Sarkozy offered his Mexican counterpart Felipe Calderon help with police training and technology for gathering intelligence. The two leaders also unveiled plans to build a $550m (£397m) Franco-European helicopter factory in Mexico. (...)", 
        "reply": " +http://news.bbc.co.uk/2/hi/americas/7934889.stm", 
        "threadID": "672198221_4690024712001", 
        "time": "2009-03-10 06:41:00", 
        "title": "France offers Mexico police aid", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by Knele: quote: French President Nicolas Sarkozy has pledged to help Mexico in its battle against organised crime during an official visit to the country Mr Sarkozy offered his Mexican counterpart Felipe Calderon help with police training and technology for gathering intelligence. The two leaders also unveiled plans to build a $550m (£397m) Franco-European helicopter factory in Mexico. (...) +http://news.bbc.co.uk/2/hi/americas/7934889.stm I didn't know France was still in the political field. I thought they gave up a long time ago. Maybe they are just trying to save face with the rest of the world by saying \"OH, OH, look what I did\" \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090310, 
        "postID": 42, 
        "quote": "Originally posted by Knele: quote: French President Nicolas Sarkozy has pledged to help Mexico in its battle against organised crime during an official visit to the country Mr Sarkozy offered his Mexican counterpart Felipe Calderon help with police training and technology for gathering intelligence. The two leaders also unveiled plans to build a $550m (£397m) Franco-European helicopter factory in Mexico. (...) +http://news.bbc.co.uk/2/hi/americas/7934889.stm", 
        "reply": " I didn't know France was still in the political field. I thought they gave up a long time ago. Maybe they are just trying to save face with the rest of the world by saying \"OH, OH, look what I did\" \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_4690024712001", 
        "time": "2009-03-10 10:31:00", 
        "title": "France offers Mexico police aid", 
        "userID": "Anbar7"
    }, 
    {
        "content": "The last time frenchy visited Mexico Benito Juarez provided a warm reception. I can guess what the narco-gangs will have planned today.", 
        "intTime": 20090310, 
        "postID": 43, 
        "quote": "", 
        "reply": "The last time frenchy visited Mexico Benito Juarez provided a warm reception. I can guess what the narco-gangs will have planned today.", 
        "threadID": "672198221_4690024712001", 
        "time": "2009-03-10 11:07:00", 
        "title": "France offers Mexico police aid", 
        "userID": "Sand_Flea"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by Knele: quote: French President Nicolas Sarkozy has pledged to help Mexico in its battle against organised crime during an official visit to the country Mr Sarkozy offered his Mexican counterpart Felipe Calderon help with police training and technology for gathering intelligence. The two leaders also unveiled plans to build a $550m (£397m) Franco-European helicopter factory in Mexico. (...) +http://news.bbc.co.uk/2/hi/americas/7934889.stm I didn't know France was still in the political field. I thought they gave up a long time ago. Maybe they are just trying to save face with the rest of the world by saying \"OH, OH, look what I did\" I am not aware of any recent events France should be ashamed of?", 
        "intTime": 20090310, 
        "postID": 44, 
        "quote": "Originally posted by Anbar7: quote: Originally posted by Knele: quote: French President Nicolas Sarkozy has pledged to help Mexico in its battle against organised crime during an official visit to the country Mr Sarkozy offered his Mexican counterpart Felipe Calderon help with police training and technology for gathering intelligence. The two leaders also unveiled plans to build a $550m (£397m) Franco-European helicopter factory in Mexico. (...) +http://news.bbc.co.uk/2/hi/americas/7934889.stm I didn't know France was still in the political field. I thought they gave up a long time ago. Maybe they are just trying to save face with the rest of the world by saying \"OH, OH, look what I did\"", 
        "reply": " I am not aware of any recent events France should be ashamed of?", 
        "threadID": "672198221_4690024712001", 
        "time": "2009-03-10 11:34:00", 
        "title": "France offers Mexico police aid", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by Knele: quote: Originally posted by Anbar7: quote: Originally posted by Knele: quote: French President Nicolas Sarkozy has pledged to help Mexico in its battle against organised crime during an official visit to the country Mr Sarkozy offered his Mexican counterpart Felipe Calderon help with police training and technology for gathering intelligence. The two leaders also unveiled plans to build a $550m (£397m) Franco-European helicopter factory in Mexico. (...) +http://news.bbc.co.uk/2/hi/americas/7934889.stm I didn't know France was still in the political field. I thought they gave up a long time ago. Maybe they are just trying to save face with the rest of the world by saying \"OH, OH, look what I did\" I am not aware of any recent events France should be ashamed of? they haven't done much for the war. They have a few troops there, but not as many as they could. It is disappointing. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090310, 
        "postID": 45, 
        "quote": "Originally posted by Knele: quote: Originally posted by Anbar7: quote: Originally posted by Knele: quote: French President Nicolas Sarkozy has pledged to help Mexico in its battle against organised crime during an official visit to the country Mr Sarkozy offered his Mexican counterpart Felipe Calderon help with police training and technology for gathering intelligence. The two leaders also unveiled plans to build a $550m (£397m) Franco-European helicopter factory in Mexico. (...) +http://news.bbc.co.uk/2/hi/americas/7934889.stm I didn't know France was still in the political field. I thought they gave up a long time ago. Maybe they are just trying to save face with the rest of the world by saying \"OH, OH, look what I did\" I am not aware of any recent events France should be ashamed of?", 
        "reply": " they haven't done much for the war. They have a few troops there, but not as many as they could. It is disappointing. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_4690024712001", 
        "time": "2009-03-10 11:37:00", 
        "title": "France offers Mexico police aid", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: they haven't done much for the war. They have a few troops there, but not as many as they could. It is disappointing. Who is France at war with?", 
        "intTime": 20090310, 
        "postID": 46, 
        "quote": "Originally posted by Anbar7: they haven't done much for the war. They have a few troops there, but not as many as they could. It is disappointing.", 
        "reply": " Who is France at war with?", 
        "threadID": "672198221_4690024712001", 
        "time": "2009-03-10 11:40:00", 
        "title": "France offers Mexico police aid", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by Knele: quote: Originally posted by Anbar7: they haven't done much for the war. They have a few troops there, but not as many as they could. It is disappointing. Who is France at war with? I hope your not being serious. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090310, 
        "postID": 47, 
        "quote": "Originally posted by Knele: quote: Originally posted by Anbar7: they haven't done much for the war. They have a few troops there, but not as many as they could. It is disappointing. Who is France at war with?", 
        "reply": " I hope your not being serious. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_4690024712001", 
        "time": "2009-03-10 11:42:00", 
        "title": "France offers Mexico police aid", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by Knele: quote: Originally posted by Anbar7: they haven't done much for the war. They have a few troops there, but not as many as they could. It is disappointing. Who is France at war with? I hope your not being serious. I am! France is not required or obligated to help us out in either (especially) Iraq or Afghanistan....but however minuscule, they are!", 
        "intTime": 20090310, 
        "postID": 48, 
        "quote": "Originally posted by Anbar7: quote: Originally posted by Knele: quote: Originally posted by Anbar7: they haven't done much for the war. They have a few troops there, but not as many as they could. It is disappointing. Who is France at war with? I hope your not being serious.", 
        "reply": " I am! France is not required or obligated to help us out in either (especially) Iraq or Afghanistan....but however minuscule, they are!", 
        "threadID": "672198221_4690024712001", 
        "time": "2009-03-10 11:46:00", 
        "title": "France offers Mexico police aid", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by Knele: quote: Originally posted by Anbar7: quote: Originally posted by Knele: quote: Originally posted by Anbar7: they haven't done much for the war. They have a few troops there, but not as many as they could. It is disappointing. Who is France at war with? I hope your not being serious. I am! France is not required or obligated to help us out in either Iraq or Afghanistan....but however minuscule, they are! Your right they are not required, but other countries are doing more than they are. It is disappointing, but France has never been one for war anyways. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090310, 
        "postID": 49, 
        "quote": "Originally posted by Knele: quote: Originally posted by Anbar7: quote: Originally posted by Knele: quote: Originally posted by Anbar7: they haven't done much for the war. They have a few troops there, but not as many as they could. It is disappointing. Who is France at war with? I hope your not being serious. I am! France is not required or obligated to help us out in either Iraq or Afghanistan....but however minuscule, they are!", 
        "reply": " Your right they are not required, but other countries are doing more than they are. It is disappointing, but France has never been one for war anyways. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_4690024712001", 
        "time": "2009-03-10 11:48:00", 
        "title": "France offers Mexico police aid", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Sand_Flea: The last time frenchy visited Mexico Benito Juarez provided a warm reception. I can guess what the narco-gangs will have planned today. A new Cinco de Mayo?... LOL Respectfully, SUNLINER81", 
        "intTime": 20090310, 
        "postID": 50, 
        "quote": "Originally posted by Sand_Flea: The last time frenchy visited Mexico Benito Juarez provided a warm reception. I can guess what the narco-gangs will have planned today.", 
        "reply": " A new Cinco de Mayo?... LOL Respectfully, SUNLINER81", 
        "threadID": "672198221_4690024712001", 
        "time": "2009-03-10 11:58:00", 
        "title": "France offers Mexico police aid", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by Knele: quote: Originally posted by Anbar7: they haven't done much for the war. They have a few troops there, but not as many as they could. It is disappointing. Who is France at war with? France has troops in Afghanistan. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090310, 
        "postID": 51, 
        "quote": "Originally posted by Knele: quote: Originally posted by Anbar7: they haven't done much for the war. They have a few troops there, but not as many as they could. It is disappointing. Who is France at war with?", 
        "reply": " France has troops in Afghanistan. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_4690024712001", 
        "time": "2009-03-10 11:59:00", 
        "title": "France offers Mexico police aid", 
        "userID": "jack_flats"
    }, 
    {
        "content": "Not at all sure what the justification for this would be as the French have not been particularly successful in military matters for nearly 200 years. Since Trafalgar and Waterloo it has been one disaster after the other, with only the occasional bright spot of slaughtering a bunch of peasants before predictably loosing once again.", 
        "intTime": 20090310, 
        "postID": 52, 
        "quote": "", 
        "reply": "Not at all sure what the justification for this would be as the French have not been particularly successful in military matters for nearly 200 years. Since Trafalgar and Waterloo it has been one disaster after the other, with only the occasional bright spot of slaughtering a bunch of peasants before predictably loosing once again.", 
        "threadID": "672198221_4690024712001", 
        "time": "2009-03-10 12:55:00", 
        "title": "France offers Mexico police aid", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: Not at all sure what the justification for this would be as the French have not been particularly successful in military matters for nearly 200 years. Since Trafalgar and Waterloo it has been one disaster after the other, with only the occasional bright spot of slaughtering a bunch of peasants before predictably loosing once again. That’s why they are offering Police aid. Training and technology for gathering intelligence!", 
        "intTime": 20090310, 
        "postID": 53, 
        "quote": "Originally posted by adminnco1: Not at all sure what the justification for this would be as the French have not been particularly successful in military matters for nearly 200 years. Since Trafalgar and Waterloo it has been one disaster after the other, with only the occasional bright spot of slaughtering a bunch of peasants before predictably loosing once again.", 
        "reply": " That’s why they are offering Police aid. Training and technology for gathering intelligence!", 
        "threadID": "672198221_4690024712001", 
        "time": "2009-03-10 13:00:00", 
        "title": "France offers Mexico police aid", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by Knele: quote: Originally posted by adminnco1: Not at all sure what the justification for this would be as the French have not been particularly successful in military matters for nearly 200 years. Since Trafalgar and Waterloo it has been one disaster after the other, with only the occasional bright spot of slaughtering a bunch of peasants before predictably loosing once again. That’s why they are offering Police aid. Training and technology for gathering intelligence! and of course there has never been a connection between the two From what my family members in southern Texas have told me the situation in northern Mexico is rapidly spinning out of control. It is hardly a time to send in the amateurs.", 
        "intTime": 20090310, 
        "postID": 54, 
        "quote": "Originally posted by Knele: quote: Originally posted by adminnco1: Not at all sure what the justification for this would be as the French have not been particularly successful in military matters for nearly 200 years. Since Trafalgar and Waterloo it has been one disaster after the other, with only the occasional bright spot of slaughtering a bunch of peasants before predictably loosing once again. That’s why they are offering Police aid. Training and technology for gathering intelligence!", 
        "reply": " and of course there has never been a connection between the two From what my family members in southern Texas have told me the situation in northern Mexico is rapidly spinning out of control. It is hardly a time to send in the amateurs.", 
        "threadID": "672198221_4690024712001", 
        "time": "2009-03-10 13:06:00", 
        "title": "France offers Mexico police aid", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Your right they are not required, but other countries are doing more than they are. It is disappointing, but France has never been one for war anyways. Yep only the fourth largest contingent. Maybe it's all the appreciation that's getting more troops committed.", 
        "intTime": 20090310, 
        "postID": 55, 
        "quote": "Your right they are not required, but other countries are doing more than they are. It is disappointing, but France has never been one for war anyways.", 
        "reply": " Yep only the fourth largest contingent. Maybe it's all the appreciation that's getting more troops committed.", 
        "threadID": "672198221_4690024712001", 
        "time": "2009-03-10 13:15:00", 
        "title": "France offers Mexico police aid", 
        "userID": "2nd_freedomfighter"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by Knele: quote: Originally posted by adminnco1: Not at all sure what the justification for this would be as the French have not been particularly successful in military matters for nearly 200 years. Since Trafalgar and Waterloo it has been one disaster after the other, with only the occasional bright spot of slaughtering a bunch of peasants before predictably loosing once again. That’s why they are offering Police aid. Training and technology for gathering intelligence! and of course there has never been a connection between the two From what my family members in southern Texas have told me the situation in northern Mexico is rapidly spinning out of control. It is hardly a time to send in the amateurs. Yeah there's nothing to learn from French intelligence gathering or police work.", 
        "intTime": 20090310, 
        "postID": 56, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by Knele: quote: Originally posted by adminnco1: Not at all sure what the justification for this would be as the French have not been particularly successful in military matters for nearly 200 years. Since Trafalgar and Waterloo it has been one disaster after the other, with only the occasional bright spot of slaughtering a bunch of peasants before predictably loosing once again. That’s why they are offering Police aid. Training and technology for gathering intelligence! and of course there has never been a connection between the two From what my family members in southern Texas have told me the situation in northern Mexico is rapidly spinning out of control. It is hardly a time to send in the amateurs.", 
        "reply": " Yeah there's nothing to learn from French intelligence gathering or police work.", 
        "threadID": "672198221_4690024712001", 
        "time": "2009-03-10 13:17:00", 
        "title": "France offers Mexico police aid", 
        "userID": "2nd_freedomfighter"
    }, 
    {
        "content": "quote: Originally posted by 2nd_freedomfighter: quote: Your right they are not required, but other countries are doing more than they are. It is disappointing, but France has never been one for war anyways. Yep only the fourth largest contingent. Maybe it's all the appreciation that's getting more troops committed. What, you have a problem with “Old Europe”?", 
        "intTime": 20090310, 
        "postID": 57, 
        "quote": "Originally posted by 2nd_freedomfighter: quote: Your right they are not required, but other countries are doing more than they are. It is disappointing, but France has never been one for war anyways. Yep only the fourth largest contingent. Maybe it's all the appreciation that's getting more troops committed.", 
        "reply": " What, you have a problem with “Old Europe”?", 
        "threadID": "672198221_4690024712001", 
        "time": "2009-03-10 13:27:00", 
        "title": "France offers Mexico police aid", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by Knele: quote: Originally posted by adminnco1: Not at all sure what the justification for this would be as the French have not been particularly successful in military matters for nearly 200 years. Since Trafalgar and Waterloo it has been one disaster after the other, with only the occasional bright spot of slaughtering a bunch of peasants before predictably loosing once again. That’s why they are offering Police aid. Training and technology for gathering intelligence! and of course there has never been a connection between the two From what my family members in southern Texas have told me the situation in northern Mexico is rapidly spinning out of control. It is hardly a time to send in the amateurs. what makes you think that french police are amateurs? ever hear of Interpol? Europol? the french Gendarme are VERY qualified. as i foresaw, foreigh help will be made available to mexico . i fully expect to see a multi national force being made up to aid Mexico. and theis MFO will not include the United States.", 
        "intTime": 20090310, 
        "postID": 58, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by Knele: quote: Originally posted by adminnco1: Not at all sure what the justification for this would be as the French have not been particularly successful in military matters for nearly 200 years. Since Trafalgar and Waterloo it has been one disaster after the other, with only the occasional bright spot of slaughtering a bunch of peasants before predictably loosing once again. That’s why they are offering Police aid. Training and technology for gathering intelligence! and of course there has never been a connection between the two From what my family members in southern Texas have told me the situation in northern Mexico is rapidly spinning out of control. It is hardly a time to send in the amateurs.", 
        "reply": " what makes you think that french police are amateurs? ever hear of Interpol? Europol? the french Gendarme are VERY qualified. as i foresaw, foreigh help will be made available to mexico . i fully expect to see a multi national force being made up to aid Mexico. and theis MFO will not include the United States.", 
        "threadID": "672198221_4690024712001", 
        "time": "2009-03-10 13:34:00", 
        "title": "France offers Mexico police aid", 
        "userID": "Elesso"
    }, 
    {
        "content": "Don't forget the French Foreign legion- they will go in when the U.S. Marines deem the situation to risky. I think the French have a good idea with this bit of diplomacy.", 
        "intTime": 20090310, 
        "postID": 59, 
        "quote": "", 
        "reply": "Don't forget the French Foreign legion- they will go in when the U.S. Marines deem the situation to risky. I think the French have a good idea with this bit of diplomacy.", 
        "threadID": "672198221_4690024712001", 
        "time": "2009-03-10 13:40:00", 
        "title": "France offers Mexico police aid", 
        "userID": "MaddogK"
    }, 
    {
        "content": "quote: Originally posted by MaddogK: I think the French have a good idea with this bit of diplomacy. Sarkozy has been right on target so far…….", 
        "intTime": 20090310, 
        "postID": 60, 
        "quote": "Originally posted by MaddogK: I think the French have a good idea with this bit of diplomacy.", 
        "reply": " Sarkozy has been right on target so far…….", 
        "threadID": "672198221_4690024712001", 
        "time": "2009-03-10 13:45:00", 
        "title": "France offers Mexico police aid", 
        "userID": "Knele"
    }
]