[
    {
        "content": "In THE NEWS: All News Channels: Obama is in the news 24 hours a day every day on every channel and I for one am sick and tired of the a$$ kissing the liberal news donkeys are giving this poor excuse of a president! \"http://www.foxnews.com/politics/index.html This message has been edited. Last edited by: EAG154, Mon 27 April 2009 04:21 PM", 
        "intTime": 20090427, 
        "postID": 1, 
        "quote": "", 
        "reply": "In THE NEWS: All News Channels: Obama is in the news 24 hours a day every day on every channel and I for one am sick and tired of the a$$ kissing the liberal news donkeys are giving this poor excuse of a president! \"http://www.foxnews.com/politics/index.html This message has been edited. Last edited by: EAG154, Mon 27 April 2009 04:21 PM", 
        "threadID": "672198221_8010019122001", 
        "time": "2009-04-27 15:38:00", 
        "title": "Obama news", 
        "userID": "EAG154"
    }, 
    {
        "content": "There has to be someone out there planning a ALL OBAMA ALL THE TIME channel for some poor cable network out there. Wait EAG, I think it's comming to a town near YOU!!!! Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090427, 
        "postID": 2, 
        "quote": "", 
        "reply": "There has to be someone out there planning a ALL OBAMA ALL THE TIME channel for some poor cable network out there. Wait EAG, I think it's comming to a town near YOU!!!! Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_8010019122001", 
        "time": "2009-04-27 15:43:00", 
        "title": "Obama news", 
        "userID": "L0A1"
    }, 
    {
        "content": "got a link to that news article ?", 
        "intTime": 20090427, 
        "postID": 3, 
        "quote": "", 
        "reply": "got a link to that news article ?", 
        "threadID": "672198221_8010019122001", 
        "time": "2009-04-27 16:01:00", 
        "title": "Obama news", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: got a link to that news article ? I guess my sarcasm got lost somewhere. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090427, 
        "postID": 4, 
        "quote": "Originally posted by crackerjacks61: got a link to that news article ?", 
        "reply": " I guess my sarcasm got lost somewhere. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_8010019122001", 
        "time": "2009-04-27 16:19:00", 
        "title": "Obama news", 
        "userID": "L0A1"
    }, 
    {
        "content": "One thing the MSM is doing is downplaying any call for prosecution of Bush Aministration officials. We need to move on, don't you know. They have also ignored the story about retired military officers taking what were essentially bribes to push the Bush Administration's view of the invasion of Iraq. And if anyone ever had a free ride with the press, it was George Bush and Ronald Reagan. All they ever got was softball questions. Walt", 
        "intTime": 20090428, 
        "postID": 5, 
        "quote": "", 
        "reply": "One thing the MSM is doing is downplaying any call for prosecution of Bush Aministration officials. We need to move on, don't you know. They have also ignored the story about retired military officers taking what were essentially bribes to push the Bush Administration's view of the invasion of Iraq. And if anyone ever had a free ride with the press, it was George Bush and Ronald Reagan. All they ever got was softball questions. Walt", 
        "threadID": "672198221_8010019122001", 
        "time": "2009-04-28 01:53:00", 
        "title": "Obama news", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "what was the point of this thread again?", 
        "intTime": 20090428, 
        "postID": 6, 
        "quote": "", 
        "reply": "what was the point of this thread again?", 
        "threadID": "672198221_8010019122001", 
        "time": "2009-04-28 02:28:00", 
        "title": "Obama news", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: what was the point of this thread again? The all Obama station, all the time... Looks like that they will have to take off the all Johny Horton station, all the time and replace it with the all Obama station... LOL Respectfully, SUNLINER81", 
        "intTime": 20090428, 
        "postID": 7, 
        "quote": "Originally posted by karlhungusjr: what was the point of this thread again?", 
        "reply": " The all Obama station, all the time... Looks like that they will have to take off the all Johny Horton station, all the time and replace it with the all Obama station... LOL Respectfully, SUNLINER81", 
        "threadID": "672198221_8010019122001", 
        "time": "2009-04-28 03:56:00", 
        "title": "Obama news", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: what was the point of this thread again? He's just upset because the current President doesn't fire someone from his cabinet for gross incompetence every month like the old one did. Maybe if there were competent Republicans actually doing something other than pointing fingers at each other, they'd get some news coverage themselves. You guys are going to be REALLY upset when even more Republicans get voted out in 2010 and we see even less of them on the news.", 
        "intTime": 20090428, 
        "postID": 8, 
        "quote": "Originally posted by karlhungusjr: what was the point of this thread again?", 
        "reply": " He's just upset because the current President doesn't fire someone from his cabinet for gross incompetence every month like the old one did. Maybe if there were competent Republicans actually doing something other than pointing fingers at each other, they'd get some news coverage themselves. You guys are going to be REALLY upset when even more Republicans get voted out in 2010 and we see even less of them on the news.", 
        "threadID": "672198221_8010019122001", 
        "time": "2009-04-28 04:51:00", 
        "title": "Obama news", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by karlhungusjr: what was the point of this thread again? He's just upset because the current President doesn't fire someone from his cabinet for gross incompetence every month like the old one did. Maybe if there were competent Republicans actually doing something other than pointing fingers at each other, they'd get some news coverage themselves. You guys are going to be REALLY upset when even more Republicans get voted out in 2010 and we see even less of them on the news. ha ha ha come 2010 the real Obama will be unvailed to everyones horror", 
        "intTime": 20090428, 
        "postID": 9, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by karlhungusjr: what was the point of this thread again? He's just upset because the current President doesn't fire someone from his cabinet for gross incompetence every month like the old one did. Maybe if there were competent Republicans actually doing something other than pointing fingers at each other, they'd get some news coverage themselves. You guys are going to be REALLY upset when even more Republicans get voted out in 2010 and we see even less of them on the news.", 
        "reply": " ha ha ha come 2010 the real Obama will be unvailed to everyones horror", 
        "threadID": "672198221_8010019122001", 
        "time": "2009-04-28 17:27:00", 
        "title": "Obama news", 
        "userID": "EAG154"
    }, 
    {
        "content": "And who is the \"real Obama\"? Enlighten us.", 
        "intTime": 20090428, 
        "postID": 10, 
        "quote": "", 
        "reply": "And who is the \"real Obama\"? Enlighten us.", 
        "threadID": "672198221_8010019122001", 
        "time": "2009-04-28 18:08:00", 
        "title": "Obama news", 
        "userID": "mcgreer"
    }, 
    {
        "content": "MSNBC, the all Obama station.", 
        "intTime": 20090428, 
        "postID": 11, 
        "quote": "", 
        "reply": "MSNBC, the all Obama station.", 
        "threadID": "672198221_8010019122001", 
        "time": "2009-04-28 18:30:00", 
        "title": "Obama news", 
        "userID": "MSGCAVALRY"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: And who is the \"real Obama\"? Enlighten us. gotta wait for 2010", 
        "intTime": 20090429, 
        "postID": 12, 
        "quote": "Originally posted by mcgreer: And who is the \"real Obama\"? Enlighten us.", 
        "reply": " gotta wait for 2010", 
        "threadID": "672198221_8010019122001", 
        "time": "2009-04-29 06:53:00", 
        "title": "Obama news", 
        "userID": "EAG154"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by karlhungusjr: what was the point of this thread again? He's just upset because the current President doesn't fire someone from his cabinet for gross incompetence every month like the old one did. Maybe if there were competent Republicans actually doing something other than pointing fingers at each other, they'd get some news coverage themselves. You guys are going to be REALLY upset when even more Republicans get voted out in 2010 and we see even less of them on the news. Well atleast Bush could get someone into his cabinet. Obama can't even get anyone to stay long enough because they don't pay taxes or they just withdraw. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090429, 
        "postID": 13, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by karlhungusjr: what was the point of this thread again? He's just upset because the current President doesn't fire someone from his cabinet for gross incompetence every month like the old one did. Maybe if there were competent Republicans actually doing something other than pointing fingers at each other, they'd get some news coverage themselves. You guys are going to be REALLY upset when even more Republicans get voted out in 2010 and we see even less of them on the news.", 
        "reply": " Well atleast Bush could get someone into his cabinet. Obama can't even get anyone to stay long enough because they don't pay taxes or they just withdraw. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_8010019122001", 
        "time": "2009-04-29 07:29:00", 
        "title": "Obama news", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by mrmixitup: quote: Originally posted by karlhungusjr: what was the point of this thread again? He's just upset because the current President doesn't fire someone from his cabinet for gross incompetence every month like the old one did. Maybe if there were competent Republicans actually doing something other than pointing fingers at each other, they'd get some news coverage themselves. You guys are going to be REALLY upset when even more Republicans get voted out in 2010 and we see even less of them on the news. Well atleast Bush could get someone into his cabinet. Obama can't even get anyone to stay long enough because they don't pay taxes or they just withdraw. With the swearing in of Kathleen Sebelius at HHS, Obama's cabinet is now complete.", 
        "intTime": 20090429, 
        "postID": 14, 
        "quote": "Originally posted by Anbar7: quote: Originally posted by mrmixitup: quote: Originally posted by karlhungusjr: what was the point of this thread again? He's just upset because the current President doesn't fire someone from his cabinet for gross incompetence every month like the old one did. Maybe if there were competent Republicans actually doing something other than pointing fingers at each other, they'd get some news coverage themselves. You guys are going to be REALLY upset when even more Republicans get voted out in 2010 and we see even less of them on the news. Well atleast Bush could get someone into his cabinet. Obama can't even get anyone to stay long enough because they don't pay taxes or they just withdraw.", 
        "reply": " With the swearing in of Kathleen Sebelius at HHS, Obama's cabinet is now complete.", 
        "threadID": "672198221_8010019122001", 
        "time": "2009-04-29 07:39:00", 
        "title": "Obama news", 
        "userID": "Motive25"
    }, 
    {
        "content": "quote: With the swearing in of Kathleen Sebelius at HHS, Obama's cabinet is now complete. You wanted change but yet the council on foreign relations fills another administrations cabinet. When you understand their agenda, you'll understand why regardless of POTUS, we keep sailing the same direction.", 
        "intTime": 20090429, 
        "postID": 15, 
        "quote": "With the swearing in of Kathleen Sebelius at HHS, Obama's cabinet is now complete.", 
        "reply": " You wanted change but yet the council on foreign relations fills another administrations cabinet. When you understand their agenda, you'll understand why regardless of POTUS, we keep sailing the same direction.", 
        "threadID": "672198221_8010019122001", 
        "time": "2009-04-29 11:16:00", 
        "title": "Obama news", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: quote: With the swearing in of Kathleen Sebelius at HHS, Obama's cabinet is now complete. You wanted change but yet the council on foreign relations fills another administrations cabinet. When you understand their agenda, you'll understand why regardless of POTUS, we keep sailing the same direction. Tin foil alert!", 
        "intTime": 20090429, 
        "postID": 16, 
        "quote": "Originally posted by soscorpio: quote: With the swearing in of Kathleen Sebelius at HHS, Obama's cabinet is now complete. You wanted change but yet the council on foreign relations fills another administrations cabinet. When you understand their agenda, you'll understand why regardless of POTUS, we keep sailing the same direction.", 
        "reply": " Tin foil alert!", 
        "threadID": "672198221_8010019122001", 
        "time": "2009-04-29 11:50:00", 
        "title": "Obama news", 
        "userID": "Motive25"
    }, 
    {
        "content": "quote: Tin foil alert! Three minutes thought would suffice to find this out; but thought is irksome and three minutes is a long time. Keep it buddy, many in power are relying on you.", 
        "intTime": 20090429, 
        "postID": 17, 
        "quote": "Tin foil alert!", 
        "reply": " Three minutes thought would suffice to find this out; but thought is irksome and three minutes is a long time. Keep it buddy, many in power are relying on you.", 
        "threadID": "672198221_8010019122001", 
        "time": "2009-04-29 11:55:00", 
        "title": "Obama news", 
        "userID": "soscorpio"
    }
]