[
    {
        "content": "Well that didn't take them long. I wonder if they even tried to hijack that ship? Or were they just wanting to shoot at an American flagged ship? quote: Defiant Somali pirates fired rocket-propelled grenades and automatic weapons at another U.S. cargo ship on Tuesday but failed to hijack it, officials said, just days after Navy SEALs rescued an American hostage after an earlier unsuccessful hijacking. The brazen midday attack on the MV Liberty Sun in international waters off the African coast is further evidence that Somali pirates are back to business as usual. Pirates have seized four other ships with 60 hostages since sharpshooters killed three gunmen holding American freighter captain Richard Phillips. \"No one can deter us,\" one bandit boasted. The Liberty Sun's American crew was not injured but the vessel sustained unspecified damage in the attack, owner Liberty Maritime Corp. said in a statement Tuesday night. \"We are under attack by pirates, we are being hit by rockets. Also bullets,\" crewman Thomas Urbik, 26, wrote his mother in an e-mail Tuesday. \"We are barricaded in the engine room and so far no one is hurt. (A) rocket penetrated the bulkhead but the hole is small. Small fire, too, but put out.\" >>http://news.yahoo.com/s/ap/piracy<<", 
        "intTime": 20090414, 
        "postID": 1, 
        "quote": "Defiant Somali pirates fired rocket-propelled grenades and automatic weapons at another U.S. cargo ship on Tuesday but failed to hijack it, officials said, just days after Navy SEALs rescued an American hostage after an earlier unsuccessful hijacking. The brazen midday attack on the MV Liberty Sun in international waters off the African coast is further evidence that Somali pirates are back to business as usual. Pirates have seized four other ships with 60 hostages since sharpshooters killed three gunmen holding American freighter captain Richard Phillips. \"No one can deter us,\" one bandit boasted. The Liberty Sun's American crew was not injured but the vessel sustained unspecified damage in the attack, owner Liberty Maritime Corp. said in a statement Tuesday night. \"We are under attack by pirates, we are being hit by rockets. Also bullets,\" crewman Thomas Urbik, 26, wrote his mother in an e-mail Tuesday. \"We are barricaded in the engine room and so far no one is hurt. (A) rocket penetrated the bulkhead but the hole is small. Small fire, too, but put out.\" >>http://news.yahoo.com/s/ap/piracy<<", 
        "reply": "Well that didn't take them long. I wonder if they even tried to hijack that ship? Or were they just wanting to shoot at an American flagged ship? ", 
        "threadID": "672198221_1540077022001", 
        "time": "2009-04-14 23:16:00", 
        "title": "US Merchant vessel attacked", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "quote: Originally posted by ArtMarsh: Well that didn't take them long. I wonder if they even tried to hijack that ship? Or were they just wanting to shoot at an American flagged ship? quote: Defiant Somali pirates fired rocket-propelled grenades and automatic weapons at another U.S. cargo ship on Tuesday but failed to hijack it, officials said, just days after Navy SEALs rescued an American hostage after an earlier unsuccessful hijacking. The brazen midday attack on the MV Liberty Sun in international waters off the African coast is further evidence that Somali pirates are back to business as usual. Pirates have seized four other ships with 60 hostages since sharpshooters killed three gunmen holding American freighter captain Richard Phillips. \"No one can deter us,\" one bandit boasted. The Liberty Sun's American crew was not injured but the vessel sustained unspecified damage in the attack, owner Liberty Maritime Corp. said in a statement Tuesday night. \"We are under attack by pirates, we are being hit by rockets. Also bullets,\" crewman Thomas Urbik, 26, wrote his mother in an e-mail Tuesday. \"We are barricaded in the engine room and so far no one is hurt. (A) rocket penetrated the bulkhead but the hole is small. Small fire, too, but put out.\" >>http://news.yahoo.com/s/ap/piracy<< Probably not. I doubt if this incident just ended has much impact on their thinking. They're out there \"making a living,\" and they've taken quite a few other ships besides attacking this one. The others were Not American. Dave", 
        "intTime": 20090415, 
        "postID": 2, 
        "quote": "Originally posted by ArtMarsh: Well that didn't take them long. I wonder if they even tried to hijack that ship? Or were they just wanting to shoot at an American flagged ship? quote: Defiant Somali pirates fired rocket-propelled grenades and automatic weapons at another U.S. cargo ship on Tuesday but failed to hijack it, officials said, just days after Navy SEALs rescued an American hostage after an earlier unsuccessful hijacking. The brazen midday attack on the MV Liberty Sun in international waters off the African coast is further evidence that Somali pirates are back to business as usual. Pirates have seized four other ships with 60 hostages since sharpshooters killed three gunmen holding American freighter captain Richard Phillips. \"No one can deter us,\" one bandit boasted. The Liberty Sun's American crew was not injured but the vessel sustained unspecified damage in the attack, owner Liberty Maritime Corp. said in a statement Tuesday night. \"We are under attack by pirates, we are being hit by rockets. Also bullets,\" crewman Thomas Urbik, 26, wrote his mother in an e-mail Tuesday. \"We are barricaded in the engine room and so far no one is hurt. (A) rocket penetrated the bulkhead but the hole is small. Small fire, too, but put out.\" >>http://news.yahoo.com/s/ap/piracy<<", 
        "reply": " Probably not. I doubt if this incident just ended has much impact on their thinking. They're out there \"making a living,\" and they've taken quite a few other ships besides attacking this one. The others were Not American. Dave", 
        "threadID": "672198221_1540077022001", 
        "time": "2009-04-15 07:57:00", 
        "title": "US Merchant vessel attacked", 
        "userID": "Grachus"
    }, 
    {
        "content": "Looks like we are going to have to hire a few civilian contractors to put on these ships for protection in troubled waters. That way we could kill too birds with one stone. Protect our ships and creating jobs.", 
        "intTime": 20090415, 
        "postID": 3, 
        "quote": "", 
        "reply": "Looks like we are going to have to hire a few civilian contractors to put on these ships for protection in troubled waters. That way we could kill too birds with one stone. Protect our ships and creating jobs.", 
        "threadID": "672198221_1540077022001", 
        "time": "2009-04-15 08:01:00", 
        "title": "US Merchant vessel attacked", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Duster6: Looks like we are going to have to hire a few civilian contractors to put on these ships for protection in troubled waters. That way we could kill too birds with one stone. Protect our ships and creating jobs. That's a considerably better suggestion than some of the ones I've read lately.", 
        "intTime": 20090415, 
        "postID": 4, 
        "quote": "Originally posted by Duster6: Looks like we are going to have to hire a few civilian contractors to put on these ships for protection in troubled waters. That way we could kill too birds with one stone. Protect our ships and creating jobs.", 
        "reply": " That's a considerably better suggestion than some of the ones I've read lately.", 
        "threadID": "672198221_1540077022001", 
        "time": "2009-04-15 08:06:00", 
        "title": "US Merchant vessel attacked", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "I think we should do it the Democratic way. They are innocent because they are hungry. Let them come to America so we can feed them and give them jobs. They are the victims and we are the bullies. Please forgive us pirates, but we don't know what we do. Or we could just start patrolling the damn waters and have satellites find the mother ships and we can have some nice little submarines to there and do a little damage. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090415, 
        "postID": 5, 
        "quote": "", 
        "reply": "I think we should do it the Democratic way. They are innocent because they are hungry. Let them come to America so we can feed them and give them jobs. They are the victims and we are the bullies. Please forgive us pirates, but we don't know what we do. Or we could just start patrolling the damn waters and have satellites find the mother ships and we can have some nice little submarines to there and do a little damage. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_1540077022001", 
        "time": "2009-04-15 08:44:00", 
        "title": "US Merchant vessel attacked", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Ol_Doc: quote: Originally posted by Duster6: Looks like we are going to have to hire a few civilian contractors to put on these ships for protection in troubled waters. That way we could kill too birds with one stone. Protect our ships and creating jobs. That's a considerably better suggestion than some of the ones I've read lately. Yes but apparently it's off the table. The Shipping firms don't like it. They much prefer the taxpayers forking over billions of dollars for our Navy to do this job for them. Dave", 
        "intTime": 20090415, 
        "postID": 6, 
        "quote": "Originally posted by Ol_Doc: quote: Originally posted by Duster6: Looks like we are going to have to hire a few civilian contractors to put on these ships for protection in troubled waters. That way we could kill too birds with one stone. Protect our ships and creating jobs. That's a considerably better suggestion than some of the ones I've read lately.", 
        "reply": " Yes but apparently it's off the table. The Shipping firms don't like it. They much prefer the taxpayers forking over billions of dollars for our Navy to do this job for them. Dave", 
        "threadID": "672198221_1540077022001", 
        "time": "2009-04-15 08:56:00", 
        "title": "US Merchant vessel attacked", 
        "userID": "Grachus"
    }, 
    {
        "content": "Our Navy has already said they can't patrol the one million square miles of shipping lanes without other countries help. So if we hired people like we did for the Air Marshal program (retired military, military that have ETS from service, retired Cops, DOD Police, formal special Opns folks, etc, give them a training program that deals with this type of activity and pay them a fair wage then most of the problem is solved. Look at it this way. Ten years ago all they would have had to do is give me a room, feed me, pay me about $150/day plus medical benefits and some R&R and I'd work my butt off for them plus I know many friends of mine that would do the same. They would love to take on a dozen or two of these skinny Pirates. We would be just as qualified (if not more) than those Black Water boys in Iraq pulling down $200,000 a year. Don't ya think?", 
        "intTime": 20090416, 
        "postID": 7, 
        "quote": "", 
        "reply": "Our Navy has already said they can't patrol the one million square miles of shipping lanes without other countries help. So if we hired people like we did for the Air Marshal program (retired military, military that have ETS from service, retired Cops, DOD Police, formal special Opns folks, etc, give them a training program that deals with this type of activity and pay them a fair wage then most of the problem is solved. Look at it this way. Ten years ago all they would have had to do is give me a room, feed me, pay me about $150/day plus medical benefits and some R&R and I'd work my butt off for them plus I know many friends of mine that would do the same. They would love to take on a dozen or two of these skinny Pirates. We would be just as qualified (if not more) than those Black Water boys in Iraq pulling down $200,000 a year. Don't ya think?", 
        "threadID": "672198221_1540077022001", 
        "time": "2009-04-16 16:58:00", 
        "title": "US Merchant vessel attacked", 
        "userID": "Duster6"
    }, 
    {
        "content": "I still think an in-shore blockade of the ports used by the pirate mother ships is the best way to go. There are less than a half dozen ports, so only a handful of ships would needed, plus a bunch of small boats for board & search ops.", 
        "intTime": 20090416, 
        "postID": 8, 
        "quote": "", 
        "reply": "I still think an in-shore blockade of the ports used by the pirate mother ships is the best way to go. There are less than a half dozen ports, so only a handful of ships would needed, plus a bunch of small boats for board & search ops.", 
        "threadID": "672198221_1540077022001", 
        "time": "2009-04-16 18:16:00", 
        "title": "US Merchant vessel attacked", 
        "userID": "Motive25"
    }, 
    {
        "content": "Give me $1000 a head and a comfy chair and I'll protect the ship. You don't even have to supply the weapon, just supply 7.62 NATO rounds and extra magazines. I kinda felt like plinking anyway.", 
        "intTime": 20090416, 
        "postID": 9, 
        "quote": "", 
        "reply": "Give me $1000 a head and a comfy chair and I'll protect the ship. You don't even have to supply the weapon, just supply 7.62 NATO rounds and extra magazines. I kinda felt like plinking anyway.", 
        "threadID": "672198221_1540077022001", 
        "time": "2009-04-16 18:18:00", 
        "title": "US Merchant vessel attacked", 
        "userID": "10Tenths"
    }, 
    {
        "content": "quote: Originally posted by 10tenths: Give me $1000 a head and a comfy chair and I'll protect the ship. You don't even have to supply the weapon, just supply 7.62 NATO rounds and extra magazines. I kinda felt like plinking anyway. The shipping companies oppose your logical solution. They want the taxpayer to do it for free. Dave", 
        "intTime": 20090417, 
        "postID": 10, 
        "quote": "Originally posted by 10tenths: Give me $1000 a head and a comfy chair and I'll protect the ship. You don't even have to supply the weapon, just supply 7.62 NATO rounds and extra magazines. I kinda felt like plinking anyway.", 
        "reply": " The shipping companies oppose your logical solution. They want the taxpayer to do it for free. Dave", 
        "threadID": "672198221_1540077022001", 
        "time": "2009-04-17 07:41:00", 
        "title": "US Merchant vessel attacked", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: I think we should do it the Democratic way. They are innocent because they are hungry. Let them come to America so we can feed them and give them jobs. They are the victims and we are the bullies. Please forgive us pirates, but we don't know what we do. Or we could just start patrolling the damn waters and have satellites find the mother ships and we can have some nice little submarines to there and do a little damage. Yea! Let's use our military (and Servicemembers) to defend hundreds of other country's civilian resources! And let's make sure we spend millions our own money doing it!", 
        "intTime": 20090417, 
        "postID": 11, 
        "quote": "Originally posted by Anbar7: I think we should do it the Democratic way. They are innocent because they are hungry. Let them come to America so we can feed them and give them jobs. They are the victims and we are the bullies. Please forgive us pirates, but we don't know what we do. Or we could just start patrolling the damn waters and have satellites find the mother ships and we can have some nice little submarines to there and do a little damage.", 
        "reply": " Yea! Let's use our military (and Servicemembers) to defend hundreds of other country's civilian resources! And let's make sure we spend millions our own money doing it!", 
        "threadID": "672198221_1540077022001", 
        "time": "2009-04-17 07:47:00", 
        "title": "US Merchant vessel attacked", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "May I also add that I think it's great that most of you supporting the use of our military for something like this (which is a complete waste of money since we're talking about civilian freighters here which should pay for their own protection), but opposed surplus spending. Way to go.", 
        "intTime": 20090417, 
        "postID": 12, 
        "quote": "", 
        "reply": "May I also add that I think it's great that most of you supporting the use of our military for something like this (which is a complete waste of money since we're talking about civilian freighters here which should pay for their own protection), but opposed surplus spending. Way to go.", 
        "threadID": "672198221_1540077022001", 
        "time": "2009-04-17 07:51:00", 
        "title": "US Merchant vessel attacked", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: May I also add that I think it's great that most of you supporting the use of our military for something like this (which is a complete waste of money since we're talking about civilian freighters here which should pay for their own protection), but opposed surplus spending. Way to go. What is the reason the United States Navy came into existance in the first place? Why did it take more than 10 YEARS after the Revolutionary War to create the United States Navy? Now care to explain your answer in a more logical manner? Finally, Why do you not know what the US Navy's mission and charters are?", 
        "intTime": 20090417, 
        "postID": 13, 
        "quote": "Originally posted by mrmixitup: May I also add that I think it's great that most of you supporting the use of our military for something like this (which is a complete waste of money since we're talking about civilian freighters here which should pay for their own protection), but opposed surplus spending. Way to go.", 
        "reply": " What is the reason the United States Navy came into existance in the first place? Why did it take more than 10 YEARS after the Revolutionary War to create the United States Navy? Now care to explain your answer in a more logical manner? Finally, Why do you not know what the US Navy's mission and charters are?", 
        "threadID": "672198221_1540077022001", 
        "time": "2009-04-17 14:16:00", 
        "title": "US Merchant vessel attacked", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "quote: Originally posted by ArtMarsh: quote: Originally posted by mrmixitup: May I also add that I think it's great that most of you supporting the use of our military for something like this (which is a complete waste of money since we're talking about civilian freighters here which should pay for their own protection), but opposed surplus spending. Way to go. What is the reason the United States Navy came into existance in the first place? Why did it take more than 10 YEARS after the Revolutionary War to create the United States Navy? Now care to explain your answer in a more logical manner? Finally, Why do you not know what the US Navy's mission and charters are? While we call them the \"Barbary Pirates,\" they were actually a State sponsored AND controlled organisation, not independant operators. Capture the \"King\" and all the little pieces fell into place. But these guys are controlled by nothing but their own greed, and even knocking them off one by one, will simply result in replacements. The only way to really stop them is to make piracy a suicide mission. Arm the ships, force them to hire armed guards, inside a few months, no more piracy. Dave", 
        "intTime": 20090417, 
        "postID": 14, 
        "quote": "Originally posted by ArtMarsh: quote: Originally posted by mrmixitup: May I also add that I think it's great that most of you supporting the use of our military for something like this (which is a complete waste of money since we're talking about civilian freighters here which should pay for their own protection), but opposed surplus spending. Way to go. What is the reason the United States Navy came into existance in the first place? Why did it take more than 10 YEARS after the Revolutionary War to create the United States Navy? Now care to explain your answer in a more logical manner? Finally, Why do you not know what the US Navy's mission and charters are?", 
        "reply": " While we call them the \"Barbary Pirates,\" they were actually a State sponsored AND controlled organisation, not independant operators. Capture the \"King\" and all the little pieces fell into place. But these guys are controlled by nothing but their own greed, and even knocking them off one by one, will simply result in replacements. The only way to really stop them is to make piracy a suicide mission. Arm the ships, force them to hire armed guards, inside a few months, no more piracy. Dave", 
        "threadID": "672198221_1540077022001", 
        "time": "2009-04-17 14:29:00", 
        "title": "US Merchant vessel attacked", 
        "userID": "Grachus"
    }, 
    {
        "content": "Eh, I posted it before. So, I might as well post it again in light of Grachus' last comment. Here is an interesting point of view... ---http://www.sfbayview.com/2009/you-are-being-lied-to-about-pirates/", 
        "intTime": 20090417, 
        "postID": 15, 
        "quote": "", 
        "reply": "Eh, I posted it before. So, I might as well post it again in light of Grachus' last comment. Here is an interesting point of view... ---http://www.sfbayview.com/2009/you-are-being-lied-to-about-pirates/", 
        "threadID": "672198221_1540077022001", 
        "time": "2009-04-17 17:51:00", 
        "title": "US Merchant vessel attacked", 
        "userID": "10Tenths"
    }, 
    {
        "content": "I don't have the time to fully research this... so I'm just speaking from what may be a clouded memory...so Please excuse my rambling. Putting Armed folks on a Civilian Flagged vessel I believe violates international law somewhere...or they could have weapons in international waters but they would have to have all sort of special permission to have weapons aboard the ship when in domesticated waters. Some countries consider all ships with any kind of weaponry either unlawful or military subject to a SOFA agreement. Either way I think my ultimate point is it's just more complicated then just hiring mercenaries, Creating an Air Marshal like job is also a difficult task...even the air marshals have limited jurisdiction on international flights...have to have all sorts of special permission. Sorry for the rambling...food for thought", 
        "intTime": 20090417, 
        "postID": 16, 
        "quote": "", 
        "reply": "I don't have the time to fully research this... so I'm just speaking from what may be a clouded memory...so Please excuse my rambling. Putting Armed folks on a Civilian Flagged vessel I believe violates international law somewhere...or they could have weapons in international waters but they would have to have all sort of special permission to have weapons aboard the ship when in domesticated waters. Some countries consider all ships with any kind of weaponry either unlawful or military subject to a SOFA agreement. Either way I think my ultimate point is it's just more complicated then just hiring mercenaries, Creating an Air Marshal like job is also a difficult task...even the air marshals have limited jurisdiction on international flights...have to have all sorts of special permission. Sorry for the rambling...food for thought", 
        "threadID": "672198221_1540077022001", 
        "time": "2009-04-17 18:07:00", 
        "title": "US Merchant vessel attacked", 
        "userID": "CombatNAC"
    }, 
    {
        "content": "quote: Originally posted by 10tenths: Eh, I posted it before. So, I might as well post it again in light of Grachus' last comment. Here is an interesting point of view... ---http://www.sfbayview.com/2009/you-are-being-lied-to-about-pirates/ I do think the article is interesting...I would just like to find another credible source for some of the facts like the Illegal overfishing and dumping of Hazardous Materials in their waters", 
        "intTime": 20090417, 
        "postID": 17, 
        "quote": "Originally posted by 10tenths: Eh, I posted it before. So, I might as well post it again in light of Grachus' last comment. Here is an interesting point of view... ---http://www.sfbayview.com/2009/you-are-being-lied-to-about-pirates/", 
        "reply": " I do think the article is interesting...I would just like to find another credible source for some of the facts like the Illegal overfishing and dumping of Hazardous Materials in their waters", 
        "threadID": "672198221_1540077022001", 
        "time": "2009-04-17 18:26:00", 
        "title": "US Merchant vessel attacked", 
        "userID": "CombatNAC"
    }, 
    {
        "content": "quote: Originally posted by CombatNAC: quote: Originally posted by 10tenths: Eh, I posted it before. So, I might as well post it again in light of Grachus' last comment. Here is an interesting point of view... ---http://www.sfbayview.com/2009/you-are-being-lied-to-about-pirates/ I do think the article is interesting...I would just like to find another credible source for some of the facts like the Illegal overfishing and dumping of Hazardous Materials in their waters Check PBS' World Focus from Thursday night (might have been Wednesday, I cannot remember exactly). They talked about it on there. Here is the video: ---http://worldfocus.org/blog/2009/04/15/somali-pirates-target-another-us-ship-with-grenades/4987/ A news story from 2005: ---http://www.news24.com/News24/Africa/News/0,6119,2-11-1447_1673649,00.html An article from Allison Kilkenny: ---http://www.smirkingchimp.com/thread/21294 From the Canadian National Post: ---http://www.nationalpost.com/news/story.html?id=1508124 From Al Jazeera: ---http://english.aljazeera.net/news/africa/2008/10/2008109174223218644.html From Bartamaha, a Somali news organization: ---http://bartamaha.com/?p=411 Time magazine: ---http://www.time.com/time/world/article/0,8599,1892376,00.html The list really goes on forever. This message has been edited. Last edited by: 10Tenths, Sun 19 April 2009 12:52 AM", 
        "intTime": 20090418, 
        "postID": 18, 
        "quote": "Originally posted by CombatNAC: quote: Originally posted by 10tenths: Eh, I posted it before. So, I might as well post it again in light of Grachus' last comment. Here is an interesting point of view... ---http://www.sfbayview.com/2009/you-are-being-lied-to-about-pirates/ I do think the article is interesting...I would just like to find another credible source for some of the facts like the Illegal overfishing and dumping of Hazardous Materials in their waters", 
        "reply": " Check PBS' World Focus from Thursday night (might have been Wednesday, I cannot remember exactly). They talked about it on there. Here is the video: ---http://worldfocus.org/blog/2009/04/15/somali-pirates-target-another-us-ship-with-grenades/4987/ A news story from 2005: ---http://www.news24.com/News24/Africa/News/0,6119,2-11-1447_1673649,00.html An article from Allison Kilkenny: ---http://www.smirkingchimp.com/thread/21294 From the Canadian National Post: ---http://www.nationalpost.com/news/story.html?id=1508124 From Al Jazeera: ---http://english.aljazeera.net/news/africa/2008/10/2008109174223218644.html From Bartamaha, a Somali news organization: ---http://bartamaha.com/?p=411 Time magazine: ---http://www.time.com/time/world/article/0,8599,1892376,00.html The list really goes on forever. This message has been edited. Last edited by: 10Tenths, Sun 19 April 2009 12:52 AM", 
        "threadID": "672198221_1540077022001", 
        "time": "2009-04-18 21:34:00", 
        "title": "US Merchant vessel attacked", 
        "userID": "10Tenths"
    }
]