[
    {
        "content": "For a city that is drowning in debt, high murder rate, and low education numbers what do you think the city of Detroit does about it? Why of course they go out and sign the number one football draft pick from GA. Detroit signed Stafford for a deal worth somewhere around $78 million dollars. One would think this guy is the CEO of GM. I wonder if Obama will freeze some of this guys money? Link: \"usatoday.com\"", 
        "intTime": 20090425, 
        "postID": 1, 
        "quote": "", 
        "reply": "For a city that is drowning in debt, high murder rate, and low education numbers what do you think the city of Detroit does about it? Why of course they go out and sign the number one football draft pick from GA. Detroit signed Stafford for a deal worth somewhere around $78 million dollars. One would think this guy is the CEO of GM. I wonder if Obama will freeze some of this guys money? Link: \"usatoday.com\"", 
        "threadID": "672198221_4560037122001", 
        "time": "2009-04-25 05:46:00", 
        "title": "Detroit says \"Recession? What Recession\"?", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Duster6: For a city that is drowning in debt, high murder rate, and low education numbers what do you think the city of Detroit does about it? Why of course they go out and sign the number one football draft pick from GA. Detroit signed Stafford for a deal worth somewhere around $78 million dollars. One would think this guy is the CEO of GM. I wonder if Obama will freeze some of this guys money? Link: \"usatoday.com\" But who owns the team? Not the city I expect!", 
        "intTime": 20090425, 
        "postID": 2, 
        "quote": "Originally posted by Duster6: For a city that is drowning in debt, high murder rate, and low education numbers what do you think the city of Detroit does about it? Why of course they go out and sign the number one football draft pick from GA. Detroit signed Stafford for a deal worth somewhere around $78 million dollars. One would think this guy is the CEO of GM. I wonder if Obama will freeze some of this guys money? Link: \"usatoday.com\"", 
        "reply": " But who owns the team? Not the city I expect!", 
        "threadID": "672198221_4560037122001", 
        "time": "2009-04-25 06:16:00", 
        "title": "Detroit says \"Recession? What Recession\"?", 
        "userID": "busnrete8"
    }, 
    {
        "content": "Not sure what the correlation between the city's problems and the football team. The city doesn't own the football team, so their financial problems have nothing to do with who the Lions draft.", 
        "intTime": 20090425, 
        "postID": 3, 
        "quote": "", 
        "reply": "Not sure what the correlation between the city's problems and the football team. The city doesn't own the football team, so their financial problems have nothing to do with who the Lions draft.", 
        "threadID": "672198221_4560037122001", 
        "time": "2009-04-25 06:16:00", 
        "title": "Detroit says \"Recession? What Recession\"?", 
        "userID": "PSimon572"
    }, 
    {
        "content": "PSimon572; quote: Not sure what the correlation between the city's problems and the football team. The city doesn't own the football team, so their financial problems have nothing to do with who the Lions draft. That might depend, I know for the Jaguars, tax payers put up a large sum of the money to rebuild the stadium. So while they may not 'own' the team, they do have a financial stake in the team and stadium. And if there are financial struggles in a city, and the team raises prices in order to bring in some large salaried player..and people can't afford the ticket prices..everyone loses out.. One of the things I take issue with concerning that, is if they haven't sold 'enough' tickets, the game is blacked out locally. I think excuse me?? Our tax dollars helping pay for that stadium they are playing in-- Even when local schools want to use the stadium to hold a high school prom, they have to pay to use it..so that's more money out of the tax payers pocket to help pay for this thing.. And there are other cities around the country just like it, and I'm sure Detroit, might be one of them.. Many of these are older articles, but they show the abuses to tax payers.. \"http://www.akdart.com/sports.html\"", 
        "intTime": 20090425, 
        "postID": 4, 
        "quote": "Not sure what the correlation between the city's problems and the football team. The city doesn't own the football team, so their financial problems have nothing to do with who the Lions draft.", 
        "reply": "PSimon572;  That might depend, I know for the Jaguars, tax payers put up a large sum of the money to rebuild the stadium. So while they may not 'own' the team, they do have a financial stake in the team and stadium. And if there are financial struggles in a city, and the team raises prices in order to bring in some large salaried player..and people can't afford the ticket prices..everyone loses out.. One of the things I take issue with concerning that, is if they haven't sold 'enough' tickets, the game is blacked out locally. I think excuse me?? Our tax dollars helping pay for that stadium they are playing in-- Even when local schools want to use the stadium to hold a high school prom, they have to pay to use it..so that's more money out of the tax payers pocket to help pay for this thing.. And there are other cities around the country just like it, and I'm sure Detroit, might be one of them.. Many of these are older articles, but they show the abuses to tax payers.. \"http://www.akdart.com/sports.html\"", 
        "threadID": "672198221_4560037122001", 
        "time": "2009-04-25 06:46:00", 
        "title": "Detroit says \"Recession? What Recession\"?", 
        "userID": "3678131"
    }, 
    {
        "content": "The sports team usually pays an event and/or facility fee for games, too. Generally the stadium is an independent entity, though often connected to city government, that charges everyone, including the sports teams, a fee to hold events there. That fee covers stadium construction loans/bond issues, electric bills, and staff salaries. I've coordinated events in a lot of large venues, and you'd be surprised at the amount of money these things need to run a single event.", 
        "intTime": 20090425, 
        "postID": 5, 
        "quote": "", 
        "reply": "The sports team usually pays an event and/or facility fee for games, too. Generally the stadium is an independent entity, though often connected to city government, that charges everyone, including the sports teams, a fee to hold events there. That fee covers stadium construction loans/bond issues, electric bills, and staff salaries. I've coordinated events in a lot of large venues, and you'd be surprised at the amount of money these things need to run a single event.", 
        "threadID": "672198221_4560037122001", 
        "time": "2009-04-25 06:53:00", 
        "title": "Detroit says \"Recession? What Recession\"?", 
        "userID": "Bleah"
    }, 
    {
        "content": "quote: That might depend, I know for the Jaguars, tax payers put up a large sum of the money to rebuild the stadium. So while they may not 'own' the team, they do have a financial stake in the team and stadium. Every city has a financial stake in sports teams, professional, semi-pro, college, maybe even further down for small towns. I still don't see what St. Louis's or Detroit's or any other city's problems has to do with the signing of athletes. If anything, the Lions spending money on a QB is better for the city; if they win. People would be willing to buy tickets to watch a winner, which puts money into the city's coffers in the way of taxes. It helps local restaurants and hotels, which puts more tax dollars in the city's pockets. But, no matter who the Lions sign, that money does not come out of city funds. The TV blackout rule is an NFL owners/NFLPA/network agreement and has nothing to do with the cities.", 
        "intTime": 20090425, 
        "postID": 6, 
        "quote": "That might depend, I know for the Jaguars, tax payers put up a large sum of the money to rebuild the stadium. So while they may not 'own' the team, they do have a financial stake in the team and stadium.", 
        "reply": " Every city has a financial stake in sports teams, professional, semi-pro, college, maybe even further down for small towns. I still don't see what St. Louis's or Detroit's or any other city's problems has to do with the signing of athletes. If anything, the Lions spending money on a QB is better for the city; if they win. People would be willing to buy tickets to watch a winner, which puts money into the city's coffers in the way of taxes. It helps local restaurants and hotels, which puts more tax dollars in the city's pockets. But, no matter who the Lions sign, that money does not come out of city funds. The TV blackout rule is an NFL owners/NFLPA/network agreement and has nothing to do with the cities.", 
        "threadID": "672198221_4560037122001", 
        "time": "2009-04-25 07:31:00", 
        "title": "Detroit says \"Recession? What Recession\"?", 
        "userID": "PSimon572"
    }, 
    {
        "content": "PSimon572; quote: Every city has a financial stake in sports teams, professional, semi-pro, college, maybe even further down for small towns. I still don't see what St. Louis's or Detroit's or any other city's problems has to do with the signing of athletes. If anything, the Lions spending money on a QB is better for the city; if they win. People would be willing to buy tickets to watch a winner, which puts money into the city's coffers in the way of taxes. It helps local restaurants and hotels, which puts more tax dollars in the city's pockets. But, no matter who the Lions sign, that money does not come out of city funds. The TV blackout rule is an NFL owners/NFLPA/network agreement and has nothing to do with the cities. I understand that, it comes in part from ticket sales, but it's not going to be helpful if the people can't afford to pay for the tickets to go see them play.", 
        "intTime": 20090426, 
        "postID": 7, 
        "quote": "Every city has a financial stake in sports teams, professional, semi-pro, college, maybe even further down for small towns. I still don't see what St. Louis's or Detroit's or any other city's problems has to do with the signing of athletes. If anything, the Lions spending money on a QB is better for the city; if they win. People would be willing to buy tickets to watch a winner, which puts money into the city's coffers in the way of taxes. It helps local restaurants and hotels, which puts more tax dollars in the city's pockets. But, no matter who the Lions sign, that money does not come out of city funds. The TV blackout rule is an NFL owners/NFLPA/network agreement and has nothing to do with the cities.", 
        "reply": "PSimon572;  I understand that, it comes in part from ticket sales, but it's not going to be helpful if the people can't afford to pay for the tickets to go see them play.", 
        "threadID": "672198221_4560037122001", 
        "time": "2009-04-26 19:38:00", 
        "title": "Detroit says \"Recession? What Recession\"?", 
        "userID": "3678131"
    }
]