[
    {
        "content": "12 arrested in 'very serious' terror plot in UK (CNN) -- British police Wednesday arrested 12 people in a counterterrorism operation, and locations were being searched, authorities said. Arrests were carried out in a series of raids in northwest England, police said. Participating agencies included Merseyside Police, Greater Manchester Police and the Lancashire Constabulary, according to a statement from Greater Manchester Police. The men arrested were involved in a \"very serious\" plot closely associated with al Qaeda and escaped al Qaeda operative Rashid Rauf, whom British intelligence have linked to the 2006 plot to blow up trans-Atlantic airliners, according to a security source with knowledge of the investigation. Full report at > >http://www.cnn.com/2009/WORLD/europe/04/08/uk.terror.arrests/index.html", 
        "intTime": 20090408, 
        "postID": 1, 
        "quote": "", 
        "reply": "12 arrested in 'very serious' terror plot in UK (CNN) -- British police Wednesday arrested 12 people in a counterterrorism operation, and locations were being searched, authorities said. Arrests were carried out in a series of raids in northwest England, police said. Participating agencies included Merseyside Police, Greater Manchester Police and the Lancashire Constabulary, according to a statement from Greater Manchester Police. The men arrested were involved in a \"very serious\" plot closely associated with al Qaeda and escaped al Qaeda operative Rashid Rauf, whom British intelligence have linked to the 2006 plot to blow up trans-Atlantic airliners, according to a security source with knowledge of the investigation. Full report at > >http://www.cnn.com/2009/WORLD/europe/04/08/uk.terror.arrests/index.html", 
        "threadID": "672198221_1110032022001", 
        "time": "2009-04-08 20:08:00", 
        "title": "12 arrested in 'very serious' terror plot in UK", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "I wonder if they had any collaboration from any U.S. agencies in busted this plot. Details will come out later, then again we may never know.", 
        "intTime": 20090410, 
        "postID": 2, 
        "quote": "", 
        "reply": "I wonder if they had any collaboration from any U.S. agencies in busted this plot. Details will come out later, then again we may never know.", 
        "threadID": "672198221_1110032022001", 
        "time": "2009-04-10 13:19:00", 
        "title": "12 arrested in 'very serious' terror plot in UK", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "Brits Rock!!! GG Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090410, 
        "postID": 3, 
        "quote": "", 
        "reply": "Brits Rock!!! GG Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_1110032022001", 
        "time": "2009-04-10 13:28:00", 
        "title": "12 arrested in 'very serious' terror plot in UK", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: Brits Rock!!! GG Noo they screwed up they had to act quicky after some moron showed papers of the whole opt to the media when he got out of his car. There lucky these guys didn't make a dash to mainland Europe.", 
        "intTime": 20090410, 
        "postID": 4, 
        "quote": "Originally posted by L0A1: Brits Rock!!! GG", 
        "reply": " Noo they screwed up they had to act quicky after some moron showed papers of the whole opt to the media when he got out of his car. There lucky these guys didn't make a dash to mainland Europe.", 
        "threadID": "672198221_1110032022001", 
        "time": "2009-04-10 13:34:00", 
        "title": "12 arrested in 'very serious' terror plot in UK", 
        "userID": "world_king377"
    }, 
    {
        "content": "quote: Originally posted by world_king377: quote: Originally posted by L0A1: Brits Rock!!! GG Noo they screwed up they had to act quicky after some moron showed papers of the whole opt to the media when he got out of his car. There lucky these guys didn't make a dash to mainland Europe. I am giving them credit for the take down, it may have een sloppy, lesson learned, but you accomplished the mission. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090410, 
        "postID": 5, 
        "quote": "Originally posted by world_king377: quote: Originally posted by L0A1: Brits Rock!!! GG Noo they screwed up they had to act quicky after some moron showed papers of the whole opt to the media when he got out of his car. There lucky these guys didn't make a dash to mainland Europe.", 
        "reply": " I am giving them credit for the take down, it may have een sloppy, lesson learned, but you accomplished the mission. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_1110032022001", 
        "time": "2009-04-10 13:37:00", 
        "title": "12 arrested in 'very serious' terror plot in UK", 
        "userID": "L0A1"
    }, 
    {
        "content": "Just because they say its serious doesn't mean crap....", 
        "intTime": 20090410, 
        "postID": 6, 
        "quote": "", 
        "reply": "Just because they say its serious doesn't mean crap....", 
        "threadID": "672198221_1110032022001", 
        "time": "2009-04-10 14:22:00", 
        "title": "12 arrested in 'very serious' terror plot in UK", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: Just because they say its serious doesn't mean crap.... I agree. The British have dispensed with what we Americans consider elementary safeguards. Now they have to justify this suspension of basic rights. Nothing like announcing a big arrest to get the public terrified. Dave", 
        "intTime": 20090410, 
        "postID": 7, 
        "quote": "Originally posted by Irwin_R_Schyster: Just because they say its serious doesn't mean crap....", 
        "reply": " I agree. The British have dispensed with what we Americans consider elementary safeguards. Now they have to justify this suspension of basic rights. Nothing like announcing a big arrest to get the public terrified. Dave", 
        "threadID": "672198221_1110032022001", 
        "time": "2009-04-10 14:30:00", 
        "title": "12 arrested in 'very serious' terror plot in UK", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by world_king377: quote: Originally posted by L0A1: Brits Rock!!! GG Noo they screwed up they had to act quicky after some moron showed papers of the whole opt to the media when he got out of his car. There lucky these guys didn't make a dash to mainland Europe. I am giving them credit for the take down, it may have een sloppy, lesson learned, but you accomplished the mission. but still its lucky but you got to admit how many were there really that decided they need to make a run for it.", 
        "intTime": 20090410, 
        "postID": 8, 
        "quote": "Originally posted by L0A1: quote: Originally posted by world_king377: quote: Originally posted by L0A1: Brits Rock!!! GG Noo they screwed up they had to act quicky after some moron showed papers of the whole opt to the media when he got out of his car. There lucky these guys didn't make a dash to mainland Europe. I am giving them credit for the take down, it may have een sloppy, lesson learned, but you accomplished the mission.", 
        "reply": " but still its lucky but you got to admit how many were there really that decided they need to make a run for it.", 
        "threadID": "672198221_1110032022001", 
        "time": "2009-04-10 14:37:00", 
        "title": "12 arrested in 'very serious' terror plot in UK", 
        "userID": "world_king377"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by Irwin_R_Schyster: Just because they say its serious doesn't mean crap.... I agree. The British have dispensed with what we Americans consider elementary safeguards. Now they have to justify this suspension of basic rights. Nothing like announcing a big arrest to get the public terrified. Dave Agreed. I didn't buy that story about the \"Highly ranked and powerfully placed\" intel official who \"accidentally\" exposed a covert plan to move on terrorists in Britian... Sounds like a bunch of crap to me...", 
        "intTime": 20090410, 
        "postID": 9, 
        "quote": "Originally posted by Grachus: quote: Originally posted by Irwin_R_Schyster: Just because they say its serious doesn't mean crap.... I agree. The British have dispensed with what we Americans consider elementary safeguards. Now they have to justify this suspension of basic rights. Nothing like announcing a big arrest to get the public terrified. Dave", 
        "reply": " Agreed. I didn't buy that story about the \"Highly ranked and powerfully placed\" intel official who \"accidentally\" exposed a covert plan to move on terrorists in Britian... Sounds like a bunch of crap to me...", 
        "threadID": "672198221_1110032022001", 
        "time": "2009-04-10 15:40:00", 
        "title": "12 arrested in 'very serious' terror plot in UK", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: Agreed. I didn't buy that story about the \"Highly ranked and powerfully placed\" intel official who \"accidentally\" exposed a covert plan to move on terrorists in Britian... Sounds like a bunch of crap to me... Police chief quits over blunder Britain's top counter-terrorism officer has quit after admitting he could have jeopardised an operation to thwart a possible UK al-Qaeda terror plot. Assistant Commissioner Bob Quick resigned after he accidently revealed a secret document to photographers. Police were forced to bring their operation forward and arrested 12 men - 11 of whom are Pakistanis. Gordon Brown said Mr Quick had said sorry for what went wrong and he had thanked him for his long service. >http://news.bbc.co.uk/2/hi/uk_news/7991307.stm", 
        "intTime": 20090411, 
        "postID": 10, 
        "quote": "Originally posted by Irwin_R_Schyster: Agreed. I didn't buy that story about the \"Highly ranked and powerfully placed\" intel official who \"accidentally\" exposed a covert plan to move on terrorists in Britian... Sounds like a bunch of crap to me...", 
        "reply": " Police chief quits over blunder Britain's top counter-terrorism officer has quit after admitting he could have jeopardised an operation to thwart a possible UK al-Qaeda terror plot. Assistant Commissioner Bob Quick resigned after he accidently revealed a secret document to photographers. Police were forced to bring their operation forward and arrested 12 men - 11 of whom are Pakistanis. Gordon Brown said Mr Quick had said sorry for what went wrong and he had thanked him for his long service. >http://news.bbc.co.uk/2/hi/uk_news/7991307.stm", 
        "threadID": "672198221_1110032022001", 
        "time": "2009-04-11 10:38:00", 
        "title": "12 arrested in 'very serious' terror plot in UK", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "quote: Now they have to justify this suspension of basic rights. Nothing like announcing a big arrest to get the public terrified. Where did that come from? Not being a smarta$$ just don't get where your comming from on this. Who's rights have been suspended? If they didn't announce arrests there would be a claim of keeping secrets or hiding something or that they weren't doing anything. I'm not sure how this would terrify anyone either. Makes most people happy. Not to mention the neighbors that saw it would still be going \"what the heck was that all about\".", 
        "intTime": 20090411, 
        "postID": 11, 
        "quote": "Now they have to justify this suspension of basic rights. Nothing like announcing a big arrest to get the public terrified.", 
        "reply": " Where did that come from? Not being a smarta$$ just don't get where your comming from on this. Who's rights have been suspended? If they didn't announce arrests there would be a claim of keeping secrets or hiding something or that they weren't doing anything. I'm not sure how this would terrify anyone either. Makes most people happy. Not to mention the neighbors that saw it would still be going \"what the heck was that all about\".", 
        "threadID": "672198221_1110032022001", 
        "time": "2009-04-11 11:01:00", 
        "title": "12 arrested in 'very serious' terror plot in UK", 
        "userID": "101MPRAT"
    }, 
    {
        "content": "quote: Originally posted by IHAWKER: quote: Originally posted by Irwin_R_Schyster: Agreed. I didn't buy that story about the \"Highly ranked and powerfully placed\" intel official who \"accidentally\" exposed a covert plan to move on terrorists in Britian... Sounds like a bunch of crap to me... Police chief quits over blunder Britain's top counter-terrorism officer has quit after admitting he could have jeopardised an operation to thwart a possible UK al-Qaeda terror plot. Assistant Commissioner Bob Quick resigned after he accidently revealed a secret document to photographers. Police were forced to bring their operation forward and arrested 12 men - 11 of whom are Pakistanis. Gordon Brown said Mr Quick had said sorry for what went wrong and he had thanked him for his long service. >http://news.bbc.co.uk/2/hi/uk_news/7991307.stm Since 2005, England has introduced a series of Police State laws that we Americans who battle to save the Constitution can hardly imagine. Mind you, this is the \"home\" of Magna Carta. So in todays England, you can be imprisoned for ten years, if you take a photograph, or collect information which \"could be useful to terrorists.\" What exactely does that mean? You can be arrested for a parking ticket, if the officer chooses to do so, and your DNA will then be taken. At the moment, over 7 percent of Brits have their DNA on file. You have a right to take photographs anywhere, unless the local cop deems you are in some manner a menace. All undefined. How can the above laws be justified to a free people? So in this case we are discussing, the Police arrested a bunch of people - And they have announced that they seized important evidence - Photographs of public places. So far, that's all the \"proof\" they have given the public. Strangely enough, you can get the same photographs and MORE, merely by going to Google Earth. This case stinks. Within a few months, the Brits will introduce more laws, and pretty soon we wont be forced to listen to embarrasing stories about law enforecment and their brutality/incompetence. Such stories will be deemed a menace to the country... Dave", 
        "intTime": 20090411, 
        "postID": 12, 
        "quote": "Originally posted by IHAWKER: quote: Originally posted by Irwin_R_Schyster: Agreed. I didn't buy that story about the \"Highly ranked and powerfully placed\" intel official who \"accidentally\" exposed a covert plan to move on terrorists in Britian... Sounds like a bunch of crap to me... Police chief quits over blunder Britain's top counter-terrorism officer has quit after admitting he could have jeopardised an operation to thwart a possible UK al-Qaeda terror plot. Assistant Commissioner Bob Quick resigned after he accidently revealed a secret document to photographers. Police were forced to bring their operation forward and arrested 12 men - 11 of whom are Pakistanis. Gordon Brown said Mr Quick had said sorry for what went wrong and he had thanked him for his long service. >http://news.bbc.co.uk/2/hi/uk_news/7991307.stm", 
        "reply": " Since 2005, England has introduced a series of Police State laws that we Americans who battle to save the Constitution can hardly imagine. Mind you, this is the \"home\" of Magna Carta. So in todays England, you can be imprisoned for ten years, if you take a photograph, or collect information which \"could be useful to terrorists.\" What exactely does that mean? You can be arrested for a parking ticket, if the officer chooses to do so, and your DNA will then be taken. At the moment, over 7 percent of Brits have their DNA on file. You have a right to take photographs anywhere, unless the local cop deems you are in some manner a menace. All undefined. How can the above laws be justified to a free people? So in this case we are discussing, the Police arrested a bunch of people - And they have announced that they seized important evidence - Photographs of public places. So far, that's all the \"proof\" they have given the public. Strangely enough, you can get the same photographs and MORE, merely by going to Google Earth. This case stinks. Within a few months, the Brits will introduce more laws, and pretty soon we wont be forced to listen to embarrasing stories about law enforecment and their brutality/incompetence. Such stories will be deemed a menace to the country... Dave", 
        "threadID": "672198221_1110032022001", 
        "time": "2009-04-11 11:07:00", 
        "title": "12 arrested in 'very serious' terror plot in UK", 
        "userID": "Grachus"
    }, 
    {
        "content": "Fortunately the innocence or guilt of a person is tried in a court and not in the media. The proof being provided to the public should only be done in court. Most of the media and public see one of many pieces of a case and assume to know all. Based on what has been released there are alot of ASS U M(E)tions going on.", 
        "intTime": 20090411, 
        "postID": 13, 
        "quote": "", 
        "reply": "Fortunately the innocence or guilt of a person is tried in a court and not in the media. The proof being provided to the public should only be done in court. Most of the media and public see one of many pieces of a case and assume to know all. Based on what has been released there are alot of ASS U M(E)tions going on.", 
        "threadID": "672198221_1110032022001", 
        "time": "2009-04-11 11:23:00", 
        "title": "12 arrested in 'very serious' terror plot in UK", 
        "userID": "101MPRAT"
    }, 
    {
        "content": "All 12 were freed to-day. >http://www.reuters.com/article/latestCrisis/idUSLM586762 Some more of that waterboard quality 'intel' at work? But, hey, to the paranoid among us, their liberty is no indication that they weren't planning to demolish civilization, it's just an indicator that the 'right' methods weren't used to make them confess.", 
        "intTime": 20090422, 
        "postID": 14, 
        "quote": "", 
        "reply": "All 12 were freed to-day. >http://www.reuters.com/article/latestCrisis/idUSLM586762 Some more of that waterboard quality 'intel' at work? But, hey, to the paranoid among us, their liberty is no indication that they weren't planning to demolish civilization, it's just an indicator that the 'right' methods weren't used to make them confess.", 
        "threadID": "672198221_1110032022001", 
        "time": "2009-04-22 07:05:00", 
        "title": "12 arrested in 'very serious' terror plot in UK", 
        "userID": "popsiq"
    }, 
    {
        "content": "quote: Originally posted by popsiq: All 12 were freed to-day. >http://www.reuters.com/article/latestCrisis/idUSLM586762 Some more of that waterboard quality 'intel' at work? But, hey, to the paranoid among us, their liberty is no indication that they weren't planning to demolish civilization, it's just an indicator that the 'right' methods weren't used to make them confess. Yup, and all those \"dramatic stories\" that Murdochs paper the Times ran, about evidence that the Police couldn't release yet, turned out to be as bogus as a three dollar bill. And Brown trumpeting that an \"imminent attack was thwarted\" turned out to be a fairy tale. Not a damn thing on these guys Dave", 
        "intTime": 20090422, 
        "postID": 15, 
        "quote": "Originally posted by popsiq: All 12 were freed to-day. >http://www.reuters.com/article/latestCrisis/idUSLM586762 Some more of that waterboard quality 'intel' at work? But, hey, to the paranoid among us, their liberty is no indication that they weren't planning to demolish civilization, it's just an indicator that the 'right' methods weren't used to make them confess.", 
        "reply": " Yup, and all those \"dramatic stories\" that Murdochs paper the Times ran, about evidence that the Police couldn't release yet, turned out to be as bogus as a three dollar bill. And Brown trumpeting that an \"imminent attack was thwarted\" turned out to be a fairy tale. Not a damn thing on these guys Dave", 
        "threadID": "672198221_1110032022001", 
        "time": "2009-04-22 09:42:00", 
        "title": "12 arrested in 'very serious' terror plot in UK", 
        "userID": "Grachus"
    }
]