[
    {
        "content": "\"\"http://news.yahoo.com/s/ap/20090510/ap_on_go_pr_wh/us_cheney_2\"\" A shock-jock and junkie over that of the honorable General? Figures . Just goes to prove the party's radical-right-wing is condemning the once great party to a future of insignificance and continued failure. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090510, 
        "postID": 1, 
        "quote": "", 
        "reply": "\"\"http://news.yahoo.com/s/ap/20090510/ap_on_go_pr_wh/us_cheney_2\"\" A shock-jock and junkie over that of the honorable General? Figures . Just goes to prove the party's radical-right-wing is condemning the once great party to a future of insignificance and continued failure. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 10:26:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "jack_flats"
    }, 
    {
        "content": "If you saw the interview, Cheney pointed out that since Powell endorsed Obama he felt Powell is already in the process of leaving the GOP. Would you choose someone already leaving any organization as the future of that organization?", 
        "intTime": 20090510, 
        "postID": 2, 
        "quote": "", 
        "reply": "If you saw the interview, Cheney pointed out that since Powell endorsed Obama he felt Powell is already in the process of leaving the GOP. Would you choose someone already leaving any organization as the future of that organization?", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 11:48:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "iamgonzo"
    }, 
    {
        "content": "Gee, Powell goes and shills for the Opposition, and a Radio Commentator & a Former VP make there opinion known of it. Was Powell supposed to be welcomed with open arms after his perfidy? Frankly I think there was 1 Reason Powell supported 0bama, and that was his Race.(dont like my opinion, go see the sky pilot for a Tango Sierra slip) As for the Honorable General, Funny how when it was rumored that Lieutenant General Petreaus might run for office your silica problem got all out of joint. You judge a man by their actions. Limpbaugh, I cant stand, he's a Hypocrite. But, you Democrats must be infatuated with him for the amount of time you allocate to his every pronouncement. Frankly, he's a Pompous Azz. Powell, close to the General Election kicks McCain in the Ballz with an 11th Hour backstab. That tells me he sucks as an honorable Man.", 
        "intTime": 20090510, 
        "postID": 3, 
        "quote": "", 
        "reply": "Gee, Powell goes and shills for the Opposition, and a Radio Commentator & a Former VP make there opinion known of it. Was Powell supposed to be welcomed with open arms after his perfidy? Frankly I think there was 1 Reason Powell supported 0bama, and that was his Race.(dont like my opinion, go see the sky pilot for a Tango Sierra slip) As for the Honorable General, Funny how when it was rumored that Lieutenant General Petreaus might run for office your silica problem got all out of joint. You judge a man by their actions. Limpbaugh, I cant stand, he's a Hypocrite. But, you Democrats must be infatuated with him for the amount of time you allocate to his every pronouncement. Frankly, he's a Pompous Azz. Powell, close to the General Election kicks McCain in the Ballz with an 11th Hour backstab. That tells me he sucks as an honorable Man.", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 12:22:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "quote: Originally posted by iamgonzo: If you saw the interview, Cheney pointed out that since Powell endorsed Obama he felt Powell is already in the process of leaving the GOP. Would you choose someone already leaving any organization as the future of that organization? Powel of course refers to himself as a Republican. And like others in the Party, decided to support Obama in THIS race. Cheney, who is a personal hater of Powerl, knows all of this as well. His remarks in the interview, that he thought Powel had quit the party, were to say the least BS. Now when he was asked who he would choose in a choice of Limbaugh vs Powel, he could have easily avoided an answer. He CHOOSE to endorse Limbaugh, over Powel. Now I have always disagreed with Powel on many questions, it's never occured to me to doubt his integrity. I would choose him over any number of Democrats, simply BECAUSE he's a man of integrity. Limbaugh has all the integrity of a rat sitting in a pile of rotten cheese. Knock yourselves out rallying around Cheney. His remarks speak for themselves. Dave", 
        "intTime": 20090510, 
        "postID": 4, 
        "quote": "Originally posted by iamgonzo: If you saw the interview, Cheney pointed out that since Powell endorsed Obama he felt Powell is already in the process of leaving the GOP. Would you choose someone already leaving any organization as the future of that organization?", 
        "reply": " Powel of course refers to himself as a Republican. And like others in the Party, decided to support Obama in THIS race. Cheney, who is a personal hater of Powerl, knows all of this as well. His remarks in the interview, that he thought Powel had quit the party, were to say the least BS. Now when he was asked who he would choose in a choice of Limbaugh vs Powel, he could have easily avoided an answer. He CHOOSE to endorse Limbaugh, over Powel. Now I have always disagreed with Powel on many questions, it's never occured to me to doubt his integrity. I would choose him over any number of Democrats, simply BECAUSE he's a man of integrity. Limbaugh has all the integrity of a rat sitting in a pile of rotten cheese. Knock yourselves out rallying around Cheney. His remarks speak for themselves. Dave", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 12:53:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "Grachus"
    }, 
    {
        "content": "RE: the title of this thread. This surprises anyone ... why, exactly???", 
        "intTime": 20090510, 
        "postID": 5, 
        "quote": "", 
        "reply": "RE: the title of this thread. This surprises anyone ... why, exactly???", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 12:59:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "Cider33_Alpha"
    }, 
    {
        "content": "quote: Originally posted by iamgonzo: If you saw the interview, Cheney pointed out that since Powell endorsed Obama he felt Powell is already in the process of leaving the GOP. Would you choose someone already leaving any organization as the future of that organization? Powell is in the GOP for the long haul. He and many others like him plan to change it from what it has become, a radical right-wing cult not unlike the radical left-wing cult's of the 1960's, and bring it back to prominence as a party of reason and control. God Bless General Powell. I'm sure he will succeed. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090510, 
        "postID": 6, 
        "quote": "Originally posted by iamgonzo: If you saw the interview, Cheney pointed out that since Powell endorsed Obama he felt Powell is already in the process of leaving the GOP. Would you choose someone already leaving any organization as the future of that organization?", 
        "reply": " Powell is in the GOP for the long haul. He and many others like him plan to change it from what it has become, a radical right-wing cult not unlike the radical left-wing cult's of the 1960's, and bring it back to prominence as a party of reason and control. God Bless General Powell. I'm sure he will succeed. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 15:07:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "jack_flats"
    }, 
    {
        "content": "hmm. didn't see there was already another thread started over this. From another post, on a different thread: Of course. CHENEY'S TWISTED LOGIC: favor the fat pill-popping drug addict who glosses over your SPECTACULAR failures \"for the good of the party.\" vilify the 4 star, 35 yr veteran who built a career working \"for the good of the country\" because he endorsed Obama and voted his conscience Maybe the problem with the GOP is that it's veering dangerously rightward when the entire country has signaled a desire to get on with it's bipartisan business. Alarms should be going off when well respected, long time Republican moderates like Colin Powell and Arlen Specter start finding themselves crowded out of the tent.", 
        "intTime": 20090510, 
        "postID": 7, 
        "quote": "", 
        "reply": "hmm. didn't see there was already another thread started over this. From another post, on a different thread: Of course. CHENEY'S TWISTED LOGIC: favor the fat pill-popping drug addict who glosses over your SPECTACULAR failures \"for the good of the party.\" vilify the 4 star, 35 yr veteran who built a career working \"for the good of the country\" because he endorsed Obama and voted his conscience Maybe the problem with the GOP is that it's veering dangerously rightward when the entire country has signaled a desire to get on with it's bipartisan business. Alarms should be going off when well respected, long time Republican moderates like Colin Powell and Arlen Specter start finding themselves crowded out of the tent.", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 16:41:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "Frank_A_Valdez"
    }, 
    {
        "content": "Gee, your right, Cheney should have favored the Back Stabbing Powell. Because Loyalty to your friends is everything? Were to Believe that Kerry Sticking up for Sanders was about Loyalty and friendship But when it's Powell and McCain, the Powells knife came out and Huzzah, it's Conscience........ Honestly, I think Powells a scumbag now, simple as that.", 
        "intTime": 20090510, 
        "postID": 8, 
        "quote": "", 
        "reply": "Gee, your right, Cheney should have favored the Back Stabbing Powell. Because Loyalty to your friends is everything? Were to Believe that Kerry Sticking up for Sanders was about Loyalty and friendship But when it's Powell and McCain, the Powells knife came out and Huzzah, it's Conscience........ Honestly, I think Powells a scumbag now, simple as that.", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 16:47:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: Powell is in the GOP for the long haul. He and many others like him plan to change it from what it has become, a radical right-wing cult not unlike the radical left-wing cult's of the 1960's, and bring it back to prominence as a party of reason and control. God Bless General Powell. I'm sure he will succeed. Nope, sorry his days in the Republican Party are over. Now he can change the Democrat Party back from the home of left wingnuts and Neo-Marxists (like yourself) that it currently is, to it's formerly great past as the home of the center moderates.", 
        "intTime": 20090510, 
        "postID": 9, 
        "quote": "Originally posted by jack_flats: Powell is in the GOP for the long haul. He and many others like him plan to change it from what it has become, a radical right-wing cult not unlike the radical left-wing cult's of the 1960's, and bring it back to prominence as a party of reason and control. God Bless General Powell. I'm sure he will succeed.", 
        "reply": " Nope, sorry his days in the Republican Party are over. Now he can change the Democrat Party back from the home of left wingnuts and Neo-Marxists (like yourself) that it currently is, to it's formerly great past as the home of the center moderates.", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 16:58:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "shuman14"
    }, 
    {
        "content": "quote: Alarms should be going off when well respected, long time Republican moderates like Colin Powell and Arlen Specter start finding themselves crowded out of the tent. Alarms, no, more like fireworks when you hit a homerun at Wrigley Feild. Hope they take MexiCain with them next and Snowe, she can go too.", 
        "intTime": 20090510, 
        "postID": 10, 
        "quote": "Alarms should be going off when well respected, long time Republican moderates like Colin Powell and Arlen Specter start finding themselves crowded out of the tent.", 
        "reply": " Alarms, no, more like fireworks when you hit a homerun at Wrigley Feild. Hope they take MexiCain with them next and Snowe, she can go too.", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 17:02:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "shuman14"
    }, 
    {
        "content": "GREAT IDEA! I admire the kind of politician who puts their butt on the line for the good of the country, even as the stark raving idealogues in their own party are howling for blood. McCain, Snowe, Specter, Powell. We'll take them all. Even if we don't agree 100%, I can admire the guts it takes to stand up for the good of your country. Good riddance to the GOP. When they crown Limbaugh, Palin, and Cheney as their saviors, they're committing themselves to political irrelevance.", 
        "intTime": 20090510, 
        "postID": 11, 
        "quote": "", 
        "reply": "GREAT IDEA! I admire the kind of politician who puts their butt on the line for the good of the country, even as the stark raving idealogues in their own party are howling for blood. McCain, Snowe, Specter, Powell. We'll take them all. Even if we don't agree 100%, I can admire the guts it takes to stand up for the good of your country. Good riddance to the GOP. When they crown Limbaugh, Palin, and Cheney as their saviors, they're committing themselves to political irrelevance.", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 17:27:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "Frank_A_Valdez"
    }, 
    {
        "content": "quote: Originally posted by LineDoggie: Gee, your right, Cheney should have favored the Back Stabbing Powell. Because Loyalty to your friends is everything? Were to Believe that Kerry Sticking up for Sanders was about Loyalty and friendship But when it's Powell and McCain, the Powells knife came out and Huzzah, it's Conscience........ Honestly, I think Powells a scumbag now, simple as that. In my opinion in reading your posts on this thread, it becomes clear that you simply can't imagine someone thinking that the Nation needed a change. That anyone who voted for Obama, and especially a Republican who voted for Obama, did so more or less from ulterior or twisted motives. So you can dismiss someone who served our nation so well as a \"scumbag,\" just because rightly or wrongly, he didn't vote your way. That's a terrible picture of yourself that you're holding up for everyone to see. A lot of hate goes into creating such an attitude, where automatically people are scum for opposing your views. Dave", 
        "intTime": 20090510, 
        "postID": 12, 
        "quote": "Originally posted by LineDoggie: Gee, your right, Cheney should have favored the Back Stabbing Powell. Because Loyalty to your friends is everything? Were to Believe that Kerry Sticking up for Sanders was about Loyalty and friendship But when it's Powell and McCain, the Powells knife came out and Huzzah, it's Conscience........ Honestly, I think Powells a scumbag now, simple as that.", 
        "reply": " In my opinion in reading your posts on this thread, it becomes clear that you simply can't imagine someone thinking that the Nation needed a change. That anyone who voted for Obama, and especially a Republican who voted for Obama, did so more or less from ulterior or twisted motives. So you can dismiss someone who served our nation so well as a \"scumbag,\" just because rightly or wrongly, he didn't vote your way. That's a terrible picture of yourself that you're holding up for everyone to see. A lot of hate goes into creating such an attitude, where automatically people are scum for opposing your views. Dave", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 17:31:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Frank_A_Valdez: GREAT IDEA! I admire the kind of politician who puts their butt on the line for the good of the country, even as the stark raving idealogues in their own party are howling for blood. McCain, Snowe, Specter, Powell. We'll take them all. Even if we don't agree 100%, I can admire the guts it takes to stand up for the good of your country. Good riddance to the GOP. When they crown Limbaugh, Palin, and Cheney as their saviors, they're committing themselves to political irrelevance. If, that's IF, the Obama bail out plan and economic recovery package tanks and people get fed up with it, the next set of elections will tell the tale... The American people, for lack of a better term, are \"fickle\" when it comes who they place in office... There is an old saying in D.C., \"If you want a friend in D.C., buy a dog!\"... LOL Respectfully, SUNLINER81", 
        "intTime": 20090510, 
        "postID": 13, 
        "quote": "Originally posted by Frank_A_Valdez: GREAT IDEA! I admire the kind of politician who puts their butt on the line for the good of the country, even as the stark raving idealogues in their own party are howling for blood. McCain, Snowe, Specter, Powell. We'll take them all. Even if we don't agree 100%, I can admire the guts it takes to stand up for the good of your country. Good riddance to the GOP. When they crown Limbaugh, Palin, and Cheney as their saviors, they're committing themselves to political irrelevance.", 
        "reply": " If, that's IF, the Obama bail out plan and economic recovery package tanks and people get fed up with it, the next set of elections will tell the tale... The American people, for lack of a better term, are \"fickle\" when it comes who they place in office... There is an old saying in D.C., \"If you want a friend in D.C., buy a dog!\"... LOL Respectfully, SUNLINER81", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 17:36:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "I'm not sure I get your point Sunliner81. Are you saying the GOP is betting on failure? And even worse, maybe digging in their heels at every opportunity and doing their best to make sure the Obama administration fails so they can score political points? That's ghastly . That's an even more d-amning critique of the GOP than the one I put forth. It literally makes me sick to my stomach.", 
        "intTime": 20090510, 
        "postID": 14, 
        "quote": "", 
        "reply": "I'm not sure I get your point Sunliner81. Are you saying the GOP is betting on failure? And even worse, maybe digging in their heels at every opportunity and doing their best to make sure the Obama administration fails so they can score political points? That's ghastly . That's an even more d-amning critique of the GOP than the one I put forth. It literally makes me sick to my stomach.", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 17:48:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "Frank_A_Valdez"
    }, 
    {
        "content": "quote: Originally posted by Frank_A_Valdez: I'm not sure I get your point Sunliner81. Are you saying the GOP is betting on failure? And even worse, maybe digging in their heels at every opportunity and doing their best to make sure the Obama administration fails so they can score political points? That's ghastly . That's an even more d-amning critique of the GOP than the one I put forth. It literally makes me sick to my stomach. That's partly it plus, the American electorate is totally fickle... Hero today and goat tomorrow... Respectfully, SUNLINER81", 
        "intTime": 20090510, 
        "postID": 15, 
        "quote": "Originally posted by Frank_A_Valdez: I'm not sure I get your point Sunliner81. Are you saying the GOP is betting on failure? And even worse, maybe digging in their heels at every opportunity and doing their best to make sure the Obama administration fails so they can score political points? That's ghastly . That's an even more d-amning critique of the GOP than the one I put forth. It literally makes me sick to my stomach.", 
        "reply": " That's partly it plus, the American electorate is totally fickle... Hero today and goat tomorrow... Respectfully, SUNLINER81", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 19:32:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by shuman14: quote: Originally posted by jack_flats: Powell is in the GOP for the long haul. He and many others like him plan to change it from what it has become, a radical right-wing cult not unlike the radical left-wing cult's of the 1960's, and bring it back to prominence as a party of reason and control. God Bless General Powell. I'm sure he will succeed. Nope, sorry his days in the Republican Party are over. Now he can change the Democrat Party back from the home of left wingnuts and Neo-Marxists (like yourself) that it currently is, to it's formerly great past as the home of the center moderates. Well at least Cheney can still fire-up the base...all 21% of the population. Ops...my bad. It's 21% that identify themselves as Republicans, the BASE would be much smaller.", 
        "intTime": 20090510, 
        "postID": 16, 
        "quote": "Originally posted by shuman14: quote: Originally posted by jack_flats: Powell is in the GOP for the long haul. He and many others like him plan to change it from what it has become, a radical right-wing cult not unlike the radical left-wing cult's of the 1960's, and bring it back to prominence as a party of reason and control. God Bless General Powell. I'm sure he will succeed. Nope, sorry his days in the Republican Party are over. Now he can change the Democrat Party back from the home of left wingnuts and Neo-Marxists (like yourself) that it currently is, to it's formerly great past as the home of the center moderates.", 
        "reply": " Well at least Cheney can still fire-up the base...all 21% of the population. Ops...my bad. It's 21% that identify themselves as Republicans, the BASE would be much smaller.", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 19:35:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by Frank_A_Valdez: When they crown Limbaugh, Palin, and Cheney as their saviors, they're committing themselves to political irrelevance. They already are irrelevant, the voters made sure of that, but they just can't seem to accept the fact they have to change. The future of the GOP lies in Gen. Powell types and in the Meghan McCain's of the Party. These people are in it for the long haul, and they WILL prevail. Trust me, they will prevail over the Cheney's and Limbaugh's of the Party. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090510, 
        "postID": 17, 
        "quote": "Originally posted by Frank_A_Valdez: When they crown Limbaugh, Palin, and Cheney as their saviors, they're committing themselves to political irrelevance.", 
        "reply": " They already are irrelevant, the voters made sure of that, but they just can't seem to accept the fact they have to change. The future of the GOP lies in Gen. Powell types and in the Meghan McCain's of the Party. These people are in it for the long haul, and they WILL prevail. Trust me, they will prevail over the Cheney's and Limbaugh's of the Party. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 20:16:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by iamgonzo: If you saw the interview, Cheney pointed out that since Powell endorsed Obama he felt Powell is already in the process of leaving the GOP. Would you choose someone already leaving any organization as the future of that organization? Powel of course refers to himself as a Republican. And like others in the Party, decided to support Obama in THIS race. Cheney, who is a personal hater of Powerl, knows all of this as well. His remarks in the interview, that he thought Powel had quit the party, were to say the least BS. Now when he was asked who he would choose in a choice of Limbaugh vs Powel, he could have easily avoided an answer. He CHOOSE to endorse Limbaugh, over Powel. Now I have always disagreed with Powel on many questions, it's never occured to me to doubt his integrity. I would choose him over any number of Democrats, simply BECAUSE he's a man of integrity. Limbaugh has all the integrity of a rat sitting in a pile of rotten cheese. Knock yourselves out rallying around Cheney. His remarks speak for themselves. Dave Refering to oneself as a Republican and being a Republican are two different things. The public endorsement of Obama is a slap in the face of the Republican party. Powell could have easily avoided an answer. He CHOOSE to endorse Obama over McCain. My opinion of Limbaugh is not a great one either, but he does occasionally provide some great comedic remarks. I think of him as an entertainer more than the political powerhouse he has somehow become.", 
        "intTime": 20090510, 
        "postID": 18, 
        "quote": "Originally posted by Grachus: quote: Originally posted by iamgonzo: If you saw the interview, Cheney pointed out that since Powell endorsed Obama he felt Powell is already in the process of leaving the GOP. Would you choose someone already leaving any organization as the future of that organization? Powel of course refers to himself as a Republican. And like others in the Party, decided to support Obama in THIS race. Cheney, who is a personal hater of Powerl, knows all of this as well. His remarks in the interview, that he thought Powel had quit the party, were to say the least BS. Now when he was asked who he would choose in a choice of Limbaugh vs Powel, he could have easily avoided an answer. He CHOOSE to endorse Limbaugh, over Powel. Now I have always disagreed with Powel on many questions, it's never occured to me to doubt his integrity. I would choose him over any number of Democrats, simply BECAUSE he's a man of integrity. Limbaugh has all the integrity of a rat sitting in a pile of rotten cheese. Knock yourselves out rallying around Cheney. His remarks speak for themselves. Dave", 
        "reply": " Refering to oneself as a Republican and being a Republican are two different things. The public endorsement of Obama is a slap in the face of the Republican party. Powell could have easily avoided an answer. He CHOOSE to endorse Obama over McCain. My opinion of Limbaugh is not a great one either, but he does occasionally provide some great comedic remarks. I think of him as an entertainer more than the political powerhouse he has somehow become.", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 21:43:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "iamgonzo"
    }, 
    {
        "content": "quote: Originally posted by Frank_A_Valdez: hmm. didn't see there was already another thread started over this. From another post, on a different thread: Of course. CHENEY'S TWISTED LOGIC: favor the fat pill-popping drug addict who glosses over your SPECTACULAR failures \"for the good of the party.\" vilify the 4 star, 35 yr veteran who built a career working \"for the good of the country\" because he endorsed Obama and voted his conscience Maybe the problem with the GOP is that it's veering dangerously rightward when the entire country has signaled a desire to get on with it's bipartisan business. Alarms should be going off when well respected, long time Republican moderates like Colin Powell and Arlen Specter start finding themselves crowded out of the tent. How did he vilify Gen. Powell?", 
        "intTime": 20090510, 
        "postID": 19, 
        "quote": "Originally posted by Frank_A_Valdez: hmm. didn't see there was already another thread started over this. From another post, on a different thread: Of course. CHENEY'S TWISTED LOGIC: favor the fat pill-popping drug addict who glosses over your SPECTACULAR failures \"for the good of the party.\" vilify the 4 star, 35 yr veteran who built a career working \"for the good of the country\" because he endorsed Obama and voted his conscience Maybe the problem with the GOP is that it's veering dangerously rightward when the entire country has signaled a desire to get on with it's bipartisan business. Alarms should be going off when well respected, long time Republican moderates like Colin Powell and Arlen Specter start finding themselves crowded out of the tent.", 
        "reply": " How did he vilify Gen. Powell?", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 21:46:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "iamgonzo"
    }, 
    {
        "content": "quote: Gee, Powell goes and shills for the Opposition, and a Radio Commentator & a Former VP make there opinion known of it. I love how you think Powell \"shills\" and Cheney and Rush are merely voicing their opinions and concerns.", 
        "intTime": 20090510, 
        "postID": 20, 
        "quote": "Gee, Powell goes and shills for the Opposition, and a Radio Commentator & a Former VP make there opinion known of it.", 
        "reply": " I love how you think Powell \"shills\" and Cheney and Rush are merely voicing their opinions and concerns.", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 22:16:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "\"\"http://news.yahoo.com/s/ap/20090510/ap_on_go_pr_wh/us_cheney_2\"\" A shock-jock and junkie over that of the honorable General? Figures . Just goes to prove the party's radical-right-wing is condemning the once great party to a future of insignificance and continued failure. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090510, 
        "postID": 21, 
        "quote": "", 
        "reply": "\"\"http://news.yahoo.com/s/ap/20090510/ap_on_go_pr_wh/us_cheney_2\"\" A shock-jock and junkie over that of the honorable General? Figures . Just goes to prove the party's radical-right-wing is condemning the once great party to a future of insignificance and continued failure. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 10:26:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "jack_flats"
    }, 
    {
        "content": "If you saw the interview, Cheney pointed out that since Powell endorsed Obama he felt Powell is already in the process of leaving the GOP. Would you choose someone already leaving any organization as the future of that organization?", 
        "intTime": 20090510, 
        "postID": 22, 
        "quote": "", 
        "reply": "If you saw the interview, Cheney pointed out that since Powell endorsed Obama he felt Powell is already in the process of leaving the GOP. Would you choose someone already leaving any organization as the future of that organization?", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 11:48:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "iamgonzo"
    }, 
    {
        "content": "Gee, Powell goes and shills for the Opposition, and a Radio Commentator & a Former VP make there opinion known of it. Was Powell supposed to be welcomed with open arms after his perfidy? Frankly I think there was 1 Reason Powell supported 0bama, and that was his Race.(dont like my opinion, go see the sky pilot for a Tango Sierra slip) As for the Honorable General, Funny how when it was rumored that Lieutenant General Petreaus might run for office your silica problem got all out of joint. You judge a man by their actions. Limpbaugh, I cant stand, he's a Hypocrite. But, you Democrats must be infatuated with him for the amount of time you allocate to his every pronouncement. Frankly, he's a Pompous Azz. Powell, close to the General Election kicks McCain in the Ballz with an 11th Hour backstab. That tells me he sucks as an honorable Man.", 
        "intTime": 20090510, 
        "postID": 23, 
        "quote": "", 
        "reply": "Gee, Powell goes and shills for the Opposition, and a Radio Commentator & a Former VP make there opinion known of it. Was Powell supposed to be welcomed with open arms after his perfidy? Frankly I think there was 1 Reason Powell supported 0bama, and that was his Race.(dont like my opinion, go see the sky pilot for a Tango Sierra slip) As for the Honorable General, Funny how when it was rumored that Lieutenant General Petreaus might run for office your silica problem got all out of joint. You judge a man by their actions. Limpbaugh, I cant stand, he's a Hypocrite. But, you Democrats must be infatuated with him for the amount of time you allocate to his every pronouncement. Frankly, he's a Pompous Azz. Powell, close to the General Election kicks McCain in the Ballz with an 11th Hour backstab. That tells me he sucks as an honorable Man.", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 12:22:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "quote: Originally posted by iamgonzo: If you saw the interview, Cheney pointed out that since Powell endorsed Obama he felt Powell is already in the process of leaving the GOP. Would you choose someone already leaving any organization as the future of that organization? Powel of course refers to himself as a Republican. And like others in the Party, decided to support Obama in THIS race. Cheney, who is a personal hater of Powerl, knows all of this as well. His remarks in the interview, that he thought Powel had quit the party, were to say the least BS. Now when he was asked who he would choose in a choice of Limbaugh vs Powel, he could have easily avoided an answer. He CHOOSE to endorse Limbaugh, over Powel. Now I have always disagreed with Powel on many questions, it's never occured to me to doubt his integrity. I would choose him over any number of Democrats, simply BECAUSE he's a man of integrity. Limbaugh has all the integrity of a rat sitting in a pile of rotten cheese. Knock yourselves out rallying around Cheney. His remarks speak for themselves. Dave", 
        "intTime": 20090510, 
        "postID": 24, 
        "quote": "Originally posted by iamgonzo: If you saw the interview, Cheney pointed out that since Powell endorsed Obama he felt Powell is already in the process of leaving the GOP. Would you choose someone already leaving any organization as the future of that organization?", 
        "reply": " Powel of course refers to himself as a Republican. And like others in the Party, decided to support Obama in THIS race. Cheney, who is a personal hater of Powerl, knows all of this as well. His remarks in the interview, that he thought Powel had quit the party, were to say the least BS. Now when he was asked who he would choose in a choice of Limbaugh vs Powel, he could have easily avoided an answer. He CHOOSE to endorse Limbaugh, over Powel. Now I have always disagreed with Powel on many questions, it's never occured to me to doubt his integrity. I would choose him over any number of Democrats, simply BECAUSE he's a man of integrity. Limbaugh has all the integrity of a rat sitting in a pile of rotten cheese. Knock yourselves out rallying around Cheney. His remarks speak for themselves. Dave", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 12:53:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "Grachus"
    }, 
    {
        "content": "RE: the title of this thread. This surprises anyone ... why, exactly???", 
        "intTime": 20090510, 
        "postID": 25, 
        "quote": "", 
        "reply": "RE: the title of this thread. This surprises anyone ... why, exactly???", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 12:59:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "Cider33_Alpha"
    }, 
    {
        "content": "quote: Originally posted by iamgonzo: If you saw the interview, Cheney pointed out that since Powell endorsed Obama he felt Powell is already in the process of leaving the GOP. Would you choose someone already leaving any organization as the future of that organization? Powell is in the GOP for the long haul. He and many others like him plan to change it from what it has become, a radical right-wing cult not unlike the radical left-wing cult's of the 1960's, and bring it back to prominence as a party of reason and control. God Bless General Powell. I'm sure he will succeed. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090510, 
        "postID": 26, 
        "quote": "Originally posted by iamgonzo: If you saw the interview, Cheney pointed out that since Powell endorsed Obama he felt Powell is already in the process of leaving the GOP. Would you choose someone already leaving any organization as the future of that organization?", 
        "reply": " Powell is in the GOP for the long haul. He and many others like him plan to change it from what it has become, a radical right-wing cult not unlike the radical left-wing cult's of the 1960's, and bring it back to prominence as a party of reason and control. God Bless General Powell. I'm sure he will succeed. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 15:07:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "jack_flats"
    }, 
    {
        "content": "hmm. didn't see there was already another thread started over this. From another post, on a different thread: Of course. CHENEY'S TWISTED LOGIC: favor the fat pill-popping drug addict who glosses over your SPECTACULAR failures \"for the good of the party.\" vilify the 4 star, 35 yr veteran who built a career working \"for the good of the country\" because he endorsed Obama and voted his conscience Maybe the problem with the GOP is that it's veering dangerously rightward when the entire country has signaled a desire to get on with it's bipartisan business. Alarms should be going off when well respected, long time Republican moderates like Colin Powell and Arlen Specter start finding themselves crowded out of the tent.", 
        "intTime": 20090510, 
        "postID": 27, 
        "quote": "", 
        "reply": "hmm. didn't see there was already another thread started over this. From another post, on a different thread: Of course. CHENEY'S TWISTED LOGIC: favor the fat pill-popping drug addict who glosses over your SPECTACULAR failures \"for the good of the party.\" vilify the 4 star, 35 yr veteran who built a career working \"for the good of the country\" because he endorsed Obama and voted his conscience Maybe the problem with the GOP is that it's veering dangerously rightward when the entire country has signaled a desire to get on with it's bipartisan business. Alarms should be going off when well respected, long time Republican moderates like Colin Powell and Arlen Specter start finding themselves crowded out of the tent.", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 16:41:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "Frank_A_Valdez"
    }, 
    {
        "content": "Gee, your right, Cheney should have favored the Back Stabbing Powell. Because Loyalty to your friends is everything? Were to Believe that Kerry Sticking up for Sanders was about Loyalty and friendship But when it's Powell and McCain, the Powells knife came out and Huzzah, it's Conscience........ Honestly, I think Powells a scumbag now, simple as that.", 
        "intTime": 20090510, 
        "postID": 28, 
        "quote": "", 
        "reply": "Gee, your right, Cheney should have favored the Back Stabbing Powell. Because Loyalty to your friends is everything? Were to Believe that Kerry Sticking up for Sanders was about Loyalty and friendship But when it's Powell and McCain, the Powells knife came out and Huzzah, it's Conscience........ Honestly, I think Powells a scumbag now, simple as that.", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 16:47:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: Powell is in the GOP for the long haul. He and many others like him plan to change it from what it has become, a radical right-wing cult not unlike the radical left-wing cult's of the 1960's, and bring it back to prominence as a party of reason and control. God Bless General Powell. I'm sure he will succeed. Nope, sorry his days in the Republican Party are over. Now he can change the Democrat Party back from the home of left wingnuts and Neo-Marxists (like yourself) that it currently is, to it's formerly great past as the home of the center moderates.", 
        "intTime": 20090510, 
        "postID": 29, 
        "quote": "Originally posted by jack_flats: Powell is in the GOP for the long haul. He and many others like him plan to change it from what it has become, a radical right-wing cult not unlike the radical left-wing cult's of the 1960's, and bring it back to prominence as a party of reason and control. God Bless General Powell. I'm sure he will succeed.", 
        "reply": " Nope, sorry his days in the Republican Party are over. Now he can change the Democrat Party back from the home of left wingnuts and Neo-Marxists (like yourself) that it currently is, to it's formerly great past as the home of the center moderates.", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 16:58:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "shuman14"
    }, 
    {
        "content": "quote: Alarms should be going off when well respected, long time Republican moderates like Colin Powell and Arlen Specter start finding themselves crowded out of the tent. Alarms, no, more like fireworks when you hit a homerun at Wrigley Feild. Hope they take MexiCain with them next and Snowe, she can go too.", 
        "intTime": 20090510, 
        "postID": 30, 
        "quote": "Alarms should be going off when well respected, long time Republican moderates like Colin Powell and Arlen Specter start finding themselves crowded out of the tent.", 
        "reply": " Alarms, no, more like fireworks when you hit a homerun at Wrigley Feild. Hope they take MexiCain with them next and Snowe, she can go too.", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 17:02:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "shuman14"
    }, 
    {
        "content": "GREAT IDEA! I admire the kind of politician who puts their butt on the line for the good of the country, even as the stark raving idealogues in their own party are howling for blood. McCain, Snowe, Specter, Powell. We'll take them all. Even if we don't agree 100%, I can admire the guts it takes to stand up for the good of your country. Good riddance to the GOP. When they crown Limbaugh, Palin, and Cheney as their saviors, they're committing themselves to political irrelevance.", 
        "intTime": 20090510, 
        "postID": 31, 
        "quote": "", 
        "reply": "GREAT IDEA! I admire the kind of politician who puts their butt on the line for the good of the country, even as the stark raving idealogues in their own party are howling for blood. McCain, Snowe, Specter, Powell. We'll take them all. Even if we don't agree 100%, I can admire the guts it takes to stand up for the good of your country. Good riddance to the GOP. When they crown Limbaugh, Palin, and Cheney as their saviors, they're committing themselves to political irrelevance.", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 17:27:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "Frank_A_Valdez"
    }, 
    {
        "content": "quote: Originally posted by LineDoggie: Gee, your right, Cheney should have favored the Back Stabbing Powell. Because Loyalty to your friends is everything? Were to Believe that Kerry Sticking up for Sanders was about Loyalty and friendship But when it's Powell and McCain, the Powells knife came out and Huzzah, it's Conscience........ Honestly, I think Powells a scumbag now, simple as that. In my opinion in reading your posts on this thread, it becomes clear that you simply can't imagine someone thinking that the Nation needed a change. That anyone who voted for Obama, and especially a Republican who voted for Obama, did so more or less from ulterior or twisted motives. So you can dismiss someone who served our nation so well as a \"scumbag,\" just because rightly or wrongly, he didn't vote your way. That's a terrible picture of yourself that you're holding up for everyone to see. A lot of hate goes into creating such an attitude, where automatically people are scum for opposing your views. Dave", 
        "intTime": 20090510, 
        "postID": 32, 
        "quote": "Originally posted by LineDoggie: Gee, your right, Cheney should have favored the Back Stabbing Powell. Because Loyalty to your friends is everything? Were to Believe that Kerry Sticking up for Sanders was about Loyalty and friendship But when it's Powell and McCain, the Powells knife came out and Huzzah, it's Conscience........ Honestly, I think Powells a scumbag now, simple as that.", 
        "reply": " In my opinion in reading your posts on this thread, it becomes clear that you simply can't imagine someone thinking that the Nation needed a change. That anyone who voted for Obama, and especially a Republican who voted for Obama, did so more or less from ulterior or twisted motives. So you can dismiss someone who served our nation so well as a \"scumbag,\" just because rightly or wrongly, he didn't vote your way. That's a terrible picture of yourself that you're holding up for everyone to see. A lot of hate goes into creating such an attitude, where automatically people are scum for opposing your views. Dave", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 17:31:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Frank_A_Valdez: GREAT IDEA! I admire the kind of politician who puts their butt on the line for the good of the country, even as the stark raving idealogues in their own party are howling for blood. McCain, Snowe, Specter, Powell. We'll take them all. Even if we don't agree 100%, I can admire the guts it takes to stand up for the good of your country. Good riddance to the GOP. When they crown Limbaugh, Palin, and Cheney as their saviors, they're committing themselves to political irrelevance. If, that's IF, the Obama bail out plan and economic recovery package tanks and people get fed up with it, the next set of elections will tell the tale... The American people, for lack of a better term, are \"fickle\" when it comes who they place in office... There is an old saying in D.C., \"If you want a friend in D.C., buy a dog!\"... LOL Respectfully, SUNLINER81", 
        "intTime": 20090510, 
        "postID": 33, 
        "quote": "Originally posted by Frank_A_Valdez: GREAT IDEA! I admire the kind of politician who puts their butt on the line for the good of the country, even as the stark raving idealogues in their own party are howling for blood. McCain, Snowe, Specter, Powell. We'll take them all. Even if we don't agree 100%, I can admire the guts it takes to stand up for the good of your country. Good riddance to the GOP. When they crown Limbaugh, Palin, and Cheney as their saviors, they're committing themselves to political irrelevance.", 
        "reply": " If, that's IF, the Obama bail out plan and economic recovery package tanks and people get fed up with it, the next set of elections will tell the tale... The American people, for lack of a better term, are \"fickle\" when it comes who they place in office... There is an old saying in D.C., \"If you want a friend in D.C., buy a dog!\"... LOL Respectfully, SUNLINER81", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 17:36:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "I'm not sure I get your point Sunliner81. Are you saying the GOP is betting on failure? And even worse, maybe digging in their heels at every opportunity and doing their best to make sure the Obama administration fails so they can score political points? That's ghastly . That's an even more d-amning critique of the GOP than the one I put forth. It literally makes me sick to my stomach.", 
        "intTime": 20090510, 
        "postID": 34, 
        "quote": "", 
        "reply": "I'm not sure I get your point Sunliner81. Are you saying the GOP is betting on failure? And even worse, maybe digging in their heels at every opportunity and doing their best to make sure the Obama administration fails so they can score political points? That's ghastly . That's an even more d-amning critique of the GOP than the one I put forth. It literally makes me sick to my stomach.", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 17:48:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "Frank_A_Valdez"
    }, 
    {
        "content": "quote: Originally posted by Frank_A_Valdez: I'm not sure I get your point Sunliner81. Are you saying the GOP is betting on failure? And even worse, maybe digging in their heels at every opportunity and doing their best to make sure the Obama administration fails so they can score political points? That's ghastly . That's an even more d-amning critique of the GOP than the one I put forth. It literally makes me sick to my stomach. That's partly it plus, the American electorate is totally fickle... Hero today and goat tomorrow... Respectfully, SUNLINER81", 
        "intTime": 20090510, 
        "postID": 35, 
        "quote": "Originally posted by Frank_A_Valdez: I'm not sure I get your point Sunliner81. Are you saying the GOP is betting on failure? And even worse, maybe digging in their heels at every opportunity and doing their best to make sure the Obama administration fails so they can score political points? That's ghastly . That's an even more d-amning critique of the GOP than the one I put forth. It literally makes me sick to my stomach.", 
        "reply": " That's partly it plus, the American electorate is totally fickle... Hero today and goat tomorrow... Respectfully, SUNLINER81", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 19:32:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by shuman14: quote: Originally posted by jack_flats: Powell is in the GOP for the long haul. He and many others like him plan to change it from what it has become, a radical right-wing cult not unlike the radical left-wing cult's of the 1960's, and bring it back to prominence as a party of reason and control. God Bless General Powell. I'm sure he will succeed. Nope, sorry his days in the Republican Party are over. Now he can change the Democrat Party back from the home of left wingnuts and Neo-Marxists (like yourself) that it currently is, to it's formerly great past as the home of the center moderates. Well at least Cheney can still fire-up the base...all 21% of the population. Ops...my bad. It's 21% that identify themselves as Republicans, the BASE would be much smaller.", 
        "intTime": 20090510, 
        "postID": 36, 
        "quote": "Originally posted by shuman14: quote: Originally posted by jack_flats: Powell is in the GOP for the long haul. He and many others like him plan to change it from what it has become, a radical right-wing cult not unlike the radical left-wing cult's of the 1960's, and bring it back to prominence as a party of reason and control. God Bless General Powell. I'm sure he will succeed. Nope, sorry his days in the Republican Party are over. Now he can change the Democrat Party back from the home of left wingnuts and Neo-Marxists (like yourself) that it currently is, to it's formerly great past as the home of the center moderates.", 
        "reply": " Well at least Cheney can still fire-up the base...all 21% of the population. Ops...my bad. It's 21% that identify themselves as Republicans, the BASE would be much smaller.", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 19:35:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by Frank_A_Valdez: When they crown Limbaugh, Palin, and Cheney as their saviors, they're committing themselves to political irrelevance. They already are irrelevant, the voters made sure of that, but they just can't seem to accept the fact they have to change. The future of the GOP lies in Gen. Powell types and in the Meghan McCain's of the Party. These people are in it for the long haul, and they WILL prevail. Trust me, they will prevail over the Cheney's and Limbaugh's of the Party. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090510, 
        "postID": 37, 
        "quote": "Originally posted by Frank_A_Valdez: When they crown Limbaugh, Palin, and Cheney as their saviors, they're committing themselves to political irrelevance.", 
        "reply": " They already are irrelevant, the voters made sure of that, but they just can't seem to accept the fact they have to change. The future of the GOP lies in Gen. Powell types and in the Meghan McCain's of the Party. These people are in it for the long haul, and they WILL prevail. Trust me, they will prevail over the Cheney's and Limbaugh's of the Party. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 20:16:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by iamgonzo: If you saw the interview, Cheney pointed out that since Powell endorsed Obama he felt Powell is already in the process of leaving the GOP. Would you choose someone already leaving any organization as the future of that organization? Powel of course refers to himself as a Republican. And like others in the Party, decided to support Obama in THIS race. Cheney, who is a personal hater of Powerl, knows all of this as well. His remarks in the interview, that he thought Powel had quit the party, were to say the least BS. Now when he was asked who he would choose in a choice of Limbaugh vs Powel, he could have easily avoided an answer. He CHOOSE to endorse Limbaugh, over Powel. Now I have always disagreed with Powel on many questions, it's never occured to me to doubt his integrity. I would choose him over any number of Democrats, simply BECAUSE he's a man of integrity. Limbaugh has all the integrity of a rat sitting in a pile of rotten cheese. Knock yourselves out rallying around Cheney. His remarks speak for themselves. Dave Refering to oneself as a Republican and being a Republican are two different things. The public endorsement of Obama is a slap in the face of the Republican party. Powell could have easily avoided an answer. He CHOOSE to endorse Obama over McCain. My opinion of Limbaugh is not a great one either, but he does occasionally provide some great comedic remarks. I think of him as an entertainer more than the political powerhouse he has somehow become.", 
        "intTime": 20090510, 
        "postID": 38, 
        "quote": "Originally posted by Grachus: quote: Originally posted by iamgonzo: If you saw the interview, Cheney pointed out that since Powell endorsed Obama he felt Powell is already in the process of leaving the GOP. Would you choose someone already leaving any organization as the future of that organization? Powel of course refers to himself as a Republican. And like others in the Party, decided to support Obama in THIS race. Cheney, who is a personal hater of Powerl, knows all of this as well. His remarks in the interview, that he thought Powel had quit the party, were to say the least BS. Now when he was asked who he would choose in a choice of Limbaugh vs Powel, he could have easily avoided an answer. He CHOOSE to endorse Limbaugh, over Powel. Now I have always disagreed with Powel on many questions, it's never occured to me to doubt his integrity. I would choose him over any number of Democrats, simply BECAUSE he's a man of integrity. Limbaugh has all the integrity of a rat sitting in a pile of rotten cheese. Knock yourselves out rallying around Cheney. His remarks speak for themselves. Dave", 
        "reply": " Refering to oneself as a Republican and being a Republican are two different things. The public endorsement of Obama is a slap in the face of the Republican party. Powell could have easily avoided an answer. He CHOOSE to endorse Obama over McCain. My opinion of Limbaugh is not a great one either, but he does occasionally provide some great comedic remarks. I think of him as an entertainer more than the political powerhouse he has somehow become.", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 21:43:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "iamgonzo"
    }, 
    {
        "content": "quote: Originally posted by Frank_A_Valdez: hmm. didn't see there was already another thread started over this. From another post, on a different thread: Of course. CHENEY'S TWISTED LOGIC: favor the fat pill-popping drug addict who glosses over your SPECTACULAR failures \"for the good of the party.\" vilify the 4 star, 35 yr veteran who built a career working \"for the good of the country\" because he endorsed Obama and voted his conscience Maybe the problem with the GOP is that it's veering dangerously rightward when the entire country has signaled a desire to get on with it's bipartisan business. Alarms should be going off when well respected, long time Republican moderates like Colin Powell and Arlen Specter start finding themselves crowded out of the tent. How did he vilify Gen. Powell?", 
        "intTime": 20090510, 
        "postID": 39, 
        "quote": "Originally posted by Frank_A_Valdez: hmm. didn't see there was already another thread started over this. From another post, on a different thread: Of course. CHENEY'S TWISTED LOGIC: favor the fat pill-popping drug addict who glosses over your SPECTACULAR failures \"for the good of the party.\" vilify the 4 star, 35 yr veteran who built a career working \"for the good of the country\" because he endorsed Obama and voted his conscience Maybe the problem with the GOP is that it's veering dangerously rightward when the entire country has signaled a desire to get on with it's bipartisan business. Alarms should be going off when well respected, long time Republican moderates like Colin Powell and Arlen Specter start finding themselves crowded out of the tent.", 
        "reply": " How did he vilify Gen. Powell?", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 21:46:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "iamgonzo"
    }, 
    {
        "content": "quote: Gee, Powell goes and shills for the Opposition, and a Radio Commentator & a Former VP make there opinion known of it. I love how you think Powell \"shills\" and Cheney and Rush are merely voicing their opinions and concerns.", 
        "intTime": 20090510, 
        "postID": 40, 
        "quote": "Gee, Powell goes and shills for the Opposition, and a Radio Commentator & a Former VP make there opinion known of it.", 
        "reply": " I love how you think Powell \"shills\" and Cheney and Rush are merely voicing their opinions and concerns.", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 22:16:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "\"\"http://news.yahoo.com/s/ap/20090510/ap_on_go_pr_wh/us_cheney_2\"\" A shock-jock and junkie over that of the honorable General? Figures . Just goes to prove the party's radical-right-wing is condemning the once great party to a future of insignificance and continued failure. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090510, 
        "postID": 41, 
        "quote": "", 
        "reply": "\"\"http://news.yahoo.com/s/ap/20090510/ap_on_go_pr_wh/us_cheney_2\"\" A shock-jock and junkie over that of the honorable General? Figures . Just goes to prove the party's radical-right-wing is condemning the once great party to a future of insignificance and continued failure. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 10:26:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "jack_flats"
    }, 
    {
        "content": "If you saw the interview, Cheney pointed out that since Powell endorsed Obama he felt Powell is already in the process of leaving the GOP. Would you choose someone already leaving any organization as the future of that organization?", 
        "intTime": 20090510, 
        "postID": 42, 
        "quote": "", 
        "reply": "If you saw the interview, Cheney pointed out that since Powell endorsed Obama he felt Powell is already in the process of leaving the GOP. Would you choose someone already leaving any organization as the future of that organization?", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 11:48:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "iamgonzo"
    }, 
    {
        "content": "Gee, Powell goes and shills for the Opposition, and a Radio Commentator & a Former VP make there opinion known of it. Was Powell supposed to be welcomed with open arms after his perfidy? Frankly I think there was 1 Reason Powell supported 0bama, and that was his Race.(dont like my opinion, go see the sky pilot for a Tango Sierra slip) As for the Honorable General, Funny how when it was rumored that Lieutenant General Petreaus might run for office your silica problem got all out of joint. You judge a man by their actions. Limpbaugh, I cant stand, he's a Hypocrite. But, you Democrats must be infatuated with him for the amount of time you allocate to his every pronouncement. Frankly, he's a Pompous Azz. Powell, close to the General Election kicks McCain in the Ballz with an 11th Hour backstab. That tells me he sucks as an honorable Man.", 
        "intTime": 20090510, 
        "postID": 43, 
        "quote": "", 
        "reply": "Gee, Powell goes and shills for the Opposition, and a Radio Commentator & a Former VP make there opinion known of it. Was Powell supposed to be welcomed with open arms after his perfidy? Frankly I think there was 1 Reason Powell supported 0bama, and that was his Race.(dont like my opinion, go see the sky pilot for a Tango Sierra slip) As for the Honorable General, Funny how when it was rumored that Lieutenant General Petreaus might run for office your silica problem got all out of joint. You judge a man by their actions. Limpbaugh, I cant stand, he's a Hypocrite. But, you Democrats must be infatuated with him for the amount of time you allocate to his every pronouncement. Frankly, he's a Pompous Azz. Powell, close to the General Election kicks McCain in the Ballz with an 11th Hour backstab. That tells me he sucks as an honorable Man.", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 12:22:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "quote: Originally posted by iamgonzo: If you saw the interview, Cheney pointed out that since Powell endorsed Obama he felt Powell is already in the process of leaving the GOP. Would you choose someone already leaving any organization as the future of that organization? Powel of course refers to himself as a Republican. And like others in the Party, decided to support Obama in THIS race. Cheney, who is a personal hater of Powerl, knows all of this as well. His remarks in the interview, that he thought Powel had quit the party, were to say the least BS. Now when he was asked who he would choose in a choice of Limbaugh vs Powel, he could have easily avoided an answer. He CHOOSE to endorse Limbaugh, over Powel. Now I have always disagreed with Powel on many questions, it's never occured to me to doubt his integrity. I would choose him over any number of Democrats, simply BECAUSE he's a man of integrity. Limbaugh has all the integrity of a rat sitting in a pile of rotten cheese. Knock yourselves out rallying around Cheney. His remarks speak for themselves. Dave", 
        "intTime": 20090510, 
        "postID": 44, 
        "quote": "Originally posted by iamgonzo: If you saw the interview, Cheney pointed out that since Powell endorsed Obama he felt Powell is already in the process of leaving the GOP. Would you choose someone already leaving any organization as the future of that organization?", 
        "reply": " Powel of course refers to himself as a Republican. And like others in the Party, decided to support Obama in THIS race. Cheney, who is a personal hater of Powerl, knows all of this as well. His remarks in the interview, that he thought Powel had quit the party, were to say the least BS. Now when he was asked who he would choose in a choice of Limbaugh vs Powel, he could have easily avoided an answer. He CHOOSE to endorse Limbaugh, over Powel. Now I have always disagreed with Powel on many questions, it's never occured to me to doubt his integrity. I would choose him over any number of Democrats, simply BECAUSE he's a man of integrity. Limbaugh has all the integrity of a rat sitting in a pile of rotten cheese. Knock yourselves out rallying around Cheney. His remarks speak for themselves. Dave", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 12:53:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "Grachus"
    }, 
    {
        "content": "RE: the title of this thread. This surprises anyone ... why, exactly???", 
        "intTime": 20090510, 
        "postID": 45, 
        "quote": "", 
        "reply": "RE: the title of this thread. This surprises anyone ... why, exactly???", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 12:59:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "Cider33_Alpha"
    }, 
    {
        "content": "quote: Originally posted by iamgonzo: If you saw the interview, Cheney pointed out that since Powell endorsed Obama he felt Powell is already in the process of leaving the GOP. Would you choose someone already leaving any organization as the future of that organization? Powell is in the GOP for the long haul. He and many others like him plan to change it from what it has become, a radical right-wing cult not unlike the radical left-wing cult's of the 1960's, and bring it back to prominence as a party of reason and control. God Bless General Powell. I'm sure he will succeed. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090510, 
        "postID": 46, 
        "quote": "Originally posted by iamgonzo: If you saw the interview, Cheney pointed out that since Powell endorsed Obama he felt Powell is already in the process of leaving the GOP. Would you choose someone already leaving any organization as the future of that organization?", 
        "reply": " Powell is in the GOP for the long haul. He and many others like him plan to change it from what it has become, a radical right-wing cult not unlike the radical left-wing cult's of the 1960's, and bring it back to prominence as a party of reason and control. God Bless General Powell. I'm sure he will succeed. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 15:07:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "jack_flats"
    }, 
    {
        "content": "hmm. didn't see there was already another thread started over this. From another post, on a different thread: Of course. CHENEY'S TWISTED LOGIC: favor the fat pill-popping drug addict who glosses over your SPECTACULAR failures \"for the good of the party.\" vilify the 4 star, 35 yr veteran who built a career working \"for the good of the country\" because he endorsed Obama and voted his conscience Maybe the problem with the GOP is that it's veering dangerously rightward when the entire country has signaled a desire to get on with it's bipartisan business. Alarms should be going off when well respected, long time Republican moderates like Colin Powell and Arlen Specter start finding themselves crowded out of the tent.", 
        "intTime": 20090510, 
        "postID": 47, 
        "quote": "", 
        "reply": "hmm. didn't see there was already another thread started over this. From another post, on a different thread: Of course. CHENEY'S TWISTED LOGIC: favor the fat pill-popping drug addict who glosses over your SPECTACULAR failures \"for the good of the party.\" vilify the 4 star, 35 yr veteran who built a career working \"for the good of the country\" because he endorsed Obama and voted his conscience Maybe the problem with the GOP is that it's veering dangerously rightward when the entire country has signaled a desire to get on with it's bipartisan business. Alarms should be going off when well respected, long time Republican moderates like Colin Powell and Arlen Specter start finding themselves crowded out of the tent.", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 16:41:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "Frank_A_Valdez"
    }, 
    {
        "content": "Gee, your right, Cheney should have favored the Back Stabbing Powell. Because Loyalty to your friends is everything? Were to Believe that Kerry Sticking up for Sanders was about Loyalty and friendship But when it's Powell and McCain, the Powells knife came out and Huzzah, it's Conscience........ Honestly, I think Powells a scumbag now, simple as that.", 
        "intTime": 20090510, 
        "postID": 48, 
        "quote": "", 
        "reply": "Gee, your right, Cheney should have favored the Back Stabbing Powell. Because Loyalty to your friends is everything? Were to Believe that Kerry Sticking up for Sanders was about Loyalty and friendship But when it's Powell and McCain, the Powells knife came out and Huzzah, it's Conscience........ Honestly, I think Powells a scumbag now, simple as that.", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 16:47:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: Powell is in the GOP for the long haul. He and many others like him plan to change it from what it has become, a radical right-wing cult not unlike the radical left-wing cult's of the 1960's, and bring it back to prominence as a party of reason and control. God Bless General Powell. I'm sure he will succeed. Nope, sorry his days in the Republican Party are over. Now he can change the Democrat Party back from the home of left wingnuts and Neo-Marxists (like yourself) that it currently is, to it's formerly great past as the home of the center moderates.", 
        "intTime": 20090510, 
        "postID": 49, 
        "quote": "Originally posted by jack_flats: Powell is in the GOP for the long haul. He and many others like him plan to change it from what it has become, a radical right-wing cult not unlike the radical left-wing cult's of the 1960's, and bring it back to prominence as a party of reason and control. God Bless General Powell. I'm sure he will succeed.", 
        "reply": " Nope, sorry his days in the Republican Party are over. Now he can change the Democrat Party back from the home of left wingnuts and Neo-Marxists (like yourself) that it currently is, to it's formerly great past as the home of the center moderates.", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 16:58:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "shuman14"
    }, 
    {
        "content": "quote: Alarms should be going off when well respected, long time Republican moderates like Colin Powell and Arlen Specter start finding themselves crowded out of the tent. Alarms, no, more like fireworks when you hit a homerun at Wrigley Feild. Hope they take MexiCain with them next and Snowe, she can go too.", 
        "intTime": 20090510, 
        "postID": 50, 
        "quote": "Alarms should be going off when well respected, long time Republican moderates like Colin Powell and Arlen Specter start finding themselves crowded out of the tent.", 
        "reply": " Alarms, no, more like fireworks when you hit a homerun at Wrigley Feild. Hope they take MexiCain with them next and Snowe, she can go too.", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 17:02:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "shuman14"
    }, 
    {
        "content": "GREAT IDEA! I admire the kind of politician who puts their butt on the line for the good of the country, even as the stark raving idealogues in their own party are howling for blood. McCain, Snowe, Specter, Powell. We'll take them all. Even if we don't agree 100%, I can admire the guts it takes to stand up for the good of your country. Good riddance to the GOP. When they crown Limbaugh, Palin, and Cheney as their saviors, they're committing themselves to political irrelevance.", 
        "intTime": 20090510, 
        "postID": 51, 
        "quote": "", 
        "reply": "GREAT IDEA! I admire the kind of politician who puts their butt on the line for the good of the country, even as the stark raving idealogues in their own party are howling for blood. McCain, Snowe, Specter, Powell. We'll take them all. Even if we don't agree 100%, I can admire the guts it takes to stand up for the good of your country. Good riddance to the GOP. When they crown Limbaugh, Palin, and Cheney as their saviors, they're committing themselves to political irrelevance.", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 17:27:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "Frank_A_Valdez"
    }, 
    {
        "content": "quote: Originally posted by LineDoggie: Gee, your right, Cheney should have favored the Back Stabbing Powell. Because Loyalty to your friends is everything? Were to Believe that Kerry Sticking up for Sanders was about Loyalty and friendship But when it's Powell and McCain, the Powells knife came out and Huzzah, it's Conscience........ Honestly, I think Powells a scumbag now, simple as that. In my opinion in reading your posts on this thread, it becomes clear that you simply can't imagine someone thinking that the Nation needed a change. That anyone who voted for Obama, and especially a Republican who voted for Obama, did so more or less from ulterior or twisted motives. So you can dismiss someone who served our nation so well as a \"scumbag,\" just because rightly or wrongly, he didn't vote your way. That's a terrible picture of yourself that you're holding up for everyone to see. A lot of hate goes into creating such an attitude, where automatically people are scum for opposing your views. Dave", 
        "intTime": 20090510, 
        "postID": 52, 
        "quote": "Originally posted by LineDoggie: Gee, your right, Cheney should have favored the Back Stabbing Powell. Because Loyalty to your friends is everything? Were to Believe that Kerry Sticking up for Sanders was about Loyalty and friendship But when it's Powell and McCain, the Powells knife came out and Huzzah, it's Conscience........ Honestly, I think Powells a scumbag now, simple as that.", 
        "reply": " In my opinion in reading your posts on this thread, it becomes clear that you simply can't imagine someone thinking that the Nation needed a change. That anyone who voted for Obama, and especially a Republican who voted for Obama, did so more or less from ulterior or twisted motives. So you can dismiss someone who served our nation so well as a \"scumbag,\" just because rightly or wrongly, he didn't vote your way. That's a terrible picture of yourself that you're holding up for everyone to see. A lot of hate goes into creating such an attitude, where automatically people are scum for opposing your views. Dave", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 17:31:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Frank_A_Valdez: GREAT IDEA! I admire the kind of politician who puts their butt on the line for the good of the country, even as the stark raving idealogues in their own party are howling for blood. McCain, Snowe, Specter, Powell. We'll take them all. Even if we don't agree 100%, I can admire the guts it takes to stand up for the good of your country. Good riddance to the GOP. When they crown Limbaugh, Palin, and Cheney as their saviors, they're committing themselves to political irrelevance. If, that's IF, the Obama bail out plan and economic recovery package tanks and people get fed up with it, the next set of elections will tell the tale... The American people, for lack of a better term, are \"fickle\" when it comes who they place in office... There is an old saying in D.C., \"If you want a friend in D.C., buy a dog!\"... LOL Respectfully, SUNLINER81", 
        "intTime": 20090510, 
        "postID": 53, 
        "quote": "Originally posted by Frank_A_Valdez: GREAT IDEA! I admire the kind of politician who puts their butt on the line for the good of the country, even as the stark raving idealogues in their own party are howling for blood. McCain, Snowe, Specter, Powell. We'll take them all. Even if we don't agree 100%, I can admire the guts it takes to stand up for the good of your country. Good riddance to the GOP. When they crown Limbaugh, Palin, and Cheney as their saviors, they're committing themselves to political irrelevance.", 
        "reply": " If, that's IF, the Obama bail out plan and economic recovery package tanks and people get fed up with it, the next set of elections will tell the tale... The American people, for lack of a better term, are \"fickle\" when it comes who they place in office... There is an old saying in D.C., \"If you want a friend in D.C., buy a dog!\"... LOL Respectfully, SUNLINER81", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 17:36:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "I'm not sure I get your point Sunliner81. Are you saying the GOP is betting on failure? And even worse, maybe digging in their heels at every opportunity and doing their best to make sure the Obama administration fails so they can score political points? That's ghastly . That's an even more d-amning critique of the GOP than the one I put forth. It literally makes me sick to my stomach.", 
        "intTime": 20090510, 
        "postID": 54, 
        "quote": "", 
        "reply": "I'm not sure I get your point Sunliner81. Are you saying the GOP is betting on failure? And even worse, maybe digging in their heels at every opportunity and doing their best to make sure the Obama administration fails so they can score political points? That's ghastly . That's an even more d-amning critique of the GOP than the one I put forth. It literally makes me sick to my stomach.", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 17:48:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "Frank_A_Valdez"
    }, 
    {
        "content": "quote: Originally posted by Frank_A_Valdez: I'm not sure I get your point Sunliner81. Are you saying the GOP is betting on failure? And even worse, maybe digging in their heels at every opportunity and doing their best to make sure the Obama administration fails so they can score political points? That's ghastly . That's an even more d-amning critique of the GOP than the one I put forth. It literally makes me sick to my stomach. That's partly it plus, the American electorate is totally fickle... Hero today and goat tomorrow... Respectfully, SUNLINER81", 
        "intTime": 20090510, 
        "postID": 55, 
        "quote": "Originally posted by Frank_A_Valdez: I'm not sure I get your point Sunliner81. Are you saying the GOP is betting on failure? And even worse, maybe digging in their heels at every opportunity and doing their best to make sure the Obama administration fails so they can score political points? That's ghastly . That's an even more d-amning critique of the GOP than the one I put forth. It literally makes me sick to my stomach.", 
        "reply": " That's partly it plus, the American electorate is totally fickle... Hero today and goat tomorrow... Respectfully, SUNLINER81", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 19:32:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by shuman14: quote: Originally posted by jack_flats: Powell is in the GOP for the long haul. He and many others like him plan to change it from what it has become, a radical right-wing cult not unlike the radical left-wing cult's of the 1960's, and bring it back to prominence as a party of reason and control. God Bless General Powell. I'm sure he will succeed. Nope, sorry his days in the Republican Party are over. Now he can change the Democrat Party back from the home of left wingnuts and Neo-Marxists (like yourself) that it currently is, to it's formerly great past as the home of the center moderates. Well at least Cheney can still fire-up the base...all 21% of the population. Ops...my bad. It's 21% that identify themselves as Republicans, the BASE would be much smaller.", 
        "intTime": 20090510, 
        "postID": 56, 
        "quote": "Originally posted by shuman14: quote: Originally posted by jack_flats: Powell is in the GOP for the long haul. He and many others like him plan to change it from what it has become, a radical right-wing cult not unlike the radical left-wing cult's of the 1960's, and bring it back to prominence as a party of reason and control. God Bless General Powell. I'm sure he will succeed. Nope, sorry his days in the Republican Party are over. Now he can change the Democrat Party back from the home of left wingnuts and Neo-Marxists (like yourself) that it currently is, to it's formerly great past as the home of the center moderates.", 
        "reply": " Well at least Cheney can still fire-up the base...all 21% of the population. Ops...my bad. It's 21% that identify themselves as Republicans, the BASE would be much smaller.", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 19:35:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by Frank_A_Valdez: When they crown Limbaugh, Palin, and Cheney as their saviors, they're committing themselves to political irrelevance. They already are irrelevant, the voters made sure of that, but they just can't seem to accept the fact they have to change. The future of the GOP lies in Gen. Powell types and in the Meghan McCain's of the Party. These people are in it for the long haul, and they WILL prevail. Trust me, they will prevail over the Cheney's and Limbaugh's of the Party. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090510, 
        "postID": 57, 
        "quote": "Originally posted by Frank_A_Valdez: When they crown Limbaugh, Palin, and Cheney as their saviors, they're committing themselves to political irrelevance.", 
        "reply": " They already are irrelevant, the voters made sure of that, but they just can't seem to accept the fact they have to change. The future of the GOP lies in Gen. Powell types and in the Meghan McCain's of the Party. These people are in it for the long haul, and they WILL prevail. Trust me, they will prevail over the Cheney's and Limbaugh's of the Party. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 20:16:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by iamgonzo: If you saw the interview, Cheney pointed out that since Powell endorsed Obama he felt Powell is already in the process of leaving the GOP. Would you choose someone already leaving any organization as the future of that organization? Powel of course refers to himself as a Republican. And like others in the Party, decided to support Obama in THIS race. Cheney, who is a personal hater of Powerl, knows all of this as well. His remarks in the interview, that he thought Powel had quit the party, were to say the least BS. Now when he was asked who he would choose in a choice of Limbaugh vs Powel, he could have easily avoided an answer. He CHOOSE to endorse Limbaugh, over Powel. Now I have always disagreed with Powel on many questions, it's never occured to me to doubt his integrity. I would choose him over any number of Democrats, simply BECAUSE he's a man of integrity. Limbaugh has all the integrity of a rat sitting in a pile of rotten cheese. Knock yourselves out rallying around Cheney. His remarks speak for themselves. Dave Refering to oneself as a Republican and being a Republican are two different things. The public endorsement of Obama is a slap in the face of the Republican party. Powell could have easily avoided an answer. He CHOOSE to endorse Obama over McCain. My opinion of Limbaugh is not a great one either, but he does occasionally provide some great comedic remarks. I think of him as an entertainer more than the political powerhouse he has somehow become.", 
        "intTime": 20090510, 
        "postID": 58, 
        "quote": "Originally posted by Grachus: quote: Originally posted by iamgonzo: If you saw the interview, Cheney pointed out that since Powell endorsed Obama he felt Powell is already in the process of leaving the GOP. Would you choose someone already leaving any organization as the future of that organization? Powel of course refers to himself as a Republican. And like others in the Party, decided to support Obama in THIS race. Cheney, who is a personal hater of Powerl, knows all of this as well. His remarks in the interview, that he thought Powel had quit the party, were to say the least BS. Now when he was asked who he would choose in a choice of Limbaugh vs Powel, he could have easily avoided an answer. He CHOOSE to endorse Limbaugh, over Powel. Now I have always disagreed with Powel on many questions, it's never occured to me to doubt his integrity. I would choose him over any number of Democrats, simply BECAUSE he's a man of integrity. Limbaugh has all the integrity of a rat sitting in a pile of rotten cheese. Knock yourselves out rallying around Cheney. His remarks speak for themselves. Dave", 
        "reply": " Refering to oneself as a Republican and being a Republican are two different things. The public endorsement of Obama is a slap in the face of the Republican party. Powell could have easily avoided an answer. He CHOOSE to endorse Obama over McCain. My opinion of Limbaugh is not a great one either, but he does occasionally provide some great comedic remarks. I think of him as an entertainer more than the political powerhouse he has somehow become.", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 21:43:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "iamgonzo"
    }, 
    {
        "content": "quote: Originally posted by Frank_A_Valdez: hmm. didn't see there was already another thread started over this. From another post, on a different thread: Of course. CHENEY'S TWISTED LOGIC: favor the fat pill-popping drug addict who glosses over your SPECTACULAR failures \"for the good of the party.\" vilify the 4 star, 35 yr veteran who built a career working \"for the good of the country\" because he endorsed Obama and voted his conscience Maybe the problem with the GOP is that it's veering dangerously rightward when the entire country has signaled a desire to get on with it's bipartisan business. Alarms should be going off when well respected, long time Republican moderates like Colin Powell and Arlen Specter start finding themselves crowded out of the tent. How did he vilify Gen. Powell?", 
        "intTime": 20090510, 
        "postID": 59, 
        "quote": "Originally posted by Frank_A_Valdez: hmm. didn't see there was already another thread started over this. From another post, on a different thread: Of course. CHENEY'S TWISTED LOGIC: favor the fat pill-popping drug addict who glosses over your SPECTACULAR failures \"for the good of the party.\" vilify the 4 star, 35 yr veteran who built a career working \"for the good of the country\" because he endorsed Obama and voted his conscience Maybe the problem with the GOP is that it's veering dangerously rightward when the entire country has signaled a desire to get on with it's bipartisan business. Alarms should be going off when well respected, long time Republican moderates like Colin Powell and Arlen Specter start finding themselves crowded out of the tent.", 
        "reply": " How did he vilify Gen. Powell?", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 21:46:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "iamgonzo"
    }, 
    {
        "content": "quote: Gee, Powell goes and shills for the Opposition, and a Radio Commentator & a Former VP make there opinion known of it. I love how you think Powell \"shills\" and Cheney and Rush are merely voicing their opinions and concerns.", 
        "intTime": 20090510, 
        "postID": 60, 
        "quote": "Gee, Powell goes and shills for the Opposition, and a Radio Commentator & a Former VP make there opinion known of it.", 
        "reply": " I love how you think Powell \"shills\" and Cheney and Rush are merely voicing their opinions and concerns.", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 22:16:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "\"\"http://news.yahoo.com/s/ap/20090510/ap_on_go_pr_wh/us_cheney_2\"\" A shock-jock and junkie over that of the honorable General? Figures . Just goes to prove the party's radical-right-wing is condemning the once great party to a future of insignificance and continued failure. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090510, 
        "postID": 61, 
        "quote": "", 
        "reply": "\"\"http://news.yahoo.com/s/ap/20090510/ap_on_go_pr_wh/us_cheney_2\"\" A shock-jock and junkie over that of the honorable General? Figures . Just goes to prove the party's radical-right-wing is condemning the once great party to a future of insignificance and continued failure. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 10:26:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "jack_flats"
    }, 
    {
        "content": "If you saw the interview, Cheney pointed out that since Powell endorsed Obama he felt Powell is already in the process of leaving the GOP. Would you choose someone already leaving any organization as the future of that organization?", 
        "intTime": 20090510, 
        "postID": 62, 
        "quote": "", 
        "reply": "If you saw the interview, Cheney pointed out that since Powell endorsed Obama he felt Powell is already in the process of leaving the GOP. Would you choose someone already leaving any organization as the future of that organization?", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 11:48:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "iamgonzo"
    }, 
    {
        "content": "Gee, Powell goes and shills for the Opposition, and a Radio Commentator & a Former VP make there opinion known of it. Was Powell supposed to be welcomed with open arms after his perfidy? Frankly I think there was 1 Reason Powell supported 0bama, and that was his Race.(dont like my opinion, go see the sky pilot for a Tango Sierra slip) As for the Honorable General, Funny how when it was rumored that Lieutenant General Petreaus might run for office your silica problem got all out of joint. You judge a man by their actions. Limpbaugh, I cant stand, he's a Hypocrite. But, you Democrats must be infatuated with him for the amount of time you allocate to his every pronouncement. Frankly, he's a Pompous Azz. Powell, close to the General Election kicks McCain in the Ballz with an 11th Hour backstab. That tells me he sucks as an honorable Man.", 
        "intTime": 20090510, 
        "postID": 63, 
        "quote": "", 
        "reply": "Gee, Powell goes and shills for the Opposition, and a Radio Commentator & a Former VP make there opinion known of it. Was Powell supposed to be welcomed with open arms after his perfidy? Frankly I think there was 1 Reason Powell supported 0bama, and that was his Race.(dont like my opinion, go see the sky pilot for a Tango Sierra slip) As for the Honorable General, Funny how when it was rumored that Lieutenant General Petreaus might run for office your silica problem got all out of joint. You judge a man by their actions. Limpbaugh, I cant stand, he's a Hypocrite. But, you Democrats must be infatuated with him for the amount of time you allocate to his every pronouncement. Frankly, he's a Pompous Azz. Powell, close to the General Election kicks McCain in the Ballz with an 11th Hour backstab. That tells me he sucks as an honorable Man.", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 12:22:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "quote: Originally posted by iamgonzo: If you saw the interview, Cheney pointed out that since Powell endorsed Obama he felt Powell is already in the process of leaving the GOP. Would you choose someone already leaving any organization as the future of that organization? Powel of course refers to himself as a Republican. And like others in the Party, decided to support Obama in THIS race. Cheney, who is a personal hater of Powerl, knows all of this as well. His remarks in the interview, that he thought Powel had quit the party, were to say the least BS. Now when he was asked who he would choose in a choice of Limbaugh vs Powel, he could have easily avoided an answer. He CHOOSE to endorse Limbaugh, over Powel. Now I have always disagreed with Powel on many questions, it's never occured to me to doubt his integrity. I would choose him over any number of Democrats, simply BECAUSE he's a man of integrity. Limbaugh has all the integrity of a rat sitting in a pile of rotten cheese. Knock yourselves out rallying around Cheney. His remarks speak for themselves. Dave", 
        "intTime": 20090510, 
        "postID": 64, 
        "quote": "Originally posted by iamgonzo: If you saw the interview, Cheney pointed out that since Powell endorsed Obama he felt Powell is already in the process of leaving the GOP. Would you choose someone already leaving any organization as the future of that organization?", 
        "reply": " Powel of course refers to himself as a Republican. And like others in the Party, decided to support Obama in THIS race. Cheney, who is a personal hater of Powerl, knows all of this as well. His remarks in the interview, that he thought Powel had quit the party, were to say the least BS. Now when he was asked who he would choose in a choice of Limbaugh vs Powel, he could have easily avoided an answer. He CHOOSE to endorse Limbaugh, over Powel. Now I have always disagreed with Powel on many questions, it's never occured to me to doubt his integrity. I would choose him over any number of Democrats, simply BECAUSE he's a man of integrity. Limbaugh has all the integrity of a rat sitting in a pile of rotten cheese. Knock yourselves out rallying around Cheney. His remarks speak for themselves. Dave", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 12:53:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "Grachus"
    }, 
    {
        "content": "RE: the title of this thread. This surprises anyone ... why, exactly???", 
        "intTime": 20090510, 
        "postID": 65, 
        "quote": "", 
        "reply": "RE: the title of this thread. This surprises anyone ... why, exactly???", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 12:59:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "Cider33_Alpha"
    }, 
    {
        "content": "quote: Originally posted by iamgonzo: If you saw the interview, Cheney pointed out that since Powell endorsed Obama he felt Powell is already in the process of leaving the GOP. Would you choose someone already leaving any organization as the future of that organization? Powell is in the GOP for the long haul. He and many others like him plan to change it from what it has become, a radical right-wing cult not unlike the radical left-wing cult's of the 1960's, and bring it back to prominence as a party of reason and control. God Bless General Powell. I'm sure he will succeed. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090510, 
        "postID": 66, 
        "quote": "Originally posted by iamgonzo: If you saw the interview, Cheney pointed out that since Powell endorsed Obama he felt Powell is already in the process of leaving the GOP. Would you choose someone already leaving any organization as the future of that organization?", 
        "reply": " Powell is in the GOP for the long haul. He and many others like him plan to change it from what it has become, a radical right-wing cult not unlike the radical left-wing cult's of the 1960's, and bring it back to prominence as a party of reason and control. God Bless General Powell. I'm sure he will succeed. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 15:07:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "jack_flats"
    }, 
    {
        "content": "hmm. didn't see there was already another thread started over this. From another post, on a different thread: Of course. CHENEY'S TWISTED LOGIC: favor the fat pill-popping drug addict who glosses over your SPECTACULAR failures \"for the good of the party.\" vilify the 4 star, 35 yr veteran who built a career working \"for the good of the country\" because he endorsed Obama and voted his conscience Maybe the problem with the GOP is that it's veering dangerously rightward when the entire country has signaled a desire to get on with it's bipartisan business. Alarms should be going off when well respected, long time Republican moderates like Colin Powell and Arlen Specter start finding themselves crowded out of the tent.", 
        "intTime": 20090510, 
        "postID": 67, 
        "quote": "", 
        "reply": "hmm. didn't see there was already another thread started over this. From another post, on a different thread: Of course. CHENEY'S TWISTED LOGIC: favor the fat pill-popping drug addict who glosses over your SPECTACULAR failures \"for the good of the party.\" vilify the 4 star, 35 yr veteran who built a career working \"for the good of the country\" because he endorsed Obama and voted his conscience Maybe the problem with the GOP is that it's veering dangerously rightward when the entire country has signaled a desire to get on with it's bipartisan business. Alarms should be going off when well respected, long time Republican moderates like Colin Powell and Arlen Specter start finding themselves crowded out of the tent.", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 16:41:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "Frank_A_Valdez"
    }, 
    {
        "content": "Gee, your right, Cheney should have favored the Back Stabbing Powell. Because Loyalty to your friends is everything? Were to Believe that Kerry Sticking up for Sanders was about Loyalty and friendship But when it's Powell and McCain, the Powells knife came out and Huzzah, it's Conscience........ Honestly, I think Powells a scumbag now, simple as that.", 
        "intTime": 20090510, 
        "postID": 68, 
        "quote": "", 
        "reply": "Gee, your right, Cheney should have favored the Back Stabbing Powell. Because Loyalty to your friends is everything? Were to Believe that Kerry Sticking up for Sanders was about Loyalty and friendship But when it's Powell and McCain, the Powells knife came out and Huzzah, it's Conscience........ Honestly, I think Powells a scumbag now, simple as that.", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 16:47:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: Powell is in the GOP for the long haul. He and many others like him plan to change it from what it has become, a radical right-wing cult not unlike the radical left-wing cult's of the 1960's, and bring it back to prominence as a party of reason and control. God Bless General Powell. I'm sure he will succeed. Nope, sorry his days in the Republican Party are over. Now he can change the Democrat Party back from the home of left wingnuts and Neo-Marxists (like yourself) that it currently is, to it's formerly great past as the home of the center moderates.", 
        "intTime": 20090510, 
        "postID": 69, 
        "quote": "Originally posted by jack_flats: Powell is in the GOP for the long haul. He and many others like him plan to change it from what it has become, a radical right-wing cult not unlike the radical left-wing cult's of the 1960's, and bring it back to prominence as a party of reason and control. God Bless General Powell. I'm sure he will succeed.", 
        "reply": " Nope, sorry his days in the Republican Party are over. Now he can change the Democrat Party back from the home of left wingnuts and Neo-Marxists (like yourself) that it currently is, to it's formerly great past as the home of the center moderates.", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 16:58:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "shuman14"
    }, 
    {
        "content": "quote: Alarms should be going off when well respected, long time Republican moderates like Colin Powell and Arlen Specter start finding themselves crowded out of the tent. Alarms, no, more like fireworks when you hit a homerun at Wrigley Feild. Hope they take MexiCain with them next and Snowe, she can go too.", 
        "intTime": 20090510, 
        "postID": 70, 
        "quote": "Alarms should be going off when well respected, long time Republican moderates like Colin Powell and Arlen Specter start finding themselves crowded out of the tent.", 
        "reply": " Alarms, no, more like fireworks when you hit a homerun at Wrigley Feild. Hope they take MexiCain with them next and Snowe, she can go too.", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 17:02:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "shuman14"
    }, 
    {
        "content": "GREAT IDEA! I admire the kind of politician who puts their butt on the line for the good of the country, even as the stark raving idealogues in their own party are howling for blood. McCain, Snowe, Specter, Powell. We'll take them all. Even if we don't agree 100%, I can admire the guts it takes to stand up for the good of your country. Good riddance to the GOP. When they crown Limbaugh, Palin, and Cheney as their saviors, they're committing themselves to political irrelevance.", 
        "intTime": 20090510, 
        "postID": 71, 
        "quote": "", 
        "reply": "GREAT IDEA! I admire the kind of politician who puts their butt on the line for the good of the country, even as the stark raving idealogues in their own party are howling for blood. McCain, Snowe, Specter, Powell. We'll take them all. Even if we don't agree 100%, I can admire the guts it takes to stand up for the good of your country. Good riddance to the GOP. When they crown Limbaugh, Palin, and Cheney as their saviors, they're committing themselves to political irrelevance.", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 17:27:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "Frank_A_Valdez"
    }, 
    {
        "content": "quote: Originally posted by LineDoggie: Gee, your right, Cheney should have favored the Back Stabbing Powell. Because Loyalty to your friends is everything? Were to Believe that Kerry Sticking up for Sanders was about Loyalty and friendship But when it's Powell and McCain, the Powells knife came out and Huzzah, it's Conscience........ Honestly, I think Powells a scumbag now, simple as that. In my opinion in reading your posts on this thread, it becomes clear that you simply can't imagine someone thinking that the Nation needed a change. That anyone who voted for Obama, and especially a Republican who voted for Obama, did so more or less from ulterior or twisted motives. So you can dismiss someone who served our nation so well as a \"scumbag,\" just because rightly or wrongly, he didn't vote your way. That's a terrible picture of yourself that you're holding up for everyone to see. A lot of hate goes into creating such an attitude, where automatically people are scum for opposing your views. Dave", 
        "intTime": 20090510, 
        "postID": 72, 
        "quote": "Originally posted by LineDoggie: Gee, your right, Cheney should have favored the Back Stabbing Powell. Because Loyalty to your friends is everything? Were to Believe that Kerry Sticking up for Sanders was about Loyalty and friendship But when it's Powell and McCain, the Powells knife came out and Huzzah, it's Conscience........ Honestly, I think Powells a scumbag now, simple as that.", 
        "reply": " In my opinion in reading your posts on this thread, it becomes clear that you simply can't imagine someone thinking that the Nation needed a change. That anyone who voted for Obama, and especially a Republican who voted for Obama, did so more or less from ulterior or twisted motives. So you can dismiss someone who served our nation so well as a \"scumbag,\" just because rightly or wrongly, he didn't vote your way. That's a terrible picture of yourself that you're holding up for everyone to see. A lot of hate goes into creating such an attitude, where automatically people are scum for opposing your views. Dave", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 17:31:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Frank_A_Valdez: GREAT IDEA! I admire the kind of politician who puts their butt on the line for the good of the country, even as the stark raving idealogues in their own party are howling for blood. McCain, Snowe, Specter, Powell. We'll take them all. Even if we don't agree 100%, I can admire the guts it takes to stand up for the good of your country. Good riddance to the GOP. When they crown Limbaugh, Palin, and Cheney as their saviors, they're committing themselves to political irrelevance. If, that's IF, the Obama bail out plan and economic recovery package tanks and people get fed up with it, the next set of elections will tell the tale... The American people, for lack of a better term, are \"fickle\" when it comes who they place in office... There is an old saying in D.C., \"If you want a friend in D.C., buy a dog!\"... LOL Respectfully, SUNLINER81", 
        "intTime": 20090510, 
        "postID": 73, 
        "quote": "Originally posted by Frank_A_Valdez: GREAT IDEA! I admire the kind of politician who puts their butt on the line for the good of the country, even as the stark raving idealogues in their own party are howling for blood. McCain, Snowe, Specter, Powell. We'll take them all. Even if we don't agree 100%, I can admire the guts it takes to stand up for the good of your country. Good riddance to the GOP. When they crown Limbaugh, Palin, and Cheney as their saviors, they're committing themselves to political irrelevance.", 
        "reply": " If, that's IF, the Obama bail out plan and economic recovery package tanks and people get fed up with it, the next set of elections will tell the tale... The American people, for lack of a better term, are \"fickle\" when it comes who they place in office... There is an old saying in D.C., \"If you want a friend in D.C., buy a dog!\"... LOL Respectfully, SUNLINER81", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 17:36:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "I'm not sure I get your point Sunliner81. Are you saying the GOP is betting on failure? And even worse, maybe digging in their heels at every opportunity and doing their best to make sure the Obama administration fails so they can score political points? That's ghastly . That's an even more d-amning critique of the GOP than the one I put forth. It literally makes me sick to my stomach.", 
        "intTime": 20090510, 
        "postID": 74, 
        "quote": "", 
        "reply": "I'm not sure I get your point Sunliner81. Are you saying the GOP is betting on failure? And even worse, maybe digging in their heels at every opportunity and doing their best to make sure the Obama administration fails so they can score political points? That's ghastly . That's an even more d-amning critique of the GOP than the one I put forth. It literally makes me sick to my stomach.", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 17:48:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "Frank_A_Valdez"
    }, 
    {
        "content": "quote: Originally posted by Frank_A_Valdez: I'm not sure I get your point Sunliner81. Are you saying the GOP is betting on failure? And even worse, maybe digging in their heels at every opportunity and doing their best to make sure the Obama administration fails so they can score political points? That's ghastly . That's an even more d-amning critique of the GOP than the one I put forth. It literally makes me sick to my stomach. That's partly it plus, the American electorate is totally fickle... Hero today and goat tomorrow... Respectfully, SUNLINER81", 
        "intTime": 20090510, 
        "postID": 75, 
        "quote": "Originally posted by Frank_A_Valdez: I'm not sure I get your point Sunliner81. Are you saying the GOP is betting on failure? And even worse, maybe digging in their heels at every opportunity and doing their best to make sure the Obama administration fails so they can score political points? That's ghastly . That's an even more d-amning critique of the GOP than the one I put forth. It literally makes me sick to my stomach.", 
        "reply": " That's partly it plus, the American electorate is totally fickle... Hero today and goat tomorrow... Respectfully, SUNLINER81", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 19:32:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by shuman14: quote: Originally posted by jack_flats: Powell is in the GOP for the long haul. He and many others like him plan to change it from what it has become, a radical right-wing cult not unlike the radical left-wing cult's of the 1960's, and bring it back to prominence as a party of reason and control. God Bless General Powell. I'm sure he will succeed. Nope, sorry his days in the Republican Party are over. Now he can change the Democrat Party back from the home of left wingnuts and Neo-Marxists (like yourself) that it currently is, to it's formerly great past as the home of the center moderates. Well at least Cheney can still fire-up the base...all 21% of the population. Ops...my bad. It's 21% that identify themselves as Republicans, the BASE would be much smaller.", 
        "intTime": 20090510, 
        "postID": 76, 
        "quote": "Originally posted by shuman14: quote: Originally posted by jack_flats: Powell is in the GOP for the long haul. He and many others like him plan to change it from what it has become, a radical right-wing cult not unlike the radical left-wing cult's of the 1960's, and bring it back to prominence as a party of reason and control. God Bless General Powell. I'm sure he will succeed. Nope, sorry his days in the Republican Party are over. Now he can change the Democrat Party back from the home of left wingnuts and Neo-Marxists (like yourself) that it currently is, to it's formerly great past as the home of the center moderates.", 
        "reply": " Well at least Cheney can still fire-up the base...all 21% of the population. Ops...my bad. It's 21% that identify themselves as Republicans, the BASE would be much smaller.", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 19:35:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by Frank_A_Valdez: When they crown Limbaugh, Palin, and Cheney as their saviors, they're committing themselves to political irrelevance. They already are irrelevant, the voters made sure of that, but they just can't seem to accept the fact they have to change. The future of the GOP lies in Gen. Powell types and in the Meghan McCain's of the Party. These people are in it for the long haul, and they WILL prevail. Trust me, they will prevail over the Cheney's and Limbaugh's of the Party. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090510, 
        "postID": 77, 
        "quote": "Originally posted by Frank_A_Valdez: When they crown Limbaugh, Palin, and Cheney as their saviors, they're committing themselves to political irrelevance.", 
        "reply": " They already are irrelevant, the voters made sure of that, but they just can't seem to accept the fact they have to change. The future of the GOP lies in Gen. Powell types and in the Meghan McCain's of the Party. These people are in it for the long haul, and they WILL prevail. Trust me, they will prevail over the Cheney's and Limbaugh's of the Party. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 20:16:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by iamgonzo: If you saw the interview, Cheney pointed out that since Powell endorsed Obama he felt Powell is already in the process of leaving the GOP. Would you choose someone already leaving any organization as the future of that organization? Powel of course refers to himself as a Republican. And like others in the Party, decided to support Obama in THIS race. Cheney, who is a personal hater of Powerl, knows all of this as well. His remarks in the interview, that he thought Powel had quit the party, were to say the least BS. Now when he was asked who he would choose in a choice of Limbaugh vs Powel, he could have easily avoided an answer. He CHOOSE to endorse Limbaugh, over Powel. Now I have always disagreed with Powel on many questions, it's never occured to me to doubt his integrity. I would choose him over any number of Democrats, simply BECAUSE he's a man of integrity. Limbaugh has all the integrity of a rat sitting in a pile of rotten cheese. Knock yourselves out rallying around Cheney. His remarks speak for themselves. Dave Refering to oneself as a Republican and being a Republican are two different things. The public endorsement of Obama is a slap in the face of the Republican party. Powell could have easily avoided an answer. He CHOOSE to endorse Obama over McCain. My opinion of Limbaugh is not a great one either, but he does occasionally provide some great comedic remarks. I think of him as an entertainer more than the political powerhouse he has somehow become.", 
        "intTime": 20090510, 
        "postID": 78, 
        "quote": "Originally posted by Grachus: quote: Originally posted by iamgonzo: If you saw the interview, Cheney pointed out that since Powell endorsed Obama he felt Powell is already in the process of leaving the GOP. Would you choose someone already leaving any organization as the future of that organization? Powel of course refers to himself as a Republican. And like others in the Party, decided to support Obama in THIS race. Cheney, who is a personal hater of Powerl, knows all of this as well. His remarks in the interview, that he thought Powel had quit the party, were to say the least BS. Now when he was asked who he would choose in a choice of Limbaugh vs Powel, he could have easily avoided an answer. He CHOOSE to endorse Limbaugh, over Powel. Now I have always disagreed with Powel on many questions, it's never occured to me to doubt his integrity. I would choose him over any number of Democrats, simply BECAUSE he's a man of integrity. Limbaugh has all the integrity of a rat sitting in a pile of rotten cheese. Knock yourselves out rallying around Cheney. His remarks speak for themselves. Dave", 
        "reply": " Refering to oneself as a Republican and being a Republican are two different things. The public endorsement of Obama is a slap in the face of the Republican party. Powell could have easily avoided an answer. He CHOOSE to endorse Obama over McCain. My opinion of Limbaugh is not a great one either, but he does occasionally provide some great comedic remarks. I think of him as an entertainer more than the political powerhouse he has somehow become.", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 21:43:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "iamgonzo"
    }, 
    {
        "content": "quote: Originally posted by Frank_A_Valdez: hmm. didn't see there was already another thread started over this. From another post, on a different thread: Of course. CHENEY'S TWISTED LOGIC: favor the fat pill-popping drug addict who glosses over your SPECTACULAR failures \"for the good of the party.\" vilify the 4 star, 35 yr veteran who built a career working \"for the good of the country\" because he endorsed Obama and voted his conscience Maybe the problem with the GOP is that it's veering dangerously rightward when the entire country has signaled a desire to get on with it's bipartisan business. Alarms should be going off when well respected, long time Republican moderates like Colin Powell and Arlen Specter start finding themselves crowded out of the tent. How did he vilify Gen. Powell?", 
        "intTime": 20090510, 
        "postID": 79, 
        "quote": "Originally posted by Frank_A_Valdez: hmm. didn't see there was already another thread started over this. From another post, on a different thread: Of course. CHENEY'S TWISTED LOGIC: favor the fat pill-popping drug addict who glosses over your SPECTACULAR failures \"for the good of the party.\" vilify the 4 star, 35 yr veteran who built a career working \"for the good of the country\" because he endorsed Obama and voted his conscience Maybe the problem with the GOP is that it's veering dangerously rightward when the entire country has signaled a desire to get on with it's bipartisan business. Alarms should be going off when well respected, long time Republican moderates like Colin Powell and Arlen Specter start finding themselves crowded out of the tent.", 
        "reply": " How did he vilify Gen. Powell?", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 21:46:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "iamgonzo"
    }, 
    {
        "content": "quote: Gee, Powell goes and shills for the Opposition, and a Radio Commentator & a Former VP make there opinion known of it. I love how you think Powell \"shills\" and Cheney and Rush are merely voicing their opinions and concerns.", 
        "intTime": 20090510, 
        "postID": 80, 
        "quote": "Gee, Powell goes and shills for the Opposition, and a Radio Commentator & a Former VP make there opinion known of it.", 
        "reply": " I love how you think Powell \"shills\" and Cheney and Rush are merely voicing their opinions and concerns.", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 22:16:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "\"\"http://news.yahoo.com/s/ap/20090510/ap_on_go_pr_wh/us_cheney_2\"\" A shock-jock and junkie over that of the honorable General? Figures . Just goes to prove the party's radical-right-wing is condemning the once great party to a future of insignificance and continued failure. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090510, 
        "postID": 81, 
        "quote": "", 
        "reply": "\"\"http://news.yahoo.com/s/ap/20090510/ap_on_go_pr_wh/us_cheney_2\"\" A shock-jock and junkie over that of the honorable General? Figures . Just goes to prove the party's radical-right-wing is condemning the once great party to a future of insignificance and continued failure. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 10:26:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "jack_flats"
    }, 
    {
        "content": "If you saw the interview, Cheney pointed out that since Powell endorsed Obama he felt Powell is already in the process of leaving the GOP. Would you choose someone already leaving any organization as the future of that organization?", 
        "intTime": 20090510, 
        "postID": 82, 
        "quote": "", 
        "reply": "If you saw the interview, Cheney pointed out that since Powell endorsed Obama he felt Powell is already in the process of leaving the GOP. Would you choose someone already leaving any organization as the future of that organization?", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 11:48:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "iamgonzo"
    }, 
    {
        "content": "Gee, Powell goes and shills for the Opposition, and a Radio Commentator & a Former VP make there opinion known of it. Was Powell supposed to be welcomed with open arms after his perfidy? Frankly I think there was 1 Reason Powell supported 0bama, and that was his Race.(dont like my opinion, go see the sky pilot for a Tango Sierra slip) As for the Honorable General, Funny how when it was rumored that Lieutenant General Petreaus might run for office your silica problem got all out of joint. You judge a man by their actions. Limpbaugh, I cant stand, he's a Hypocrite. But, you Democrats must be infatuated with him for the amount of time you allocate to his every pronouncement. Frankly, he's a Pompous Azz. Powell, close to the General Election kicks McCain in the Ballz with an 11th Hour backstab. That tells me he sucks as an honorable Man.", 
        "intTime": 20090510, 
        "postID": 83, 
        "quote": "", 
        "reply": "Gee, Powell goes and shills for the Opposition, and a Radio Commentator & a Former VP make there opinion known of it. Was Powell supposed to be welcomed with open arms after his perfidy? Frankly I think there was 1 Reason Powell supported 0bama, and that was his Race.(dont like my opinion, go see the sky pilot for a Tango Sierra slip) As for the Honorable General, Funny how when it was rumored that Lieutenant General Petreaus might run for office your silica problem got all out of joint. You judge a man by their actions. Limpbaugh, I cant stand, he's a Hypocrite. But, you Democrats must be infatuated with him for the amount of time you allocate to his every pronouncement. Frankly, he's a Pompous Azz. Powell, close to the General Election kicks McCain in the Ballz with an 11th Hour backstab. That tells me he sucks as an honorable Man.", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 12:22:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "quote: Originally posted by iamgonzo: If you saw the interview, Cheney pointed out that since Powell endorsed Obama he felt Powell is already in the process of leaving the GOP. Would you choose someone already leaving any organization as the future of that organization? Powel of course refers to himself as a Republican. And like others in the Party, decided to support Obama in THIS race. Cheney, who is a personal hater of Powerl, knows all of this as well. His remarks in the interview, that he thought Powel had quit the party, were to say the least BS. Now when he was asked who he would choose in a choice of Limbaugh vs Powel, he could have easily avoided an answer. He CHOOSE to endorse Limbaugh, over Powel. Now I have always disagreed with Powel on many questions, it's never occured to me to doubt his integrity. I would choose him over any number of Democrats, simply BECAUSE he's a man of integrity. Limbaugh has all the integrity of a rat sitting in a pile of rotten cheese. Knock yourselves out rallying around Cheney. His remarks speak for themselves. Dave", 
        "intTime": 20090510, 
        "postID": 84, 
        "quote": "Originally posted by iamgonzo: If you saw the interview, Cheney pointed out that since Powell endorsed Obama he felt Powell is already in the process of leaving the GOP. Would you choose someone already leaving any organization as the future of that organization?", 
        "reply": " Powel of course refers to himself as a Republican. And like others in the Party, decided to support Obama in THIS race. Cheney, who is a personal hater of Powerl, knows all of this as well. His remarks in the interview, that he thought Powel had quit the party, were to say the least BS. Now when he was asked who he would choose in a choice of Limbaugh vs Powel, he could have easily avoided an answer. He CHOOSE to endorse Limbaugh, over Powel. Now I have always disagreed with Powel on many questions, it's never occured to me to doubt his integrity. I would choose him over any number of Democrats, simply BECAUSE he's a man of integrity. Limbaugh has all the integrity of a rat sitting in a pile of rotten cheese. Knock yourselves out rallying around Cheney. His remarks speak for themselves. Dave", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 12:53:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "Grachus"
    }, 
    {
        "content": "RE: the title of this thread. This surprises anyone ... why, exactly???", 
        "intTime": 20090510, 
        "postID": 85, 
        "quote": "", 
        "reply": "RE: the title of this thread. This surprises anyone ... why, exactly???", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 12:59:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "Cider33_Alpha"
    }, 
    {
        "content": "quote: Originally posted by iamgonzo: If you saw the interview, Cheney pointed out that since Powell endorsed Obama he felt Powell is already in the process of leaving the GOP. Would you choose someone already leaving any organization as the future of that organization? Powell is in the GOP for the long haul. He and many others like him plan to change it from what it has become, a radical right-wing cult not unlike the radical left-wing cult's of the 1960's, and bring it back to prominence as a party of reason and control. God Bless General Powell. I'm sure he will succeed. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090510, 
        "postID": 86, 
        "quote": "Originally posted by iamgonzo: If you saw the interview, Cheney pointed out that since Powell endorsed Obama he felt Powell is already in the process of leaving the GOP. Would you choose someone already leaving any organization as the future of that organization?", 
        "reply": " Powell is in the GOP for the long haul. He and many others like him plan to change it from what it has become, a radical right-wing cult not unlike the radical left-wing cult's of the 1960's, and bring it back to prominence as a party of reason and control. God Bless General Powell. I'm sure he will succeed. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 15:07:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "jack_flats"
    }, 
    {
        "content": "hmm. didn't see there was already another thread started over this. From another post, on a different thread: Of course. CHENEY'S TWISTED LOGIC: favor the fat pill-popping drug addict who glosses over your SPECTACULAR failures \"for the good of the party.\" vilify the 4 star, 35 yr veteran who built a career working \"for the good of the country\" because he endorsed Obama and voted his conscience Maybe the problem with the GOP is that it's veering dangerously rightward when the entire country has signaled a desire to get on with it's bipartisan business. Alarms should be going off when well respected, long time Republican moderates like Colin Powell and Arlen Specter start finding themselves crowded out of the tent.", 
        "intTime": 20090510, 
        "postID": 87, 
        "quote": "", 
        "reply": "hmm. didn't see there was already another thread started over this. From another post, on a different thread: Of course. CHENEY'S TWISTED LOGIC: favor the fat pill-popping drug addict who glosses over your SPECTACULAR failures \"for the good of the party.\" vilify the 4 star, 35 yr veteran who built a career working \"for the good of the country\" because he endorsed Obama and voted his conscience Maybe the problem with the GOP is that it's veering dangerously rightward when the entire country has signaled a desire to get on with it's bipartisan business. Alarms should be going off when well respected, long time Republican moderates like Colin Powell and Arlen Specter start finding themselves crowded out of the tent.", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 16:41:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "Frank_A_Valdez"
    }, 
    {
        "content": "Gee, your right, Cheney should have favored the Back Stabbing Powell. Because Loyalty to your friends is everything? Were to Believe that Kerry Sticking up for Sanders was about Loyalty and friendship But when it's Powell and McCain, the Powells knife came out and Huzzah, it's Conscience........ Honestly, I think Powells a scumbag now, simple as that.", 
        "intTime": 20090510, 
        "postID": 88, 
        "quote": "", 
        "reply": "Gee, your right, Cheney should have favored the Back Stabbing Powell. Because Loyalty to your friends is everything? Were to Believe that Kerry Sticking up for Sanders was about Loyalty and friendship But when it's Powell and McCain, the Powells knife came out and Huzzah, it's Conscience........ Honestly, I think Powells a scumbag now, simple as that.", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 16:47:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: Powell is in the GOP for the long haul. He and many others like him plan to change it from what it has become, a radical right-wing cult not unlike the radical left-wing cult's of the 1960's, and bring it back to prominence as a party of reason and control. God Bless General Powell. I'm sure he will succeed. Nope, sorry his days in the Republican Party are over. Now he can change the Democrat Party back from the home of left wingnuts and Neo-Marxists (like yourself) that it currently is, to it's formerly great past as the home of the center moderates.", 
        "intTime": 20090510, 
        "postID": 89, 
        "quote": "Originally posted by jack_flats: Powell is in the GOP for the long haul. He and many others like him plan to change it from what it has become, a radical right-wing cult not unlike the radical left-wing cult's of the 1960's, and bring it back to prominence as a party of reason and control. God Bless General Powell. I'm sure he will succeed.", 
        "reply": " Nope, sorry his days in the Republican Party are over. Now he can change the Democrat Party back from the home of left wingnuts and Neo-Marxists (like yourself) that it currently is, to it's formerly great past as the home of the center moderates.", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 16:58:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "shuman14"
    }, 
    {
        "content": "quote: Alarms should be going off when well respected, long time Republican moderates like Colin Powell and Arlen Specter start finding themselves crowded out of the tent. Alarms, no, more like fireworks when you hit a homerun at Wrigley Feild. Hope they take MexiCain with them next and Snowe, she can go too.", 
        "intTime": 20090510, 
        "postID": 90, 
        "quote": "Alarms should be going off when well respected, long time Republican moderates like Colin Powell and Arlen Specter start finding themselves crowded out of the tent.", 
        "reply": " Alarms, no, more like fireworks when you hit a homerun at Wrigley Feild. Hope they take MexiCain with them next and Snowe, she can go too.", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 17:02:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "shuman14"
    }, 
    {
        "content": "GREAT IDEA! I admire the kind of politician who puts their butt on the line for the good of the country, even as the stark raving idealogues in their own party are howling for blood. McCain, Snowe, Specter, Powell. We'll take them all. Even if we don't agree 100%, I can admire the guts it takes to stand up for the good of your country. Good riddance to the GOP. When they crown Limbaugh, Palin, and Cheney as their saviors, they're committing themselves to political irrelevance.", 
        "intTime": 20090510, 
        "postID": 91, 
        "quote": "", 
        "reply": "GREAT IDEA! I admire the kind of politician who puts their butt on the line for the good of the country, even as the stark raving idealogues in their own party are howling for blood. McCain, Snowe, Specter, Powell. We'll take them all. Even if we don't agree 100%, I can admire the guts it takes to stand up for the good of your country. Good riddance to the GOP. When they crown Limbaugh, Palin, and Cheney as their saviors, they're committing themselves to political irrelevance.", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 17:27:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "Frank_A_Valdez"
    }, 
    {
        "content": "quote: Originally posted by LineDoggie: Gee, your right, Cheney should have favored the Back Stabbing Powell. Because Loyalty to your friends is everything? Were to Believe that Kerry Sticking up for Sanders was about Loyalty and friendship But when it's Powell and McCain, the Powells knife came out and Huzzah, it's Conscience........ Honestly, I think Powells a scumbag now, simple as that. In my opinion in reading your posts on this thread, it becomes clear that you simply can't imagine someone thinking that the Nation needed a change. That anyone who voted for Obama, and especially a Republican who voted for Obama, did so more or less from ulterior or twisted motives. So you can dismiss someone who served our nation so well as a \"scumbag,\" just because rightly or wrongly, he didn't vote your way. That's a terrible picture of yourself that you're holding up for everyone to see. A lot of hate goes into creating such an attitude, where automatically people are scum for opposing your views. Dave", 
        "intTime": 20090510, 
        "postID": 92, 
        "quote": "Originally posted by LineDoggie: Gee, your right, Cheney should have favored the Back Stabbing Powell. Because Loyalty to your friends is everything? Were to Believe that Kerry Sticking up for Sanders was about Loyalty and friendship But when it's Powell and McCain, the Powells knife came out and Huzzah, it's Conscience........ Honestly, I think Powells a scumbag now, simple as that.", 
        "reply": " In my opinion in reading your posts on this thread, it becomes clear that you simply can't imagine someone thinking that the Nation needed a change. That anyone who voted for Obama, and especially a Republican who voted for Obama, did so more or less from ulterior or twisted motives. So you can dismiss someone who served our nation so well as a \"scumbag,\" just because rightly or wrongly, he didn't vote your way. That's a terrible picture of yourself that you're holding up for everyone to see. A lot of hate goes into creating such an attitude, where automatically people are scum for opposing your views. Dave", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 17:31:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Frank_A_Valdez: GREAT IDEA! I admire the kind of politician who puts their butt on the line for the good of the country, even as the stark raving idealogues in their own party are howling for blood. McCain, Snowe, Specter, Powell. We'll take them all. Even if we don't agree 100%, I can admire the guts it takes to stand up for the good of your country. Good riddance to the GOP. When they crown Limbaugh, Palin, and Cheney as their saviors, they're committing themselves to political irrelevance. If, that's IF, the Obama bail out plan and economic recovery package tanks and people get fed up with it, the next set of elections will tell the tale... The American people, for lack of a better term, are \"fickle\" when it comes who they place in office... There is an old saying in D.C., \"If you want a friend in D.C., buy a dog!\"... LOL Respectfully, SUNLINER81", 
        "intTime": 20090510, 
        "postID": 93, 
        "quote": "Originally posted by Frank_A_Valdez: GREAT IDEA! I admire the kind of politician who puts their butt on the line for the good of the country, even as the stark raving idealogues in their own party are howling for blood. McCain, Snowe, Specter, Powell. We'll take them all. Even if we don't agree 100%, I can admire the guts it takes to stand up for the good of your country. Good riddance to the GOP. When they crown Limbaugh, Palin, and Cheney as their saviors, they're committing themselves to political irrelevance.", 
        "reply": " If, that's IF, the Obama bail out plan and economic recovery package tanks and people get fed up with it, the next set of elections will tell the tale... The American people, for lack of a better term, are \"fickle\" when it comes who they place in office... There is an old saying in D.C., \"If you want a friend in D.C., buy a dog!\"... LOL Respectfully, SUNLINER81", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 17:36:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "I'm not sure I get your point Sunliner81. Are you saying the GOP is betting on failure? And even worse, maybe digging in their heels at every opportunity and doing their best to make sure the Obama administration fails so they can score political points? That's ghastly . That's an even more d-amning critique of the GOP than the one I put forth. It literally makes me sick to my stomach.", 
        "intTime": 20090510, 
        "postID": 94, 
        "quote": "", 
        "reply": "I'm not sure I get your point Sunliner81. Are you saying the GOP is betting on failure? And even worse, maybe digging in their heels at every opportunity and doing their best to make sure the Obama administration fails so they can score political points? That's ghastly . That's an even more d-amning critique of the GOP than the one I put forth. It literally makes me sick to my stomach.", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 17:48:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "Frank_A_Valdez"
    }, 
    {
        "content": "quote: Originally posted by Frank_A_Valdez: I'm not sure I get your point Sunliner81. Are you saying the GOP is betting on failure? And even worse, maybe digging in their heels at every opportunity and doing their best to make sure the Obama administration fails so they can score political points? That's ghastly . That's an even more d-amning critique of the GOP than the one I put forth. It literally makes me sick to my stomach. That's partly it plus, the American electorate is totally fickle... Hero today and goat tomorrow... Respectfully, SUNLINER81", 
        "intTime": 20090510, 
        "postID": 95, 
        "quote": "Originally posted by Frank_A_Valdez: I'm not sure I get your point Sunliner81. Are you saying the GOP is betting on failure? And even worse, maybe digging in their heels at every opportunity and doing their best to make sure the Obama administration fails so they can score political points? That's ghastly . That's an even more d-amning critique of the GOP than the one I put forth. It literally makes me sick to my stomach.", 
        "reply": " That's partly it plus, the American electorate is totally fickle... Hero today and goat tomorrow... Respectfully, SUNLINER81", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 19:32:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by shuman14: quote: Originally posted by jack_flats: Powell is in the GOP for the long haul. He and many others like him plan to change it from what it has become, a radical right-wing cult not unlike the radical left-wing cult's of the 1960's, and bring it back to prominence as a party of reason and control. God Bless General Powell. I'm sure he will succeed. Nope, sorry his days in the Republican Party are over. Now he can change the Democrat Party back from the home of left wingnuts and Neo-Marxists (like yourself) that it currently is, to it's formerly great past as the home of the center moderates. Well at least Cheney can still fire-up the base...all 21% of the population. Ops...my bad. It's 21% that identify themselves as Republicans, the BASE would be much smaller.", 
        "intTime": 20090510, 
        "postID": 96, 
        "quote": "Originally posted by shuman14: quote: Originally posted by jack_flats: Powell is in the GOP for the long haul. He and many others like him plan to change it from what it has become, a radical right-wing cult not unlike the radical left-wing cult's of the 1960's, and bring it back to prominence as a party of reason and control. God Bless General Powell. I'm sure he will succeed. Nope, sorry his days in the Republican Party are over. Now he can change the Democrat Party back from the home of left wingnuts and Neo-Marxists (like yourself) that it currently is, to it's formerly great past as the home of the center moderates.", 
        "reply": " Well at least Cheney can still fire-up the base...all 21% of the population. Ops...my bad. It's 21% that identify themselves as Republicans, the BASE would be much smaller.", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 19:35:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by Frank_A_Valdez: When they crown Limbaugh, Palin, and Cheney as their saviors, they're committing themselves to political irrelevance. They already are irrelevant, the voters made sure of that, but they just can't seem to accept the fact they have to change. The future of the GOP lies in Gen. Powell types and in the Meghan McCain's of the Party. These people are in it for the long haul, and they WILL prevail. Trust me, they will prevail over the Cheney's and Limbaugh's of the Party. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090510, 
        "postID": 97, 
        "quote": "Originally posted by Frank_A_Valdez: When they crown Limbaugh, Palin, and Cheney as their saviors, they're committing themselves to political irrelevance.", 
        "reply": " They already are irrelevant, the voters made sure of that, but they just can't seem to accept the fact they have to change. The future of the GOP lies in Gen. Powell types and in the Meghan McCain's of the Party. These people are in it for the long haul, and they WILL prevail. Trust me, they will prevail over the Cheney's and Limbaugh's of the Party. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 20:16:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by iamgonzo: If you saw the interview, Cheney pointed out that since Powell endorsed Obama he felt Powell is already in the process of leaving the GOP. Would you choose someone already leaving any organization as the future of that organization? Powel of course refers to himself as a Republican. And like others in the Party, decided to support Obama in THIS race. Cheney, who is a personal hater of Powerl, knows all of this as well. His remarks in the interview, that he thought Powel had quit the party, were to say the least BS. Now when he was asked who he would choose in a choice of Limbaugh vs Powel, he could have easily avoided an answer. He CHOOSE to endorse Limbaugh, over Powel. Now I have always disagreed with Powel on many questions, it's never occured to me to doubt his integrity. I would choose him over any number of Democrats, simply BECAUSE he's a man of integrity. Limbaugh has all the integrity of a rat sitting in a pile of rotten cheese. Knock yourselves out rallying around Cheney. His remarks speak for themselves. Dave Refering to oneself as a Republican and being a Republican are two different things. The public endorsement of Obama is a slap in the face of the Republican party. Powell could have easily avoided an answer. He CHOOSE to endorse Obama over McCain. My opinion of Limbaugh is not a great one either, but he does occasionally provide some great comedic remarks. I think of him as an entertainer more than the political powerhouse he has somehow become.", 
        "intTime": 20090510, 
        "postID": 98, 
        "quote": "Originally posted by Grachus: quote: Originally posted by iamgonzo: If you saw the interview, Cheney pointed out that since Powell endorsed Obama he felt Powell is already in the process of leaving the GOP. Would you choose someone already leaving any organization as the future of that organization? Powel of course refers to himself as a Republican. And like others in the Party, decided to support Obama in THIS race. Cheney, who is a personal hater of Powerl, knows all of this as well. His remarks in the interview, that he thought Powel had quit the party, were to say the least BS. Now when he was asked who he would choose in a choice of Limbaugh vs Powel, he could have easily avoided an answer. He CHOOSE to endorse Limbaugh, over Powel. Now I have always disagreed with Powel on many questions, it's never occured to me to doubt his integrity. I would choose him over any number of Democrats, simply BECAUSE he's a man of integrity. Limbaugh has all the integrity of a rat sitting in a pile of rotten cheese. Knock yourselves out rallying around Cheney. His remarks speak for themselves. Dave", 
        "reply": " Refering to oneself as a Republican and being a Republican are two different things. The public endorsement of Obama is a slap in the face of the Republican party. Powell could have easily avoided an answer. He CHOOSE to endorse Obama over McCain. My opinion of Limbaugh is not a great one either, but he does occasionally provide some great comedic remarks. I think of him as an entertainer more than the political powerhouse he has somehow become.", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 21:43:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "iamgonzo"
    }, 
    {
        "content": "quote: Originally posted by Frank_A_Valdez: hmm. didn't see there was already another thread started over this. From another post, on a different thread: Of course. CHENEY'S TWISTED LOGIC: favor the fat pill-popping drug addict who glosses over your SPECTACULAR failures \"for the good of the party.\" vilify the 4 star, 35 yr veteran who built a career working \"for the good of the country\" because he endorsed Obama and voted his conscience Maybe the problem with the GOP is that it's veering dangerously rightward when the entire country has signaled a desire to get on with it's bipartisan business. Alarms should be going off when well respected, long time Republican moderates like Colin Powell and Arlen Specter start finding themselves crowded out of the tent. How did he vilify Gen. Powell?", 
        "intTime": 20090510, 
        "postID": 99, 
        "quote": "Originally posted by Frank_A_Valdez: hmm. didn't see there was already another thread started over this. From another post, on a different thread: Of course. CHENEY'S TWISTED LOGIC: favor the fat pill-popping drug addict who glosses over your SPECTACULAR failures \"for the good of the party.\" vilify the 4 star, 35 yr veteran who built a career working \"for the good of the country\" because he endorsed Obama and voted his conscience Maybe the problem with the GOP is that it's veering dangerously rightward when the entire country has signaled a desire to get on with it's bipartisan business. Alarms should be going off when well respected, long time Republican moderates like Colin Powell and Arlen Specter start finding themselves crowded out of the tent.", 
        "reply": " How did he vilify Gen. Powell?", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 21:46:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "iamgonzo"
    }, 
    {
        "content": "quote: Gee, Powell goes and shills for the Opposition, and a Radio Commentator & a Former VP make there opinion known of it. I love how you think Powell \"shills\" and Cheney and Rush are merely voicing their opinions and concerns.", 
        "intTime": 20090510, 
        "postID": 100, 
        "quote": "Gee, Powell goes and shills for the Opposition, and a Radio Commentator & a Former VP make there opinion known of it.", 
        "reply": " I love how you think Powell \"shills\" and Cheney and Rush are merely voicing their opinions and concerns.", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 22:16:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "\"\"http://news.yahoo.com/s/ap/20090510/ap_on_go_pr_wh/us_cheney_2\"\" A shock-jock and junkie over that of the honorable General? Figures . Just goes to prove the party's radical-right-wing is condemning the once great party to a future of insignificance and continued failure. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090510, 
        "postID": 101, 
        "quote": "", 
        "reply": "\"\"http://news.yahoo.com/s/ap/20090510/ap_on_go_pr_wh/us_cheney_2\"\" A shock-jock and junkie over that of the honorable General? Figures . Just goes to prove the party's radical-right-wing is condemning the once great party to a future of insignificance and continued failure. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 10:26:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "jack_flats"
    }, 
    {
        "content": "If you saw the interview, Cheney pointed out that since Powell endorsed Obama he felt Powell is already in the process of leaving the GOP. Would you choose someone already leaving any organization as the future of that organization?", 
        "intTime": 20090510, 
        "postID": 102, 
        "quote": "", 
        "reply": "If you saw the interview, Cheney pointed out that since Powell endorsed Obama he felt Powell is already in the process of leaving the GOP. Would you choose someone already leaving any organization as the future of that organization?", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 11:48:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "iamgonzo"
    }, 
    {
        "content": "Gee, Powell goes and shills for the Opposition, and a Radio Commentator & a Former VP make there opinion known of it. Was Powell supposed to be welcomed with open arms after his perfidy? Frankly I think there was 1 Reason Powell supported 0bama, and that was his Race.(dont like my opinion, go see the sky pilot for a Tango Sierra slip) As for the Honorable General, Funny how when it was rumored that Lieutenant General Petreaus might run for office your silica problem got all out of joint. You judge a man by their actions. Limpbaugh, I cant stand, he's a Hypocrite. But, you Democrats must be infatuated with him for the amount of time you allocate to his every pronouncement. Frankly, he's a Pompous Azz. Powell, close to the General Election kicks McCain in the Ballz with an 11th Hour backstab. That tells me he sucks as an honorable Man.", 
        "intTime": 20090510, 
        "postID": 103, 
        "quote": "", 
        "reply": "Gee, Powell goes and shills for the Opposition, and a Radio Commentator & a Former VP make there opinion known of it. Was Powell supposed to be welcomed with open arms after his perfidy? Frankly I think there was 1 Reason Powell supported 0bama, and that was his Race.(dont like my opinion, go see the sky pilot for a Tango Sierra slip) As for the Honorable General, Funny how when it was rumored that Lieutenant General Petreaus might run for office your silica problem got all out of joint. You judge a man by their actions. Limpbaugh, I cant stand, he's a Hypocrite. But, you Democrats must be infatuated with him for the amount of time you allocate to his every pronouncement. Frankly, he's a Pompous Azz. Powell, close to the General Election kicks McCain in the Ballz with an 11th Hour backstab. That tells me he sucks as an honorable Man.", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 12:22:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "quote: Originally posted by iamgonzo: If you saw the interview, Cheney pointed out that since Powell endorsed Obama he felt Powell is already in the process of leaving the GOP. Would you choose someone already leaving any organization as the future of that organization? Powel of course refers to himself as a Republican. And like others in the Party, decided to support Obama in THIS race. Cheney, who is a personal hater of Powerl, knows all of this as well. His remarks in the interview, that he thought Powel had quit the party, were to say the least BS. Now when he was asked who he would choose in a choice of Limbaugh vs Powel, he could have easily avoided an answer. He CHOOSE to endorse Limbaugh, over Powel. Now I have always disagreed with Powel on many questions, it's never occured to me to doubt his integrity. I would choose him over any number of Democrats, simply BECAUSE he's a man of integrity. Limbaugh has all the integrity of a rat sitting in a pile of rotten cheese. Knock yourselves out rallying around Cheney. His remarks speak for themselves. Dave", 
        "intTime": 20090510, 
        "postID": 104, 
        "quote": "Originally posted by iamgonzo: If you saw the interview, Cheney pointed out that since Powell endorsed Obama he felt Powell is already in the process of leaving the GOP. Would you choose someone already leaving any organization as the future of that organization?", 
        "reply": " Powel of course refers to himself as a Republican. And like others in the Party, decided to support Obama in THIS race. Cheney, who is a personal hater of Powerl, knows all of this as well. His remarks in the interview, that he thought Powel had quit the party, were to say the least BS. Now when he was asked who he would choose in a choice of Limbaugh vs Powel, he could have easily avoided an answer. He CHOOSE to endorse Limbaugh, over Powel. Now I have always disagreed with Powel on many questions, it's never occured to me to doubt his integrity. I would choose him over any number of Democrats, simply BECAUSE he's a man of integrity. Limbaugh has all the integrity of a rat sitting in a pile of rotten cheese. Knock yourselves out rallying around Cheney. His remarks speak for themselves. Dave", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 12:53:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "Grachus"
    }, 
    {
        "content": "RE: the title of this thread. This surprises anyone ... why, exactly???", 
        "intTime": 20090510, 
        "postID": 105, 
        "quote": "", 
        "reply": "RE: the title of this thread. This surprises anyone ... why, exactly???", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 12:59:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "Cider33_Alpha"
    }, 
    {
        "content": "quote: Originally posted by iamgonzo: If you saw the interview, Cheney pointed out that since Powell endorsed Obama he felt Powell is already in the process of leaving the GOP. Would you choose someone already leaving any organization as the future of that organization? Powell is in the GOP for the long haul. He and many others like him plan to change it from what it has become, a radical right-wing cult not unlike the radical left-wing cult's of the 1960's, and bring it back to prominence as a party of reason and control. God Bless General Powell. I'm sure he will succeed. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090510, 
        "postID": 106, 
        "quote": "Originally posted by iamgonzo: If you saw the interview, Cheney pointed out that since Powell endorsed Obama he felt Powell is already in the process of leaving the GOP. Would you choose someone already leaving any organization as the future of that organization?", 
        "reply": " Powell is in the GOP for the long haul. He and many others like him plan to change it from what it has become, a radical right-wing cult not unlike the radical left-wing cult's of the 1960's, and bring it back to prominence as a party of reason and control. God Bless General Powell. I'm sure he will succeed. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 15:07:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "jack_flats"
    }, 
    {
        "content": "hmm. didn't see there was already another thread started over this. From another post, on a different thread: Of course. CHENEY'S TWISTED LOGIC: favor the fat pill-popping drug addict who glosses over your SPECTACULAR failures \"for the good of the party.\" vilify the 4 star, 35 yr veteran who built a career working \"for the good of the country\" because he endorsed Obama and voted his conscience Maybe the problem with the GOP is that it's veering dangerously rightward when the entire country has signaled a desire to get on with it's bipartisan business. Alarms should be going off when well respected, long time Republican moderates like Colin Powell and Arlen Specter start finding themselves crowded out of the tent.", 
        "intTime": 20090510, 
        "postID": 107, 
        "quote": "", 
        "reply": "hmm. didn't see there was already another thread started over this. From another post, on a different thread: Of course. CHENEY'S TWISTED LOGIC: favor the fat pill-popping drug addict who glosses over your SPECTACULAR failures \"for the good of the party.\" vilify the 4 star, 35 yr veteran who built a career working \"for the good of the country\" because he endorsed Obama and voted his conscience Maybe the problem with the GOP is that it's veering dangerously rightward when the entire country has signaled a desire to get on with it's bipartisan business. Alarms should be going off when well respected, long time Republican moderates like Colin Powell and Arlen Specter start finding themselves crowded out of the tent.", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 16:41:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "Frank_A_Valdez"
    }, 
    {
        "content": "Gee, your right, Cheney should have favored the Back Stabbing Powell. Because Loyalty to your friends is everything? Were to Believe that Kerry Sticking up for Sanders was about Loyalty and friendship But when it's Powell and McCain, the Powells knife came out and Huzzah, it's Conscience........ Honestly, I think Powells a scumbag now, simple as that.", 
        "intTime": 20090510, 
        "postID": 108, 
        "quote": "", 
        "reply": "Gee, your right, Cheney should have favored the Back Stabbing Powell. Because Loyalty to your friends is everything? Were to Believe that Kerry Sticking up for Sanders was about Loyalty and friendship But when it's Powell and McCain, the Powells knife came out and Huzzah, it's Conscience........ Honestly, I think Powells a scumbag now, simple as that.", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 16:47:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: Powell is in the GOP for the long haul. He and many others like him plan to change it from what it has become, a radical right-wing cult not unlike the radical left-wing cult's of the 1960's, and bring it back to prominence as a party of reason and control. God Bless General Powell. I'm sure he will succeed. Nope, sorry his days in the Republican Party are over. Now he can change the Democrat Party back from the home of left wingnuts and Neo-Marxists (like yourself) that it currently is, to it's formerly great past as the home of the center moderates.", 
        "intTime": 20090510, 
        "postID": 109, 
        "quote": "Originally posted by jack_flats: Powell is in the GOP for the long haul. He and many others like him plan to change it from what it has become, a radical right-wing cult not unlike the radical left-wing cult's of the 1960's, and bring it back to prominence as a party of reason and control. God Bless General Powell. I'm sure he will succeed.", 
        "reply": " Nope, sorry his days in the Republican Party are over. Now he can change the Democrat Party back from the home of left wingnuts and Neo-Marxists (like yourself) that it currently is, to it's formerly great past as the home of the center moderates.", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 16:58:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "shuman14"
    }, 
    {
        "content": "quote: Alarms should be going off when well respected, long time Republican moderates like Colin Powell and Arlen Specter start finding themselves crowded out of the tent. Alarms, no, more like fireworks when you hit a homerun at Wrigley Feild. Hope they take MexiCain with them next and Snowe, she can go too.", 
        "intTime": 20090510, 
        "postID": 110, 
        "quote": "Alarms should be going off when well respected, long time Republican moderates like Colin Powell and Arlen Specter start finding themselves crowded out of the tent.", 
        "reply": " Alarms, no, more like fireworks when you hit a homerun at Wrigley Feild. Hope they take MexiCain with them next and Snowe, she can go too.", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 17:02:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "shuman14"
    }, 
    {
        "content": "GREAT IDEA! I admire the kind of politician who puts their butt on the line for the good of the country, even as the stark raving idealogues in their own party are howling for blood. McCain, Snowe, Specter, Powell. We'll take them all. Even if we don't agree 100%, I can admire the guts it takes to stand up for the good of your country. Good riddance to the GOP. When they crown Limbaugh, Palin, and Cheney as their saviors, they're committing themselves to political irrelevance.", 
        "intTime": 20090510, 
        "postID": 111, 
        "quote": "", 
        "reply": "GREAT IDEA! I admire the kind of politician who puts their butt on the line for the good of the country, even as the stark raving idealogues in their own party are howling for blood. McCain, Snowe, Specter, Powell. We'll take them all. Even if we don't agree 100%, I can admire the guts it takes to stand up for the good of your country. Good riddance to the GOP. When they crown Limbaugh, Palin, and Cheney as their saviors, they're committing themselves to political irrelevance.", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 17:27:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "Frank_A_Valdez"
    }, 
    {
        "content": "quote: Originally posted by LineDoggie: Gee, your right, Cheney should have favored the Back Stabbing Powell. Because Loyalty to your friends is everything? Were to Believe that Kerry Sticking up for Sanders was about Loyalty and friendship But when it's Powell and McCain, the Powells knife came out and Huzzah, it's Conscience........ Honestly, I think Powells a scumbag now, simple as that. In my opinion in reading your posts on this thread, it becomes clear that you simply can't imagine someone thinking that the Nation needed a change. That anyone who voted for Obama, and especially a Republican who voted for Obama, did so more or less from ulterior or twisted motives. So you can dismiss someone who served our nation so well as a \"scumbag,\" just because rightly or wrongly, he didn't vote your way. That's a terrible picture of yourself that you're holding up for everyone to see. A lot of hate goes into creating such an attitude, where automatically people are scum for opposing your views. Dave", 
        "intTime": 20090510, 
        "postID": 112, 
        "quote": "Originally posted by LineDoggie: Gee, your right, Cheney should have favored the Back Stabbing Powell. Because Loyalty to your friends is everything? Were to Believe that Kerry Sticking up for Sanders was about Loyalty and friendship But when it's Powell and McCain, the Powells knife came out and Huzzah, it's Conscience........ Honestly, I think Powells a scumbag now, simple as that.", 
        "reply": " In my opinion in reading your posts on this thread, it becomes clear that you simply can't imagine someone thinking that the Nation needed a change. That anyone who voted for Obama, and especially a Republican who voted for Obama, did so more or less from ulterior or twisted motives. So you can dismiss someone who served our nation so well as a \"scumbag,\" just because rightly or wrongly, he didn't vote your way. That's a terrible picture of yourself that you're holding up for everyone to see. A lot of hate goes into creating such an attitude, where automatically people are scum for opposing your views. Dave", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 17:31:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Frank_A_Valdez: GREAT IDEA! I admire the kind of politician who puts their butt on the line for the good of the country, even as the stark raving idealogues in their own party are howling for blood. McCain, Snowe, Specter, Powell. We'll take them all. Even if we don't agree 100%, I can admire the guts it takes to stand up for the good of your country. Good riddance to the GOP. When they crown Limbaugh, Palin, and Cheney as their saviors, they're committing themselves to political irrelevance. If, that's IF, the Obama bail out plan and economic recovery package tanks and people get fed up with it, the next set of elections will tell the tale... The American people, for lack of a better term, are \"fickle\" when it comes who they place in office... There is an old saying in D.C., \"If you want a friend in D.C., buy a dog!\"... LOL Respectfully, SUNLINER81", 
        "intTime": 20090510, 
        "postID": 113, 
        "quote": "Originally posted by Frank_A_Valdez: GREAT IDEA! I admire the kind of politician who puts their butt on the line for the good of the country, even as the stark raving idealogues in their own party are howling for blood. McCain, Snowe, Specter, Powell. We'll take them all. Even if we don't agree 100%, I can admire the guts it takes to stand up for the good of your country. Good riddance to the GOP. When they crown Limbaugh, Palin, and Cheney as their saviors, they're committing themselves to political irrelevance.", 
        "reply": " If, that's IF, the Obama bail out plan and economic recovery package tanks and people get fed up with it, the next set of elections will tell the tale... The American people, for lack of a better term, are \"fickle\" when it comes who they place in office... There is an old saying in D.C., \"If you want a friend in D.C., buy a dog!\"... LOL Respectfully, SUNLINER81", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 17:36:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "I'm not sure I get your point Sunliner81. Are you saying the GOP is betting on failure? And even worse, maybe digging in their heels at every opportunity and doing their best to make sure the Obama administration fails so they can score political points? That's ghastly . That's an even more d-amning critique of the GOP than the one I put forth. It literally makes me sick to my stomach.", 
        "intTime": 20090510, 
        "postID": 114, 
        "quote": "", 
        "reply": "I'm not sure I get your point Sunliner81. Are you saying the GOP is betting on failure? And even worse, maybe digging in their heels at every opportunity and doing their best to make sure the Obama administration fails so they can score political points? That's ghastly . That's an even more d-amning critique of the GOP than the one I put forth. It literally makes me sick to my stomach.", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 17:48:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "Frank_A_Valdez"
    }, 
    {
        "content": "quote: Originally posted by Frank_A_Valdez: I'm not sure I get your point Sunliner81. Are you saying the GOP is betting on failure? And even worse, maybe digging in their heels at every opportunity and doing their best to make sure the Obama administration fails so they can score political points? That's ghastly . That's an even more d-amning critique of the GOP than the one I put forth. It literally makes me sick to my stomach. That's partly it plus, the American electorate is totally fickle... Hero today and goat tomorrow... Respectfully, SUNLINER81", 
        "intTime": 20090510, 
        "postID": 115, 
        "quote": "Originally posted by Frank_A_Valdez: I'm not sure I get your point Sunliner81. Are you saying the GOP is betting on failure? And even worse, maybe digging in their heels at every opportunity and doing their best to make sure the Obama administration fails so they can score political points? That's ghastly . That's an even more d-amning critique of the GOP than the one I put forth. It literally makes me sick to my stomach.", 
        "reply": " That's partly it plus, the American electorate is totally fickle... Hero today and goat tomorrow... Respectfully, SUNLINER81", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 19:32:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by shuman14: quote: Originally posted by jack_flats: Powell is in the GOP for the long haul. He and many others like him plan to change it from what it has become, a radical right-wing cult not unlike the radical left-wing cult's of the 1960's, and bring it back to prominence as a party of reason and control. God Bless General Powell. I'm sure he will succeed. Nope, sorry his days in the Republican Party are over. Now he can change the Democrat Party back from the home of left wingnuts and Neo-Marxists (like yourself) that it currently is, to it's formerly great past as the home of the center moderates. Well at least Cheney can still fire-up the base...all 21% of the population. Ops...my bad. It's 21% that identify themselves as Republicans, the BASE would be much smaller.", 
        "intTime": 20090510, 
        "postID": 116, 
        "quote": "Originally posted by shuman14: quote: Originally posted by jack_flats: Powell is in the GOP for the long haul. He and many others like him plan to change it from what it has become, a radical right-wing cult not unlike the radical left-wing cult's of the 1960's, and bring it back to prominence as a party of reason and control. God Bless General Powell. I'm sure he will succeed. Nope, sorry his days in the Republican Party are over. Now he can change the Democrat Party back from the home of left wingnuts and Neo-Marxists (like yourself) that it currently is, to it's formerly great past as the home of the center moderates.", 
        "reply": " Well at least Cheney can still fire-up the base...all 21% of the population. Ops...my bad. It's 21% that identify themselves as Republicans, the BASE would be much smaller.", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 19:35:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by Frank_A_Valdez: When they crown Limbaugh, Palin, and Cheney as their saviors, they're committing themselves to political irrelevance. They already are irrelevant, the voters made sure of that, but they just can't seem to accept the fact they have to change. The future of the GOP lies in Gen. Powell types and in the Meghan McCain's of the Party. These people are in it for the long haul, and they WILL prevail. Trust me, they will prevail over the Cheney's and Limbaugh's of the Party. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090510, 
        "postID": 117, 
        "quote": "Originally posted by Frank_A_Valdez: When they crown Limbaugh, Palin, and Cheney as their saviors, they're committing themselves to political irrelevance.", 
        "reply": " They already are irrelevant, the voters made sure of that, but they just can't seem to accept the fact they have to change. The future of the GOP lies in Gen. Powell types and in the Meghan McCain's of the Party. These people are in it for the long haul, and they WILL prevail. Trust me, they will prevail over the Cheney's and Limbaugh's of the Party. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 20:16:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by iamgonzo: If you saw the interview, Cheney pointed out that since Powell endorsed Obama he felt Powell is already in the process of leaving the GOP. Would you choose someone already leaving any organization as the future of that organization? Powel of course refers to himself as a Republican. And like others in the Party, decided to support Obama in THIS race. Cheney, who is a personal hater of Powerl, knows all of this as well. His remarks in the interview, that he thought Powel had quit the party, were to say the least BS. Now when he was asked who he would choose in a choice of Limbaugh vs Powel, he could have easily avoided an answer. He CHOOSE to endorse Limbaugh, over Powel. Now I have always disagreed with Powel on many questions, it's never occured to me to doubt his integrity. I would choose him over any number of Democrats, simply BECAUSE he's a man of integrity. Limbaugh has all the integrity of a rat sitting in a pile of rotten cheese. Knock yourselves out rallying around Cheney. His remarks speak for themselves. Dave Refering to oneself as a Republican and being a Republican are two different things. The public endorsement of Obama is a slap in the face of the Republican party. Powell could have easily avoided an answer. He CHOOSE to endorse Obama over McCain. My opinion of Limbaugh is not a great one either, but he does occasionally provide some great comedic remarks. I think of him as an entertainer more than the political powerhouse he has somehow become.", 
        "intTime": 20090510, 
        "postID": 118, 
        "quote": "Originally posted by Grachus: quote: Originally posted by iamgonzo: If you saw the interview, Cheney pointed out that since Powell endorsed Obama he felt Powell is already in the process of leaving the GOP. Would you choose someone already leaving any organization as the future of that organization? Powel of course refers to himself as a Republican. And like others in the Party, decided to support Obama in THIS race. Cheney, who is a personal hater of Powerl, knows all of this as well. His remarks in the interview, that he thought Powel had quit the party, were to say the least BS. Now when he was asked who he would choose in a choice of Limbaugh vs Powel, he could have easily avoided an answer. He CHOOSE to endorse Limbaugh, over Powel. Now I have always disagreed with Powel on many questions, it's never occured to me to doubt his integrity. I would choose him over any number of Democrats, simply BECAUSE he's a man of integrity. Limbaugh has all the integrity of a rat sitting in a pile of rotten cheese. Knock yourselves out rallying around Cheney. His remarks speak for themselves. Dave", 
        "reply": " Refering to oneself as a Republican and being a Republican are two different things. The public endorsement of Obama is a slap in the face of the Republican party. Powell could have easily avoided an answer. He CHOOSE to endorse Obama over McCain. My opinion of Limbaugh is not a great one either, but he does occasionally provide some great comedic remarks. I think of him as an entertainer more than the political powerhouse he has somehow become.", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 21:43:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "iamgonzo"
    }, 
    {
        "content": "quote: Originally posted by Frank_A_Valdez: hmm. didn't see there was already another thread started over this. From another post, on a different thread: Of course. CHENEY'S TWISTED LOGIC: favor the fat pill-popping drug addict who glosses over your SPECTACULAR failures \"for the good of the party.\" vilify the 4 star, 35 yr veteran who built a career working \"for the good of the country\" because he endorsed Obama and voted his conscience Maybe the problem with the GOP is that it's veering dangerously rightward when the entire country has signaled a desire to get on with it's bipartisan business. Alarms should be going off when well respected, long time Republican moderates like Colin Powell and Arlen Specter start finding themselves crowded out of the tent. How did he vilify Gen. Powell?", 
        "intTime": 20090510, 
        "postID": 119, 
        "quote": "Originally posted by Frank_A_Valdez: hmm. didn't see there was already another thread started over this. From another post, on a different thread: Of course. CHENEY'S TWISTED LOGIC: favor the fat pill-popping drug addict who glosses over your SPECTACULAR failures \"for the good of the party.\" vilify the 4 star, 35 yr veteran who built a career working \"for the good of the country\" because he endorsed Obama and voted his conscience Maybe the problem with the GOP is that it's veering dangerously rightward when the entire country has signaled a desire to get on with it's bipartisan business. Alarms should be going off when well respected, long time Republican moderates like Colin Powell and Arlen Specter start finding themselves crowded out of the tent.", 
        "reply": " How did he vilify Gen. Powell?", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 21:46:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "iamgonzo"
    }, 
    {
        "content": "quote: Gee, Powell goes and shills for the Opposition, and a Radio Commentator & a Former VP make there opinion known of it. I love how you think Powell \"shills\" and Cheney and Rush are merely voicing their opinions and concerns.", 
        "intTime": 20090510, 
        "postID": 120, 
        "quote": "Gee, Powell goes and shills for the Opposition, and a Radio Commentator & a Former VP make there opinion known of it.", 
        "reply": " I love how you think Powell \"shills\" and Cheney and Rush are merely voicing their opinions and concerns.", 
        "threadID": "672198221_7460069222001", 
        "time": "2009-05-10 22:16:00", 
        "title": "Cheney Backs Limbaugh Over Powell for Party Future", 
        "userID": "karlhungusjr"
    }
]