[
    {
        "content": "The more the GOP complains, the better Obama looks. By Gene Lyons May 7, 2009 | A funny thing happened on the way to the Tea Party. The more furiously the party out of power denounces President Obama, the more confident Americans appear to be that voters made a wise decision last November. That would be the Republican Party. Remember them? Every time you turn on the television, some Republican is ranting like the kind of barstool know-it-all who gives booze a bad name. Recently it was Tom DeLay, explaining to MSNBC's Chris Matthews that Texas might leave the United States to avoid (imaginary) tax increases. And here I thought the Dallas Cowboys were \"America's Team.\" After first giving us George W. Bush, then impugning the patriotism of anybody who thought invading Iraq was a bad idea, the Texas Knothead faction loses an election, and then talks secession. DeLay was making it up as he went along, claiming the Obama administration seeks \"50 percent to 60 percent tax rates on American citizens.\" In reality, it seeks a 39.6 percent rate on yearly income over $250,000, tax cuts for everybody else. It's also nonsense that Texas can divide itself five ways, forcing the United States to accept eight new Republican senators or kiss all five mini-states goodbye. (Would that make Austin the new West Berlin? Which tiny Texas would claim Willie Nelson?) According to the 1846 treaty annexing Texas, partition requires congressional approval. So as tempting as it would be to bid the Five Star State farewell, it's not going to happen. Then there's Washington Examiner columnist Byron York, who actually wrote that Obama's \"sky-high ratings among African-Americans make some of his positions appear a bit more popular overall than they actually are.\" Got that? Apart from those pesky minorities, real (i.e., white) Americans dislike Obama. York's not a Texan; he's from Alabama. Meanwhile, Fox News can't decide whether the new president's policies make him a \"socialist,\" a \"communist\" or a Nazi -- words that once meant very different things, but have now come to signify \"I'm a big crybaby who pitches a hissy fit whenever I don't get my way.\" MSNBC's Joe Scarborough uses similar language. Mediamatters.org keeps a handy \"Red Scare Index\" for people keeping score at home. Ironically, the upshot of this crazy talk may be the opposite of that intended. Not only did a remarkable 81 percent of Americans express a favorable personal opinion of the president in a Wall Street Journal/NBC poll, but almost two-thirds support his policies across the board. Asked to describe Obama in a single word, most said \"intelligent.\" Even more surprising, a recent Rasmussen survey found Americans favoring \"capitalism\" over \"socialism\" by only 53 percent. Among the under-30 set, capitalism edges out socialism 37 to 33 percent. Have younger voters decided that since most Americans already enjoy \"socialist\" water, sewers, trash collection, fire and police protection, highways, public schools, universities, hospitals, Social Security, Medicare and Medicaid, we may as well nationalize private enterprise altogether? Of course not. The average American could no more concisely define \"socialism\" than explain the infield fly rule in Sanskrit. But if Rush Limbaugh calls Obama a socialist, maybe a socialist's not such a terrible thing to be.\" Ouch for the Rethugs. More at the link: >http://www.salon.com/opinion/feature/2009/05/07/lyons/< You people - you vets - that oppose President Obama. If you love the country the way many of you claim, you will look with better eyes. Walt", 
        "intTime": 20090506, 
        "postID": 1, 
        "quote": "", 
        "reply": "The more the GOP complains, the better Obama looks. By Gene Lyons May 7, 2009 | A funny thing happened on the way to the Tea Party. The more furiously the party out of power denounces President Obama, the more confident Americans appear to be that voters made a wise decision last November. That would be the Republican Party. Remember them? Every time you turn on the television, some Republican is ranting like the kind of barstool know-it-all who gives booze a bad name. Recently it was Tom DeLay, explaining to MSNBC's Chris Matthews that Texas might leave the United States to avoid (imaginary) tax increases. And here I thought the Dallas Cowboys were \"America's Team.\" After first giving us George W. Bush, then impugning the patriotism of anybody who thought invading Iraq was a bad idea, the Texas Knothead faction loses an election, and then talks secession. DeLay was making it up as he went along, claiming the Obama administration seeks \"50 percent to 60 percent tax rates on American citizens.\" In reality, it seeks a 39.6 percent rate on yearly income over $250,000, tax cuts for everybody else. It's also nonsense that Texas can divide itself five ways, forcing the United States to accept eight new Republican senators or kiss all five mini-states goodbye. (Would that make Austin the new West Berlin? Which tiny Texas would claim Willie Nelson?) According to the 1846 treaty annexing Texas, partition requires congressional approval. So as tempting as it would be to bid the Five Star State farewell, it's not going to happen. Then there's Washington Examiner columnist Byron York, who actually wrote that Obama's \"sky-high ratings among African-Americans make some of his positions appear a bit more popular overall than they actually are.\" Got that? Apart from those pesky minorities, real (i.e., white) Americans dislike Obama. York's not a Texan; he's from Alabama. Meanwhile, Fox News can't decide whether the new president's policies make him a \"socialist,\" a \"communist\" or a Nazi -- words that once meant very different things, but have now come to signify \"I'm a big crybaby who pitches a hissy fit whenever I don't get my way.\" MSNBC's Joe Scarborough uses similar language. Mediamatters.org keeps a handy \"Red Scare Index\" for people keeping score at home. Ironically, the upshot of this crazy talk may be the opposite of that intended. Not only did a remarkable 81 percent of Americans express a favorable personal opinion of the president in a Wall Street Journal/NBC poll, but almost two-thirds support his policies across the board. Asked to describe Obama in a single word, most said \"intelligent.\" Even more surprising, a recent Rasmussen survey found Americans favoring \"capitalism\" over \"socialism\" by only 53 percent. Among the under-30 set, capitalism edges out socialism 37 to 33 percent. Have younger voters decided that since most Americans already enjoy \"socialist\" water, sewers, trash collection, fire and police protection, highways, public schools, universities, hospitals, Social Security, Medicare and Medicaid, we may as well nationalize private enterprise altogether? Of course not. The average American could no more concisely define \"socialism\" than explain the infield fly rule in Sanskrit. But if Rush Limbaugh calls Obama a socialist, maybe a socialist's not such a terrible thing to be.\" Ouch for the Rethugs. More at the link: >http://www.salon.com/opinion/feature/2009/05/07/lyons/< You people - you vets - that oppose President Obama. If you love the country the way many of you claim, you will look with better eyes. Walt", 
        "threadID": "672198221_7880086222001", 
        "time": "2009-05-06 20:26:00", 
        "title": "Keep on whining, Republicans", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "So if we dont love the Dear Leader we are unpatriotic How North Korean-ish", 
        "intTime": 20090506, 
        "postID": 2, 
        "quote": "", 
        "reply": "So if we dont love the Dear Leader we are unpatriotic How North Korean-ish", 
        "threadID": "672198221_7880086222001", 
        "time": "2009-05-06 20:28:00", 
        "title": "Keep on whining, Republicans", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "quote: Originally posted by LineDoggie: So if we dont love the Dear Leader we are unpatriotic How North Korean-ish Can you please explain your thought process in reaching that conclusion? Walt", 
        "intTime": 20090506, 
        "postID": 3, 
        "quote": "Originally posted by LineDoggie: So if we dont love the Dear Leader we are unpatriotic How North Korean-ish", 
        "reply": " Can you please explain your thought process in reaching that conclusion? Walt", 
        "threadID": "672198221_7880086222001", 
        "time": "2009-05-06 20:32:00", 
        "title": "Keep on whining, Republicans", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "quote: You people - you vets - that oppose President Obama. If you love the country the way many of you claim, you will look with better eyes. So now you're going to slam the Veterans here because they don't share your perspective or agree with some of the actions of the President? You're now on a 20 day warning. If you disagree, e-mail the Lead Moderator-Nemesis1960@AOL.com-and ask him to review this. Gypsysnipe Moderator", 
        "intTime": 20090506, 
        "postID": 4, 
        "quote": "You people - you vets - that oppose President Obama. If you love the country the way many of you claim, you will look with better eyes.", 
        "reply": " So now you're going to slam the Veterans here because they don't share your perspective or agree with some of the actions of the President? You're now on a 20 day warning. If you disagree, e-mail the Lead Moderator-Nemesis1960@AOL.com-and ask him to review this. Gypsysnipe Moderator", 
        "threadID": "672198221_7880086222001", 
        "time": "2009-05-06 20:34:00", 
        "title": "Keep on whining, Republicans", 
        "userID": "gypsysnipe"
    }, 
    {
        "content": "quote: Originally posted by LineDoggie: So if we dont love the Dear Leader we are unpatriotic How North Korean-ish \"Not only did a remarkable 81 percent of Americans express a favorable personal opinion of the president in a Wall Street Journal/NBC poll...\" So! I guess you have a poll from NKorea that shows 81% favorable rating for the Dear Leader. I can;'t wait for you to share it. Walt", 
        "intTime": 20090506, 
        "postID": 5, 
        "quote": "Originally posted by LineDoggie: So if we dont love the Dear Leader we are unpatriotic How North Korean-ish", 
        "reply": " \"Not only did a remarkable 81 percent of Americans express a favorable personal opinion of the president in a Wall Street Journal/NBC poll...\" So! I guess you have a poll from NKorea that shows 81% favorable rating for the Dear Leader. I can;'t wait for you to share it. Walt", 
        "threadID": "672198221_7880086222001", 
        "time": "2009-05-06 20:34:00", 
        "title": "Keep on whining, Republicans", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "quote: Originally posted by gypsysnipe: quote: You people - you vets - that oppose President Obama. If you love the country the way many of you claim, you will look with better eyes. So now you're going to slam the Veterans here because they don't share your perspective or agree with some of the actions of the President? You're now on a 20 day warning. If you disagree, e-mail the Lead Moderator-Nemesis1960@AOL.com-and ask him to review this. Gypsysnipe Moderator Do what you like. I am challenging you presonally to uphold the First Amendment. I have strong opinions. I keep away from insulting individuals by name. But yes. People, especially veterans, need to see with better eyes -- not with the Beer Google clarity provided by the likes of FOX News. Walt", 
        "intTime": 20090506, 
        "postID": 6, 
        "quote": "Originally posted by gypsysnipe: quote: You people - you vets - that oppose President Obama. If you love the country the way many of you claim, you will look with better eyes. So now you're going to slam the Veterans here because they don't share your perspective or agree with some of the actions of the President? You're now on a 20 day warning. If you disagree, e-mail the Lead Moderator-Nemesis1960@AOL.com-and ask him to review this. Gypsysnipe Moderator", 
        "reply": " Do what you like. I am challenging you presonally to uphold the First Amendment. I have strong opinions. I keep away from insulting individuals by name. But yes. People, especially veterans, need to see with better eyes -- not with the Beer Google clarity provided by the likes of FOX News. Walt", 
        "threadID": "672198221_7880086222001", 
        "time": "2009-05-06 20:37:00", 
        "title": "Keep on whining, Republicans", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "1- Rarely watch Fox, or CNN. Mostly Local WNBC 2- If I have 6 beers a year its a lot but hey thanks for trying to claim any who arent slavish in affection for obama are drunks", 
        "intTime": 20090506, 
        "postID": 7, 
        "quote": "", 
        "reply": "1- Rarely watch Fox, or CNN. Mostly Local WNBC 2- If I have 6 beers a year its a lot but hey thanks for trying to claim any who arent slavish in affection for obama are drunks", 
        "threadID": "672198221_7880086222001", 
        "time": "2009-05-06 20:40:00", 
        "title": "Keep on whining, Republicans", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "quote: Originally posted by LineDoggie: 1- Rarely watch Fox, or CNN. Mostly Local WNBC 2- If I have 6 beers a year its a lot but hey thanks for trying to claim any who arent slavish in affection for obama are drunks I never said that. Walt", 
        "intTime": 20090506, 
        "postID": 8, 
        "quote": "Originally posted by LineDoggie: 1- Rarely watch Fox, or CNN. Mostly Local WNBC 2- If I have 6 beers a year its a lot but hey thanks for trying to claim any who arent slavish in affection for obama are drunks", 
        "reply": " I never said that. Walt", 
        "threadID": "672198221_7880086222001", 
        "time": "2009-05-06 20:41:00", 
        "title": "Keep on whining, Republicans", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "Walt: I will not attempt to diminish your opinions, or your perspective, that would be disrespectful to you as an intelligent adult. And your 1st Amendment rights have the caveat that you stay within the Terms Of Service of this website, which you agreed to follow when you became a member. But to type the words you did and direct them toward the Veterans here that you perceive as disloyal is putting you on thin ice. Gypsysnipe Moderator", 
        "intTime": 20090506, 
        "postID": 9, 
        "quote": "", 
        "reply": "Walt: I will not attempt to diminish your opinions, or your perspective, that would be disrespectful to you as an intelligent adult. And your 1st Amendment rights have the caveat that you stay within the Terms Of Service of this website, which you agreed to follow when you became a member. But to type the words you did and direct them toward the Veterans here that you perceive as disloyal is putting you on thin ice. Gypsysnipe Moderator", 
        "threadID": "672198221_7880086222001", 
        "time": "2009-05-06 20:45:00", 
        "title": "Keep on whining, Republicans", 
        "userID": "gypsysnipe"
    }, 
    {
        "content": "quote: Originally posted by WhiskeyPapa: quote: Originally posted by LineDoggie: 1- Rarely watch Fox, or CNN. Mostly Local WNBC 2- If I have 6 beers a year its a lot but hey thanks for trying to claim any who arent slavish in affection for obama are drunks I never said that. Walt Walt: Yes, you did. \"People, especially veterans, need to see with better eyes -- not with the Beer Google clarity provided by the likes of FOX News.\"", 
        "intTime": 20090506, 
        "postID": 10, 
        "quote": "Originally posted by WhiskeyPapa: quote: Originally posted by LineDoggie: 1- Rarely watch Fox, or CNN. Mostly Local WNBC 2- If I have 6 beers a year its a lot but hey thanks for trying to claim any who arent slavish in affection for obama are drunks I never said that. Walt", 
        "reply": " Walt: Yes, you did. \"People, especially veterans, need to see with better eyes -- not with the Beer Google clarity provided by the likes of FOX News.\"", 
        "threadID": "672198221_7880086222001", 
        "time": "2009-05-06 20:48:00", 
        "title": "Keep on whining, Republicans", 
        "userID": "gypsysnipe"
    }, 
    {
        "content": "quote: Do what you like. I am challenging you presonally to uphold the First Amendment. I have strong opinions. I keep away from insulting individuals by name. But yes. People, especially veterans, need to see with better eyes -- not with the Beer Google clarity provided by the likes of FOX News. Walt Yeah...like veterans can't figure stuff out for themselves. They were brainwashed by a DI/unit instead of a college prof. At least the vet went out and got to figure out things real quick if they were lucky. College kids aren't so lucky. They know they are better because they think they are. I appreciate your concern about as much as I appreciate being constipated", 
        "intTime": 20090506, 
        "postID": 11, 
        "quote": "Do what you like. I am challenging you presonally to uphold the First Amendment. I have strong opinions. I keep away from insulting individuals by name. But yes. People, especially veterans, need to see with better eyes -- not with the Beer Google clarity provided by the likes of FOX News. Walt", 
        "reply": " Yeah...like veterans can't figure stuff out for themselves. They were brainwashed by a DI/unit instead of a college prof. At least the vet went out and got to figure out things real quick if they were lucky. College kids aren't so lucky. They know they are better because they think they are. I appreciate your concern about as much as I appreciate being constipated", 
        "threadID": "672198221_7880086222001", 
        "time": "2009-05-06 20:50:00", 
        "title": "Keep on whining, Republicans", 
        "userID": "ACR26"
    }, 
    {
        "content": "Well, I don't know if I am surprised or not. I have been banned on Freerepublic.com and on Democraticunderground.com and also on Togetherweserved.com. To be threatened here, on a site frequented by and dedicated to, veterans, makes me very sad. It makes me wonder if there is not some universal field of discourse in this country outside which no one is allowed. This particular thread merely points out that 81% of Americans are favorable to president Obama. You won't likely see that played up too much on FOX news or the other Republican Party organs that use Nazi -type- propaganda to make their talking points. I asked this on FreeReublic, both on threads and to the owner of FR, Jim Robinson, so I will post it here to the management of Military.com. Do you believe in reasonable free speech or not? Nothing I have posted in any way impinges even remotely on the way Free Speech has been seen in this country for 200+ years. Jim Robinson showed his respect for our most sacred institutions -- nil. I was banned. We'll see what happens on this site. If you see me just drop off the screen entirely, you'll know that this site also does not respect the First Amendment. Walt", 
        "intTime": 20090506, 
        "postID": 12, 
        "quote": "", 
        "reply": "Well, I don't know if I am surprised or not. I have been banned on Freerepublic.com and on Democraticunderground.com and also on Togetherweserved.com. To be threatened here, on a site frequented by and dedicated to, veterans, makes me very sad. It makes me wonder if there is not some universal field of discourse in this country outside which no one is allowed. This particular thread merely points out that 81% of Americans are favorable to president Obama. You won't likely see that played up too much on FOX news or the other Republican Party organs that use Nazi -type- propaganda to make their talking points. I asked this on FreeReublic, both on threads and to the owner of FR, Jim Robinson, so I will post it here to the management of Military.com. Do you believe in reasonable free speech or not? Nothing I have posted in any way impinges even remotely on the way Free Speech has been seen in this country for 200+ years. Jim Robinson showed his respect for our most sacred institutions -- nil. I was banned. We'll see what happens on this site. If you see me just drop off the screen entirely, you'll know that this site also does not respect the First Amendment. Walt", 
        "threadID": "672198221_7880086222001", 
        "time": "2009-05-06 20:52:00", 
        "title": "Keep on whining, Republicans", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "quote: Originally posted by gypsysnipe: quote: Originally posted by WhiskeyPapa: quote: Originally posted by LineDoggie: 1- Rarely watch Fox, or CNN. Mostly Local WNBC 2- If I have 6 beers a year its a lot but hey thanks for trying to claim any who arent slavish in affection for obama are drunks I never said that. Walt Walt: Yes, you did. \"People, especially veterans, need to see with better eyes -- not with the Beer Google clarity provided by the likes of FOX News.\" That doesn't say people are drunks. It says they cannot see clearly. Walt", 
        "intTime": 20090506, 
        "postID": 13, 
        "quote": "Originally posted by gypsysnipe: quote: Originally posted by WhiskeyPapa: quote: Originally posted by LineDoggie: 1- Rarely watch Fox, or CNN. Mostly Local WNBC 2- If I have 6 beers a year its a lot but hey thanks for trying to claim any who arent slavish in affection for obama are drunks I never said that. Walt Walt: Yes, you did. \"People, especially veterans, need to see with better eyes -- not with the Beer Google clarity provided by the likes of FOX News.\"", 
        "reply": " That doesn't say people are drunks. It says they cannot see clearly. Walt", 
        "threadID": "672198221_7880086222001", 
        "time": "2009-05-06 20:55:00", 
        "title": "Keep on whining, Republicans", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "quote: Originally posted by gypsysnipe: Walt: I will not attempt to diminish your opinions, or your perspective, that would be disrespectful to you as an intelligent adult. And your 1st Amendment rights have the caveat that you stay within the Terms Of Service of this website, which you agreed to follow when you became a member. But to type the words you did and direct them toward the Veterans here that you perceive as disloyal is putting you on thin ice. Gypsysnipe Moderator Can you say exactly how I am breaking the TOS? Walt", 
        "intTime": 20090506, 
        "postID": 14, 
        "quote": "Originally posted by gypsysnipe: Walt: I will not attempt to diminish your opinions, or your perspective, that would be disrespectful to you as an intelligent adult. And your 1st Amendment rights have the caveat that you stay within the Terms Of Service of this website, which you agreed to follow when you became a member. But to type the words you did and direct them toward the Veterans here that you perceive as disloyal is putting you on thin ice. Gypsysnipe Moderator", 
        "reply": " Can you say exactly how I am breaking the TOS? Walt", 
        "threadID": "672198221_7880086222001", 
        "time": "2009-05-06 20:56:00", 
        "title": "Keep on whining, Republicans", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "quote: Originally posted by gypsysnipe: quote: Originally posted by WhiskeyPapa: quote: Originally posted by LineDoggie: 1- Rarely watch Fox, or CNN. Mostly Local WNBC 2- If I have 6 beers a year its a lot but hey thanks for trying to claim any who arent slavish in affection for obama are drunks I never said that. Walt Walt: Yes, you did. \"People, especially veterans, need to see with better eyes -- not with the Beer Google clarity provided by the likes of FOX News.\" Maybe I have \"beer goggle clarity\" on this, but there is big difference between calling those who disagree with his thinking drunks, and what he actually said.", 
        "intTime": 20090506, 
        "postID": 15, 
        "quote": "Originally posted by gypsysnipe: quote: Originally posted by WhiskeyPapa: quote: Originally posted by LineDoggie: 1- Rarely watch Fox, or CNN. Mostly Local WNBC 2- If I have 6 beers a year its a lot but hey thanks for trying to claim any who arent slavish in affection for obama are drunks I never said that. Walt Walt: Yes, you did. \"People, especially veterans, need to see with better eyes -- not with the Beer Google clarity provided by the likes of FOX News.\"", 
        "reply": " Maybe I have \"beer goggle clarity\" on this, but there is big difference between calling those who disagree with his thinking drunks, and what he actually said.", 
        "threadID": "672198221_7880086222001", 
        "time": "2009-05-06 21:04:00", 
        "title": "Keep on whining, Republicans", 
        "userID": "iamgonzo"
    }, 
    {
        "content": "Walt: Let's try this again. Here are your words: \"You people - you vets - that oppose President Obama. If you love the country the way many of you claim, you will look with better eyes.\" That was an insult to the Veterans who don't agree with you. And I don't make threats, I make statements. If you play by the same rules that everyone else does, which are the TOS here, there won't be any more issues. Gypsysnipe Moderator", 
        "intTime": 20090506, 
        "postID": 16, 
        "quote": "", 
        "reply": "Walt: Let's try this again. Here are your words: \"You people - you vets - that oppose President Obama. If you love the country the way many of you claim, you will look with better eyes.\" That was an insult to the Veterans who don't agree with you. And I don't make threats, I make statements. If you play by the same rules that everyone else does, which are the TOS here, there won't be any more issues. Gypsysnipe Moderator", 
        "threadID": "672198221_7880086222001", 
        "time": "2009-05-06 21:05:00", 
        "title": "Keep on whining, Republicans", 
        "userID": "gypsysnipe"
    }, 
    {
        "content": "quote: Originally posted by WhiskeyPapa: quote: Originally posted by gypsysnipe: Walt: I will not attempt to diminish your opinions, or your perspective, that would be disrespectful to you as an intelligent adult. And your 1st Amendment rights have the caveat that you stay within the Terms Of Service of this website, which you agreed to follow when you became a member. But to type the words you did and direct them toward the Veterans here that you perceive as disloyal is putting you on thin ice. Gypsysnipe Moderator Can you say exactly how I am breaking the TOS? Walt Read the Terms Of Service, specifically to wit: 6ii-offensive Don't slam the Veterans here if they don't agree with you. Gypsysnipe Moderator", 
        "intTime": 20090506, 
        "postID": 17, 
        "quote": "Originally posted by WhiskeyPapa: quote: Originally posted by gypsysnipe: Walt: I will not attempt to diminish your opinions, or your perspective, that would be disrespectful to you as an intelligent adult. And your 1st Amendment rights have the caveat that you stay within the Terms Of Service of this website, which you agreed to follow when you became a member. But to type the words you did and direct them toward the Veterans here that you perceive as disloyal is putting you on thin ice. Gypsysnipe Moderator Can you say exactly how I am breaking the TOS? Walt", 
        "reply": " Read the Terms Of Service, specifically to wit: 6ii-offensive Don't slam the Veterans here if they don't agree with you. Gypsysnipe Moderator", 
        "threadID": "672198221_7880086222001", 
        "time": "2009-05-06 21:09:00", 
        "title": "Keep on whining, Republicans", 
        "userID": "gypsysnipe"
    }
]