[
    {
        "content": "Note: this is an updated thread, please scroll down or go to the last page for the latest update. Before the blame game begins, have in mind that this has yet to pass Congress and is still a proposal as of yet. quote: ++http://www.foxnews.com/politics/first100days/2009/04/06/gates-calling-cuts-high-tech-weapons-programs/ WASHINGTON -- Defense Secretary Robert Gates is proposing deep cuts to some big weapons programs such as the F-22 fighter jet as the Pentagon takes a hard look at how it spends money. Gates announced a broad range of cuts Monday to weapons spending, saying he plans to cut programs ranging from a new helicopter for the president to ending production of the $140 billion F-22 fighter jet. The Army's modernization program would be scaled back, while a new satellite system and a search-and-rescue helicopter would be cut. Gates says his budget will \"profoundly reform\" the way the Pentagon buys weapons and does business. To fight new threats from insurgents, Gates is proposing more funding for special forces and other tools... This message has been edited. Last edited by: Canuck_Centaur, Thu 25 June 2009 10:18 PM", 
        "intTime": 20090406, 
        "postID": 1, 
        "quote": "++http://www.foxnews.com/politics/first100days/2009/04/06/gates-calling-cuts-high-tech-weapons-programs/ WASHINGTON -- Defense Secretary Robert Gates is proposing deep cuts to some big weapons programs such as the F-22 fighter jet as the Pentagon takes a hard look at how it spends money. Gates announced a broad range of cuts Monday to weapons spending, saying he plans to cut programs ranging from a new helicopter for the president to ending production of the $140 billion F-22 fighter jet. The Army's modernization program would be scaled back, while a new satellite system and a search-and-rescue helicopter would be cut. Gates says his budget will \"profoundly reform\" the way the Pentagon buys weapons and does business. To fight new threats from insurgents, Gates is proposing more funding for special forces and other tools...", 
        "reply": "Note: this is an updated thread, please scroll down or go to the last page for the latest update. Before the blame game begins, have in mind that this has yet to pass Congress and is still a proposal as of yet.  This message has been edited. Last edited by: Canuck_Centaur, Thu 25 June 2009 10:18 PM", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 14:11:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "That is good. They are $140 million for each one past what is already ordered. The 187 we already ordered cost $361 million each, much of which was an R&D cost. They are a defense project that has gone overtime and over-budget. Something needs to clean up the way contractors run the DoD. Big contractors are rewarded for taking too long and spending too much. They know it takes so long for major projects that they can get away with whatever they want because the military wants the final product. Considering that at least three F-22s have already crashed it already has one of the worst safety records in the Air Force. There is no reason to buy more of them, they are merely a waste of our tax dollars.", 
        "intTime": 20090406, 
        "postID": 2, 
        "quote": "", 
        "reply": "That is good. They are $140 million for each one past what is already ordered. The 187 we already ordered cost $361 million each, much of which was an R&D cost. They are a defense project that has gone overtime and over-budget. Something needs to clean up the way contractors run the DoD. Big contractors are rewarded for taking too long and spending too much. They know it takes so long for major projects that they can get away with whatever they want because the military wants the final product. Considering that at least three F-22s have already crashed it already has one of the worst safety records in the Air Force. There is no reason to buy more of them, they are merely a waste of our tax dollars.", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 14:32:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "nspreitler"
    }, 
    {
        "content": "Mr. Gates is a very wise man. I support his decision 100% to cancel the F22 program.", 
        "intTime": 20090406, 
        "postID": 3, 
        "quote": "", 
        "reply": "Mr. Gates is a very wise man. I support his decision 100% to cancel the F22 program.", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 15:02:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "Duster6"
    }, 
    {
        "content": "And Cancelling the Airborne Laser system, Missile defence Sysytem when North Korea is desperately trying to enhance their Capability. BRILLIANT! Even Petain & Laval couldnt have come up with a Better plan at appeasement and stupidity", 
        "intTime": 20090406, 
        "postID": 4, 
        "quote": "", 
        "reply": "And Cancelling the Airborne Laser system, Missile defence Sysytem when North Korea is desperately trying to enhance their Capability. BRILLIANT! Even Petain & Laval couldnt have come up with a Better plan at appeasement and stupidity", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 15:21:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: That is good. They are $140 million for each one past what is already ordered. The 187 we already ordered cost $361 million each, much of which was an R&D cost. They are a defense project that has gone overtime and over-budget. Something needs to clean up the way contractors run the DoD. $213 a piece according to this guy's math (initial still being $361 mil)! +http://www.military.com/opinion/0,15202,187737,00.html?wh=wh Big contractors are rewarded for taking too long and spending too much. They know it takes so long for major projects that they can get away with whatever they want because the military wants the final product. Considering that at least three F-22s have already crashed it already has one of the worst safety records in the Air Force. There is no reason to buy more of them, they are merely a waste of our tax dollars. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090406, 
        "postID": 5, 
        "quote": "Originally posted by nspreitler: That is good. They are $140 million for each one past what is already ordered. The 187 we already ordered cost $361 million each, much of which was an R&D cost. They are a defense project that has gone overtime and over-budget. Something needs to clean up the way contractors run the DoD. $213 a piece according to this guy's math (initial still being $361 mil)! +http://www.military.com/opinion/0,15202,187737,00.html?wh=wh Big contractors are rewarded for taking too long and spending too much. They know it takes so long for major projects that they can get away with whatever they want because the military wants the final product. Considering that at least three F-22s have already crashed it already has one of the worst safety records in the Air Force. There is no reason to buy more of them, they are merely a waste of our tax dollars.", 
        "reply": " \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 15:29:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "NSNN"
    }, 
    {
        "content": "NA73(North American Aircraft), Crashed just 25 days after it first appeared. Thankfully the BPC didnt give up on it. Today we know it as the P-51 Mustang Many aircraft havd had Crashes and gone on to great things B-17, Harrier, F-15, F-16 etc.", 
        "intTime": 20090406, 
        "postID": 6, 
        "quote": "", 
        "reply": "NA73(North American Aircraft), Crashed just 25 days after it first appeared. Thankfully the BPC didnt give up on it. Today we know it as the P-51 Mustang Many aircraft havd had Crashes and gone on to great things B-17, Harrier, F-15, F-16 etc.", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 15:40:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "And so it begins... the only Fed Gubmint spending the B.O. administration is willing to consider cutting is the only spending it's engaged in that's actually in the Constitution. To hell with the common defense, we gots to spend trillions on new welfare programs and to line the pockets of corrupt union officials and ACORN malcontents. Right? This sickens me. If anything we should be spending more on defense, including the F-22 program.", 
        "intTime": 20090406, 
        "postID": 7, 
        "quote": "", 
        "reply": "And so it begins... the only Fed Gubmint spending the B.O. administration is willing to consider cutting is the only spending it's engaged in that's actually in the Constitution. To hell with the common defense, we gots to spend trillions on new welfare programs and to line the pockets of corrupt union officials and ACORN malcontents. Right? This sickens me. If anything we should be spending more on defense, including the F-22 program.", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 16:03:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "I understand the F 22 went over budget, but now that it's been paid for, wouldn't the price go back down? It's notable the best aircraft out their, far better then the Joint fighter. I was wrong when I though Gates was beyond politics because this seems more like a political move so he keeps his job then anything smart. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090406, 
        "postID": 8, 
        "quote": "", 
        "reply": "I understand the F 22 went over budget, but now that it's been paid for, wouldn't the price go back down? It's notable the best aircraft out their, far better then the Joint fighter. I was wrong when I though Gates was beyond politics because this seems more like a political move so he keeps his job then anything smart. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 16:18:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: I understand the F 22 went over budget, but now that it's been paid for, wouldn't the price go back down? It's notable the best aircraft out their, far better then the Joint fighter. I was wrong when I though Gates was beyond politics because this seems more like a political move so he keeps his job then anything smart. It’s only natural for the Military to tighten its belt when the economy is in the drain...if we didn’t and spent more like some here suggest, we would arguably end up like the Soviet Union! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090406, 
        "postID": 9, 
        "quote": "Originally posted by L0A1: I understand the F 22 went over budget, but now that it's been paid for, wouldn't the price go back down? It's notable the best aircraft out their, far better then the Joint fighter. I was wrong when I though Gates was beyond politics because this seems more like a political move so he keeps his job then anything smart.", 
        "reply": " It’s only natural for the Military to tighten its belt when the economy is in the drain...if we didn’t and spent more like some here suggest, we would arguably end up like the Soviet Union! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 16:28:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: That is good. They are $140 million for each one past what is already ordered. The 187 we already ordered cost $361 million each, much of which was an R&D cost. They are a defense project that has gone overtime and over-budget. Something needs to clean up the way contractors run the DoD. Big contractors are rewarded for taking too long and spending too much. They know it takes so long for major projects that they can get away with whatever they want because the military wants the final product. Considering that at least three F-22s have already crashed it already has one of the worst safety records in the Air Force. There is no reason to buy more of them, they are merely a waste of our tax dollars. And you have worked in the aerospace industry where?... Respectfully, SUNLINER81", 
        "intTime": 20090406, 
        "postID": 10, 
        "quote": "Originally posted by nspreitler: That is good. They are $140 million for each one past what is already ordered. The 187 we already ordered cost $361 million each, much of which was an R&D cost. They are a defense project that has gone overtime and over-budget. Something needs to clean up the way contractors run the DoD. Big contractors are rewarded for taking too long and spending too much. They know it takes so long for major projects that they can get away with whatever they want because the military wants the final product. Considering that at least three F-22s have already crashed it already has one of the worst safety records in the Air Force. There is no reason to buy more of them, they are merely a waste of our tax dollars.", 
        "reply": " And you have worked in the aerospace industry where?... Respectfully, SUNLINER81", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 16:29:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by shades_of_grey: And so it begins... the only Fed Gubmint spending the B.O. administration is willing to consider cutting is the only spending it's engaged in that's actually in the Constitution. To hell with the common defense, we gots to spend trillions on new welfare programs and to line the pockets of corrupt union officials and ACORN malcontents. Right? This sickens me. If anything we should be spending more on defense, including the F-22 program. Why? What is the benefit from having a massive fleet of fighters that can't be used in the wars we are fighting. We are going to have 187 of them, plus thousands more F-35s and new F/A-18Es. Why do we need more of them? There isn't a credible threat from anyone even close to competing with it. N Korea isn't a threat, they still have an air force that uses the same MiG-15s it fought with almost 50 years ago. China isn't a military threat at least not for another 15-20 years. The military needs to build practical capability and $300 million fighters with nobody to fight are not practical.", 
        "intTime": 20090406, 
        "postID": 11, 
        "quote": "Originally posted by shades_of_grey: And so it begins... the only Fed Gubmint spending the B.O. administration is willing to consider cutting is the only spending it's engaged in that's actually in the Constitution. To hell with the common defense, we gots to spend trillions on new welfare programs and to line the pockets of corrupt union officials and ACORN malcontents. Right? This sickens me. If anything we should be spending more on defense, including the F-22 program.", 
        "reply": " Why? What is the benefit from having a massive fleet of fighters that can't be used in the wars we are fighting. We are going to have 187 of them, plus thousands more F-35s and new F/A-18Es. Why do we need more of them? There isn't a credible threat from anyone even close to competing with it. N Korea isn't a threat, they still have an air force that uses the same MiG-15s it fought with almost 50 years ago. China isn't a military threat at least not for another 15-20 years. The military needs to build practical capability and $300 million fighters with nobody to fight are not practical.", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 16:32:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "nspreitler"
    }, 
    {
        "content": "quote: Originally posted by NSNN: quote: Originally posted by L0A1: I understand the F 22 went over budget, but now that it's been paid for, wouldn't the price go back down? It's notable the best aircraft out their, far better then the Joint fighter. I was wrong when I though Gates was beyond politics because this seems more like a political move so he keeps his job then anything smart. It’s only natural for the Military to tighten its belt when the economy is in the drain...if we didn’t and spent more like some here suggest, we would arguably end up like the Soviet Union! I can't argue with that. I just feel they could have picked other programs. Like measuring cow farts and stuff. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090406, 
        "postID": 12, 
        "quote": "Originally posted by NSNN: quote: Originally posted by L0A1: I understand the F 22 went over budget, but now that it's been paid for, wouldn't the price go back down? It's notable the best aircraft out their, far better then the Joint fighter. I was wrong when I though Gates was beyond politics because this seems more like a political move so he keeps his job then anything smart. It’s only natural for the Military to tighten its belt when the economy is in the drain...if we didn’t and spent more like some here suggest, we would arguably end up like the Soviet Union!", 
        "reply": " I can't argue with that. I just feel they could have picked other programs. Like measuring cow farts and stuff. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 16:32:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: quote: Originally posted by shades_of_grey: And so it begins... the only Fed Gubmint spending the B.O. administration is willing to consider cutting is the only spending it's engaged in that's actually in the Constitution. To hell with the common defense, we gots to spend trillions on new welfare programs and to line the pockets of corrupt union officials and ACORN malcontents. Right? This sickens me. If anything we should be spending more on defense, including the F-22 program. Why? What is the benefit from having a massive fleet of fighters that can't be used in the wars we are fighting. We are going to have 187 of them, plus thousands more F-35s and new F/A-18Es. Why do we need more of them? There isn't a credible threat from anyone even close to competing with it. N Korea isn't a threat, they still have an air force that uses the same MiG-15s it fought with almost 50 years ago. China isn't a military threat at least not for another 15-20 years. The military needs to build practical capability and $300 million fighters with nobody to fight are not practical. That's precisely the point, our enemies can't compete with them, while they can with the aged and decrepit F-15s... Now, if you can forecast when, where and who we will fight in the future, with certainty, the Pentagon has a job opening for you... LOL Respectfully, SUNLINER81", 
        "intTime": 20090406, 
        "postID": 13, 
        "quote": "Originally posted by nspreitler: quote: Originally posted by shades_of_grey: And so it begins... the only Fed Gubmint spending the B.O. administration is willing to consider cutting is the only spending it's engaged in that's actually in the Constitution. To hell with the common defense, we gots to spend trillions on new welfare programs and to line the pockets of corrupt union officials and ACORN malcontents. Right? This sickens me. If anything we should be spending more on defense, including the F-22 program. Why? What is the benefit from having a massive fleet of fighters that can't be used in the wars we are fighting. We are going to have 187 of them, plus thousands more F-35s and new F/A-18Es. Why do we need more of them? There isn't a credible threat from anyone even close to competing with it. N Korea isn't a threat, they still have an air force that uses the same MiG-15s it fought with almost 50 years ago. China isn't a military threat at least not for another 15-20 years. The military needs to build practical capability and $300 million fighters with nobody to fight are not practical.", 
        "reply": " That's precisely the point, our enemies can't compete with them, while they can with the aged and decrepit F-15s... Now, if you can forecast when, where and who we will fight in the future, with certainty, the Pentagon has a job opening for you... LOL Respectfully, SUNLINER81", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 16:34:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: I can't argue with that. I just feel they could have picked other programs. Like measuring cow farts and stuff. Math wasn't your favorite subject, was it....", 
        "intTime": 20090406, 
        "postID": 14, 
        "quote": "I can't argue with that. I just feel they could have picked other programs. Like measuring cow farts and stuff.", 
        "reply": " Math wasn't your favorite subject, was it....", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 16:35:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "s122604"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: quote: Originally posted by nspreitler: That is good. They are $140 million for each one past what is already ordered. The 187 we already ordered cost $361 million each, much of which was an R&D cost. They are a defense project that has gone overtime and over-budget. Something needs to clean up the way contractors run the DoD. Big contractors are rewarded for taking too long and spending too much. They know it takes so long for major projects that they can get away with whatever they want because the military wants the final product. Considering that at least three F-22s have already crashed it already has one of the worst safety records in the Air Force. There is no reason to buy more of them, they are merely a waste of our tax dollars. And you have worked in the aerospace industry where?... Respectfully, SUNLINER81 In the Air Force. Did you know those are the people that have to actually use the equipment?", 
        "intTime": 20090406, 
        "postID": 15, 
        "quote": "Originally posted by SUNLINER81: quote: Originally posted by nspreitler: That is good. They are $140 million for each one past what is already ordered. The 187 we already ordered cost $361 million each, much of which was an R&D cost. They are a defense project that has gone overtime and over-budget. Something needs to clean up the way contractors run the DoD. Big contractors are rewarded for taking too long and spending too much. They know it takes so long for major projects that they can get away with whatever they want because the military wants the final product. Considering that at least three F-22s have already crashed it already has one of the worst safety records in the Air Force. There is no reason to buy more of them, they are merely a waste of our tax dollars. And you have worked in the aerospace industry where?... Respectfully, SUNLINER81", 
        "reply": " In the Air Force. Did you know those are the people that have to actually use the equipment?", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 16:35:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "nspreitler"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: quote: Originally posted by nspreitler: quote: Originally posted by shades_of_grey: And so it begins... the only Fed Gubmint spending the B.O. administration is willing to consider cutting is the only spending it's engaged in that's actually in the Constitution. To hell with the common defense, we gots to spend trillions on new welfare programs and to line the pockets of corrupt union officials and ACORN malcontents. Right? This sickens me. If anything we should be spending more on defense, including the F-22 program. Why? What is the benefit from having a massive fleet of fighters that can't be used in the wars we are fighting. We are going to have 187 of them, plus thousands more F-35s and new F/A-18Es. Why do we need more of them? There isn't a credible threat from anyone even close to competing with it. N Korea isn't a threat, they still have an air force that uses the same MiG-15s it fought with almost 50 years ago. China isn't a military threat at least not for another 15-20 years. The military needs to build practical capability and $300 million fighters with nobody to fight are not practical. That's precisely the point, our enemies can't compete with them, while they can with the aged and decrepit F-15s... Now, if you can forecast when, where and who we will fight in the future, with certainty, the Pentagon has a job opening for you... LOL Respectfully, SUNLINER81 Do you mean the F-15s that have a 104-0 kill ratio worldwide?", 
        "intTime": 20090406, 
        "postID": 16, 
        "quote": "Originally posted by SUNLINER81: quote: Originally posted by nspreitler: quote: Originally posted by shades_of_grey: And so it begins... the only Fed Gubmint spending the B.O. administration is willing to consider cutting is the only spending it's engaged in that's actually in the Constitution. To hell with the common defense, we gots to spend trillions on new welfare programs and to line the pockets of corrupt union officials and ACORN malcontents. Right? This sickens me. If anything we should be spending more on defense, including the F-22 program. Why? What is the benefit from having a massive fleet of fighters that can't be used in the wars we are fighting. We are going to have 187 of them, plus thousands more F-35s and new F/A-18Es. Why do we need more of them? There isn't a credible threat from anyone even close to competing with it. N Korea isn't a threat, they still have an air force that uses the same MiG-15s it fought with almost 50 years ago. China isn't a military threat at least not for another 15-20 years. The military needs to build practical capability and $300 million fighters with nobody to fight are not practical. That's precisely the point, our enemies can't compete with them, while they can with the aged and decrepit F-15s... Now, if you can forecast when, where and who we will fight in the future, with certainty, the Pentagon has a job opening for you... LOL Respectfully, SUNLINER81", 
        "reply": " Do you mean the F-15s that have a 104-0 kill ratio worldwide?", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 16:37:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "nspreitler"
    }, 
    {
        "content": "quote: Originally posted by s122604: quote: I can't argue with that. I just feel they could have picked other programs. Like measuring cow farts and stuff. Math wasn't your favorite subject, was it.... Actual, I am very good with math. So instead of your insulting comment, try something real. Since you didn't understand what I was getting at, let me downgrade it for you. THE GOVERMENT BLOWS MONEY ON CRAP that does nothing for this country, where as the F 22 does. Get it? Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090406, 
        "postID": 17, 
        "quote": "Originally posted by s122604: quote: I can't argue with that. I just feel they could have picked other programs. Like measuring cow farts and stuff. Math wasn't your favorite subject, was it....", 
        "reply": " Actual, I am very good with math. So instead of your insulting comment, try something real. Since you didn't understand what I was getting at, let me downgrade it for you. THE GOVERMENT BLOWS MONEY ON CRAP that does nothing for this country, where as the F 22 does. Get it? Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 16:41:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: quote: Originally posted by SUNLINER81: quote: Originally posted by nspreitler: That is good. They are $140 million for each one past what is already ordered. The 187 we already ordered cost $361 million each, much of which was an R&D cost. They are a defense project that has gone overtime and over-budget. Something needs to clean up the way contractors run the DoD. Big contractors are rewarded for taking too long and spending too much. They know it takes so long for major projects that they can get away with whatever they want because the military wants the final product. Considering that at least three F-22s have already crashed it already has one of the worst safety records in the Air Force. There is no reason to buy more of them, they are merely a waste of our tax dollars. And you have worked in the aerospace industry where?... Respectfully, SUNLINER81 In the Air Force. Did you know those are the people that have to actually use the equipment? What I was referring to was on the \"contract\" side of procurement... I too served in the active military aviation branch of the U.S.N. AND I worked for Lockheed, Douglas, Northrop and BAE, in all aspects of contractual negotiations, as a \"Provisioning Analyst\" and on the \"assembly line\"... The point is, aircraft are \"long lead time\" items and they are built to specifications to meet actual and projected hostile forces... It take from eight to twelve years from concept, proposal, test and evaluation, to prototypes, to actual \"article in service\"... The point was and is, if we don't procure these fighters and strike aircraft now, we wont' have time to do it, when and if the schidt hits the fan AND THEN, PEOPLE WILL DIE BECAUSE WE WERE PENNY WISE AND POUND FOOLISH... IMHO... Respectfully, SUNLINER81", 
        "intTime": 20090406, 
        "postID": 18, 
        "quote": "Originally posted by nspreitler: quote: Originally posted by SUNLINER81: quote: Originally posted by nspreitler: That is good. They are $140 million for each one past what is already ordered. The 187 we already ordered cost $361 million each, much of which was an R&D cost. They are a defense project that has gone overtime and over-budget. Something needs to clean up the way contractors run the DoD. Big contractors are rewarded for taking too long and spending too much. They know it takes so long for major projects that they can get away with whatever they want because the military wants the final product. Considering that at least three F-22s have already crashed it already has one of the worst safety records in the Air Force. There is no reason to buy more of them, they are merely a waste of our tax dollars. And you have worked in the aerospace industry where?... Respectfully, SUNLINER81 In the Air Force. Did you know those are the people that have to actually use the equipment?", 
        "reply": " What I was referring to was on the \"contract\" side of procurement... I too served in the active military aviation branch of the U.S.N. AND I worked for Lockheed, Douglas, Northrop and BAE, in all aspects of contractual negotiations, as a \"Provisioning Analyst\" and on the \"assembly line\"... The point is, aircraft are \"long lead time\" items and they are built to specifications to meet actual and projected hostile forces... It take from eight to twelve years from concept, proposal, test and evaluation, to prototypes, to actual \"article in service\"... The point was and is, if we don't procure these fighters and strike aircraft now, we wont' have time to do it, when and if the schidt hits the fan AND THEN, PEOPLE WILL DIE BECAUSE WE WERE PENNY WISE AND POUND FOOLISH... IMHO... Respectfully, SUNLINER81", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 16:42:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "Show me a cow fart study that equals up to even one F22... You can't. Tell us what the government should cut, to make up for these programs. I'd like to see you balance the numbers...", 
        "intTime": 20090406, 
        "postID": 19, 
        "quote": "", 
        "reply": "Show me a cow fart study that equals up to even one F22... You can't. Tell us what the government should cut, to make up for these programs. I'd like to see you balance the numbers...", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 16:43:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "s122604"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: Do you mean the F-15s that have a 104-0 kill ratio worldwide? In all fairness, that ratio is inflated and somewhat flawed! It never went one on one against an A/C in its class! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090406, 
        "postID": 20, 
        "quote": "Originally posted by nspreitler: Do you mean the F-15s that have a 104-0 kill ratio worldwide?", 
        "reply": " In all fairness, that ratio is inflated and somewhat flawed! It never went one on one against an A/C in its class! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 16:44:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "NSNN"
    }, 
    {
        "content": "Note: this is an updated thread, please scroll down or go to the last page for the latest update. Before the blame game begins, have in mind that this has yet to pass Congress and is still a proposal as of yet. quote: ++http://www.foxnews.com/politics/first100days/2009/04/06/gates-calling-cuts-high-tech-weapons-programs/ WASHINGTON -- Defense Secretary Robert Gates is proposing deep cuts to some big weapons programs such as the F-22 fighter jet as the Pentagon takes a hard look at how it spends money. Gates announced a broad range of cuts Monday to weapons spending, saying he plans to cut programs ranging from a new helicopter for the president to ending production of the $140 billion F-22 fighter jet. The Army's modernization program would be scaled back, while a new satellite system and a search-and-rescue helicopter would be cut. Gates says his budget will \"profoundly reform\" the way the Pentagon buys weapons and does business. To fight new threats from insurgents, Gates is proposing more funding for special forces and other tools... This message has been edited. Last edited by: Canuck_Centaur, Thu 25 June 2009 10:18 PM", 
        "intTime": 20090406, 
        "postID": 21, 
        "quote": "++http://www.foxnews.com/politics/first100days/2009/04/06/gates-calling-cuts-high-tech-weapons-programs/ WASHINGTON -- Defense Secretary Robert Gates is proposing deep cuts to some big weapons programs such as the F-22 fighter jet as the Pentagon takes a hard look at how it spends money. Gates announced a broad range of cuts Monday to weapons spending, saying he plans to cut programs ranging from a new helicopter for the president to ending production of the $140 billion F-22 fighter jet. The Army's modernization program would be scaled back, while a new satellite system and a search-and-rescue helicopter would be cut. Gates says his budget will \"profoundly reform\" the way the Pentagon buys weapons and does business. To fight new threats from insurgents, Gates is proposing more funding for special forces and other tools...", 
        "reply": "Note: this is an updated thread, please scroll down or go to the last page for the latest update. Before the blame game begins, have in mind that this has yet to pass Congress and is still a proposal as of yet.  This message has been edited. Last edited by: Canuck_Centaur, Thu 25 June 2009 10:18 PM", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 14:11:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "That is good. They are $140 million for each one past what is already ordered. The 187 we already ordered cost $361 million each, much of which was an R&D cost. They are a defense project that has gone overtime and over-budget. Something needs to clean up the way contractors run the DoD. Big contractors are rewarded for taking too long and spending too much. They know it takes so long for major projects that they can get away with whatever they want because the military wants the final product. Considering that at least three F-22s have already crashed it already has one of the worst safety records in the Air Force. There is no reason to buy more of them, they are merely a waste of our tax dollars.", 
        "intTime": 20090406, 
        "postID": 22, 
        "quote": "", 
        "reply": "That is good. They are $140 million for each one past what is already ordered. The 187 we already ordered cost $361 million each, much of which was an R&D cost. They are a defense project that has gone overtime and over-budget. Something needs to clean up the way contractors run the DoD. Big contractors are rewarded for taking too long and spending too much. They know it takes so long for major projects that they can get away with whatever they want because the military wants the final product. Considering that at least three F-22s have already crashed it already has one of the worst safety records in the Air Force. There is no reason to buy more of them, they are merely a waste of our tax dollars.", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 14:32:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "nspreitler"
    }, 
    {
        "content": "Mr. Gates is a very wise man. I support his decision 100% to cancel the F22 program.", 
        "intTime": 20090406, 
        "postID": 23, 
        "quote": "", 
        "reply": "Mr. Gates is a very wise man. I support his decision 100% to cancel the F22 program.", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 15:02:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "Duster6"
    }, 
    {
        "content": "And Cancelling the Airborne Laser system, Missile defence Sysytem when North Korea is desperately trying to enhance their Capability. BRILLIANT! Even Petain & Laval couldnt have come up with a Better plan at appeasement and stupidity", 
        "intTime": 20090406, 
        "postID": 24, 
        "quote": "", 
        "reply": "And Cancelling the Airborne Laser system, Missile defence Sysytem when North Korea is desperately trying to enhance their Capability. BRILLIANT! Even Petain & Laval couldnt have come up with a Better plan at appeasement and stupidity", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 15:21:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: That is good. They are $140 million for each one past what is already ordered. The 187 we already ordered cost $361 million each, much of which was an R&D cost. They are a defense project that has gone overtime and over-budget. Something needs to clean up the way contractors run the DoD. $213 a piece according to this guy's math (initial still being $361 mil)! +http://www.military.com/opinion/0,15202,187737,00.html?wh=wh Big contractors are rewarded for taking too long and spending too much. They know it takes so long for major projects that they can get away with whatever they want because the military wants the final product. Considering that at least three F-22s have already crashed it already has one of the worst safety records in the Air Force. There is no reason to buy more of them, they are merely a waste of our tax dollars. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090406, 
        "postID": 25, 
        "quote": "Originally posted by nspreitler: That is good. They are $140 million for each one past what is already ordered. The 187 we already ordered cost $361 million each, much of which was an R&D cost. They are a defense project that has gone overtime and over-budget. Something needs to clean up the way contractors run the DoD. $213 a piece according to this guy's math (initial still being $361 mil)! +http://www.military.com/opinion/0,15202,187737,00.html?wh=wh Big contractors are rewarded for taking too long and spending too much. They know it takes so long for major projects that they can get away with whatever they want because the military wants the final product. Considering that at least three F-22s have already crashed it already has one of the worst safety records in the Air Force. There is no reason to buy more of them, they are merely a waste of our tax dollars.", 
        "reply": " \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 15:29:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "NSNN"
    }, 
    {
        "content": "NA73(North American Aircraft), Crashed just 25 days after it first appeared. Thankfully the BPC didnt give up on it. Today we know it as the P-51 Mustang Many aircraft havd had Crashes and gone on to great things B-17, Harrier, F-15, F-16 etc.", 
        "intTime": 20090406, 
        "postID": 26, 
        "quote": "", 
        "reply": "NA73(North American Aircraft), Crashed just 25 days after it first appeared. Thankfully the BPC didnt give up on it. Today we know it as the P-51 Mustang Many aircraft havd had Crashes and gone on to great things B-17, Harrier, F-15, F-16 etc.", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 15:40:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "And so it begins... the only Fed Gubmint spending the B.O. administration is willing to consider cutting is the only spending it's engaged in that's actually in the Constitution. To hell with the common defense, we gots to spend trillions on new welfare programs and to line the pockets of corrupt union officials and ACORN malcontents. Right? This sickens me. If anything we should be spending more on defense, including the F-22 program.", 
        "intTime": 20090406, 
        "postID": 27, 
        "quote": "", 
        "reply": "And so it begins... the only Fed Gubmint spending the B.O. administration is willing to consider cutting is the only spending it's engaged in that's actually in the Constitution. To hell with the common defense, we gots to spend trillions on new welfare programs and to line the pockets of corrupt union officials and ACORN malcontents. Right? This sickens me. If anything we should be spending more on defense, including the F-22 program.", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 16:03:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "I understand the F 22 went over budget, but now that it's been paid for, wouldn't the price go back down? It's notable the best aircraft out their, far better then the Joint fighter. I was wrong when I though Gates was beyond politics because this seems more like a political move so he keeps his job then anything smart. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090406, 
        "postID": 28, 
        "quote": "", 
        "reply": "I understand the F 22 went over budget, but now that it's been paid for, wouldn't the price go back down? It's notable the best aircraft out their, far better then the Joint fighter. I was wrong when I though Gates was beyond politics because this seems more like a political move so he keeps his job then anything smart. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 16:18:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: I understand the F 22 went over budget, but now that it's been paid for, wouldn't the price go back down? It's notable the best aircraft out their, far better then the Joint fighter. I was wrong when I though Gates was beyond politics because this seems more like a political move so he keeps his job then anything smart. It’s only natural for the Military to tighten its belt when the economy is in the drain...if we didn’t and spent more like some here suggest, we would arguably end up like the Soviet Union! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090406, 
        "postID": 29, 
        "quote": "Originally posted by L0A1: I understand the F 22 went over budget, but now that it's been paid for, wouldn't the price go back down? It's notable the best aircraft out their, far better then the Joint fighter. I was wrong when I though Gates was beyond politics because this seems more like a political move so he keeps his job then anything smart.", 
        "reply": " It’s only natural for the Military to tighten its belt when the economy is in the drain...if we didn’t and spent more like some here suggest, we would arguably end up like the Soviet Union! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 16:28:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: That is good. They are $140 million for each one past what is already ordered. The 187 we already ordered cost $361 million each, much of which was an R&D cost. They are a defense project that has gone overtime and over-budget. Something needs to clean up the way contractors run the DoD. Big contractors are rewarded for taking too long and spending too much. They know it takes so long for major projects that they can get away with whatever they want because the military wants the final product. Considering that at least three F-22s have already crashed it already has one of the worst safety records in the Air Force. There is no reason to buy more of them, they are merely a waste of our tax dollars. And you have worked in the aerospace industry where?... Respectfully, SUNLINER81", 
        "intTime": 20090406, 
        "postID": 30, 
        "quote": "Originally posted by nspreitler: That is good. They are $140 million for each one past what is already ordered. The 187 we already ordered cost $361 million each, much of which was an R&D cost. They are a defense project that has gone overtime and over-budget. Something needs to clean up the way contractors run the DoD. Big contractors are rewarded for taking too long and spending too much. They know it takes so long for major projects that they can get away with whatever they want because the military wants the final product. Considering that at least three F-22s have already crashed it already has one of the worst safety records in the Air Force. There is no reason to buy more of them, they are merely a waste of our tax dollars.", 
        "reply": " And you have worked in the aerospace industry where?... Respectfully, SUNLINER81", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 16:29:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by shades_of_grey: And so it begins... the only Fed Gubmint spending the B.O. administration is willing to consider cutting is the only spending it's engaged in that's actually in the Constitution. To hell with the common defense, we gots to spend trillions on new welfare programs and to line the pockets of corrupt union officials and ACORN malcontents. Right? This sickens me. If anything we should be spending more on defense, including the F-22 program. Why? What is the benefit from having a massive fleet of fighters that can't be used in the wars we are fighting. We are going to have 187 of them, plus thousands more F-35s and new F/A-18Es. Why do we need more of them? There isn't a credible threat from anyone even close to competing with it. N Korea isn't a threat, they still have an air force that uses the same MiG-15s it fought with almost 50 years ago. China isn't a military threat at least not for another 15-20 years. The military needs to build practical capability and $300 million fighters with nobody to fight are not practical.", 
        "intTime": 20090406, 
        "postID": 31, 
        "quote": "Originally posted by shades_of_grey: And so it begins... the only Fed Gubmint spending the B.O. administration is willing to consider cutting is the only spending it's engaged in that's actually in the Constitution. To hell with the common defense, we gots to spend trillions on new welfare programs and to line the pockets of corrupt union officials and ACORN malcontents. Right? This sickens me. If anything we should be spending more on defense, including the F-22 program.", 
        "reply": " Why? What is the benefit from having a massive fleet of fighters that can't be used in the wars we are fighting. We are going to have 187 of them, plus thousands more F-35s and new F/A-18Es. Why do we need more of them? There isn't a credible threat from anyone even close to competing with it. N Korea isn't a threat, they still have an air force that uses the same MiG-15s it fought with almost 50 years ago. China isn't a military threat at least not for another 15-20 years. The military needs to build practical capability and $300 million fighters with nobody to fight are not practical.", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 16:32:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "nspreitler"
    }, 
    {
        "content": "quote: Originally posted by NSNN: quote: Originally posted by L0A1: I understand the F 22 went over budget, but now that it's been paid for, wouldn't the price go back down? It's notable the best aircraft out their, far better then the Joint fighter. I was wrong when I though Gates was beyond politics because this seems more like a political move so he keeps his job then anything smart. It’s only natural for the Military to tighten its belt when the economy is in the drain...if we didn’t and spent more like some here suggest, we would arguably end up like the Soviet Union! I can't argue with that. I just feel they could have picked other programs. Like measuring cow farts and stuff. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090406, 
        "postID": 32, 
        "quote": "Originally posted by NSNN: quote: Originally posted by L0A1: I understand the F 22 went over budget, but now that it's been paid for, wouldn't the price go back down? It's notable the best aircraft out their, far better then the Joint fighter. I was wrong when I though Gates was beyond politics because this seems more like a political move so he keeps his job then anything smart. It’s only natural for the Military to tighten its belt when the economy is in the drain...if we didn’t and spent more like some here suggest, we would arguably end up like the Soviet Union!", 
        "reply": " I can't argue with that. I just feel they could have picked other programs. Like measuring cow farts and stuff. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 16:32:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: quote: Originally posted by shades_of_grey: And so it begins... the only Fed Gubmint spending the B.O. administration is willing to consider cutting is the only spending it's engaged in that's actually in the Constitution. To hell with the common defense, we gots to spend trillions on new welfare programs and to line the pockets of corrupt union officials and ACORN malcontents. Right? This sickens me. If anything we should be spending more on defense, including the F-22 program. Why? What is the benefit from having a massive fleet of fighters that can't be used in the wars we are fighting. We are going to have 187 of them, plus thousands more F-35s and new F/A-18Es. Why do we need more of them? There isn't a credible threat from anyone even close to competing with it. N Korea isn't a threat, they still have an air force that uses the same MiG-15s it fought with almost 50 years ago. China isn't a military threat at least not for another 15-20 years. The military needs to build practical capability and $300 million fighters with nobody to fight are not practical. That's precisely the point, our enemies can't compete with them, while they can with the aged and decrepit F-15s... Now, if you can forecast when, where and who we will fight in the future, with certainty, the Pentagon has a job opening for you... LOL Respectfully, SUNLINER81", 
        "intTime": 20090406, 
        "postID": 33, 
        "quote": "Originally posted by nspreitler: quote: Originally posted by shades_of_grey: And so it begins... the only Fed Gubmint spending the B.O. administration is willing to consider cutting is the only spending it's engaged in that's actually in the Constitution. To hell with the common defense, we gots to spend trillions on new welfare programs and to line the pockets of corrupt union officials and ACORN malcontents. Right? This sickens me. If anything we should be spending more on defense, including the F-22 program. Why? What is the benefit from having a massive fleet of fighters that can't be used in the wars we are fighting. We are going to have 187 of them, plus thousands more F-35s and new F/A-18Es. Why do we need more of them? There isn't a credible threat from anyone even close to competing with it. N Korea isn't a threat, they still have an air force that uses the same MiG-15s it fought with almost 50 years ago. China isn't a military threat at least not for another 15-20 years. The military needs to build practical capability and $300 million fighters with nobody to fight are not practical.", 
        "reply": " That's precisely the point, our enemies can't compete with them, while they can with the aged and decrepit F-15s... Now, if you can forecast when, where and who we will fight in the future, with certainty, the Pentagon has a job opening for you... LOL Respectfully, SUNLINER81", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 16:34:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: I can't argue with that. I just feel they could have picked other programs. Like measuring cow farts and stuff. Math wasn't your favorite subject, was it....", 
        "intTime": 20090406, 
        "postID": 34, 
        "quote": "I can't argue with that. I just feel they could have picked other programs. Like measuring cow farts and stuff.", 
        "reply": " Math wasn't your favorite subject, was it....", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 16:35:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "s122604"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: quote: Originally posted by nspreitler: That is good. They are $140 million for each one past what is already ordered. The 187 we already ordered cost $361 million each, much of which was an R&D cost. They are a defense project that has gone overtime and over-budget. Something needs to clean up the way contractors run the DoD. Big contractors are rewarded for taking too long and spending too much. They know it takes so long for major projects that they can get away with whatever they want because the military wants the final product. Considering that at least three F-22s have already crashed it already has one of the worst safety records in the Air Force. There is no reason to buy more of them, they are merely a waste of our tax dollars. And you have worked in the aerospace industry where?... Respectfully, SUNLINER81 In the Air Force. Did you know those are the people that have to actually use the equipment?", 
        "intTime": 20090406, 
        "postID": 35, 
        "quote": "Originally posted by SUNLINER81: quote: Originally posted by nspreitler: That is good. They are $140 million for each one past what is already ordered. The 187 we already ordered cost $361 million each, much of which was an R&D cost. They are a defense project that has gone overtime and over-budget. Something needs to clean up the way contractors run the DoD. Big contractors are rewarded for taking too long and spending too much. They know it takes so long for major projects that they can get away with whatever they want because the military wants the final product. Considering that at least three F-22s have already crashed it already has one of the worst safety records in the Air Force. There is no reason to buy more of them, they are merely a waste of our tax dollars. And you have worked in the aerospace industry where?... Respectfully, SUNLINER81", 
        "reply": " In the Air Force. Did you know those are the people that have to actually use the equipment?", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 16:35:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "nspreitler"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: quote: Originally posted by nspreitler: quote: Originally posted by shades_of_grey: And so it begins... the only Fed Gubmint spending the B.O. administration is willing to consider cutting is the only spending it's engaged in that's actually in the Constitution. To hell with the common defense, we gots to spend trillions on new welfare programs and to line the pockets of corrupt union officials and ACORN malcontents. Right? This sickens me. If anything we should be spending more on defense, including the F-22 program. Why? What is the benefit from having a massive fleet of fighters that can't be used in the wars we are fighting. We are going to have 187 of them, plus thousands more F-35s and new F/A-18Es. Why do we need more of them? There isn't a credible threat from anyone even close to competing with it. N Korea isn't a threat, they still have an air force that uses the same MiG-15s it fought with almost 50 years ago. China isn't a military threat at least not for another 15-20 years. The military needs to build practical capability and $300 million fighters with nobody to fight are not practical. That's precisely the point, our enemies can't compete with them, while they can with the aged and decrepit F-15s... Now, if you can forecast when, where and who we will fight in the future, with certainty, the Pentagon has a job opening for you... LOL Respectfully, SUNLINER81 Do you mean the F-15s that have a 104-0 kill ratio worldwide?", 
        "intTime": 20090406, 
        "postID": 36, 
        "quote": "Originally posted by SUNLINER81: quote: Originally posted by nspreitler: quote: Originally posted by shades_of_grey: And so it begins... the only Fed Gubmint spending the B.O. administration is willing to consider cutting is the only spending it's engaged in that's actually in the Constitution. To hell with the common defense, we gots to spend trillions on new welfare programs and to line the pockets of corrupt union officials and ACORN malcontents. Right? This sickens me. If anything we should be spending more on defense, including the F-22 program. Why? What is the benefit from having a massive fleet of fighters that can't be used in the wars we are fighting. We are going to have 187 of them, plus thousands more F-35s and new F/A-18Es. Why do we need more of them? There isn't a credible threat from anyone even close to competing with it. N Korea isn't a threat, they still have an air force that uses the same MiG-15s it fought with almost 50 years ago. China isn't a military threat at least not for another 15-20 years. The military needs to build practical capability and $300 million fighters with nobody to fight are not practical. That's precisely the point, our enemies can't compete with them, while they can with the aged and decrepit F-15s... Now, if you can forecast when, where and who we will fight in the future, with certainty, the Pentagon has a job opening for you... LOL Respectfully, SUNLINER81", 
        "reply": " Do you mean the F-15s that have a 104-0 kill ratio worldwide?", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 16:37:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "nspreitler"
    }, 
    {
        "content": "quote: Originally posted by s122604: quote: I can't argue with that. I just feel they could have picked other programs. Like measuring cow farts and stuff. Math wasn't your favorite subject, was it.... Actual, I am very good with math. So instead of your insulting comment, try something real. Since you didn't understand what I was getting at, let me downgrade it for you. THE GOVERMENT BLOWS MONEY ON CRAP that does nothing for this country, where as the F 22 does. Get it? Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090406, 
        "postID": 37, 
        "quote": "Originally posted by s122604: quote: I can't argue with that. I just feel they could have picked other programs. Like measuring cow farts and stuff. Math wasn't your favorite subject, was it....", 
        "reply": " Actual, I am very good with math. So instead of your insulting comment, try something real. Since you didn't understand what I was getting at, let me downgrade it for you. THE GOVERMENT BLOWS MONEY ON CRAP that does nothing for this country, where as the F 22 does. Get it? Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 16:41:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: quote: Originally posted by SUNLINER81: quote: Originally posted by nspreitler: That is good. They are $140 million for each one past what is already ordered. The 187 we already ordered cost $361 million each, much of which was an R&D cost. They are a defense project that has gone overtime and over-budget. Something needs to clean up the way contractors run the DoD. Big contractors are rewarded for taking too long and spending too much. They know it takes so long for major projects that they can get away with whatever they want because the military wants the final product. Considering that at least three F-22s have already crashed it already has one of the worst safety records in the Air Force. There is no reason to buy more of them, they are merely a waste of our tax dollars. And you have worked in the aerospace industry where?... Respectfully, SUNLINER81 In the Air Force. Did you know those are the people that have to actually use the equipment? What I was referring to was on the \"contract\" side of procurement... I too served in the active military aviation branch of the U.S.N. AND I worked for Lockheed, Douglas, Northrop and BAE, in all aspects of contractual negotiations, as a \"Provisioning Analyst\" and on the \"assembly line\"... The point is, aircraft are \"long lead time\" items and they are built to specifications to meet actual and projected hostile forces... It take from eight to twelve years from concept, proposal, test and evaluation, to prototypes, to actual \"article in service\"... The point was and is, if we don't procure these fighters and strike aircraft now, we wont' have time to do it, when and if the schidt hits the fan AND THEN, PEOPLE WILL DIE BECAUSE WE WERE PENNY WISE AND POUND FOOLISH... IMHO... Respectfully, SUNLINER81", 
        "intTime": 20090406, 
        "postID": 38, 
        "quote": "Originally posted by nspreitler: quote: Originally posted by SUNLINER81: quote: Originally posted by nspreitler: That is good. They are $140 million for each one past what is already ordered. The 187 we already ordered cost $361 million each, much of which was an R&D cost. They are a defense project that has gone overtime and over-budget. Something needs to clean up the way contractors run the DoD. Big contractors are rewarded for taking too long and spending too much. They know it takes so long for major projects that they can get away with whatever they want because the military wants the final product. Considering that at least three F-22s have already crashed it already has one of the worst safety records in the Air Force. There is no reason to buy more of them, they are merely a waste of our tax dollars. And you have worked in the aerospace industry where?... Respectfully, SUNLINER81 In the Air Force. Did you know those are the people that have to actually use the equipment?", 
        "reply": " What I was referring to was on the \"contract\" side of procurement... I too served in the active military aviation branch of the U.S.N. AND I worked for Lockheed, Douglas, Northrop and BAE, in all aspects of contractual negotiations, as a \"Provisioning Analyst\" and on the \"assembly line\"... The point is, aircraft are \"long lead time\" items and they are built to specifications to meet actual and projected hostile forces... It take from eight to twelve years from concept, proposal, test and evaluation, to prototypes, to actual \"article in service\"... The point was and is, if we don't procure these fighters and strike aircraft now, we wont' have time to do it, when and if the schidt hits the fan AND THEN, PEOPLE WILL DIE BECAUSE WE WERE PENNY WISE AND POUND FOOLISH... IMHO... Respectfully, SUNLINER81", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 16:42:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "Show me a cow fart study that equals up to even one F22... You can't. Tell us what the government should cut, to make up for these programs. I'd like to see you balance the numbers...", 
        "intTime": 20090406, 
        "postID": 39, 
        "quote": "", 
        "reply": "Show me a cow fart study that equals up to even one F22... You can't. Tell us what the government should cut, to make up for these programs. I'd like to see you balance the numbers...", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 16:43:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "s122604"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: Do you mean the F-15s that have a 104-0 kill ratio worldwide? In all fairness, that ratio is inflated and somewhat flawed! It never went one on one against an A/C in its class! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090406, 
        "postID": 40, 
        "quote": "Originally posted by nspreitler: Do you mean the F-15s that have a 104-0 kill ratio worldwide?", 
        "reply": " In all fairness, that ratio is inflated and somewhat flawed! It never went one on one against an A/C in its class! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 16:44:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "NSNN"
    }, 
    {
        "content": "Note: this is an updated thread, please scroll down or go to the last page for the latest update. Before the blame game begins, have in mind that this has yet to pass Congress and is still a proposal as of yet. quote: ++http://www.foxnews.com/politics/first100days/2009/04/06/gates-calling-cuts-high-tech-weapons-programs/ WASHINGTON -- Defense Secretary Robert Gates is proposing deep cuts to some big weapons programs such as the F-22 fighter jet as the Pentagon takes a hard look at how it spends money. Gates announced a broad range of cuts Monday to weapons spending, saying he plans to cut programs ranging from a new helicopter for the president to ending production of the $140 billion F-22 fighter jet. The Army's modernization program would be scaled back, while a new satellite system and a search-and-rescue helicopter would be cut. Gates says his budget will \"profoundly reform\" the way the Pentagon buys weapons and does business. To fight new threats from insurgents, Gates is proposing more funding for special forces and other tools... This message has been edited. Last edited by: Canuck_Centaur, Thu 25 June 2009 10:18 PM", 
        "intTime": 20090406, 
        "postID": 41, 
        "quote": "++http://www.foxnews.com/politics/first100days/2009/04/06/gates-calling-cuts-high-tech-weapons-programs/ WASHINGTON -- Defense Secretary Robert Gates is proposing deep cuts to some big weapons programs such as the F-22 fighter jet as the Pentagon takes a hard look at how it spends money. Gates announced a broad range of cuts Monday to weapons spending, saying he plans to cut programs ranging from a new helicopter for the president to ending production of the $140 billion F-22 fighter jet. The Army's modernization program would be scaled back, while a new satellite system and a search-and-rescue helicopter would be cut. Gates says his budget will \"profoundly reform\" the way the Pentagon buys weapons and does business. To fight new threats from insurgents, Gates is proposing more funding for special forces and other tools...", 
        "reply": "Note: this is an updated thread, please scroll down or go to the last page for the latest update. Before the blame game begins, have in mind that this has yet to pass Congress and is still a proposal as of yet.  This message has been edited. Last edited by: Canuck_Centaur, Thu 25 June 2009 10:18 PM", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 14:11:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "That is good. They are $140 million for each one past what is already ordered. The 187 we already ordered cost $361 million each, much of which was an R&D cost. They are a defense project that has gone overtime and over-budget. Something needs to clean up the way contractors run the DoD. Big contractors are rewarded for taking too long and spending too much. They know it takes so long for major projects that they can get away with whatever they want because the military wants the final product. Considering that at least three F-22s have already crashed it already has one of the worst safety records in the Air Force. There is no reason to buy more of them, they are merely a waste of our tax dollars.", 
        "intTime": 20090406, 
        "postID": 42, 
        "quote": "", 
        "reply": "That is good. They are $140 million for each one past what is already ordered. The 187 we already ordered cost $361 million each, much of which was an R&D cost. They are a defense project that has gone overtime and over-budget. Something needs to clean up the way contractors run the DoD. Big contractors are rewarded for taking too long and spending too much. They know it takes so long for major projects that they can get away with whatever they want because the military wants the final product. Considering that at least three F-22s have already crashed it already has one of the worst safety records in the Air Force. There is no reason to buy more of them, they are merely a waste of our tax dollars.", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 14:32:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "nspreitler"
    }, 
    {
        "content": "Mr. Gates is a very wise man. I support his decision 100% to cancel the F22 program.", 
        "intTime": 20090406, 
        "postID": 43, 
        "quote": "", 
        "reply": "Mr. Gates is a very wise man. I support his decision 100% to cancel the F22 program.", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 15:02:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "Duster6"
    }, 
    {
        "content": "And Cancelling the Airborne Laser system, Missile defence Sysytem when North Korea is desperately trying to enhance their Capability. BRILLIANT! Even Petain & Laval couldnt have come up with a Better plan at appeasement and stupidity", 
        "intTime": 20090406, 
        "postID": 44, 
        "quote": "", 
        "reply": "And Cancelling the Airborne Laser system, Missile defence Sysytem when North Korea is desperately trying to enhance their Capability. BRILLIANT! Even Petain & Laval couldnt have come up with a Better plan at appeasement and stupidity", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 15:21:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: That is good. They are $140 million for each one past what is already ordered. The 187 we already ordered cost $361 million each, much of which was an R&D cost. They are a defense project that has gone overtime and over-budget. Something needs to clean up the way contractors run the DoD. $213 a piece according to this guy's math (initial still being $361 mil)! +http://www.military.com/opinion/0,15202,187737,00.html?wh=wh Big contractors are rewarded for taking too long and spending too much. They know it takes so long for major projects that they can get away with whatever they want because the military wants the final product. Considering that at least three F-22s have already crashed it already has one of the worst safety records in the Air Force. There is no reason to buy more of them, they are merely a waste of our tax dollars. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090406, 
        "postID": 45, 
        "quote": "Originally posted by nspreitler: That is good. They are $140 million for each one past what is already ordered. The 187 we already ordered cost $361 million each, much of which was an R&D cost. They are a defense project that has gone overtime and over-budget. Something needs to clean up the way contractors run the DoD. $213 a piece according to this guy's math (initial still being $361 mil)! +http://www.military.com/opinion/0,15202,187737,00.html?wh=wh Big contractors are rewarded for taking too long and spending too much. They know it takes so long for major projects that they can get away with whatever they want because the military wants the final product. Considering that at least three F-22s have already crashed it already has one of the worst safety records in the Air Force. There is no reason to buy more of them, they are merely a waste of our tax dollars.", 
        "reply": " \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 15:29:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "NSNN"
    }, 
    {
        "content": "NA73(North American Aircraft), Crashed just 25 days after it first appeared. Thankfully the BPC didnt give up on it. Today we know it as the P-51 Mustang Many aircraft havd had Crashes and gone on to great things B-17, Harrier, F-15, F-16 etc.", 
        "intTime": 20090406, 
        "postID": 46, 
        "quote": "", 
        "reply": "NA73(North American Aircraft), Crashed just 25 days after it first appeared. Thankfully the BPC didnt give up on it. Today we know it as the P-51 Mustang Many aircraft havd had Crashes and gone on to great things B-17, Harrier, F-15, F-16 etc.", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 15:40:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "And so it begins... the only Fed Gubmint spending the B.O. administration is willing to consider cutting is the only spending it's engaged in that's actually in the Constitution. To hell with the common defense, we gots to spend trillions on new welfare programs and to line the pockets of corrupt union officials and ACORN malcontents. Right? This sickens me. If anything we should be spending more on defense, including the F-22 program.", 
        "intTime": 20090406, 
        "postID": 47, 
        "quote": "", 
        "reply": "And so it begins... the only Fed Gubmint spending the B.O. administration is willing to consider cutting is the only spending it's engaged in that's actually in the Constitution. To hell with the common defense, we gots to spend trillions on new welfare programs and to line the pockets of corrupt union officials and ACORN malcontents. Right? This sickens me. If anything we should be spending more on defense, including the F-22 program.", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 16:03:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "I understand the F 22 went over budget, but now that it's been paid for, wouldn't the price go back down? It's notable the best aircraft out their, far better then the Joint fighter. I was wrong when I though Gates was beyond politics because this seems more like a political move so he keeps his job then anything smart. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090406, 
        "postID": 48, 
        "quote": "", 
        "reply": "I understand the F 22 went over budget, but now that it's been paid for, wouldn't the price go back down? It's notable the best aircraft out their, far better then the Joint fighter. I was wrong when I though Gates was beyond politics because this seems more like a political move so he keeps his job then anything smart. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 16:18:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: I understand the F 22 went over budget, but now that it's been paid for, wouldn't the price go back down? It's notable the best aircraft out their, far better then the Joint fighter. I was wrong when I though Gates was beyond politics because this seems more like a political move so he keeps his job then anything smart. It’s only natural for the Military to tighten its belt when the economy is in the drain...if we didn’t and spent more like some here suggest, we would arguably end up like the Soviet Union! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090406, 
        "postID": 49, 
        "quote": "Originally posted by L0A1: I understand the F 22 went over budget, but now that it's been paid for, wouldn't the price go back down? It's notable the best aircraft out their, far better then the Joint fighter. I was wrong when I though Gates was beyond politics because this seems more like a political move so he keeps his job then anything smart.", 
        "reply": " It’s only natural for the Military to tighten its belt when the economy is in the drain...if we didn’t and spent more like some here suggest, we would arguably end up like the Soviet Union! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 16:28:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: That is good. They are $140 million for each one past what is already ordered. The 187 we already ordered cost $361 million each, much of which was an R&D cost. They are a defense project that has gone overtime and over-budget. Something needs to clean up the way contractors run the DoD. Big contractors are rewarded for taking too long and spending too much. They know it takes so long for major projects that they can get away with whatever they want because the military wants the final product. Considering that at least three F-22s have already crashed it already has one of the worst safety records in the Air Force. There is no reason to buy more of them, they are merely a waste of our tax dollars. And you have worked in the aerospace industry where?... Respectfully, SUNLINER81", 
        "intTime": 20090406, 
        "postID": 50, 
        "quote": "Originally posted by nspreitler: That is good. They are $140 million for each one past what is already ordered. The 187 we already ordered cost $361 million each, much of which was an R&D cost. They are a defense project that has gone overtime and over-budget. Something needs to clean up the way contractors run the DoD. Big contractors are rewarded for taking too long and spending too much. They know it takes so long for major projects that they can get away with whatever they want because the military wants the final product. Considering that at least three F-22s have already crashed it already has one of the worst safety records in the Air Force. There is no reason to buy more of them, they are merely a waste of our tax dollars.", 
        "reply": " And you have worked in the aerospace industry where?... Respectfully, SUNLINER81", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 16:29:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by shades_of_grey: And so it begins... the only Fed Gubmint spending the B.O. administration is willing to consider cutting is the only spending it's engaged in that's actually in the Constitution. To hell with the common defense, we gots to spend trillions on new welfare programs and to line the pockets of corrupt union officials and ACORN malcontents. Right? This sickens me. If anything we should be spending more on defense, including the F-22 program. Why? What is the benefit from having a massive fleet of fighters that can't be used in the wars we are fighting. We are going to have 187 of them, plus thousands more F-35s and new F/A-18Es. Why do we need more of them? There isn't a credible threat from anyone even close to competing with it. N Korea isn't a threat, they still have an air force that uses the same MiG-15s it fought with almost 50 years ago. China isn't a military threat at least not for another 15-20 years. The military needs to build practical capability and $300 million fighters with nobody to fight are not practical.", 
        "intTime": 20090406, 
        "postID": 51, 
        "quote": "Originally posted by shades_of_grey: And so it begins... the only Fed Gubmint spending the B.O. administration is willing to consider cutting is the only spending it's engaged in that's actually in the Constitution. To hell with the common defense, we gots to spend trillions on new welfare programs and to line the pockets of corrupt union officials and ACORN malcontents. Right? This sickens me. If anything we should be spending more on defense, including the F-22 program.", 
        "reply": " Why? What is the benefit from having a massive fleet of fighters that can't be used in the wars we are fighting. We are going to have 187 of them, plus thousands more F-35s and new F/A-18Es. Why do we need more of them? There isn't a credible threat from anyone even close to competing with it. N Korea isn't a threat, they still have an air force that uses the same MiG-15s it fought with almost 50 years ago. China isn't a military threat at least not for another 15-20 years. The military needs to build practical capability and $300 million fighters with nobody to fight are not practical.", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 16:32:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "nspreitler"
    }, 
    {
        "content": "quote: Originally posted by NSNN: quote: Originally posted by L0A1: I understand the F 22 went over budget, but now that it's been paid for, wouldn't the price go back down? It's notable the best aircraft out their, far better then the Joint fighter. I was wrong when I though Gates was beyond politics because this seems more like a political move so he keeps his job then anything smart. It’s only natural for the Military to tighten its belt when the economy is in the drain...if we didn’t and spent more like some here suggest, we would arguably end up like the Soviet Union! I can't argue with that. I just feel they could have picked other programs. Like measuring cow farts and stuff. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090406, 
        "postID": 52, 
        "quote": "Originally posted by NSNN: quote: Originally posted by L0A1: I understand the F 22 went over budget, but now that it's been paid for, wouldn't the price go back down? It's notable the best aircraft out their, far better then the Joint fighter. I was wrong when I though Gates was beyond politics because this seems more like a political move so he keeps his job then anything smart. It’s only natural for the Military to tighten its belt when the economy is in the drain...if we didn’t and spent more like some here suggest, we would arguably end up like the Soviet Union!", 
        "reply": " I can't argue with that. I just feel they could have picked other programs. Like measuring cow farts and stuff. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 16:32:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: quote: Originally posted by shades_of_grey: And so it begins... the only Fed Gubmint spending the B.O. administration is willing to consider cutting is the only spending it's engaged in that's actually in the Constitution. To hell with the common defense, we gots to spend trillions on new welfare programs and to line the pockets of corrupt union officials and ACORN malcontents. Right? This sickens me. If anything we should be spending more on defense, including the F-22 program. Why? What is the benefit from having a massive fleet of fighters that can't be used in the wars we are fighting. We are going to have 187 of them, plus thousands more F-35s and new F/A-18Es. Why do we need more of them? There isn't a credible threat from anyone even close to competing with it. N Korea isn't a threat, they still have an air force that uses the same MiG-15s it fought with almost 50 years ago. China isn't a military threat at least not for another 15-20 years. The military needs to build practical capability and $300 million fighters with nobody to fight are not practical. That's precisely the point, our enemies can't compete with them, while they can with the aged and decrepit F-15s... Now, if you can forecast when, where and who we will fight in the future, with certainty, the Pentagon has a job opening for you... LOL Respectfully, SUNLINER81", 
        "intTime": 20090406, 
        "postID": 53, 
        "quote": "Originally posted by nspreitler: quote: Originally posted by shades_of_grey: And so it begins... the only Fed Gubmint spending the B.O. administration is willing to consider cutting is the only spending it's engaged in that's actually in the Constitution. To hell with the common defense, we gots to spend trillions on new welfare programs and to line the pockets of corrupt union officials and ACORN malcontents. Right? This sickens me. If anything we should be spending more on defense, including the F-22 program. Why? What is the benefit from having a massive fleet of fighters that can't be used in the wars we are fighting. We are going to have 187 of them, plus thousands more F-35s and new F/A-18Es. Why do we need more of them? There isn't a credible threat from anyone even close to competing with it. N Korea isn't a threat, they still have an air force that uses the same MiG-15s it fought with almost 50 years ago. China isn't a military threat at least not for another 15-20 years. The military needs to build practical capability and $300 million fighters with nobody to fight are not practical.", 
        "reply": " That's precisely the point, our enemies can't compete with them, while they can with the aged and decrepit F-15s... Now, if you can forecast when, where and who we will fight in the future, with certainty, the Pentagon has a job opening for you... LOL Respectfully, SUNLINER81", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 16:34:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: I can't argue with that. I just feel they could have picked other programs. Like measuring cow farts and stuff. Math wasn't your favorite subject, was it....", 
        "intTime": 20090406, 
        "postID": 54, 
        "quote": "I can't argue with that. I just feel they could have picked other programs. Like measuring cow farts and stuff.", 
        "reply": " Math wasn't your favorite subject, was it....", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 16:35:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "s122604"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: quote: Originally posted by nspreitler: That is good. They are $140 million for each one past what is already ordered. The 187 we already ordered cost $361 million each, much of which was an R&D cost. They are a defense project that has gone overtime and over-budget. Something needs to clean up the way contractors run the DoD. Big contractors are rewarded for taking too long and spending too much. They know it takes so long for major projects that they can get away with whatever they want because the military wants the final product. Considering that at least three F-22s have already crashed it already has one of the worst safety records in the Air Force. There is no reason to buy more of them, they are merely a waste of our tax dollars. And you have worked in the aerospace industry where?... Respectfully, SUNLINER81 In the Air Force. Did you know those are the people that have to actually use the equipment?", 
        "intTime": 20090406, 
        "postID": 55, 
        "quote": "Originally posted by SUNLINER81: quote: Originally posted by nspreitler: That is good. They are $140 million for each one past what is already ordered. The 187 we already ordered cost $361 million each, much of which was an R&D cost. They are a defense project that has gone overtime and over-budget. Something needs to clean up the way contractors run the DoD. Big contractors are rewarded for taking too long and spending too much. They know it takes so long for major projects that they can get away with whatever they want because the military wants the final product. Considering that at least three F-22s have already crashed it already has one of the worst safety records in the Air Force. There is no reason to buy more of them, they are merely a waste of our tax dollars. And you have worked in the aerospace industry where?... Respectfully, SUNLINER81", 
        "reply": " In the Air Force. Did you know those are the people that have to actually use the equipment?", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 16:35:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "nspreitler"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: quote: Originally posted by nspreitler: quote: Originally posted by shades_of_grey: And so it begins... the only Fed Gubmint spending the B.O. administration is willing to consider cutting is the only spending it's engaged in that's actually in the Constitution. To hell with the common defense, we gots to spend trillions on new welfare programs and to line the pockets of corrupt union officials and ACORN malcontents. Right? This sickens me. If anything we should be spending more on defense, including the F-22 program. Why? What is the benefit from having a massive fleet of fighters that can't be used in the wars we are fighting. We are going to have 187 of them, plus thousands more F-35s and new F/A-18Es. Why do we need more of them? There isn't a credible threat from anyone even close to competing with it. N Korea isn't a threat, they still have an air force that uses the same MiG-15s it fought with almost 50 years ago. China isn't a military threat at least not for another 15-20 years. The military needs to build practical capability and $300 million fighters with nobody to fight are not practical. That's precisely the point, our enemies can't compete with them, while they can with the aged and decrepit F-15s... Now, if you can forecast when, where and who we will fight in the future, with certainty, the Pentagon has a job opening for you... LOL Respectfully, SUNLINER81 Do you mean the F-15s that have a 104-0 kill ratio worldwide?", 
        "intTime": 20090406, 
        "postID": 56, 
        "quote": "Originally posted by SUNLINER81: quote: Originally posted by nspreitler: quote: Originally posted by shades_of_grey: And so it begins... the only Fed Gubmint spending the B.O. administration is willing to consider cutting is the only spending it's engaged in that's actually in the Constitution. To hell with the common defense, we gots to spend trillions on new welfare programs and to line the pockets of corrupt union officials and ACORN malcontents. Right? This sickens me. If anything we should be spending more on defense, including the F-22 program. Why? What is the benefit from having a massive fleet of fighters that can't be used in the wars we are fighting. We are going to have 187 of them, plus thousands more F-35s and new F/A-18Es. Why do we need more of them? There isn't a credible threat from anyone even close to competing with it. N Korea isn't a threat, they still have an air force that uses the same MiG-15s it fought with almost 50 years ago. China isn't a military threat at least not for another 15-20 years. The military needs to build practical capability and $300 million fighters with nobody to fight are not practical. That's precisely the point, our enemies can't compete with them, while they can with the aged and decrepit F-15s... Now, if you can forecast when, where and who we will fight in the future, with certainty, the Pentagon has a job opening for you... LOL Respectfully, SUNLINER81", 
        "reply": " Do you mean the F-15s that have a 104-0 kill ratio worldwide?", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 16:37:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "nspreitler"
    }, 
    {
        "content": "quote: Originally posted by s122604: quote: I can't argue with that. I just feel they could have picked other programs. Like measuring cow farts and stuff. Math wasn't your favorite subject, was it.... Actual, I am very good with math. So instead of your insulting comment, try something real. Since you didn't understand what I was getting at, let me downgrade it for you. THE GOVERMENT BLOWS MONEY ON CRAP that does nothing for this country, where as the F 22 does. Get it? Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090406, 
        "postID": 57, 
        "quote": "Originally posted by s122604: quote: I can't argue with that. I just feel they could have picked other programs. Like measuring cow farts and stuff. Math wasn't your favorite subject, was it....", 
        "reply": " Actual, I am very good with math. So instead of your insulting comment, try something real. Since you didn't understand what I was getting at, let me downgrade it for you. THE GOVERMENT BLOWS MONEY ON CRAP that does nothing for this country, where as the F 22 does. Get it? Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 16:41:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: quote: Originally posted by SUNLINER81: quote: Originally posted by nspreitler: That is good. They are $140 million for each one past what is already ordered. The 187 we already ordered cost $361 million each, much of which was an R&D cost. They are a defense project that has gone overtime and over-budget. Something needs to clean up the way contractors run the DoD. Big contractors are rewarded for taking too long and spending too much. They know it takes so long for major projects that they can get away with whatever they want because the military wants the final product. Considering that at least three F-22s have already crashed it already has one of the worst safety records in the Air Force. There is no reason to buy more of them, they are merely a waste of our tax dollars. And you have worked in the aerospace industry where?... Respectfully, SUNLINER81 In the Air Force. Did you know those are the people that have to actually use the equipment? What I was referring to was on the \"contract\" side of procurement... I too served in the active military aviation branch of the U.S.N. AND I worked for Lockheed, Douglas, Northrop and BAE, in all aspects of contractual negotiations, as a \"Provisioning Analyst\" and on the \"assembly line\"... The point is, aircraft are \"long lead time\" items and they are built to specifications to meet actual and projected hostile forces... It take from eight to twelve years from concept, proposal, test and evaluation, to prototypes, to actual \"article in service\"... The point was and is, if we don't procure these fighters and strike aircraft now, we wont' have time to do it, when and if the schidt hits the fan AND THEN, PEOPLE WILL DIE BECAUSE WE WERE PENNY WISE AND POUND FOOLISH... IMHO... Respectfully, SUNLINER81", 
        "intTime": 20090406, 
        "postID": 58, 
        "quote": "Originally posted by nspreitler: quote: Originally posted by SUNLINER81: quote: Originally posted by nspreitler: That is good. They are $140 million for each one past what is already ordered. The 187 we already ordered cost $361 million each, much of which was an R&D cost. They are a defense project that has gone overtime and over-budget. Something needs to clean up the way contractors run the DoD. Big contractors are rewarded for taking too long and spending too much. They know it takes so long for major projects that they can get away with whatever they want because the military wants the final product. Considering that at least three F-22s have already crashed it already has one of the worst safety records in the Air Force. There is no reason to buy more of them, they are merely a waste of our tax dollars. And you have worked in the aerospace industry where?... Respectfully, SUNLINER81 In the Air Force. Did you know those are the people that have to actually use the equipment?", 
        "reply": " What I was referring to was on the \"contract\" side of procurement... I too served in the active military aviation branch of the U.S.N. AND I worked for Lockheed, Douglas, Northrop and BAE, in all aspects of contractual negotiations, as a \"Provisioning Analyst\" and on the \"assembly line\"... The point is, aircraft are \"long lead time\" items and they are built to specifications to meet actual and projected hostile forces... It take from eight to twelve years from concept, proposal, test and evaluation, to prototypes, to actual \"article in service\"... The point was and is, if we don't procure these fighters and strike aircraft now, we wont' have time to do it, when and if the schidt hits the fan AND THEN, PEOPLE WILL DIE BECAUSE WE WERE PENNY WISE AND POUND FOOLISH... IMHO... Respectfully, SUNLINER81", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 16:42:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "Show me a cow fart study that equals up to even one F22... You can't. Tell us what the government should cut, to make up for these programs. I'd like to see you balance the numbers...", 
        "intTime": 20090406, 
        "postID": 59, 
        "quote": "", 
        "reply": "Show me a cow fart study that equals up to even one F22... You can't. Tell us what the government should cut, to make up for these programs. I'd like to see you balance the numbers...", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 16:43:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "s122604"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: Do you mean the F-15s that have a 104-0 kill ratio worldwide? In all fairness, that ratio is inflated and somewhat flawed! It never went one on one against an A/C in its class! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090406, 
        "postID": 60, 
        "quote": "Originally posted by nspreitler: Do you mean the F-15s that have a 104-0 kill ratio worldwide?", 
        "reply": " In all fairness, that ratio is inflated and somewhat flawed! It never went one on one against an A/C in its class! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 16:44:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "NSNN"
    }, 
    {
        "content": "Note: this is an updated thread, please scroll down or go to the last page for the latest update. Before the blame game begins, have in mind that this has yet to pass Congress and is still a proposal as of yet. quote: ++http://www.foxnews.com/politics/first100days/2009/04/06/gates-calling-cuts-high-tech-weapons-programs/ WASHINGTON -- Defense Secretary Robert Gates is proposing deep cuts to some big weapons programs such as the F-22 fighter jet as the Pentagon takes a hard look at how it spends money. Gates announced a broad range of cuts Monday to weapons spending, saying he plans to cut programs ranging from a new helicopter for the president to ending production of the $140 billion F-22 fighter jet. The Army's modernization program would be scaled back, while a new satellite system and a search-and-rescue helicopter would be cut. Gates says his budget will \"profoundly reform\" the way the Pentagon buys weapons and does business. To fight new threats from insurgents, Gates is proposing more funding for special forces and other tools... This message has been edited. Last edited by: Canuck_Centaur, Thu 25 June 2009 10:18 PM", 
        "intTime": 20090406, 
        "postID": 61, 
        "quote": "++http://www.foxnews.com/politics/first100days/2009/04/06/gates-calling-cuts-high-tech-weapons-programs/ WASHINGTON -- Defense Secretary Robert Gates is proposing deep cuts to some big weapons programs such as the F-22 fighter jet as the Pentagon takes a hard look at how it spends money. Gates announced a broad range of cuts Monday to weapons spending, saying he plans to cut programs ranging from a new helicopter for the president to ending production of the $140 billion F-22 fighter jet. The Army's modernization program would be scaled back, while a new satellite system and a search-and-rescue helicopter would be cut. Gates says his budget will \"profoundly reform\" the way the Pentagon buys weapons and does business. To fight new threats from insurgents, Gates is proposing more funding for special forces and other tools...", 
        "reply": "Note: this is an updated thread, please scroll down or go to the last page for the latest update. Before the blame game begins, have in mind that this has yet to pass Congress and is still a proposal as of yet.  This message has been edited. Last edited by: Canuck_Centaur, Thu 25 June 2009 10:18 PM", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 14:11:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "That is good. They are $140 million for each one past what is already ordered. The 187 we already ordered cost $361 million each, much of which was an R&D cost. They are a defense project that has gone overtime and over-budget. Something needs to clean up the way contractors run the DoD. Big contractors are rewarded for taking too long and spending too much. They know it takes so long for major projects that they can get away with whatever they want because the military wants the final product. Considering that at least three F-22s have already crashed it already has one of the worst safety records in the Air Force. There is no reason to buy more of them, they are merely a waste of our tax dollars.", 
        "intTime": 20090406, 
        "postID": 62, 
        "quote": "", 
        "reply": "That is good. They are $140 million for each one past what is already ordered. The 187 we already ordered cost $361 million each, much of which was an R&D cost. They are a defense project that has gone overtime and over-budget. Something needs to clean up the way contractors run the DoD. Big contractors are rewarded for taking too long and spending too much. They know it takes so long for major projects that they can get away with whatever they want because the military wants the final product. Considering that at least three F-22s have already crashed it already has one of the worst safety records in the Air Force. There is no reason to buy more of them, they are merely a waste of our tax dollars.", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 14:32:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "nspreitler"
    }, 
    {
        "content": "Mr. Gates is a very wise man. I support his decision 100% to cancel the F22 program.", 
        "intTime": 20090406, 
        "postID": 63, 
        "quote": "", 
        "reply": "Mr. Gates is a very wise man. I support his decision 100% to cancel the F22 program.", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 15:02:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "Duster6"
    }, 
    {
        "content": "And Cancelling the Airborne Laser system, Missile defence Sysytem when North Korea is desperately trying to enhance their Capability. BRILLIANT! Even Petain & Laval couldnt have come up with a Better plan at appeasement and stupidity", 
        "intTime": 20090406, 
        "postID": 64, 
        "quote": "", 
        "reply": "And Cancelling the Airborne Laser system, Missile defence Sysytem when North Korea is desperately trying to enhance their Capability. BRILLIANT! Even Petain & Laval couldnt have come up with a Better plan at appeasement and stupidity", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 15:21:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: That is good. They are $140 million for each one past what is already ordered. The 187 we already ordered cost $361 million each, much of which was an R&D cost. They are a defense project that has gone overtime and over-budget. Something needs to clean up the way contractors run the DoD. $213 a piece according to this guy's math (initial still being $361 mil)! +http://www.military.com/opinion/0,15202,187737,00.html?wh=wh Big contractors are rewarded for taking too long and spending too much. They know it takes so long for major projects that they can get away with whatever they want because the military wants the final product. Considering that at least three F-22s have already crashed it already has one of the worst safety records in the Air Force. There is no reason to buy more of them, they are merely a waste of our tax dollars. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090406, 
        "postID": 65, 
        "quote": "Originally posted by nspreitler: That is good. They are $140 million for each one past what is already ordered. The 187 we already ordered cost $361 million each, much of which was an R&D cost. They are a defense project that has gone overtime and over-budget. Something needs to clean up the way contractors run the DoD. $213 a piece according to this guy's math (initial still being $361 mil)! +http://www.military.com/opinion/0,15202,187737,00.html?wh=wh Big contractors are rewarded for taking too long and spending too much. They know it takes so long for major projects that they can get away with whatever they want because the military wants the final product. Considering that at least three F-22s have already crashed it already has one of the worst safety records in the Air Force. There is no reason to buy more of them, they are merely a waste of our tax dollars.", 
        "reply": " \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 15:29:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "NSNN"
    }, 
    {
        "content": "NA73(North American Aircraft), Crashed just 25 days after it first appeared. Thankfully the BPC didnt give up on it. Today we know it as the P-51 Mustang Many aircraft havd had Crashes and gone on to great things B-17, Harrier, F-15, F-16 etc.", 
        "intTime": 20090406, 
        "postID": 66, 
        "quote": "", 
        "reply": "NA73(North American Aircraft), Crashed just 25 days after it first appeared. Thankfully the BPC didnt give up on it. Today we know it as the P-51 Mustang Many aircraft havd had Crashes and gone on to great things B-17, Harrier, F-15, F-16 etc.", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 15:40:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "And so it begins... the only Fed Gubmint spending the B.O. administration is willing to consider cutting is the only spending it's engaged in that's actually in the Constitution. To hell with the common defense, we gots to spend trillions on new welfare programs and to line the pockets of corrupt union officials and ACORN malcontents. Right? This sickens me. If anything we should be spending more on defense, including the F-22 program.", 
        "intTime": 20090406, 
        "postID": 67, 
        "quote": "", 
        "reply": "And so it begins... the only Fed Gubmint spending the B.O. administration is willing to consider cutting is the only spending it's engaged in that's actually in the Constitution. To hell with the common defense, we gots to spend trillions on new welfare programs and to line the pockets of corrupt union officials and ACORN malcontents. Right? This sickens me. If anything we should be spending more on defense, including the F-22 program.", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 16:03:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "I understand the F 22 went over budget, but now that it's been paid for, wouldn't the price go back down? It's notable the best aircraft out their, far better then the Joint fighter. I was wrong when I though Gates was beyond politics because this seems more like a political move so he keeps his job then anything smart. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090406, 
        "postID": 68, 
        "quote": "", 
        "reply": "I understand the F 22 went over budget, but now that it's been paid for, wouldn't the price go back down? It's notable the best aircraft out their, far better then the Joint fighter. I was wrong when I though Gates was beyond politics because this seems more like a political move so he keeps his job then anything smart. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 16:18:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: I understand the F 22 went over budget, but now that it's been paid for, wouldn't the price go back down? It's notable the best aircraft out their, far better then the Joint fighter. I was wrong when I though Gates was beyond politics because this seems more like a political move so he keeps his job then anything smart. It’s only natural for the Military to tighten its belt when the economy is in the drain...if we didn’t and spent more like some here suggest, we would arguably end up like the Soviet Union! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090406, 
        "postID": 69, 
        "quote": "Originally posted by L0A1: I understand the F 22 went over budget, but now that it's been paid for, wouldn't the price go back down? It's notable the best aircraft out their, far better then the Joint fighter. I was wrong when I though Gates was beyond politics because this seems more like a political move so he keeps his job then anything smart.", 
        "reply": " It’s only natural for the Military to tighten its belt when the economy is in the drain...if we didn’t and spent more like some here suggest, we would arguably end up like the Soviet Union! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 16:28:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: That is good. They are $140 million for each one past what is already ordered. The 187 we already ordered cost $361 million each, much of which was an R&D cost. They are a defense project that has gone overtime and over-budget. Something needs to clean up the way contractors run the DoD. Big contractors are rewarded for taking too long and spending too much. They know it takes so long for major projects that they can get away with whatever they want because the military wants the final product. Considering that at least three F-22s have already crashed it already has one of the worst safety records in the Air Force. There is no reason to buy more of them, they are merely a waste of our tax dollars. And you have worked in the aerospace industry where?... Respectfully, SUNLINER81", 
        "intTime": 20090406, 
        "postID": 70, 
        "quote": "Originally posted by nspreitler: That is good. They are $140 million for each one past what is already ordered. The 187 we already ordered cost $361 million each, much of which was an R&D cost. They are a defense project that has gone overtime and over-budget. Something needs to clean up the way contractors run the DoD. Big contractors are rewarded for taking too long and spending too much. They know it takes so long for major projects that they can get away with whatever they want because the military wants the final product. Considering that at least three F-22s have already crashed it already has one of the worst safety records in the Air Force. There is no reason to buy more of them, they are merely a waste of our tax dollars.", 
        "reply": " And you have worked in the aerospace industry where?... Respectfully, SUNLINER81", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 16:29:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by shades_of_grey: And so it begins... the only Fed Gubmint spending the B.O. administration is willing to consider cutting is the only spending it's engaged in that's actually in the Constitution. To hell with the common defense, we gots to spend trillions on new welfare programs and to line the pockets of corrupt union officials and ACORN malcontents. Right? This sickens me. If anything we should be spending more on defense, including the F-22 program. Why? What is the benefit from having a massive fleet of fighters that can't be used in the wars we are fighting. We are going to have 187 of them, plus thousands more F-35s and new F/A-18Es. Why do we need more of them? There isn't a credible threat from anyone even close to competing with it. N Korea isn't a threat, they still have an air force that uses the same MiG-15s it fought with almost 50 years ago. China isn't a military threat at least not for another 15-20 years. The military needs to build practical capability and $300 million fighters with nobody to fight are not practical.", 
        "intTime": 20090406, 
        "postID": 71, 
        "quote": "Originally posted by shades_of_grey: And so it begins... the only Fed Gubmint spending the B.O. administration is willing to consider cutting is the only spending it's engaged in that's actually in the Constitution. To hell with the common defense, we gots to spend trillions on new welfare programs and to line the pockets of corrupt union officials and ACORN malcontents. Right? This sickens me. If anything we should be spending more on defense, including the F-22 program.", 
        "reply": " Why? What is the benefit from having a massive fleet of fighters that can't be used in the wars we are fighting. We are going to have 187 of them, plus thousands more F-35s and new F/A-18Es. Why do we need more of them? There isn't a credible threat from anyone even close to competing with it. N Korea isn't a threat, they still have an air force that uses the same MiG-15s it fought with almost 50 years ago. China isn't a military threat at least not for another 15-20 years. The military needs to build practical capability and $300 million fighters with nobody to fight are not practical.", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 16:32:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "nspreitler"
    }, 
    {
        "content": "quote: Originally posted by NSNN: quote: Originally posted by L0A1: I understand the F 22 went over budget, but now that it's been paid for, wouldn't the price go back down? It's notable the best aircraft out their, far better then the Joint fighter. I was wrong when I though Gates was beyond politics because this seems more like a political move so he keeps his job then anything smart. It’s only natural for the Military to tighten its belt when the economy is in the drain...if we didn’t and spent more like some here suggest, we would arguably end up like the Soviet Union! I can't argue with that. I just feel they could have picked other programs. Like measuring cow farts and stuff. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090406, 
        "postID": 72, 
        "quote": "Originally posted by NSNN: quote: Originally posted by L0A1: I understand the F 22 went over budget, but now that it's been paid for, wouldn't the price go back down? It's notable the best aircraft out their, far better then the Joint fighter. I was wrong when I though Gates was beyond politics because this seems more like a political move so he keeps his job then anything smart. It’s only natural for the Military to tighten its belt when the economy is in the drain...if we didn’t and spent more like some here suggest, we would arguably end up like the Soviet Union!", 
        "reply": " I can't argue with that. I just feel they could have picked other programs. Like measuring cow farts and stuff. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 16:32:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: quote: Originally posted by shades_of_grey: And so it begins... the only Fed Gubmint spending the B.O. administration is willing to consider cutting is the only spending it's engaged in that's actually in the Constitution. To hell with the common defense, we gots to spend trillions on new welfare programs and to line the pockets of corrupt union officials and ACORN malcontents. Right? This sickens me. If anything we should be spending more on defense, including the F-22 program. Why? What is the benefit from having a massive fleet of fighters that can't be used in the wars we are fighting. We are going to have 187 of them, plus thousands more F-35s and new F/A-18Es. Why do we need more of them? There isn't a credible threat from anyone even close to competing with it. N Korea isn't a threat, they still have an air force that uses the same MiG-15s it fought with almost 50 years ago. China isn't a military threat at least not for another 15-20 years. The military needs to build practical capability and $300 million fighters with nobody to fight are not practical. That's precisely the point, our enemies can't compete with them, while they can with the aged and decrepit F-15s... Now, if you can forecast when, where and who we will fight in the future, with certainty, the Pentagon has a job opening for you... LOL Respectfully, SUNLINER81", 
        "intTime": 20090406, 
        "postID": 73, 
        "quote": "Originally posted by nspreitler: quote: Originally posted by shades_of_grey: And so it begins... the only Fed Gubmint spending the B.O. administration is willing to consider cutting is the only spending it's engaged in that's actually in the Constitution. To hell with the common defense, we gots to spend trillions on new welfare programs and to line the pockets of corrupt union officials and ACORN malcontents. Right? This sickens me. If anything we should be spending more on defense, including the F-22 program. Why? What is the benefit from having a massive fleet of fighters that can't be used in the wars we are fighting. We are going to have 187 of them, plus thousands more F-35s and new F/A-18Es. Why do we need more of them? There isn't a credible threat from anyone even close to competing with it. N Korea isn't a threat, they still have an air force that uses the same MiG-15s it fought with almost 50 years ago. China isn't a military threat at least not for another 15-20 years. The military needs to build practical capability and $300 million fighters with nobody to fight are not practical.", 
        "reply": " That's precisely the point, our enemies can't compete with them, while they can with the aged and decrepit F-15s... Now, if you can forecast when, where and who we will fight in the future, with certainty, the Pentagon has a job opening for you... LOL Respectfully, SUNLINER81", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 16:34:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: I can't argue with that. I just feel they could have picked other programs. Like measuring cow farts and stuff. Math wasn't your favorite subject, was it....", 
        "intTime": 20090406, 
        "postID": 74, 
        "quote": "I can't argue with that. I just feel they could have picked other programs. Like measuring cow farts and stuff.", 
        "reply": " Math wasn't your favorite subject, was it....", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 16:35:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "s122604"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: quote: Originally posted by nspreitler: That is good. They are $140 million for each one past what is already ordered. The 187 we already ordered cost $361 million each, much of which was an R&D cost. They are a defense project that has gone overtime and over-budget. Something needs to clean up the way contractors run the DoD. Big contractors are rewarded for taking too long and spending too much. They know it takes so long for major projects that they can get away with whatever they want because the military wants the final product. Considering that at least three F-22s have already crashed it already has one of the worst safety records in the Air Force. There is no reason to buy more of them, they are merely a waste of our tax dollars. And you have worked in the aerospace industry where?... Respectfully, SUNLINER81 In the Air Force. Did you know those are the people that have to actually use the equipment?", 
        "intTime": 20090406, 
        "postID": 75, 
        "quote": "Originally posted by SUNLINER81: quote: Originally posted by nspreitler: That is good. They are $140 million for each one past what is already ordered. The 187 we already ordered cost $361 million each, much of which was an R&D cost. They are a defense project that has gone overtime and over-budget. Something needs to clean up the way contractors run the DoD. Big contractors are rewarded for taking too long and spending too much. They know it takes so long for major projects that they can get away with whatever they want because the military wants the final product. Considering that at least three F-22s have already crashed it already has one of the worst safety records in the Air Force. There is no reason to buy more of them, they are merely a waste of our tax dollars. And you have worked in the aerospace industry where?... Respectfully, SUNLINER81", 
        "reply": " In the Air Force. Did you know those are the people that have to actually use the equipment?", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 16:35:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "nspreitler"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: quote: Originally posted by nspreitler: quote: Originally posted by shades_of_grey: And so it begins... the only Fed Gubmint spending the B.O. administration is willing to consider cutting is the only spending it's engaged in that's actually in the Constitution. To hell with the common defense, we gots to spend trillions on new welfare programs and to line the pockets of corrupt union officials and ACORN malcontents. Right? This sickens me. If anything we should be spending more on defense, including the F-22 program. Why? What is the benefit from having a massive fleet of fighters that can't be used in the wars we are fighting. We are going to have 187 of them, plus thousands more F-35s and new F/A-18Es. Why do we need more of them? There isn't a credible threat from anyone even close to competing with it. N Korea isn't a threat, they still have an air force that uses the same MiG-15s it fought with almost 50 years ago. China isn't a military threat at least not for another 15-20 years. The military needs to build practical capability and $300 million fighters with nobody to fight are not practical. That's precisely the point, our enemies can't compete with them, while they can with the aged and decrepit F-15s... Now, if you can forecast when, where and who we will fight in the future, with certainty, the Pentagon has a job opening for you... LOL Respectfully, SUNLINER81 Do you mean the F-15s that have a 104-0 kill ratio worldwide?", 
        "intTime": 20090406, 
        "postID": 76, 
        "quote": "Originally posted by SUNLINER81: quote: Originally posted by nspreitler: quote: Originally posted by shades_of_grey: And so it begins... the only Fed Gubmint spending the B.O. administration is willing to consider cutting is the only spending it's engaged in that's actually in the Constitution. To hell with the common defense, we gots to spend trillions on new welfare programs and to line the pockets of corrupt union officials and ACORN malcontents. Right? This sickens me. If anything we should be spending more on defense, including the F-22 program. Why? What is the benefit from having a massive fleet of fighters that can't be used in the wars we are fighting. We are going to have 187 of them, plus thousands more F-35s and new F/A-18Es. Why do we need more of them? There isn't a credible threat from anyone even close to competing with it. N Korea isn't a threat, they still have an air force that uses the same MiG-15s it fought with almost 50 years ago. China isn't a military threat at least not for another 15-20 years. The military needs to build practical capability and $300 million fighters with nobody to fight are not practical. That's precisely the point, our enemies can't compete with them, while they can with the aged and decrepit F-15s... Now, if you can forecast when, where and who we will fight in the future, with certainty, the Pentagon has a job opening for you... LOL Respectfully, SUNLINER81", 
        "reply": " Do you mean the F-15s that have a 104-0 kill ratio worldwide?", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 16:37:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "nspreitler"
    }, 
    {
        "content": "quote: Originally posted by s122604: quote: I can't argue with that. I just feel they could have picked other programs. Like measuring cow farts and stuff. Math wasn't your favorite subject, was it.... Actual, I am very good with math. So instead of your insulting comment, try something real. Since you didn't understand what I was getting at, let me downgrade it for you. THE GOVERMENT BLOWS MONEY ON CRAP that does nothing for this country, where as the F 22 does. Get it? Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090406, 
        "postID": 77, 
        "quote": "Originally posted by s122604: quote: I can't argue with that. I just feel they could have picked other programs. Like measuring cow farts and stuff. Math wasn't your favorite subject, was it....", 
        "reply": " Actual, I am very good with math. So instead of your insulting comment, try something real. Since you didn't understand what I was getting at, let me downgrade it for you. THE GOVERMENT BLOWS MONEY ON CRAP that does nothing for this country, where as the F 22 does. Get it? Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 16:41:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: quote: Originally posted by SUNLINER81: quote: Originally posted by nspreitler: That is good. They are $140 million for each one past what is already ordered. The 187 we already ordered cost $361 million each, much of which was an R&D cost. They are a defense project that has gone overtime and over-budget. Something needs to clean up the way contractors run the DoD. Big contractors are rewarded for taking too long and spending too much. They know it takes so long for major projects that they can get away with whatever they want because the military wants the final product. Considering that at least three F-22s have already crashed it already has one of the worst safety records in the Air Force. There is no reason to buy more of them, they are merely a waste of our tax dollars. And you have worked in the aerospace industry where?... Respectfully, SUNLINER81 In the Air Force. Did you know those are the people that have to actually use the equipment? What I was referring to was on the \"contract\" side of procurement... I too served in the active military aviation branch of the U.S.N. AND I worked for Lockheed, Douglas, Northrop and BAE, in all aspects of contractual negotiations, as a \"Provisioning Analyst\" and on the \"assembly line\"... The point is, aircraft are \"long lead time\" items and they are built to specifications to meet actual and projected hostile forces... It take from eight to twelve years from concept, proposal, test and evaluation, to prototypes, to actual \"article in service\"... The point was and is, if we don't procure these fighters and strike aircraft now, we wont' have time to do it, when and if the schidt hits the fan AND THEN, PEOPLE WILL DIE BECAUSE WE WERE PENNY WISE AND POUND FOOLISH... IMHO... Respectfully, SUNLINER81", 
        "intTime": 20090406, 
        "postID": 78, 
        "quote": "Originally posted by nspreitler: quote: Originally posted by SUNLINER81: quote: Originally posted by nspreitler: That is good. They are $140 million for each one past what is already ordered. The 187 we already ordered cost $361 million each, much of which was an R&D cost. They are a defense project that has gone overtime and over-budget. Something needs to clean up the way contractors run the DoD. Big contractors are rewarded for taking too long and spending too much. They know it takes so long for major projects that they can get away with whatever they want because the military wants the final product. Considering that at least three F-22s have already crashed it already has one of the worst safety records in the Air Force. There is no reason to buy more of them, they are merely a waste of our tax dollars. And you have worked in the aerospace industry where?... Respectfully, SUNLINER81 In the Air Force. Did you know those are the people that have to actually use the equipment?", 
        "reply": " What I was referring to was on the \"contract\" side of procurement... I too served in the active military aviation branch of the U.S.N. AND I worked for Lockheed, Douglas, Northrop and BAE, in all aspects of contractual negotiations, as a \"Provisioning Analyst\" and on the \"assembly line\"... The point is, aircraft are \"long lead time\" items and they are built to specifications to meet actual and projected hostile forces... It take from eight to twelve years from concept, proposal, test and evaluation, to prototypes, to actual \"article in service\"... The point was and is, if we don't procure these fighters and strike aircraft now, we wont' have time to do it, when and if the schidt hits the fan AND THEN, PEOPLE WILL DIE BECAUSE WE WERE PENNY WISE AND POUND FOOLISH... IMHO... Respectfully, SUNLINER81", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 16:42:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "Show me a cow fart study that equals up to even one F22... You can't. Tell us what the government should cut, to make up for these programs. I'd like to see you balance the numbers...", 
        "intTime": 20090406, 
        "postID": 79, 
        "quote": "", 
        "reply": "Show me a cow fart study that equals up to even one F22... You can't. Tell us what the government should cut, to make up for these programs. I'd like to see you balance the numbers...", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 16:43:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "s122604"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: Do you mean the F-15s that have a 104-0 kill ratio worldwide? In all fairness, that ratio is inflated and somewhat flawed! It never went one on one against an A/C in its class! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090406, 
        "postID": 80, 
        "quote": "Originally posted by nspreitler: Do you mean the F-15s that have a 104-0 kill ratio worldwide?", 
        "reply": " In all fairness, that ratio is inflated and somewhat flawed! It never went one on one against an A/C in its class! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 16:44:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "NSNN"
    }, 
    {
        "content": "Note: this is an updated thread, please scroll down or go to the last page for the latest update. Before the blame game begins, have in mind that this has yet to pass Congress and is still a proposal as of yet. quote: ++http://www.foxnews.com/politics/first100days/2009/04/06/gates-calling-cuts-high-tech-weapons-programs/ WASHINGTON -- Defense Secretary Robert Gates is proposing deep cuts to some big weapons programs such as the F-22 fighter jet as the Pentagon takes a hard look at how it spends money. Gates announced a broad range of cuts Monday to weapons spending, saying he plans to cut programs ranging from a new helicopter for the president to ending production of the $140 billion F-22 fighter jet. The Army's modernization program would be scaled back, while a new satellite system and a search-and-rescue helicopter would be cut. Gates says his budget will \"profoundly reform\" the way the Pentagon buys weapons and does business. To fight new threats from insurgents, Gates is proposing more funding for special forces and other tools... This message has been edited. Last edited by: Canuck_Centaur, Thu 25 June 2009 10:18 PM", 
        "intTime": 20090406, 
        "postID": 81, 
        "quote": "++http://www.foxnews.com/politics/first100days/2009/04/06/gates-calling-cuts-high-tech-weapons-programs/ WASHINGTON -- Defense Secretary Robert Gates is proposing deep cuts to some big weapons programs such as the F-22 fighter jet as the Pentagon takes a hard look at how it spends money. Gates announced a broad range of cuts Monday to weapons spending, saying he plans to cut programs ranging from a new helicopter for the president to ending production of the $140 billion F-22 fighter jet. The Army's modernization program would be scaled back, while a new satellite system and a search-and-rescue helicopter would be cut. Gates says his budget will \"profoundly reform\" the way the Pentagon buys weapons and does business. To fight new threats from insurgents, Gates is proposing more funding for special forces and other tools...", 
        "reply": "Note: this is an updated thread, please scroll down or go to the last page for the latest update. Before the blame game begins, have in mind that this has yet to pass Congress and is still a proposal as of yet.  This message has been edited. Last edited by: Canuck_Centaur, Thu 25 June 2009 10:18 PM", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 14:11:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "That is good. They are $140 million for each one past what is already ordered. The 187 we already ordered cost $361 million each, much of which was an R&D cost. They are a defense project that has gone overtime and over-budget. Something needs to clean up the way contractors run the DoD. Big contractors are rewarded for taking too long and spending too much. They know it takes so long for major projects that they can get away with whatever they want because the military wants the final product. Considering that at least three F-22s have already crashed it already has one of the worst safety records in the Air Force. There is no reason to buy more of them, they are merely a waste of our tax dollars.", 
        "intTime": 20090406, 
        "postID": 82, 
        "quote": "", 
        "reply": "That is good. They are $140 million for each one past what is already ordered. The 187 we already ordered cost $361 million each, much of which was an R&D cost. They are a defense project that has gone overtime and over-budget. Something needs to clean up the way contractors run the DoD. Big contractors are rewarded for taking too long and spending too much. They know it takes so long for major projects that they can get away with whatever they want because the military wants the final product. Considering that at least three F-22s have already crashed it already has one of the worst safety records in the Air Force. There is no reason to buy more of them, they are merely a waste of our tax dollars.", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 14:32:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "nspreitler"
    }, 
    {
        "content": "Mr. Gates is a very wise man. I support his decision 100% to cancel the F22 program.", 
        "intTime": 20090406, 
        "postID": 83, 
        "quote": "", 
        "reply": "Mr. Gates is a very wise man. I support his decision 100% to cancel the F22 program.", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 15:02:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "Duster6"
    }, 
    {
        "content": "And Cancelling the Airborne Laser system, Missile defence Sysytem when North Korea is desperately trying to enhance their Capability. BRILLIANT! Even Petain & Laval couldnt have come up with a Better plan at appeasement and stupidity", 
        "intTime": 20090406, 
        "postID": 84, 
        "quote": "", 
        "reply": "And Cancelling the Airborne Laser system, Missile defence Sysytem when North Korea is desperately trying to enhance their Capability. BRILLIANT! Even Petain & Laval couldnt have come up with a Better plan at appeasement and stupidity", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 15:21:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: That is good. They are $140 million for each one past what is already ordered. The 187 we already ordered cost $361 million each, much of which was an R&D cost. They are a defense project that has gone overtime and over-budget. Something needs to clean up the way contractors run the DoD. $213 a piece according to this guy's math (initial still being $361 mil)! +http://www.military.com/opinion/0,15202,187737,00.html?wh=wh Big contractors are rewarded for taking too long and spending too much. They know it takes so long for major projects that they can get away with whatever they want because the military wants the final product. Considering that at least three F-22s have already crashed it already has one of the worst safety records in the Air Force. There is no reason to buy more of them, they are merely a waste of our tax dollars. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090406, 
        "postID": 85, 
        "quote": "Originally posted by nspreitler: That is good. They are $140 million for each one past what is already ordered. The 187 we already ordered cost $361 million each, much of which was an R&D cost. They are a defense project that has gone overtime and over-budget. Something needs to clean up the way contractors run the DoD. $213 a piece according to this guy's math (initial still being $361 mil)! +http://www.military.com/opinion/0,15202,187737,00.html?wh=wh Big contractors are rewarded for taking too long and spending too much. They know it takes so long for major projects that they can get away with whatever they want because the military wants the final product. Considering that at least three F-22s have already crashed it already has one of the worst safety records in the Air Force. There is no reason to buy more of them, they are merely a waste of our tax dollars.", 
        "reply": " \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 15:29:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "NSNN"
    }, 
    {
        "content": "NA73(North American Aircraft), Crashed just 25 days after it first appeared. Thankfully the BPC didnt give up on it. Today we know it as the P-51 Mustang Many aircraft havd had Crashes and gone on to great things B-17, Harrier, F-15, F-16 etc.", 
        "intTime": 20090406, 
        "postID": 86, 
        "quote": "", 
        "reply": "NA73(North American Aircraft), Crashed just 25 days after it first appeared. Thankfully the BPC didnt give up on it. Today we know it as the P-51 Mustang Many aircraft havd had Crashes and gone on to great things B-17, Harrier, F-15, F-16 etc.", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 15:40:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "And so it begins... the only Fed Gubmint spending the B.O. administration is willing to consider cutting is the only spending it's engaged in that's actually in the Constitution. To hell with the common defense, we gots to spend trillions on new welfare programs and to line the pockets of corrupt union officials and ACORN malcontents. Right? This sickens me. If anything we should be spending more on defense, including the F-22 program.", 
        "intTime": 20090406, 
        "postID": 87, 
        "quote": "", 
        "reply": "And so it begins... the only Fed Gubmint spending the B.O. administration is willing to consider cutting is the only spending it's engaged in that's actually in the Constitution. To hell with the common defense, we gots to spend trillions on new welfare programs and to line the pockets of corrupt union officials and ACORN malcontents. Right? This sickens me. If anything we should be spending more on defense, including the F-22 program.", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 16:03:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "I understand the F 22 went over budget, but now that it's been paid for, wouldn't the price go back down? It's notable the best aircraft out their, far better then the Joint fighter. I was wrong when I though Gates was beyond politics because this seems more like a political move so he keeps his job then anything smart. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090406, 
        "postID": 88, 
        "quote": "", 
        "reply": "I understand the F 22 went over budget, but now that it's been paid for, wouldn't the price go back down? It's notable the best aircraft out their, far better then the Joint fighter. I was wrong when I though Gates was beyond politics because this seems more like a political move so he keeps his job then anything smart. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 16:18:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: I understand the F 22 went over budget, but now that it's been paid for, wouldn't the price go back down? It's notable the best aircraft out their, far better then the Joint fighter. I was wrong when I though Gates was beyond politics because this seems more like a political move so he keeps his job then anything smart. It’s only natural for the Military to tighten its belt when the economy is in the drain...if we didn’t and spent more like some here suggest, we would arguably end up like the Soviet Union! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090406, 
        "postID": 89, 
        "quote": "Originally posted by L0A1: I understand the F 22 went over budget, but now that it's been paid for, wouldn't the price go back down? It's notable the best aircraft out their, far better then the Joint fighter. I was wrong when I though Gates was beyond politics because this seems more like a political move so he keeps his job then anything smart.", 
        "reply": " It’s only natural for the Military to tighten its belt when the economy is in the drain...if we didn’t and spent more like some here suggest, we would arguably end up like the Soviet Union! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 16:28:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: That is good. They are $140 million for each one past what is already ordered. The 187 we already ordered cost $361 million each, much of which was an R&D cost. They are a defense project that has gone overtime and over-budget. Something needs to clean up the way contractors run the DoD. Big contractors are rewarded for taking too long and spending too much. They know it takes so long for major projects that they can get away with whatever they want because the military wants the final product. Considering that at least three F-22s have already crashed it already has one of the worst safety records in the Air Force. There is no reason to buy more of them, they are merely a waste of our tax dollars. And you have worked in the aerospace industry where?... Respectfully, SUNLINER81", 
        "intTime": 20090406, 
        "postID": 90, 
        "quote": "Originally posted by nspreitler: That is good. They are $140 million for each one past what is already ordered. The 187 we already ordered cost $361 million each, much of which was an R&D cost. They are a defense project that has gone overtime and over-budget. Something needs to clean up the way contractors run the DoD. Big contractors are rewarded for taking too long and spending too much. They know it takes so long for major projects that they can get away with whatever they want because the military wants the final product. Considering that at least three F-22s have already crashed it already has one of the worst safety records in the Air Force. There is no reason to buy more of them, they are merely a waste of our tax dollars.", 
        "reply": " And you have worked in the aerospace industry where?... Respectfully, SUNLINER81", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 16:29:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by shades_of_grey: And so it begins... the only Fed Gubmint spending the B.O. administration is willing to consider cutting is the only spending it's engaged in that's actually in the Constitution. To hell with the common defense, we gots to spend trillions on new welfare programs and to line the pockets of corrupt union officials and ACORN malcontents. Right? This sickens me. If anything we should be spending more on defense, including the F-22 program. Why? What is the benefit from having a massive fleet of fighters that can't be used in the wars we are fighting. We are going to have 187 of them, plus thousands more F-35s and new F/A-18Es. Why do we need more of them? There isn't a credible threat from anyone even close to competing with it. N Korea isn't a threat, they still have an air force that uses the same MiG-15s it fought with almost 50 years ago. China isn't a military threat at least not for another 15-20 years. The military needs to build practical capability and $300 million fighters with nobody to fight are not practical.", 
        "intTime": 20090406, 
        "postID": 91, 
        "quote": "Originally posted by shades_of_grey: And so it begins... the only Fed Gubmint spending the B.O. administration is willing to consider cutting is the only spending it's engaged in that's actually in the Constitution. To hell with the common defense, we gots to spend trillions on new welfare programs and to line the pockets of corrupt union officials and ACORN malcontents. Right? This sickens me. If anything we should be spending more on defense, including the F-22 program.", 
        "reply": " Why? What is the benefit from having a massive fleet of fighters that can't be used in the wars we are fighting. We are going to have 187 of them, plus thousands more F-35s and new F/A-18Es. Why do we need more of them? There isn't a credible threat from anyone even close to competing with it. N Korea isn't a threat, they still have an air force that uses the same MiG-15s it fought with almost 50 years ago. China isn't a military threat at least not for another 15-20 years. The military needs to build practical capability and $300 million fighters with nobody to fight are not practical.", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 16:32:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "nspreitler"
    }, 
    {
        "content": "quote: Originally posted by NSNN: quote: Originally posted by L0A1: I understand the F 22 went over budget, but now that it's been paid for, wouldn't the price go back down? It's notable the best aircraft out their, far better then the Joint fighter. I was wrong when I though Gates was beyond politics because this seems more like a political move so he keeps his job then anything smart. It’s only natural for the Military to tighten its belt when the economy is in the drain...if we didn’t and spent more like some here suggest, we would arguably end up like the Soviet Union! I can't argue with that. I just feel they could have picked other programs. Like measuring cow farts and stuff. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090406, 
        "postID": 92, 
        "quote": "Originally posted by NSNN: quote: Originally posted by L0A1: I understand the F 22 went over budget, but now that it's been paid for, wouldn't the price go back down? It's notable the best aircraft out their, far better then the Joint fighter. I was wrong when I though Gates was beyond politics because this seems more like a political move so he keeps his job then anything smart. It’s only natural for the Military to tighten its belt when the economy is in the drain...if we didn’t and spent more like some here suggest, we would arguably end up like the Soviet Union!", 
        "reply": " I can't argue with that. I just feel they could have picked other programs. Like measuring cow farts and stuff. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 16:32:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: quote: Originally posted by shades_of_grey: And so it begins... the only Fed Gubmint spending the B.O. administration is willing to consider cutting is the only spending it's engaged in that's actually in the Constitution. To hell with the common defense, we gots to spend trillions on new welfare programs and to line the pockets of corrupt union officials and ACORN malcontents. Right? This sickens me. If anything we should be spending more on defense, including the F-22 program. Why? What is the benefit from having a massive fleet of fighters that can't be used in the wars we are fighting. We are going to have 187 of them, plus thousands more F-35s and new F/A-18Es. Why do we need more of them? There isn't a credible threat from anyone even close to competing with it. N Korea isn't a threat, they still have an air force that uses the same MiG-15s it fought with almost 50 years ago. China isn't a military threat at least not for another 15-20 years. The military needs to build practical capability and $300 million fighters with nobody to fight are not practical. That's precisely the point, our enemies can't compete with them, while they can with the aged and decrepit F-15s... Now, if you can forecast when, where and who we will fight in the future, with certainty, the Pentagon has a job opening for you... LOL Respectfully, SUNLINER81", 
        "intTime": 20090406, 
        "postID": 93, 
        "quote": "Originally posted by nspreitler: quote: Originally posted by shades_of_grey: And so it begins... the only Fed Gubmint spending the B.O. administration is willing to consider cutting is the only spending it's engaged in that's actually in the Constitution. To hell with the common defense, we gots to spend trillions on new welfare programs and to line the pockets of corrupt union officials and ACORN malcontents. Right? This sickens me. If anything we should be spending more on defense, including the F-22 program. Why? What is the benefit from having a massive fleet of fighters that can't be used in the wars we are fighting. We are going to have 187 of them, plus thousands more F-35s and new F/A-18Es. Why do we need more of them? There isn't a credible threat from anyone even close to competing with it. N Korea isn't a threat, they still have an air force that uses the same MiG-15s it fought with almost 50 years ago. China isn't a military threat at least not for another 15-20 years. The military needs to build practical capability and $300 million fighters with nobody to fight are not practical.", 
        "reply": " That's precisely the point, our enemies can't compete with them, while they can with the aged and decrepit F-15s... Now, if you can forecast when, where and who we will fight in the future, with certainty, the Pentagon has a job opening for you... LOL Respectfully, SUNLINER81", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 16:34:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: I can't argue with that. I just feel they could have picked other programs. Like measuring cow farts and stuff. Math wasn't your favorite subject, was it....", 
        "intTime": 20090406, 
        "postID": 94, 
        "quote": "I can't argue with that. I just feel they could have picked other programs. Like measuring cow farts and stuff.", 
        "reply": " Math wasn't your favorite subject, was it....", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 16:35:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "s122604"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: quote: Originally posted by nspreitler: That is good. They are $140 million for each one past what is already ordered. The 187 we already ordered cost $361 million each, much of which was an R&D cost. They are a defense project that has gone overtime and over-budget. Something needs to clean up the way contractors run the DoD. Big contractors are rewarded for taking too long and spending too much. They know it takes so long for major projects that they can get away with whatever they want because the military wants the final product. Considering that at least three F-22s have already crashed it already has one of the worst safety records in the Air Force. There is no reason to buy more of them, they are merely a waste of our tax dollars. And you have worked in the aerospace industry where?... Respectfully, SUNLINER81 In the Air Force. Did you know those are the people that have to actually use the equipment?", 
        "intTime": 20090406, 
        "postID": 95, 
        "quote": "Originally posted by SUNLINER81: quote: Originally posted by nspreitler: That is good. They are $140 million for each one past what is already ordered. The 187 we already ordered cost $361 million each, much of which was an R&D cost. They are a defense project that has gone overtime and over-budget. Something needs to clean up the way contractors run the DoD. Big contractors are rewarded for taking too long and spending too much. They know it takes so long for major projects that they can get away with whatever they want because the military wants the final product. Considering that at least three F-22s have already crashed it already has one of the worst safety records in the Air Force. There is no reason to buy more of them, they are merely a waste of our tax dollars. And you have worked in the aerospace industry where?... Respectfully, SUNLINER81", 
        "reply": " In the Air Force. Did you know those are the people that have to actually use the equipment?", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 16:35:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "nspreitler"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: quote: Originally posted by nspreitler: quote: Originally posted by shades_of_grey: And so it begins... the only Fed Gubmint spending the B.O. administration is willing to consider cutting is the only spending it's engaged in that's actually in the Constitution. To hell with the common defense, we gots to spend trillions on new welfare programs and to line the pockets of corrupt union officials and ACORN malcontents. Right? This sickens me. If anything we should be spending more on defense, including the F-22 program. Why? What is the benefit from having a massive fleet of fighters that can't be used in the wars we are fighting. We are going to have 187 of them, plus thousands more F-35s and new F/A-18Es. Why do we need more of them? There isn't a credible threat from anyone even close to competing with it. N Korea isn't a threat, they still have an air force that uses the same MiG-15s it fought with almost 50 years ago. China isn't a military threat at least not for another 15-20 years. The military needs to build practical capability and $300 million fighters with nobody to fight are not practical. That's precisely the point, our enemies can't compete with them, while they can with the aged and decrepit F-15s... Now, if you can forecast when, where and who we will fight in the future, with certainty, the Pentagon has a job opening for you... LOL Respectfully, SUNLINER81 Do you mean the F-15s that have a 104-0 kill ratio worldwide?", 
        "intTime": 20090406, 
        "postID": 96, 
        "quote": "Originally posted by SUNLINER81: quote: Originally posted by nspreitler: quote: Originally posted by shades_of_grey: And so it begins... the only Fed Gubmint spending the B.O. administration is willing to consider cutting is the only spending it's engaged in that's actually in the Constitution. To hell with the common defense, we gots to spend trillions on new welfare programs and to line the pockets of corrupt union officials and ACORN malcontents. Right? This sickens me. If anything we should be spending more on defense, including the F-22 program. Why? What is the benefit from having a massive fleet of fighters that can't be used in the wars we are fighting. We are going to have 187 of them, plus thousands more F-35s and new F/A-18Es. Why do we need more of them? There isn't a credible threat from anyone even close to competing with it. N Korea isn't a threat, they still have an air force that uses the same MiG-15s it fought with almost 50 years ago. China isn't a military threat at least not for another 15-20 years. The military needs to build practical capability and $300 million fighters with nobody to fight are not practical. That's precisely the point, our enemies can't compete with them, while they can with the aged and decrepit F-15s... Now, if you can forecast when, where and who we will fight in the future, with certainty, the Pentagon has a job opening for you... LOL Respectfully, SUNLINER81", 
        "reply": " Do you mean the F-15s that have a 104-0 kill ratio worldwide?", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 16:37:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "nspreitler"
    }, 
    {
        "content": "quote: Originally posted by s122604: quote: I can't argue with that. I just feel they could have picked other programs. Like measuring cow farts and stuff. Math wasn't your favorite subject, was it.... Actual, I am very good with math. So instead of your insulting comment, try something real. Since you didn't understand what I was getting at, let me downgrade it for you. THE GOVERMENT BLOWS MONEY ON CRAP that does nothing for this country, where as the F 22 does. Get it? Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090406, 
        "postID": 97, 
        "quote": "Originally posted by s122604: quote: I can't argue with that. I just feel they could have picked other programs. Like measuring cow farts and stuff. Math wasn't your favorite subject, was it....", 
        "reply": " Actual, I am very good with math. So instead of your insulting comment, try something real. Since you didn't understand what I was getting at, let me downgrade it for you. THE GOVERMENT BLOWS MONEY ON CRAP that does nothing for this country, where as the F 22 does. Get it? Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 16:41:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: quote: Originally posted by SUNLINER81: quote: Originally posted by nspreitler: That is good. They are $140 million for each one past what is already ordered. The 187 we already ordered cost $361 million each, much of which was an R&D cost. They are a defense project that has gone overtime and over-budget. Something needs to clean up the way contractors run the DoD. Big contractors are rewarded for taking too long and spending too much. They know it takes so long for major projects that they can get away with whatever they want because the military wants the final product. Considering that at least three F-22s have already crashed it already has one of the worst safety records in the Air Force. There is no reason to buy more of them, they are merely a waste of our tax dollars. And you have worked in the aerospace industry where?... Respectfully, SUNLINER81 In the Air Force. Did you know those are the people that have to actually use the equipment? What I was referring to was on the \"contract\" side of procurement... I too served in the active military aviation branch of the U.S.N. AND I worked for Lockheed, Douglas, Northrop and BAE, in all aspects of contractual negotiations, as a \"Provisioning Analyst\" and on the \"assembly line\"... The point is, aircraft are \"long lead time\" items and they are built to specifications to meet actual and projected hostile forces... It take from eight to twelve years from concept, proposal, test and evaluation, to prototypes, to actual \"article in service\"... The point was and is, if we don't procure these fighters and strike aircraft now, we wont' have time to do it, when and if the schidt hits the fan AND THEN, PEOPLE WILL DIE BECAUSE WE WERE PENNY WISE AND POUND FOOLISH... IMHO... Respectfully, SUNLINER81", 
        "intTime": 20090406, 
        "postID": 98, 
        "quote": "Originally posted by nspreitler: quote: Originally posted by SUNLINER81: quote: Originally posted by nspreitler: That is good. They are $140 million for each one past what is already ordered. The 187 we already ordered cost $361 million each, much of which was an R&D cost. They are a defense project that has gone overtime and over-budget. Something needs to clean up the way contractors run the DoD. Big contractors are rewarded for taking too long and spending too much. They know it takes so long for major projects that they can get away with whatever they want because the military wants the final product. Considering that at least three F-22s have already crashed it already has one of the worst safety records in the Air Force. There is no reason to buy more of them, they are merely a waste of our tax dollars. And you have worked in the aerospace industry where?... Respectfully, SUNLINER81 In the Air Force. Did you know those are the people that have to actually use the equipment?", 
        "reply": " What I was referring to was on the \"contract\" side of procurement... I too served in the active military aviation branch of the U.S.N. AND I worked for Lockheed, Douglas, Northrop and BAE, in all aspects of contractual negotiations, as a \"Provisioning Analyst\" and on the \"assembly line\"... The point is, aircraft are \"long lead time\" items and they are built to specifications to meet actual and projected hostile forces... It take from eight to twelve years from concept, proposal, test and evaluation, to prototypes, to actual \"article in service\"... The point was and is, if we don't procure these fighters and strike aircraft now, we wont' have time to do it, when and if the schidt hits the fan AND THEN, PEOPLE WILL DIE BECAUSE WE WERE PENNY WISE AND POUND FOOLISH... IMHO... Respectfully, SUNLINER81", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 16:42:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "Show me a cow fart study that equals up to even one F22... You can't. Tell us what the government should cut, to make up for these programs. I'd like to see you balance the numbers...", 
        "intTime": 20090406, 
        "postID": 99, 
        "quote": "", 
        "reply": "Show me a cow fart study that equals up to even one F22... You can't. Tell us what the government should cut, to make up for these programs. I'd like to see you balance the numbers...", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 16:43:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "s122604"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: Do you mean the F-15s that have a 104-0 kill ratio worldwide? In all fairness, that ratio is inflated and somewhat flawed! It never went one on one against an A/C in its class! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090406, 
        "postID": 100, 
        "quote": "Originally posted by nspreitler: Do you mean the F-15s that have a 104-0 kill ratio worldwide?", 
        "reply": " In all fairness, that ratio is inflated and somewhat flawed! It never went one on one against an A/C in its class! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_7840099912001", 
        "time": "2009-04-06 16:44:00", 
        "title": "Update:US Senate votes to build more Raptors, defies Gates", 
        "userID": "NSNN"
    }
]