[
    {
        "content": "Excerp from http://www.centcom.mil/en/from-the-commander/commanders...ns-subcommittee.html quote: Commander's statement to House Appropriations subcommittee The US military will focus its assistance in two main areas. First, we will expand our partnership with the Pakistani military and help it build its counter-insurgency capabilities by providing training, equipment, and assistance. We will also expand our exchange programs to build stronger relationships with Pakistani leaders at all levels. Second, we will help promote closer cooperation across the Afghan-Pakistan border by providing training, equipment, facilities, and intelligence capabilities and by bringing together Afghan and Pakistani military officers to enable coordination between the forces on either side of the border. These efforts will support timely sharing of intelligence information and help to coordinate the operations of the two forces. These efforts to build the capacity of the Pakistani military would be aided substantially by the Pakistani Counterinsurgency Capability Fund. Pakistan is a unique situation that required nuanced authorities. Ambassador Holbrooke and I have determined that we need both Foreign Military Financing and PCCF to accomplish our mission. PCCF will allow us to focus, as well as expand, our Security Development Plan with Pakistan. In addition, we support the continued use of Coalition Support Funds as a tool for supporting the operations of our Pakistani partners as they confront extremists who operate in Afghanistan, as well as in Pakistan, and we believe the expansion of outreach and exchange programs will enable the establishment of stronger relationships with Pakistani leaders at all levels. Within the counter-insurgency construct we have laid out for Afghanistan and together with the support provided to Pakistan, we will of course continue to support the targeting, disruption, and pursuit of the leadership, bases, and support networks of Al Qaeda and other transnational extremist groups operating in the region. We will also work with our partners to challenge the legitimacy of the terrorists’ methods, practices, and ideologies, helping our partners address legitimate grievances to win over reconcilable elements of the population, and supporting promotion of the broad-based economic and governmental development that is a necessary part of such an effort. I'm not sure if I can paste the whole speech in so I won't. It's worth clicking on the link to read the whole thing though.", 
        "intTime": 20090503, 
        "postID": 1, 
        "quote": "Commander's statement to House Appropriations subcommittee The US military will focus its assistance in two main areas. First, we will expand our partnership with the Pakistani military and help it build its counter-insurgency capabilities by providing training, equipment, and assistance. We will also expand our exchange programs to build stronger relationships with Pakistani leaders at all levels. Second, we will help promote closer cooperation across the Afghan-Pakistan border by providing training, equipment, facilities, and intelligence capabilities and by bringing together Afghan and Pakistani military officers to enable coordination between the forces on either side of the border. These efforts will support timely sharing of intelligence information and help to coordinate the operations of the two forces. These efforts to build the capacity of the Pakistani military would be aided substantially by the Pakistani Counterinsurgency Capability Fund. Pakistan is a unique situation that required nuanced authorities. Ambassador Holbrooke and I have determined that we need both Foreign Military Financing and PCCF to accomplish our mission. PCCF will allow us to focus, as well as expand, our Security Development Plan with Pakistan. In addition, we support the continued use of Coalition Support Funds as a tool for supporting the operations of our Pakistani partners as they confront extremists who operate in Afghanistan, as well as in Pakistan, and we believe the expansion of outreach and exchange programs will enable the establishment of stronger relationships with Pakistani leaders at all levels. Within the counter-insurgency construct we have laid out for Afghanistan and together with the support provided to Pakistan, we will of course continue to support the targeting, disruption, and pursuit of the leadership, bases, and support networks of Al Qaeda and other transnational extremist groups operating in the region. We will also work with our partners to challenge the legitimacy of the terrorists’ methods, practices, and ideologies, helping our partners address legitimate grievances to win over reconcilable elements of the population, and supporting promotion of the broad-based economic and governmental development that is a necessary part of such an effort.", 
        "reply": "Excerp from http://www.centcom.mil/en/from-the-commander/commanders...ns-subcommittee.html  I'm not sure if I can paste the whole speech in so I won't. It's worth clicking on the link to read the whole thing though.", 
        "threadID": "672198221_3590004222001", 
        "time": "2009-05-03 17:15:00", 
        "title": "Petraeus talks to HAS about plans in Iraq, Afghanistan & Pakistan", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "quote: Originally posted by AngelHeart: Excerp from http://www.centcom.mil/en/from-the-commander/commanders...ns-subcommittee.html quote: Commander's statement to House Appropriations subcommittee The US military will focus its assistance in two main areas. First, we will expand our partnership with the Pakistani military and help it build its counter-insurgency capabilities by providing training, equipment, and assistance. We will also expand our exchange programs to build stronger relationships with Pakistani leaders at all levels. Second, we will help promote closer cooperation across the Afghan-Pakistan border by providing training, equipment, facilities, and intelligence capabilities and by bringing together Afghan and Pakistani military officers to enable coordination between the forces on either side of the border. These efforts will support timely sharing of intelligence information and help to coordinate the operations of the two forces. These efforts to build the capacity of the Pakistani military would be aided substantially by the Pakistani Counterinsurgency Capability Fund. Pakistan is a unique situation that required nuanced authorities. Ambassador Holbrooke and I have determined that we need both Foreign Military Financing and PCCF to accomplish our mission. PCCF will allow us to focus, as well as expand, our Security Development Plan with Pakistan. In addition, we support the continued use of Coalition Support Funds as a tool for supporting the operations of our Pakistani partners as they confront extremists who operate in Afghanistan, as well as in Pakistan, and we believe the expansion of outreach and exchange programs will enable the establishment of stronger relationships with Pakistani leaders at all levels. Within the counter-insurgency construct we have laid out for Afghanistan and together with the support provided to Pakistan, we will of course continue to support the targeting, disruption, and pursuit of the leadership, bases, and support networks of Al Qaeda and other transnational extremist groups operating in the region. We will also work with our partners to challenge the legitimacy of the terrorists’ methods, practices, and ideologies, helping our partners address legitimate grievances to win over reconcilable elements of the population, and supporting promotion of the broad-based economic and governmental development that is a necessary part of such an effort. I'm not sure if I can paste the whole speech in so I won't. It's worth clicking on the link to read the whole thing though. If the plan is by Petraeus, then it is sound and should be implemented... IMHO... Respectfully, SUNLINER81", 
        "intTime": 20090503, 
        "postID": 2, 
        "quote": "Originally posted by AngelHeart: Excerp from http://www.centcom.mil/en/from-the-commander/commanders...ns-subcommittee.html quote: Commander's statement to House Appropriations subcommittee The US military will focus its assistance in two main areas. First, we will expand our partnership with the Pakistani military and help it build its counter-insurgency capabilities by providing training, equipment, and assistance. We will also expand our exchange programs to build stronger relationships with Pakistani leaders at all levels. Second, we will help promote closer cooperation across the Afghan-Pakistan border by providing training, equipment, facilities, and intelligence capabilities and by bringing together Afghan and Pakistani military officers to enable coordination between the forces on either side of the border. These efforts will support timely sharing of intelligence information and help to coordinate the operations of the two forces. These efforts to build the capacity of the Pakistani military would be aided substantially by the Pakistani Counterinsurgency Capability Fund. Pakistan is a unique situation that required nuanced authorities. Ambassador Holbrooke and I have determined that we need both Foreign Military Financing and PCCF to accomplish our mission. PCCF will allow us to focus, as well as expand, our Security Development Plan with Pakistan. In addition, we support the continued use of Coalition Support Funds as a tool for supporting the operations of our Pakistani partners as they confront extremists who operate in Afghanistan, as well as in Pakistan, and we believe the expansion of outreach and exchange programs will enable the establishment of stronger relationships with Pakistani leaders at all levels. Within the counter-insurgency construct we have laid out for Afghanistan and together with the support provided to Pakistan, we will of course continue to support the targeting, disruption, and pursuit of the leadership, bases, and support networks of Al Qaeda and other transnational extremist groups operating in the region. We will also work with our partners to challenge the legitimacy of the terrorists’ methods, practices, and ideologies, helping our partners address legitimate grievances to win over reconcilable elements of the population, and supporting promotion of the broad-based economic and governmental development that is a necessary part of such an effort. I'm not sure if I can paste the whole speech in so I won't. It's worth clicking on the link to read the whole thing though.", 
        "reply": " If the plan is by Petraeus, then it is sound and should be implemented... IMHO... Respectfully, SUNLINER81", 
        "threadID": "672198221_3590004222001", 
        "time": "2009-05-03 17:18:00", 
        "title": "Petraeus talks to HAS about plans in Iraq, Afghanistan & Pakistan", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: quote: Originally posted by AngelHeart: Excerp from http://www.centcom.mil/en/from-the-commander/commanders...ns-subcommittee.html quote: Commander's statement to House Appropriations subcommittee The US military will focus its assistance in two main areas. First, we will expand our partnership with the Pakistani military and help it build its counter-insurgency capabilities by providing training, equipment, and assistance. We will also expand our exchange programs to build stronger relationships with Pakistani leaders at all levels. Second, we will help promote closer cooperation across the Afghan-Pakistan border by providing training, equipment, facilities, and intelligence capabilities and by bringing together Afghan and Pakistani military officers to enable coordination between the forces on either side of the border. These efforts will support timely sharing of intelligence information and help to coordinate the operations of the two forces. These efforts to build the capacity of the Pakistani military would be aided substantially by the Pakistani Counterinsurgency Capability Fund. Pakistan is a unique situation that required nuanced authorities. Ambassador Holbrooke and I have determined that we need both Foreign Military Financing and PCCF to accomplish our mission. PCCF will allow us to focus, as well as expand, our Security Development Plan with Pakistan. In addition, we support the continued use of Coalition Support Funds as a tool for supporting the operations of our Pakistani partners as they confront extremists who operate in Afghanistan, as well as in Pakistan, and we believe the expansion of outreach and exchange programs will enable the establishment of stronger relationships with Pakistani leaders at all levels. Within the counter-insurgency construct we have laid out for Afghanistan and together with the support provided to Pakistan, we will of course continue to support the targeting, disruption, and pursuit of the leadership, bases, and support networks of Al Qaeda and other transnational extremist groups operating in the region. We will also work with our partners to challenge the legitimacy of the terrorists’ methods, practices, and ideologies, helping our partners address legitimate grievances to win over reconcilable elements of the population, and supporting promotion of the broad-based economic and governmental development that is a necessary part of such an effort. I'm not sure if I can paste the whole speech in so I won't. It's worth clicking on the link to read the whole thing though. If the plan is by Petraeus, then it is sound and should be implemented... IMHO... Respectfully, SUNLINER81 I completely agree", 
        "intTime": 20090503, 
        "postID": 3, 
        "quote": "Originally posted by SUNLINER81: quote: Originally posted by AngelHeart: Excerp from http://www.centcom.mil/en/from-the-commander/commanders...ns-subcommittee.html quote: Commander's statement to House Appropriations subcommittee The US military will focus its assistance in two main areas. First, we will expand our partnership with the Pakistani military and help it build its counter-insurgency capabilities by providing training, equipment, and assistance. We will also expand our exchange programs to build stronger relationships with Pakistani leaders at all levels. Second, we will help promote closer cooperation across the Afghan-Pakistan border by providing training, equipment, facilities, and intelligence capabilities and by bringing together Afghan and Pakistani military officers to enable coordination between the forces on either side of the border. These efforts will support timely sharing of intelligence information and help to coordinate the operations of the two forces. These efforts to build the capacity of the Pakistani military would be aided substantially by the Pakistani Counterinsurgency Capability Fund. Pakistan is a unique situation that required nuanced authorities. Ambassador Holbrooke and I have determined that we need both Foreign Military Financing and PCCF to accomplish our mission. PCCF will allow us to focus, as well as expand, our Security Development Plan with Pakistan. In addition, we support the continued use of Coalition Support Funds as a tool for supporting the operations of our Pakistani partners as they confront extremists who operate in Afghanistan, as well as in Pakistan, and we believe the expansion of outreach and exchange programs will enable the establishment of stronger relationships with Pakistani leaders at all levels. Within the counter-insurgency construct we have laid out for Afghanistan and together with the support provided to Pakistan, we will of course continue to support the targeting, disruption, and pursuit of the leadership, bases, and support networks of Al Qaeda and other transnational extremist groups operating in the region. We will also work with our partners to challenge the legitimacy of the terrorists’ methods, practices, and ideologies, helping our partners address legitimate grievances to win over reconcilable elements of the population, and supporting promotion of the broad-based economic and governmental development that is a necessary part of such an effort. I'm not sure if I can paste the whole speech in so I won't. It's worth clicking on the link to read the whole thing though. If the plan is by Petraeus, then it is sound and should be implemented... IMHO... Respectfully, SUNLINER81", 
        "reply": " I completely agree", 
        "threadID": "672198221_3590004222001", 
        "time": "2009-05-03 17:21:00", 
        "title": "Petraeus talks to HAS about plans in Iraq, Afghanistan & Pakistan", 
        "userID": "AngelHeart"
    }
]