[
    {
        "content": "Jay Bookman \"Technically speaking, torture is still against the law. The words are still there, in Title 18 of the U.S. Code: “Whoever outside the United States commits or attempts to commit torture shall be fined under this title or imprisoned not more than 20 years, or both, and if death results to any person from conduct prohibited by this subsection, shall be punished by death or imprisoned for any term of years or for life.” But thanks in part to President Barack Obama, those words have all the relevance of an archaic law prohibiting pig-selling on Sunday. They mean nothing. Publicly, Obama claims America has changed course. On his first day in office, he signed an executive order halting “enhanced interrogations.” But that did not restore the rule of law; it weakened it further. If one executive order can ban torture, as Obama claims, then another such order can restore it, simple as that. And let’s at least be honest — what we have done is torture, sanctioned at the highest levels of government and at least tacitly accepted if not explicitly endorsed by Congress, including leading Democrats. Let’s at least have the moral courage to acknowledge that fact. In World War II, waterboarding was torture when Japanese soldiers inflicted it on Americans such as Lt. Chase Jay Nielsen, captured in the famous Doolittle Raid on Tokyo. In a tactic that sounds all too familiar, the Japanese claimed the treatment was legal because Nielsen was a war criminal not entitled to protection as a prisoner of war. In later war-crime trials, that defense failed. To Lt. Col. William Harrison, it was torture when inflicted by North Korean Communists. “They used the water treatment. They would bend my head back, put a towel over my face and pour water over the towel. I could not breathe. This went on for hour after, day after day. It was freezing cold. When I would pass out, they would shake me and begin again. They would leave me tied to the chair with the water freezing on and around me.” That is not “fraternity hazing.” It is torture. If it is torture when inflicted on Americans by others, it is torture when we Americans do it. We torture. In the eyes of the world and whatever God you might worship, we torture. That is difficult for many to accept because we are Americans and we are supposed to be different: Our strength is in our principles and commitment to values. But what did it take to make us throw all that away? Nineteen men armed with a plan and box cutters? That is Osama bin Laden’s victory: He scared us into fleeing the high ground. “All these things vanished when the Mujahideen hit you, and you then implemented the methods of the same documented governments that you used to curse,” bin Laden chortled in 2002. “… What happens in Guantanamo is a historical embarrassment to America and its values, and it screams into your faces: ‘You hypocrites, what is the value of your signature on any agreement or treaty?’ ” As bin Laden understands, the biggest canard of all is that the strong are willing to torture, to do what is necessary, while the weak shy from it. It takes no toughness to order the torture of a creature who is helpless to defend himself, a creature over whom you have absolute control. To the contrary, you torture because you fear that helpless creature — you do so because your fear is greater than the principles of civilization you tell yourselves you are defending. On the eve of our invasion of Iraq, President Bush issued a warning to the Iraqi military: “War crimes will be prosecuted, war criminals will be punished and it will be no defense to say, ‘I was just following orders.’ ” If a president is to have the credibility make such statements again, we have to restore the rule of law. We should do so not through a criminal probe of what individuals may have done — creating legal scapegoats for a policy that too many supported for too long — but with a candid, nonpartisan investigation of what we did as a nation. Rather than block such a probe, Obama should insist upon it. >http://blogs.ajc.com/jay-bookman-blog/2009/04/30/obama-failing-to-defend-torture-law/< If everything the country stands for is -not- in the toilet, Bush Administration officials will be indicted and tried on charges of torture. No one is above the law, and the president of the United States should be held to the strictest standard of all. Walt", 
        "intTime": 20090430, 
        "postID": 1, 
        "quote": "", 
        "reply": "Jay Bookman \"Technically speaking, torture is still against the law. The words are still there, in Title 18 of the U.S. Code: “Whoever outside the United States commits or attempts to commit torture shall be fined under this title or imprisoned not more than 20 years, or both, and if death results to any person from conduct prohibited by this subsection, shall be punished by death or imprisoned for any term of years or for life.” But thanks in part to President Barack Obama, those words have all the relevance of an archaic law prohibiting pig-selling on Sunday. They mean nothing. Publicly, Obama claims America has changed course. On his first day in office, he signed an executive order halting “enhanced interrogations.” But that did not restore the rule of law; it weakened it further. If one executive order can ban torture, as Obama claims, then another such order can restore it, simple as that. And let’s at least be honest — what we have done is torture, sanctioned at the highest levels of government and at least tacitly accepted if not explicitly endorsed by Congress, including leading Democrats. Let’s at least have the moral courage to acknowledge that fact. In World War II, waterboarding was torture when Japanese soldiers inflicted it on Americans such as Lt. Chase Jay Nielsen, captured in the famous Doolittle Raid on Tokyo. In a tactic that sounds all too familiar, the Japanese claimed the treatment was legal because Nielsen was a war criminal not entitled to protection as a prisoner of war. In later war-crime trials, that defense failed. To Lt. Col. William Harrison, it was torture when inflicted by North Korean Communists. “They used the water treatment. They would bend my head back, put a towel over my face and pour water over the towel. I could not breathe. This went on for hour after, day after day. It was freezing cold. When I would pass out, they would shake me and begin again. They would leave me tied to the chair with the water freezing on and around me.” That is not “fraternity hazing.” It is torture. If it is torture when inflicted on Americans by others, it is torture when we Americans do it. We torture. In the eyes of the world and whatever God you might worship, we torture. That is difficult for many to accept because we are Americans and we are supposed to be different: Our strength is in our principles and commitment to values. But what did it take to make us throw all that away? Nineteen men armed with a plan and box cutters? That is Osama bin Laden’s victory: He scared us into fleeing the high ground. “All these things vanished when the Mujahideen hit you, and you then implemented the methods of the same documented governments that you used to curse,” bin Laden chortled in 2002. “… What happens in Guantanamo is a historical embarrassment to America and its values, and it screams into your faces: ‘You hypocrites, what is the value of your signature on any agreement or treaty?’ ” As bin Laden understands, the biggest canard of all is that the strong are willing to torture, to do what is necessary, while the weak shy from it. It takes no toughness to order the torture of a creature who is helpless to defend himself, a creature over whom you have absolute control. To the contrary, you torture because you fear that helpless creature — you do so because your fear is greater than the principles of civilization you tell yourselves you are defending. On the eve of our invasion of Iraq, President Bush issued a warning to the Iraqi military: “War crimes will be prosecuted, war criminals will be punished and it will be no defense to say, ‘I was just following orders.’ ” If a president is to have the credibility make such statements again, we have to restore the rule of law. We should do so not through a criminal probe of what individuals may have done — creating legal scapegoats for a policy that too many supported for too long — but with a candid, nonpartisan investigation of what we did as a nation. Rather than block such a probe, Obama should insist upon it. >http://blogs.ajc.com/jay-bookman-blog/2009/04/30/obama-failing-to-defend-torture-law/< If everything the country stands for is -not- in the toilet, Bush Administration officials will be indicted and tried on charges of torture. No one is above the law, and the president of the United States should be held to the strictest standard of all. Walt", 
        "threadID": "672198221_6500041222001", 
        "time": "2009-04-30 04:27:00", 
        "title": "Obama failing to defend torture law", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "As Jon Stewart pointed out: “If you don’t stick to your principles when the chips are down, they’re not principles… they’re hobbies.”", 
        "intTime": 20090430, 
        "postID": 2, 
        "quote": "", 
        "reply": "As Jon Stewart pointed out: “If you don’t stick to your principles when the chips are down, they’re not principles… they’re hobbies.”", 
        "threadID": "672198221_6500041222001", 
        "time": "2009-04-30 05:06:00", 
        "title": "Obama failing to defend torture law", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "", 
        "intTime": 20090430, 
        "postID": 3, 
        "quote": "", 
        "reply": "", 
        "threadID": "672198221_6500041222001", 
        "time": "2009-04-30 05:52:00", 
        "title": "Obama failing to defend torture law", 
        "userID": "EAG154"
    }, 
    {
        "content": "Maybe I missed something. But didn't President Obama state in his last speech that waterboarding is torture? I don't agree with that. But if I did, I would take a strong stand against waterboarding. I think it is wrong and criminal if waterboarding is used for admission of guilt, or to punish, yet still not torture. Personnally, I believe that enhanced interogations are a necessary and legitimate means to get information when its use is for the safety of our country which is one of the responsibilities of the executive branch and CinC. If President Obama recognizes those responsibilities, how can he not keep enhanced interogations at the discretion of whoever holds the office.", 
        "intTime": 20090430, 
        "postID": 4, 
        "quote": "", 
        "reply": "Maybe I missed something. But didn't President Obama state in his last speech that waterboarding is torture? I don't agree with that. But if I did, I would take a strong stand against waterboarding. I think it is wrong and criminal if waterboarding is used for admission of guilt, or to punish, yet still not torture. Personnally, I believe that enhanced interogations are a necessary and legitimate means to get information when its use is for the safety of our country which is one of the responsibilities of the executive branch and CinC. If President Obama recognizes those responsibilities, how can he not keep enhanced interogations at the discretion of whoever holds the office.", 
        "threadID": "672198221_6500041222001", 
        "time": "2009-04-30 07:39:00", 
        "title": "Obama failing to defend torture law", 
        "userID": "catahoulagill"
    }, 
    {
        "content": "quote: Originally posted by catahoulagill: Maybe I missed something. But didn't President Obama state in his last speech that waterboarding is torture? I don't agree with that. But if I did, I would take a strong stand against waterboarding. I think it is wrong and criminal if waterboarding is used for admission of guilt, or to punish, yet still not torture. Personnally, I believe that enhanced interogations are a necessary and legitimate means to get information when its use is for the safety of our country which is one of the responsibilities of the executive branch and CinC. If President Obama recognizes those responsibilities, how can he not keep enhanced interogations at the discretion of whoever holds the office. Then in the post 9/11 world, all treaties and principles of law are deemed invalid? Or only the ones we want to violate? It would seem that there is a mind set out there that says \"We are Americans, we don't torture; therefore whatever we deem necessary can not be torture\". Is that how it works?", 
        "intTime": 20090430, 
        "postID": 5, 
        "quote": "Originally posted by catahoulagill: Maybe I missed something. But didn't President Obama state in his last speech that waterboarding is torture? I don't agree with that. But if I did, I would take a strong stand against waterboarding. I think it is wrong and criminal if waterboarding is used for admission of guilt, or to punish, yet still not torture. Personnally, I believe that enhanced interogations are a necessary and legitimate means to get information when its use is for the safety of our country which is one of the responsibilities of the executive branch and CinC. If President Obama recognizes those responsibilities, how can he not keep enhanced interogations at the discretion of whoever holds the office.", 
        "reply": " Then in the post 9/11 world, all treaties and principles of law are deemed invalid? Or only the ones we want to violate? It would seem that there is a mind set out there that says \"We are Americans, we don't torture; therefore whatever we deem necessary can not be torture\". Is that how it works?", 
        "threadID": "672198221_6500041222001", 
        "time": "2009-04-30 08:07:00", 
        "title": "Obama failing to defend torture law", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "There are no treaties with terrorists that I am aware of. Terrorists also have little use of rule of law. There was a discussion over waterboarding during the prior administration. The key element of declaring waterboarding as torture now is that the decision to use waterboarding to keep us safe was made by the key figure of the Dems political opposition. None of this is really about right or wrong, treaties, or rule of law. It is all about keeping America looking elsewhere when so many in this new administration don't have to adhere to the same rule of law or the same income tax regulations as the rest of us. Stoking the fires of discontent against the Republican Party and Conservatives is far easier when everything can be kept out of focus. Stop looking through glasses colored with BDS and MSM propaganda. When enhanced interrogation methods were decided on shortly after 9/11, nearly every American wanted much harsher methods of extracting information used. The discussions were more a means to keep some sanity in the process. Check with the speaker of the house on that while she can at least still remember her name. Again I'll tell you. Concerning those terrorists who were waterboarded: They were not subject to enhanced interrogations for getting confessions. They were not subject to enhanced interrogations as punishment. America did prevent an attack in L.A. with the info obtained. The method was authorized for the purpose of saving lives, not imprisonment. These guys were already assured of a long stay in a jail cell because they were admitted terrorists.", 
        "intTime": 20090430, 
        "postID": 6, 
        "quote": "", 
        "reply": "There are no treaties with terrorists that I am aware of. Terrorists also have little use of rule of law. There was a discussion over waterboarding during the prior administration. The key element of declaring waterboarding as torture now is that the decision to use waterboarding to keep us safe was made by the key figure of the Dems political opposition. None of this is really about right or wrong, treaties, or rule of law. It is all about keeping America looking elsewhere when so many in this new administration don't have to adhere to the same rule of law or the same income tax regulations as the rest of us. Stoking the fires of discontent against the Republican Party and Conservatives is far easier when everything can be kept out of focus. Stop looking through glasses colored with BDS and MSM propaganda. When enhanced interrogation methods were decided on shortly after 9/11, nearly every American wanted much harsher methods of extracting information used. The discussions were more a means to keep some sanity in the process. Check with the speaker of the house on that while she can at least still remember her name. Again I'll tell you. Concerning those terrorists who were waterboarded: They were not subject to enhanced interrogations for getting confessions. They were not subject to enhanced interrogations as punishment. America did prevent an attack in L.A. with the info obtained. The method was authorized for the purpose of saving lives, not imprisonment. These guys were already assured of a long stay in a jail cell because they were admitted terrorists.", 
        "threadID": "672198221_6500041222001", 
        "time": "2009-04-30 09:01:00", 
        "title": "Obama failing to defend torture law", 
        "userID": "catahoulagill"
    }, 
    {
        "content": "Ditto", 
        "intTime": 20090430, 
        "postID": 7, 
        "quote": "", 
        "reply": "Ditto", 
        "threadID": "672198221_6500041222001", 
        "time": "2009-04-30 09:12:00", 
        "title": "Obama failing to defend torture law", 
        "userID": "AngryPuppy"
    }, 
    {
        "content": "Blogs are now news sources here? Since when? Ahhh, Leftie Blogs ok Anything else must be Stormfront", 
        "intTime": 20090430, 
        "postID": 8, 
        "quote": "", 
        "reply": "Blogs are now news sources here? Since when? Ahhh, Leftie Blogs ok Anything else must be Stormfront", 
        "threadID": "672198221_6500041222001", 
        "time": "2009-04-30 09:31:00", 
        "title": "Obama failing to defend torture law", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "quote: Originally posted by catahoulagill: There are no treaties with terrorists that I am aware of. Terrorists also have little use of rule of law. There are no treaties with child molesters, rapists, whether foreign or domestic. It is US law that bans torture, and everyone in our custody, here or abroad is bound by that law. The Constitution makes no exceptions with Justice. Citizen, non-citizen, all under our custody are bound by our law. When Congress banned enhanced interogation, Bush defacto vetoed the law with a \"signing statement.\" Obama's executive order reverses that \"veto.\" The real villian here is the signing statements, which are patently unconsitutional. Obama has gone along with the entire signing statement fiasco - and thus the executive order. If Congress had any balls they would outlaw these signing statements, making the whole question academic. Dave", 
        "intTime": 20090430, 
        "postID": 9, 
        "quote": "Originally posted by catahoulagill: There are no treaties with terrorists that I am aware of. Terrorists also have little use of rule of law.", 
        "reply": " There are no treaties with child molesters, rapists, whether foreign or domestic. It is US law that bans torture, and everyone in our custody, here or abroad is bound by that law. The Constitution makes no exceptions with Justice. Citizen, non-citizen, all under our custody are bound by our law. When Congress banned enhanced interogation, Bush defacto vetoed the law with a \"signing statement.\" Obama's executive order reverses that \"veto.\" The real villian here is the signing statements, which are patently unconsitutional. Obama has gone along with the entire signing statement fiasco - and thus the executive order. If Congress had any balls they would outlaw these signing statements, making the whole question academic. Dave", 
        "threadID": "672198221_6500041222001", 
        "time": "2009-04-30 09:39:00", 
        "title": "Obama failing to defend torture law", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: As Jon Stewart pointed out: “If you don’t stick to your principles when the chips are down, they’re not principles… they’re hobbies.” Now I have you figured out...Jon Stewart...", 
        "intTime": 20090430, 
        "postID": 10, 
        "quote": "As Jon Stewart pointed out: “If you don’t stick to your principles when the chips are down, they’re not principles… they’re hobbies.”", 
        "reply": " Now I have you figured out...Jon Stewart...", 
        "threadID": "672198221_6500041222001", 
        "time": "2009-04-30 09:45:00", 
        "title": "Obama failing to defend torture law", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by catahoulagill: There are no treaties with terrorists that I am aware of. Terrorists also have little use of rule of law. -snip-. Criminals have little use for the law and they did not agree tot he laws either so the US government does not have to follow the laws when dealing with criminals. See how stupid that sounds. The Treaties against torture do NOT just apply between signatories and according to the US Constitutions ratified treaties ARE US LAW.", 
        "intTime": 20090430, 
        "postID": 11, 
        "quote": "Originally posted by catahoulagill: There are no treaties with terrorists that I am aware of. Terrorists also have little use of rule of law. -snip-.", 
        "reply": " Criminals have little use for the law and they did not agree tot he laws either so the US government does not have to follow the laws when dealing with criminals. See how stupid that sounds. The Treaties against torture do NOT just apply between signatories and according to the US Constitutions ratified treaties ARE US LAW.", 
        "threadID": "672198221_6500041222001", 
        "time": "2009-04-30 10:50:00", 
        "title": "Obama failing to defend torture law", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by catahoulagill: There are no treaties with terrorists that I am aware of. Terrorists also have little use of rule of law. There are no treaties with child molesters, rapists, whether foreign or domestic. It is US law that bans torture, and everyone in our custody, here or abroad is bound by that law. The Constitution makes no exceptions with Justice. Citizen, non-citizen, all under our custody are bound by our law. When Congress banned enhanced interogation, Bush defacto vetoed the law with a \"signing statement.\" Obama's executive order reverses that \"veto.\" The real villian here is the signing statements, which are patently unconsitutional. Obama has gone along with the entire signing statement fiasco - and thus the executive order. If Congress had any balls they would outlaw these signing statements, making the whole question academic. Dave Why do we have a CIA at all then? Do we need an agency that works for our safety outside our borders where few laws of any nation reach? The NSA and the FBI would be sufficient operating internationally if we were only concerned about individual criminal activity. If there is a need for the CIA to operate outside our borders against those who consider us enemies they wish to destroy, then there is a necessity and lawful grounds for enhanced interogations. There isn't a lot of difference between targeting terrorists in the sites of a rifle holding hostages to save a life and targeting terrorist activity through enhanced interogations to save lives. Both are necessary and within the scope of the office of the President. We are back on the same ole track. Defining enhanced interrogations as torture is the target acquisition of President Bush and the former administration.", 
        "intTime": 20090430, 
        "postID": 12, 
        "quote": "Originally posted by Grachus: quote: Originally posted by catahoulagill: There are no treaties with terrorists that I am aware of. Terrorists also have little use of rule of law. There are no treaties with child molesters, rapists, whether foreign or domestic. It is US law that bans torture, and everyone in our custody, here or abroad is bound by that law. The Constitution makes no exceptions with Justice. Citizen, non-citizen, all under our custody are bound by our law. When Congress banned enhanced interogation, Bush defacto vetoed the law with a \"signing statement.\" Obama's executive order reverses that \"veto.\" The real villian here is the signing statements, which are patently unconsitutional. Obama has gone along with the entire signing statement fiasco - and thus the executive order. If Congress had any balls they would outlaw these signing statements, making the whole question academic. Dave", 
        "reply": " Why do we have a CIA at all then? Do we need an agency that works for our safety outside our borders where few laws of any nation reach? The NSA and the FBI would be sufficient operating internationally if we were only concerned about individual criminal activity. If there is a need for the CIA to operate outside our borders against those who consider us enemies they wish to destroy, then there is a necessity and lawful grounds for enhanced interogations. There isn't a lot of difference between targeting terrorists in the sites of a rifle holding hostages to save a life and targeting terrorist activity through enhanced interogations to save lives. Both are necessary and within the scope of the office of the President. We are back on the same ole track. Defining enhanced interrogations as torture is the target acquisition of President Bush and the former administration.", 
        "threadID": "672198221_6500041222001", 
        "time": "2009-04-30 13:07:00", 
        "title": "Obama failing to defend torture law", 
        "userID": "catahoulagill"
    }, 
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by catahoulagill: There are no treaties with terrorists that I am aware of. Terrorists also have little use of rule of law. -snip-. Criminals have little use for the law and they did not agree tot he laws either so the US government does not have to follow the laws when dealing with criminals. See how stupid that sounds. The Treaties against torture do NOT just apply between signatories and according to the US Constitutions ratified treaties ARE US LAW. Using treaties and rule of law only for the sake of defining enhanced interrogations to your terms only is kind of stupid. Again, none of this is about bringing someone to court and sentencing them. This is about preventing someone from basically pulling the trigger and putting into action a terrorist plan that could result in many deaths. In this case, waterboarding and enhanced interrogations isn't nearly as severe as a sniper's bullet.", 
        "intTime": 20090430, 
        "postID": 13, 
        "quote": "Originally posted by rayld2: quote: Originally posted by catahoulagill: There are no treaties with terrorists that I am aware of. Terrorists also have little use of rule of law. -snip-. Criminals have little use for the law and they did not agree tot he laws either so the US government does not have to follow the laws when dealing with criminals. See how stupid that sounds. The Treaties against torture do NOT just apply between signatories and according to the US Constitutions ratified treaties ARE US LAW.", 
        "reply": " Using treaties and rule of law only for the sake of defining enhanced interrogations to your terms only is kind of stupid. Again, none of this is about bringing someone to court and sentencing them. This is about preventing someone from basically pulling the trigger and putting into action a terrorist plan that could result in many deaths. In this case, waterboarding and enhanced interrogations isn't nearly as severe as a sniper's bullet.", 
        "threadID": "672198221_6500041222001", 
        "time": "2009-04-30 13:25:00", 
        "title": "Obama failing to defend torture law", 
        "userID": "catahoulagill"
    }, 
    {
        "content": "quote: Originally posted by catahoulagill: quote: Originally posted by Grachus: quote: Originally posted by catahoulagill: There are no treaties with terrorists that I am aware of. Terrorists also have little use of rule of law. There are no treaties with child molesters, rapists, whether foreign or domestic. It is US law that bans torture, and everyone in our custody, here or abroad is bound by that law. The Constitution makes no exceptions with Justice. Citizen, non-citizen, all under our custody are bound by our law. When Congress banned enhanced interogation, Bush defacto vetoed the law with a \"signing statement.\" Obama's executive order reverses that \"veto.\" The real villian here is the signing statements, which are patently unconsitutional. Obama has gone along with the entire signing statement fiasco - and thus the executive order. If Congress had any balls they would outlaw these signing statements, making the whole question academic. Dave Why do we have a CIA at all then? Do we need an agency that works for our safety outside our borders where few laws of any nation reach? The NSA and the FBI would be sufficient operating internationally if we were only concerned about individual criminal activity. If there is a need for the CIA to operate outside our borders against those who consider us enemies they wish to destroy, then there is a necessity and lawful grounds for enhanced interogations. There isn't a lot of difference between targeting terrorists in the sites of a rifle holding hostages to save a life and targeting terrorist activity through enhanced interogations to save lives. Both are necessary and within the scope of the office of the President. We are back on the same ole track. Defining enhanced interrogations as torture is the target acquisition of President Bush and the former administration. Is there American Law, OR American tradition that bars spying and intelligence gathering? Does either bar killing an acknowledged enemy? Am I opposed to such CIA programs as supporting the Contra's in Nicarague? You bet I am. But even in that operation the CIA didn't run around torturing people. Now Congress, to its credit, cut off CIA aid to the Contras. No ones passed any laws barring us from killing Al Qaeda members where ever found. And just like a Cop in the situation I describe below, better the Al Qaeda member, then an American. If a Cop shoot an armed criminal, should I make some stupid comment, that he should have pulled a Roy Rogers and shot the gun out of his hand? It's a tough world, and dealing with a dangerous enemy with lethal force is not the same as violating your own moral code of ethics (not to mention violating your own laws). Al Qaeda members are our acknowledged enemy. Killing them, or capturing them, violates no law that I know about, anymore than killing Germans or Japanese in WWII violated them. Nor does it violate our ethics. Torturing them does. Dave", 
        "intTime": 20090430, 
        "postID": 14, 
        "quote": "Originally posted by catahoulagill: quote: Originally posted by Grachus: quote: Originally posted by catahoulagill: There are no treaties with terrorists that I am aware of. Terrorists also have little use of rule of law. There are no treaties with child molesters, rapists, whether foreign or domestic. It is US law that bans torture, and everyone in our custody, here or abroad is bound by that law. The Constitution makes no exceptions with Justice. Citizen, non-citizen, all under our custody are bound by our law. When Congress banned enhanced interogation, Bush defacto vetoed the law with a \"signing statement.\" Obama's executive order reverses that \"veto.\" The real villian here is the signing statements, which are patently unconsitutional. Obama has gone along with the entire signing statement fiasco - and thus the executive order. If Congress had any balls they would outlaw these signing statements, making the whole question academic. Dave Why do we have a CIA at all then? Do we need an agency that works for our safety outside our borders where few laws of any nation reach? The NSA and the FBI would be sufficient operating internationally if we were only concerned about individual criminal activity. If there is a need for the CIA to operate outside our borders against those who consider us enemies they wish to destroy, then there is a necessity and lawful grounds for enhanced interogations. There isn't a lot of difference between targeting terrorists in the sites of a rifle holding hostages to save a life and targeting terrorist activity through enhanced interogations to save lives. Both are necessary and within the scope of the office of the President. We are back on the same ole track. Defining enhanced interrogations as torture is the target acquisition of President Bush and the former administration.", 
        "reply": " Is there American Law, OR American tradition that bars spying and intelligence gathering? Does either bar killing an acknowledged enemy? Am I opposed to such CIA programs as supporting the Contra's in Nicarague? You bet I am. But even in that operation the CIA didn't run around torturing people. Now Congress, to its credit, cut off CIA aid to the Contras. No ones passed any laws barring us from killing Al Qaeda members where ever found. And just like a Cop in the situation I describe below, better the Al Qaeda member, then an American. If a Cop shoot an armed criminal, should I make some stupid comment, that he should have pulled a Roy Rogers and shot the gun out of his hand? It's a tough world, and dealing with a dangerous enemy with lethal force is not the same as violating your own moral code of ethics (not to mention violating your own laws). Al Qaeda members are our acknowledged enemy. Killing them, or capturing them, violates no law that I know about, anymore than killing Germans or Japanese in WWII violated them. Nor does it violate our ethics. Torturing them does. Dave", 
        "threadID": "672198221_6500041222001", 
        "time": "2009-04-30 13:48:00", 
        "title": "Obama failing to defend torture law", 
        "userID": "Grachus"
    }, 
    {
        "content": "The law that is proudly displayed has no effect, no meaning since the bill in 2005 was passed overwhelmingly by both Houses of Congress. Besides that....... Your quote is not found in Title 18. Following was the law prior to 2005. \"http://www.talkleft.com/story/2008/6/21/235132/383 Further, the waterboarding events were not preformed in the United States or in Guatanamo as some indicate, on in Senator Durbins mind, but in foreign lands: Meet Deuce Martinez. Career narcotics agent turned Five-Star CIA interrogator. Credited with getting Khalid Sheikh Mohammed, Abu Zubaydah and Ramzi Binalshibh to talk. Waterboarding, belly slaps, sleep deprivation and more. Martinez didn't like getting his hands dirty with the physical abuse, he waited in the wings while others did it and then conducted the interrogations. If the detainee stopped cooperating, it was back to the torture, then back to Martinez. Ultimately, they talked. The value of their information? The CIA says huge, even accounting for the misinformation they were fed. Of course, there's no way to test that theory. Where did this all occur? Inside the CIA's black hole of choice -- in Poland. [More...] Poland was picked because there were no local cultural and religious ties to Al Qaeda, making infiltration or attack by sympathizers unlikely, one C.I.A. officer said. Most important, Polish intelligence officials were eager to cooperate. “Poland is the 51st state,” one former C.I.A. official recalls James L. Pavitt, then director of the agency’s clandestine service, declaring. “Americans have no idea.” Khalid Sheikh Mohammed was waterboarded 100 times during a two week period. Where is Martinez now? Like many other C.I.A. officers in the post-9/11 security boom, Mr. Martinez left the agency for more lucrative work with government contractors. His life today is quiet by comparison with the secret interrogations of 2002 and 2003. But Mr. Martinez has not turned away entirely from his old world. He now works for Mitchell & Jessen Associates, a consulting company run by former military psychologists who advised the C.I.A. on the use of harsh tactics in the secret program. Martinez refused to be interviewed for the article. [H]is role was described by colleagues. Gen. Michael V. Hayden, director of the C.I.A., and a lawyer representing Mr. Martinez asked that he not be named in this article, saying that the former interrogator believed that the use of his name would invade his privacy and might jeopardize his safety. The New York Times, noting that Mr. Martinez had never worked undercover and that others involved in the campaign against Al Qaeda have been named in news articles and books, declined the request. Good for the Times. As to why the CIA turned to a narcotics agent who didn't speak Arabic and had no formal interrogation skills -- the Times notes that the CIA had made a sudden decision to use \"harsh interrogation techniques\" without doing research or having the personnel. In its scramble, the agency made the momentous decision to use harsh methods the United States had long condemned. With little research or reflection, it borrowed its techniques from an American military training program modeled on the torture repertories of the Soviet Union and other cold-war adversaries, a lineage that would come to haunt the agency. It located its overseas jails based largely on which foreign intelligence officials were most accommodating and rushed to move the prisoners when word of locations leaked. Enter Deuce. After the [9/11] attacks, officials recognized that tracking drug lords was not so different from searching for terrorist masterminds, and Mr. Martinez was among a half dozen or so narcotics analysts moved to the Counterterrorist Center to become “targeting officers” in the hunt for Al Qaeda. Colleagues say Mr. Martinez, then 36, threw himself into the new work with a passion. His expertise: analyzing wiretaps and intercepted communications of drug cartels. On a wall at the American Embassy in Islamabad, he posted a large, blank piece of paper. He wrote Abu Zubaydah’s phone number at the center. Then, over a week or so, he and others added more and more linked phone numbers from the eavesdropping files of the National Security Agency and Pakistani intelligence. His first conquest was Abu Zubaydah. Found in Pakistan, shot three times during his capture, sent for medical treatment and then to a black hole in Thailand for interrogation\".", 
        "intTime": 20090430, 
        "postID": 15, 
        "quote": "", 
        "reply": "The law that is proudly displayed has no effect, no meaning since the bill in 2005 was passed overwhelmingly by both Houses of Congress. Besides that....... Your quote is not found in Title 18. Following was the law prior to 2005. \"http://www.talkleft.com/story/2008/6/21/235132/383 Further, the waterboarding events were not preformed in the United States or in Guatanamo as some indicate, on in Senator Durbins mind, but in foreign lands: Meet Deuce Martinez. Career narcotics agent turned Five-Star CIA interrogator. Credited with getting Khalid Sheikh Mohammed, Abu Zubaydah and Ramzi Binalshibh to talk. Waterboarding, belly slaps, sleep deprivation and more. Martinez didn't like getting his hands dirty with the physical abuse, he waited in the wings while others did it and then conducted the interrogations. If the detainee stopped cooperating, it was back to the torture, then back to Martinez. Ultimately, they talked. The value of their information? The CIA says huge, even accounting for the misinformation they were fed. Of course, there's no way to test that theory. Where did this all occur? Inside the CIA's black hole of choice -- in Poland. [More...] Poland was picked because there were no local cultural and religious ties to Al Qaeda, making infiltration or attack by sympathizers unlikely, one C.I.A. officer said. Most important, Polish intelligence officials were eager to cooperate. “Poland is the 51st state,” one former C.I.A. official recalls James L. Pavitt, then director of the agency’s clandestine service, declaring. “Americans have no idea.” Khalid Sheikh Mohammed was waterboarded 100 times during a two week period. Where is Martinez now? Like many other C.I.A. officers in the post-9/11 security boom, Mr. Martinez left the agency for more lucrative work with government contractors. His life today is quiet by comparison with the secret interrogations of 2002 and 2003. But Mr. Martinez has not turned away entirely from his old world. He now works for Mitchell & Jessen Associates, a consulting company run by former military psychologists who advised the C.I.A. on the use of harsh tactics in the secret program. Martinez refused to be interviewed for the article. [H]is role was described by colleagues. Gen. Michael V. Hayden, director of the C.I.A., and a lawyer representing Mr. Martinez asked that he not be named in this article, saying that the former interrogator believed that the use of his name would invade his privacy and might jeopardize his safety. The New York Times, noting that Mr. Martinez had never worked undercover and that others involved in the campaign against Al Qaeda have been named in news articles and books, declined the request. Good for the Times. As to why the CIA turned to a narcotics agent who didn't speak Arabic and had no formal interrogation skills -- the Times notes that the CIA had made a sudden decision to use \"harsh interrogation techniques\" without doing research or having the personnel. In its scramble, the agency made the momentous decision to use harsh methods the United States had long condemned. With little research or reflection, it borrowed its techniques from an American military training program modeled on the torture repertories of the Soviet Union and other cold-war adversaries, a lineage that would come to haunt the agency. It located its overseas jails based largely on which foreign intelligence officials were most accommodating and rushed to move the prisoners when word of locations leaked. Enter Deuce. After the [9/11] attacks, officials recognized that tracking drug lords was not so different from searching for terrorist masterminds, and Mr. Martinez was among a half dozen or so narcotics analysts moved to the Counterterrorist Center to become “targeting officers” in the hunt for Al Qaeda. Colleagues say Mr. Martinez, then 36, threw himself into the new work with a passion. His expertise: analyzing wiretaps and intercepted communications of drug cartels. On a wall at the American Embassy in Islamabad, he posted a large, blank piece of paper. He wrote Abu Zubaydah’s phone number at the center. Then, over a week or so, he and others added more and more linked phone numbers from the eavesdropping files of the National Security Agency and Pakistani intelligence. His first conquest was Abu Zubaydah. Found in Pakistan, shot three times during his capture, sent for medical treatment and then to a black hole in Thailand for interrogation\".", 
        "threadID": "672198221_6500041222001", 
        "time": "2009-04-30 14:14:00", 
        "title": "Obama failing to defend torture law", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: Originally posted by rayevinsonsr: The law that is proudly displayed has no effect, no meaning since the bill in 2005 was passed overwhelmingly by both Houses of Congress. Besides that....... Your quote is not found in Title 18. Following was the law prior to 2005. \"http://www.talkleft.com/story/2008/6/21/235132/383 Further, the waterboarding events were not preformed in the United States or in Guatanamo as some indicate, on in Senator Durbins mind, but in foreign lands: Meet Deuce Martinez. Career narcotics agent turned Five-Star CIA interrogator. Credited with getting Khalid Sheikh Mohammed, Abu Zubaydah and Ramzi Binalshibh to talk. Waterboarding, belly slaps, sleep deprivation and more. Martinez didn't like getting his hands dirty with the physical abuse, he waited in the wings while others did it and then conducted the interrogations. If the detainee stopped cooperating, it was back to the torture, then back to Martinez. Ultimately, they talked. The value of their information? The CIA says huge, even accounting for the misinformation they were fed. Of course, there's no way to test that theory. Where did this all occur? Inside the CIA's black hole of choice -- in Poland. [More...] Poland was picked because there were no local cultural and religious ties to Al Qaeda, making infiltration or attack by sympathizers unlikely, one C.I.A. officer said. Most important, Polish intelligence officials were eager to cooperate. “Poland is the 51st state,” one former C.I.A. official recalls James L. Pavitt, then director of the agency’s clandestine service, declaring. “Americans have no idea.” Khalid Sheikh Mohammed was waterboarded 100 times during a two week period. Where is Martinez now? Like many other C.I.A. officers in the post-9/11 security boom, Mr. Martinez left the agency for more lucrative work with government contractors. His life today is quiet by comparison with the secret interrogations of 2002 and 2003. But Mr. Martinez has not turned away entirely from his old world. He now works for Mitchell & Jessen Associates, a consulting company run by former military psychologists who advised the C.I.A. on the use of harsh tactics in the secret program. Martinez refused to be interviewed for the article. [H]is role was described by colleagues. Gen. Michael V. Hayden, director of the C.I.A., and a lawyer representing Mr. Martinez asked that he not be named in this article, saying that the former interrogator believed that the use of his name would invade his privacy and might jeopardize his safety. The New York Times, noting that Mr. Martinez had never worked undercover and that others involved in the campaign against Al Qaeda have been named in news articles and books, declined the request. Good for the Times. As to why the CIA turned to a narcotics agent who didn't speak Arabic and had no formal interrogation skills -- the Times notes that the CIA had made a sudden decision to use \"harsh interrogation techniques\" without doing research or having the personnel. In its scramble, the agency made the momentous decision to use harsh methods the United States had long condemned. With little research or reflection, it borrowed its techniques from an American military training program modeled on the torture repertories of the Soviet Union and other cold-war adversaries, a lineage that would come to haunt the agency. It located its overseas jails based largely on which foreign intelligence officials were most accommodating and rushed to move the prisoners when word of locations leaked. Enter Deuce. After the [9/11] attacks, officials recognized that tracking drug lords was not so different from searching for terrorist masterminds, and Mr. Martinez was among a half dozen or so narcotics analysts moved to the Counterterrorist Center to become “targeting officers” in the hunt for Al Qaeda. Colleagues say Mr. Martinez, then 36, threw himself into the new work with a passion. His expertise: analyzing wiretaps and intercepted communications of drug cartels. On a wall at the American Embassy in Islamabad, he posted a large, blank piece of paper. He wrote Abu Zubaydah’s phone number at the center. Then, over a week or so, he and others added more and more linked phone numbers from the eavesdropping files of the National Security Agency and Pakistani intelligence. His first conquest was Abu Zubaydah. Found in Pakistan, shot three times during his capture, sent for medical treatment and then to a black hole in Thailand for interrogation\". Your should read a book called \"Four Came Home\" by Lt.Col. Carroll V. Glines... It will open your eyes, especially chapter 9... Read it and you will know... Respectfully, SUNLINER81", 
        "intTime": 20090430, 
        "postID": 16, 
        "quote": "Originally posted by rayevinsonsr: The law that is proudly displayed has no effect, no meaning since the bill in 2005 was passed overwhelmingly by both Houses of Congress. Besides that....... Your quote is not found in Title 18. Following was the law prior to 2005. \"http://www.talkleft.com/story/2008/6/21/235132/383 Further, the waterboarding events were not preformed in the United States or in Guatanamo as some indicate, on in Senator Durbins mind, but in foreign lands: Meet Deuce Martinez. Career narcotics agent turned Five-Star CIA interrogator. Credited with getting Khalid Sheikh Mohammed, Abu Zubaydah and Ramzi Binalshibh to talk. Waterboarding, belly slaps, sleep deprivation and more. Martinez didn't like getting his hands dirty with the physical abuse, he waited in the wings while others did it and then conducted the interrogations. If the detainee stopped cooperating, it was back to the torture, then back to Martinez. Ultimately, they talked. The value of their information? The CIA says huge, even accounting for the misinformation they were fed. Of course, there's no way to test that theory. Where did this all occur? Inside the CIA's black hole of choice -- in Poland. [More...] Poland was picked because there were no local cultural and religious ties to Al Qaeda, making infiltration or attack by sympathizers unlikely, one C.I.A. officer said. Most important, Polish intelligence officials were eager to cooperate. “Poland is the 51st state,” one former C.I.A. official recalls James L. Pavitt, then director of the agency’s clandestine service, declaring. “Americans have no idea.” Khalid Sheikh Mohammed was waterboarded 100 times during a two week period. Where is Martinez now? Like many other C.I.A. officers in the post-9/11 security boom, Mr. Martinez left the agency for more lucrative work with government contractors. His life today is quiet by comparison with the secret interrogations of 2002 and 2003. But Mr. Martinez has not turned away entirely from his old world. He now works for Mitchell & Jessen Associates, a consulting company run by former military psychologists who advised the C.I.A. on the use of harsh tactics in the secret program. Martinez refused to be interviewed for the article. [H]is role was described by colleagues. Gen. Michael V. Hayden, director of the C.I.A., and a lawyer representing Mr. Martinez asked that he not be named in this article, saying that the former interrogator believed that the use of his name would invade his privacy and might jeopardize his safety. The New York Times, noting that Mr. Martinez had never worked undercover and that others involved in the campaign against Al Qaeda have been named in news articles and books, declined the request. Good for the Times. As to why the CIA turned to a narcotics agent who didn't speak Arabic and had no formal interrogation skills -- the Times notes that the CIA had made a sudden decision to use \"harsh interrogation techniques\" without doing research or having the personnel. In its scramble, the agency made the momentous decision to use harsh methods the United States had long condemned. With little research or reflection, it borrowed its techniques from an American military training program modeled on the torture repertories of the Soviet Union and other cold-war adversaries, a lineage that would come to haunt the agency. It located its overseas jails based largely on which foreign intelligence officials were most accommodating and rushed to move the prisoners when word of locations leaked. Enter Deuce. After the [9/11] attacks, officials recognized that tracking drug lords was not so different from searching for terrorist masterminds, and Mr. Martinez was among a half dozen or so narcotics analysts moved to the Counterterrorist Center to become “targeting officers” in the hunt for Al Qaeda. Colleagues say Mr. Martinez, then 36, threw himself into the new work with a passion. His expertise: analyzing wiretaps and intercepted communications of drug cartels. On a wall at the American Embassy in Islamabad, he posted a large, blank piece of paper. He wrote Abu Zubaydah’s phone number at the center. Then, over a week or so, he and others added more and more linked phone numbers from the eavesdropping files of the National Security Agency and Pakistani intelligence. His first conquest was Abu Zubaydah. Found in Pakistan, shot three times during his capture, sent for medical treatment and then to a black hole in Thailand for interrogation\".", 
        "reply": " Your should read a book called \"Four Came Home\" by Lt.Col. Carroll V. Glines... It will open your eyes, especially chapter 9... Read it and you will know... Respectfully, SUNLINER81", 
        "threadID": "672198221_6500041222001", 
        "time": "2009-04-30 14:20:00", 
        "title": "Obama failing to defend torture law", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Your should read a book called \"Four Came Home\" by Lt.Col. Carroll V. Glines... It will open your eyes, especially chapter 9... Read it and you will know... Respectfully, SUNLINER81 Check this out...June 5th,6th,7th in Reading Pa there are three guys (among other heroes)who were on the Doolittle Raid coming to the WWII show. I and my son will be there. Maybe get a chance to at least stand in their presence. I am looking for the book now. A new one costs $106.00.", 
        "intTime": 20090430, 
        "postID": 17, 
        "quote": "Your should read a book called \"Four Came Home\" by Lt.Col. Carroll V. Glines... It will open your eyes, especially chapter 9... Read it and you will know... Respectfully, SUNLINER81", 
        "reply": " Check this out...June 5th,6th,7th in Reading Pa there are three guys (among other heroes)who were on the Doolittle Raid coming to the WWII show. I and my son will be there. Maybe get a chance to at least stand in their presence. I am looking for the book now. A new one costs $106.00.", 
        "threadID": "672198221_6500041222001", 
        "time": "2009-04-30 14:34:00", 
        "title": "Obama failing to defend torture law", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Why do we have a CIA at all then? Do we need an agency that works for our safety outside our borders where few laws of any nation reach? The NSA and the FBI would be sufficient operating internationally if we were only concerned about individual criminal activity. If there is a need for the CIA to operate outside our borders against those who consider us enemies they wish to destroy, then there is a necessity and lawful grounds for enhanced interogations. There isn't a lot of difference between targeting terrorists in the sites of a rifle holding hostages to save a life and targeting terrorist activity through enhanced interogations to save lives. Both are necessary and within the scope of the office of the President. We are back on the same ole track. Defining enhanced interrogations as torture is the target acquisition of President Bush and the former administration. Very well put", 
        "intTime": 20090430, 
        "postID": 18, 
        "quote": "Why do we have a CIA at all then? Do we need an agency that works for our safety outside our borders where few laws of any nation reach? The NSA and the FBI would be sufficient operating internationally if we were only concerned about individual criminal activity. If there is a need for the CIA to operate outside our borders against those who consider us enemies they wish to destroy, then there is a necessity and lawful grounds for enhanced interogations. There isn't a lot of difference between targeting terrorists in the sites of a rifle holding hostages to save a life and targeting terrorist activity through enhanced interogations to save lives. Both are necessary and within the scope of the office of the President. We are back on the same ole track. Defining enhanced interrogations as torture is the target acquisition of President Bush and the former administration.", 
        "reply": " Very well put", 
        "threadID": "672198221_6500041222001", 
        "time": "2009-04-30 14:40:00", 
        "title": "Obama failing to defend torture law", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by ACR26: quote: Your should read a book called \"Four Came Home\" by Lt.Col. Carroll V. Glines... It will open your eyes, especially chapter 9... Read it and you will know... Respectfully, SUNLINER81 Check this out...June 5th,6th,7th in Reading Pa there are three guys (among other heroes)who were on the Doolittle Raid coming to the WWII show. I and my son will be there. Maybe get a chance to at least stand in their presence. I am looking for the book now. A new one costs $106.00. There are only nine of the Raiders left alive now, of the original eighty... Of the four mentioned in the book, only one, Lt. Robert Hite, later Cpt. Hite, I believe... Chase Jay Nielsen and Jacob Daniel DeShaser, died about one month and two months ago respectively... I think you can get it in paperback also... Great book and if you can get Robert Hite to sign it, WOW!... These men are heroes to me, especially Lt. Ted W. Lawson and Sgt. Jacob DeShazer... I briefly got to talk to Jacob DeShazer by phone, even the sound of his voice conveyed a man of great conviction in his beliefs, all of them, truly great men... We have been blessed as a nation to have such great men as these... IMHO... Respectfully, SUNLINER81 ADDED NOTE: If you can get them, there are several books on the \"Raid\", that you could read... One is \"Thirty Seconds Over Tokyo\" by Lt. Ted W. Lawson and Robert Considine, \"Doolittle Tokyo Raiders\" by Lt.Col. Carroll V. Glines, \"Guests of the Kremlin\" by Lt.[later Colonel] Robert Emmons and there are more but those are about the best... IMHO... Respectfully, SUNLINER81 This message has been edited. Last edited by: SUNLINER81, Thu 30 April 2009 03:12 PM", 
        "intTime": 20090430, 
        "postID": 19, 
        "quote": "Originally posted by ACR26: quote: Your should read a book called \"Four Came Home\" by Lt.Col. Carroll V. Glines... It will open your eyes, especially chapter 9... Read it and you will know... Respectfully, SUNLINER81 Check this out...June 5th,6th,7th in Reading Pa there are three guys (among other heroes)who were on the Doolittle Raid coming to the WWII show. I and my son will be there. Maybe get a chance to at least stand in their presence. I am looking for the book now. A new one costs $106.00.", 
        "reply": " There are only nine of the Raiders left alive now, of the original eighty... Of the four mentioned in the book, only one, Lt. Robert Hite, later Cpt. Hite, I believe... Chase Jay Nielsen and Jacob Daniel DeShaser, died about one month and two months ago respectively... I think you can get it in paperback also... Great book and if you can get Robert Hite to sign it, WOW!... These men are heroes to me, especially Lt. Ted W. Lawson and Sgt. Jacob DeShazer... I briefly got to talk to Jacob DeShazer by phone, even the sound of his voice conveyed a man of great conviction in his beliefs, all of them, truly great men... We have been blessed as a nation to have such great men as these... IMHO... Respectfully, SUNLINER81 ADDED NOTE: If you can get them, there are several books on the \"Raid\", that you could read... One is \"Thirty Seconds Over Tokyo\" by Lt. Ted W. Lawson and Robert Considine, \"Doolittle Tokyo Raiders\" by Lt.Col. Carroll V. Glines, \"Guests of the Kremlin\" by Lt.[later Colonel] Robert Emmons and there are more but those are about the best... IMHO... Respectfully, SUNLINER81 This message has been edited. Last edited by: SUNLINER81, Thu 30 April 2009 03:12 PM", 
        "threadID": "672198221_6500041222001", 
        "time": "2009-04-30 14:44:00", 
        "title": "Obama failing to defend torture law", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by catahoulagill: quote: Originally posted by Grachus: quote: Originally posted by catahoulagill: There are no treaties with terrorists that I am aware of. Terrorists also have little use of rule of law. There are no treaties with child molesters, rapists, whether foreign or domestic. It is US law that bans torture, and everyone in our custody, here or abroad is bound by that law. The Constitution makes no exceptions with Justice. Citizen, non-citizen, all under our custody are bound by our law. When Congress banned enhanced interogation, Bush defacto vetoed the law with a \"signing statement.\" Obama's executive order reverses that \"veto.\" The real villian here is the signing statements, which are patently unconsitutional. Obama has gone along with the entire signing statement fiasco - and thus the executive order. If Congress had any balls they would outlaw these signing statements, making the whole question academic. Dave Why do we have a CIA at all then? Do we need an agency that works for our safety outside our borders where few laws of any nation reach? The NSA and the FBI would be sufficient operating internationally if we were only concerned about individual criminal activity. If there is a need for the CIA to operate outside our borders against those who consider us enemies they wish to destroy, then there is a necessity and lawful grounds for enhanced interogations. There isn't a lot of difference between targeting terrorists in the sites of a rifle holding hostages to save a life and targeting terrorist activity through enhanced interogations to save lives. Both are necessary and within the scope of the office of the President. We are back on the same ole track. Defining enhanced interrogations as torture is the target acquisition of President Bush and the former administration. You have it exactly backwards, we defined torture as enhanced interrogations... The sad thing is, yes, there are some left wingers that are peeing in their pants at the thought of \"getting Bush\", the problem is, that if the former President didn't break the laws, that's multiple laws, then there would be \"nothing to get\"... That is the sad and sorry point of it... Respectfully, SUNLINER81", 
        "intTime": 20090430, 
        "postID": 20, 
        "quote": "Originally posted by catahoulagill: quote: Originally posted by Grachus: quote: Originally posted by catahoulagill: There are no treaties with terrorists that I am aware of. Terrorists also have little use of rule of law. There are no treaties with child molesters, rapists, whether foreign or domestic. It is US law that bans torture, and everyone in our custody, here or abroad is bound by that law. The Constitution makes no exceptions with Justice. Citizen, non-citizen, all under our custody are bound by our law. When Congress banned enhanced interogation, Bush defacto vetoed the law with a \"signing statement.\" Obama's executive order reverses that \"veto.\" The real villian here is the signing statements, which are patently unconsitutional. Obama has gone along with the entire signing statement fiasco - and thus the executive order. If Congress had any balls they would outlaw these signing statements, making the whole question academic. Dave Why do we have a CIA at all then? Do we need an agency that works for our safety outside our borders where few laws of any nation reach? The NSA and the FBI would be sufficient operating internationally if we were only concerned about individual criminal activity. If there is a need for the CIA to operate outside our borders against those who consider us enemies they wish to destroy, then there is a necessity and lawful grounds for enhanced interogations. There isn't a lot of difference between targeting terrorists in the sites of a rifle holding hostages to save a life and targeting terrorist activity through enhanced interogations to save lives. Both are necessary and within the scope of the office of the President. We are back on the same ole track. Defining enhanced interrogations as torture is the target acquisition of President Bush and the former administration.", 
        "reply": " You have it exactly backwards, we defined torture as enhanced interrogations... The sad thing is, yes, there are some left wingers that are peeing in their pants at the thought of \"getting Bush\", the problem is, that if the former President didn't break the laws, that's multiple laws, then there would be \"nothing to get\"... That is the sad and sorry point of it... Respectfully, SUNLINER81", 
        "threadID": "672198221_6500041222001", 
        "time": "2009-04-30 14:48:00", 
        "title": "Obama failing to defend torture law", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "Jay Bookman \"Technically speaking, torture is still against the law. The words are still there, in Title 18 of the U.S. Code: “Whoever outside the United States commits or attempts to commit torture shall be fined under this title or imprisoned not more than 20 years, or both, and if death results to any person from conduct prohibited by this subsection, shall be punished by death or imprisoned for any term of years or for life.” But thanks in part to President Barack Obama, those words have all the relevance of an archaic law prohibiting pig-selling on Sunday. They mean nothing. Publicly, Obama claims America has changed course. On his first day in office, he signed an executive order halting “enhanced interrogations.” But that did not restore the rule of law; it weakened it further. If one executive order can ban torture, as Obama claims, then another such order can restore it, simple as that. And let’s at least be honest — what we have done is torture, sanctioned at the highest levels of government and at least tacitly accepted if not explicitly endorsed by Congress, including leading Democrats. Let’s at least have the moral courage to acknowledge that fact. In World War II, waterboarding was torture when Japanese soldiers inflicted it on Americans such as Lt. Chase Jay Nielsen, captured in the famous Doolittle Raid on Tokyo. In a tactic that sounds all too familiar, the Japanese claimed the treatment was legal because Nielsen was a war criminal not entitled to protection as a prisoner of war. In later war-crime trials, that defense failed. To Lt. Col. William Harrison, it was torture when inflicted by North Korean Communists. “They used the water treatment. They would bend my head back, put a towel over my face and pour water over the towel. I could not breathe. This went on for hour after, day after day. It was freezing cold. When I would pass out, they would shake me and begin again. They would leave me tied to the chair with the water freezing on and around me.” That is not “fraternity hazing.” It is torture. If it is torture when inflicted on Americans by others, it is torture when we Americans do it. We torture. In the eyes of the world and whatever God you might worship, we torture. That is difficult for many to accept because we are Americans and we are supposed to be different: Our strength is in our principles and commitment to values. But what did it take to make us throw all that away? Nineteen men armed with a plan and box cutters? That is Osama bin Laden’s victory: He scared us into fleeing the high ground. “All these things vanished when the Mujahideen hit you, and you then implemented the methods of the same documented governments that you used to curse,” bin Laden chortled in 2002. “… What happens in Guantanamo is a historical embarrassment to America and its values, and it screams into your faces: ‘You hypocrites, what is the value of your signature on any agreement or treaty?’ ” As bin Laden understands, the biggest canard of all is that the strong are willing to torture, to do what is necessary, while the weak shy from it. It takes no toughness to order the torture of a creature who is helpless to defend himself, a creature over whom you have absolute control. To the contrary, you torture because you fear that helpless creature — you do so because your fear is greater than the principles of civilization you tell yourselves you are defending. On the eve of our invasion of Iraq, President Bush issued a warning to the Iraqi military: “War crimes will be prosecuted, war criminals will be punished and it will be no defense to say, ‘I was just following orders.’ ” If a president is to have the credibility make such statements again, we have to restore the rule of law. We should do so not through a criminal probe of what individuals may have done — creating legal scapegoats for a policy that too many supported for too long — but with a candid, nonpartisan investigation of what we did as a nation. Rather than block such a probe, Obama should insist upon it. >http://blogs.ajc.com/jay-bookman-blog/2009/04/30/obama-failing-to-defend-torture-law/< If everything the country stands for is -not- in the toilet, Bush Administration officials will be indicted and tried on charges of torture. No one is above the law, and the president of the United States should be held to the strictest standard of all. Walt", 
        "intTime": 20090430, 
        "postID": 21, 
        "quote": "", 
        "reply": "Jay Bookman \"Technically speaking, torture is still against the law. The words are still there, in Title 18 of the U.S. Code: “Whoever outside the United States commits or attempts to commit torture shall be fined under this title or imprisoned not more than 20 years, or both, and if death results to any person from conduct prohibited by this subsection, shall be punished by death or imprisoned for any term of years or for life.” But thanks in part to President Barack Obama, those words have all the relevance of an archaic law prohibiting pig-selling on Sunday. They mean nothing. Publicly, Obama claims America has changed course. On his first day in office, he signed an executive order halting “enhanced interrogations.” But that did not restore the rule of law; it weakened it further. If one executive order can ban torture, as Obama claims, then another such order can restore it, simple as that. And let’s at least be honest — what we have done is torture, sanctioned at the highest levels of government and at least tacitly accepted if not explicitly endorsed by Congress, including leading Democrats. Let’s at least have the moral courage to acknowledge that fact. In World War II, waterboarding was torture when Japanese soldiers inflicted it on Americans such as Lt. Chase Jay Nielsen, captured in the famous Doolittle Raid on Tokyo. In a tactic that sounds all too familiar, the Japanese claimed the treatment was legal because Nielsen was a war criminal not entitled to protection as a prisoner of war. In later war-crime trials, that defense failed. To Lt. Col. William Harrison, it was torture when inflicted by North Korean Communists. “They used the water treatment. They would bend my head back, put a towel over my face and pour water over the towel. I could not breathe. This went on for hour after, day after day. It was freezing cold. When I would pass out, they would shake me and begin again. They would leave me tied to the chair with the water freezing on and around me.” That is not “fraternity hazing.” It is torture. If it is torture when inflicted on Americans by others, it is torture when we Americans do it. We torture. In the eyes of the world and whatever God you might worship, we torture. That is difficult for many to accept because we are Americans and we are supposed to be different: Our strength is in our principles and commitment to values. But what did it take to make us throw all that away? Nineteen men armed with a plan and box cutters? That is Osama bin Laden’s victory: He scared us into fleeing the high ground. “All these things vanished when the Mujahideen hit you, and you then implemented the methods of the same documented governments that you used to curse,” bin Laden chortled in 2002. “… What happens in Guantanamo is a historical embarrassment to America and its values, and it screams into your faces: ‘You hypocrites, what is the value of your signature on any agreement or treaty?’ ” As bin Laden understands, the biggest canard of all is that the strong are willing to torture, to do what is necessary, while the weak shy from it. It takes no toughness to order the torture of a creature who is helpless to defend himself, a creature over whom you have absolute control. To the contrary, you torture because you fear that helpless creature — you do so because your fear is greater than the principles of civilization you tell yourselves you are defending. On the eve of our invasion of Iraq, President Bush issued a warning to the Iraqi military: “War crimes will be prosecuted, war criminals will be punished and it will be no defense to say, ‘I was just following orders.’ ” If a president is to have the credibility make such statements again, we have to restore the rule of law. We should do so not through a criminal probe of what individuals may have done — creating legal scapegoats for a policy that too many supported for too long — but with a candid, nonpartisan investigation of what we did as a nation. Rather than block such a probe, Obama should insist upon it. >http://blogs.ajc.com/jay-bookman-blog/2009/04/30/obama-failing-to-defend-torture-law/< If everything the country stands for is -not- in the toilet, Bush Administration officials will be indicted and tried on charges of torture. No one is above the law, and the president of the United States should be held to the strictest standard of all. Walt", 
        "threadID": "672198221_6500041222001", 
        "time": "2009-04-30 04:27:00", 
        "title": "Obama failing to defend torture law", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "As Jon Stewart pointed out: “If you don’t stick to your principles when the chips are down, they’re not principles… they’re hobbies.”", 
        "intTime": 20090430, 
        "postID": 22, 
        "quote": "", 
        "reply": "As Jon Stewart pointed out: “If you don’t stick to your principles when the chips are down, they’re not principles… they’re hobbies.”", 
        "threadID": "672198221_6500041222001", 
        "time": "2009-04-30 05:06:00", 
        "title": "Obama failing to defend torture law", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "", 
        "intTime": 20090430, 
        "postID": 23, 
        "quote": "", 
        "reply": "", 
        "threadID": "672198221_6500041222001", 
        "time": "2009-04-30 05:52:00", 
        "title": "Obama failing to defend torture law", 
        "userID": "EAG154"
    }, 
    {
        "content": "Maybe I missed something. But didn't President Obama state in his last speech that waterboarding is torture? I don't agree with that. But if I did, I would take a strong stand against waterboarding. I think it is wrong and criminal if waterboarding is used for admission of guilt, or to punish, yet still not torture. Personnally, I believe that enhanced interogations are a necessary and legitimate means to get information when its use is for the safety of our country which is one of the responsibilities of the executive branch and CinC. If President Obama recognizes those responsibilities, how can he not keep enhanced interogations at the discretion of whoever holds the office.", 
        "intTime": 20090430, 
        "postID": 24, 
        "quote": "", 
        "reply": "Maybe I missed something. But didn't President Obama state in his last speech that waterboarding is torture? I don't agree with that. But if I did, I would take a strong stand against waterboarding. I think it is wrong and criminal if waterboarding is used for admission of guilt, or to punish, yet still not torture. Personnally, I believe that enhanced interogations are a necessary and legitimate means to get information when its use is for the safety of our country which is one of the responsibilities of the executive branch and CinC. If President Obama recognizes those responsibilities, how can he not keep enhanced interogations at the discretion of whoever holds the office.", 
        "threadID": "672198221_6500041222001", 
        "time": "2009-04-30 07:39:00", 
        "title": "Obama failing to defend torture law", 
        "userID": "catahoulagill"
    }, 
    {
        "content": "quote: Originally posted by catahoulagill: Maybe I missed something. But didn't President Obama state in his last speech that waterboarding is torture? I don't agree with that. But if I did, I would take a strong stand against waterboarding. I think it is wrong and criminal if waterboarding is used for admission of guilt, or to punish, yet still not torture. Personnally, I believe that enhanced interogations are a necessary and legitimate means to get information when its use is for the safety of our country which is one of the responsibilities of the executive branch and CinC. If President Obama recognizes those responsibilities, how can he not keep enhanced interogations at the discretion of whoever holds the office. Then in the post 9/11 world, all treaties and principles of law are deemed invalid? Or only the ones we want to violate? It would seem that there is a mind set out there that says \"We are Americans, we don't torture; therefore whatever we deem necessary can not be torture\". Is that how it works?", 
        "intTime": 20090430, 
        "postID": 25, 
        "quote": "Originally posted by catahoulagill: Maybe I missed something. But didn't President Obama state in his last speech that waterboarding is torture? I don't agree with that. But if I did, I would take a strong stand against waterboarding. I think it is wrong and criminal if waterboarding is used for admission of guilt, or to punish, yet still not torture. Personnally, I believe that enhanced interogations are a necessary and legitimate means to get information when its use is for the safety of our country which is one of the responsibilities of the executive branch and CinC. If President Obama recognizes those responsibilities, how can he not keep enhanced interogations at the discretion of whoever holds the office.", 
        "reply": " Then in the post 9/11 world, all treaties and principles of law are deemed invalid? Or only the ones we want to violate? It would seem that there is a mind set out there that says \"We are Americans, we don't torture; therefore whatever we deem necessary can not be torture\". Is that how it works?", 
        "threadID": "672198221_6500041222001", 
        "time": "2009-04-30 08:07:00", 
        "title": "Obama failing to defend torture law", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "There are no treaties with terrorists that I am aware of. Terrorists also have little use of rule of law. There was a discussion over waterboarding during the prior administration. The key element of declaring waterboarding as torture now is that the decision to use waterboarding to keep us safe was made by the key figure of the Dems political opposition. None of this is really about right or wrong, treaties, or rule of law. It is all about keeping America looking elsewhere when so many in this new administration don't have to adhere to the same rule of law or the same income tax regulations as the rest of us. Stoking the fires of discontent against the Republican Party and Conservatives is far easier when everything can be kept out of focus. Stop looking through glasses colored with BDS and MSM propaganda. When enhanced interrogation methods were decided on shortly after 9/11, nearly every American wanted much harsher methods of extracting information used. The discussions were more a means to keep some sanity in the process. Check with the speaker of the house on that while she can at least still remember her name. Again I'll tell you. Concerning those terrorists who were waterboarded: They were not subject to enhanced interrogations for getting confessions. They were not subject to enhanced interrogations as punishment. America did prevent an attack in L.A. with the info obtained. The method was authorized for the purpose of saving lives, not imprisonment. These guys were already assured of a long stay in a jail cell because they were admitted terrorists.", 
        "intTime": 20090430, 
        "postID": 26, 
        "quote": "", 
        "reply": "There are no treaties with terrorists that I am aware of. Terrorists also have little use of rule of law. There was a discussion over waterboarding during the prior administration. The key element of declaring waterboarding as torture now is that the decision to use waterboarding to keep us safe was made by the key figure of the Dems political opposition. None of this is really about right or wrong, treaties, or rule of law. It is all about keeping America looking elsewhere when so many in this new administration don't have to adhere to the same rule of law or the same income tax regulations as the rest of us. Stoking the fires of discontent against the Republican Party and Conservatives is far easier when everything can be kept out of focus. Stop looking through glasses colored with BDS and MSM propaganda. When enhanced interrogation methods were decided on shortly after 9/11, nearly every American wanted much harsher methods of extracting information used. The discussions were more a means to keep some sanity in the process. Check with the speaker of the house on that while she can at least still remember her name. Again I'll tell you. Concerning those terrorists who were waterboarded: They were not subject to enhanced interrogations for getting confessions. They were not subject to enhanced interrogations as punishment. America did prevent an attack in L.A. with the info obtained. The method was authorized for the purpose of saving lives, not imprisonment. These guys were already assured of a long stay in a jail cell because they were admitted terrorists.", 
        "threadID": "672198221_6500041222001", 
        "time": "2009-04-30 09:01:00", 
        "title": "Obama failing to defend torture law", 
        "userID": "catahoulagill"
    }, 
    {
        "content": "Ditto", 
        "intTime": 20090430, 
        "postID": 27, 
        "quote": "", 
        "reply": "Ditto", 
        "threadID": "672198221_6500041222001", 
        "time": "2009-04-30 09:12:00", 
        "title": "Obama failing to defend torture law", 
        "userID": "AngryPuppy"
    }, 
    {
        "content": "Blogs are now news sources here? Since when? Ahhh, Leftie Blogs ok Anything else must be Stormfront", 
        "intTime": 20090430, 
        "postID": 28, 
        "quote": "", 
        "reply": "Blogs are now news sources here? Since when? Ahhh, Leftie Blogs ok Anything else must be Stormfront", 
        "threadID": "672198221_6500041222001", 
        "time": "2009-04-30 09:31:00", 
        "title": "Obama failing to defend torture law", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "quote: Originally posted by catahoulagill: There are no treaties with terrorists that I am aware of. Terrorists also have little use of rule of law. There are no treaties with child molesters, rapists, whether foreign or domestic. It is US law that bans torture, and everyone in our custody, here or abroad is bound by that law. The Constitution makes no exceptions with Justice. Citizen, non-citizen, all under our custody are bound by our law. When Congress banned enhanced interogation, Bush defacto vetoed the law with a \"signing statement.\" Obama's executive order reverses that \"veto.\" The real villian here is the signing statements, which are patently unconsitutional. Obama has gone along with the entire signing statement fiasco - and thus the executive order. If Congress had any balls they would outlaw these signing statements, making the whole question academic. Dave", 
        "intTime": 20090430, 
        "postID": 29, 
        "quote": "Originally posted by catahoulagill: There are no treaties with terrorists that I am aware of. Terrorists also have little use of rule of law.", 
        "reply": " There are no treaties with child molesters, rapists, whether foreign or domestic. It is US law that bans torture, and everyone in our custody, here or abroad is bound by that law. The Constitution makes no exceptions with Justice. Citizen, non-citizen, all under our custody are bound by our law. When Congress banned enhanced interogation, Bush defacto vetoed the law with a \"signing statement.\" Obama's executive order reverses that \"veto.\" The real villian here is the signing statements, which are patently unconsitutional. Obama has gone along with the entire signing statement fiasco - and thus the executive order. If Congress had any balls they would outlaw these signing statements, making the whole question academic. Dave", 
        "threadID": "672198221_6500041222001", 
        "time": "2009-04-30 09:39:00", 
        "title": "Obama failing to defend torture law", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: As Jon Stewart pointed out: “If you don’t stick to your principles when the chips are down, they’re not principles… they’re hobbies.” Now I have you figured out...Jon Stewart...", 
        "intTime": 20090430, 
        "postID": 30, 
        "quote": "As Jon Stewart pointed out: “If you don’t stick to your principles when the chips are down, they’re not principles… they’re hobbies.”", 
        "reply": " Now I have you figured out...Jon Stewart...", 
        "threadID": "672198221_6500041222001", 
        "time": "2009-04-30 09:45:00", 
        "title": "Obama failing to defend torture law", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by catahoulagill: There are no treaties with terrorists that I am aware of. Terrorists also have little use of rule of law. -snip-. Criminals have little use for the law and they did not agree tot he laws either so the US government does not have to follow the laws when dealing with criminals. See how stupid that sounds. The Treaties against torture do NOT just apply between signatories and according to the US Constitutions ratified treaties ARE US LAW.", 
        "intTime": 20090430, 
        "postID": 31, 
        "quote": "Originally posted by catahoulagill: There are no treaties with terrorists that I am aware of. Terrorists also have little use of rule of law. -snip-.", 
        "reply": " Criminals have little use for the law and they did not agree tot he laws either so the US government does not have to follow the laws when dealing with criminals. See how stupid that sounds. The Treaties against torture do NOT just apply between signatories and according to the US Constitutions ratified treaties ARE US LAW.", 
        "threadID": "672198221_6500041222001", 
        "time": "2009-04-30 10:50:00", 
        "title": "Obama failing to defend torture law", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by catahoulagill: There are no treaties with terrorists that I am aware of. Terrorists also have little use of rule of law. There are no treaties with child molesters, rapists, whether foreign or domestic. It is US law that bans torture, and everyone in our custody, here or abroad is bound by that law. The Constitution makes no exceptions with Justice. Citizen, non-citizen, all under our custody are bound by our law. When Congress banned enhanced interogation, Bush defacto vetoed the law with a \"signing statement.\" Obama's executive order reverses that \"veto.\" The real villian here is the signing statements, which are patently unconsitutional. Obama has gone along with the entire signing statement fiasco - and thus the executive order. If Congress had any balls they would outlaw these signing statements, making the whole question academic. Dave Why do we have a CIA at all then? Do we need an agency that works for our safety outside our borders where few laws of any nation reach? The NSA and the FBI would be sufficient operating internationally if we were only concerned about individual criminal activity. If there is a need for the CIA to operate outside our borders against those who consider us enemies they wish to destroy, then there is a necessity and lawful grounds for enhanced interogations. There isn't a lot of difference between targeting terrorists in the sites of a rifle holding hostages to save a life and targeting terrorist activity through enhanced interogations to save lives. Both are necessary and within the scope of the office of the President. We are back on the same ole track. Defining enhanced interrogations as torture is the target acquisition of President Bush and the former administration.", 
        "intTime": 20090430, 
        "postID": 32, 
        "quote": "Originally posted by Grachus: quote: Originally posted by catahoulagill: There are no treaties with terrorists that I am aware of. Terrorists also have little use of rule of law. There are no treaties with child molesters, rapists, whether foreign or domestic. It is US law that bans torture, and everyone in our custody, here or abroad is bound by that law. The Constitution makes no exceptions with Justice. Citizen, non-citizen, all under our custody are bound by our law. When Congress banned enhanced interogation, Bush defacto vetoed the law with a \"signing statement.\" Obama's executive order reverses that \"veto.\" The real villian here is the signing statements, which are patently unconsitutional. Obama has gone along with the entire signing statement fiasco - and thus the executive order. If Congress had any balls they would outlaw these signing statements, making the whole question academic. Dave", 
        "reply": " Why do we have a CIA at all then? Do we need an agency that works for our safety outside our borders where few laws of any nation reach? The NSA and the FBI would be sufficient operating internationally if we were only concerned about individual criminal activity. If there is a need for the CIA to operate outside our borders against those who consider us enemies they wish to destroy, then there is a necessity and lawful grounds for enhanced interogations. There isn't a lot of difference between targeting terrorists in the sites of a rifle holding hostages to save a life and targeting terrorist activity through enhanced interogations to save lives. Both are necessary and within the scope of the office of the President. We are back on the same ole track. Defining enhanced interrogations as torture is the target acquisition of President Bush and the former administration.", 
        "threadID": "672198221_6500041222001", 
        "time": "2009-04-30 13:07:00", 
        "title": "Obama failing to defend torture law", 
        "userID": "catahoulagill"
    }, 
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by catahoulagill: There are no treaties with terrorists that I am aware of. Terrorists also have little use of rule of law. -snip-. Criminals have little use for the law and they did not agree tot he laws either so the US government does not have to follow the laws when dealing with criminals. See how stupid that sounds. The Treaties against torture do NOT just apply between signatories and according to the US Constitutions ratified treaties ARE US LAW. Using treaties and rule of law only for the sake of defining enhanced interrogations to your terms only is kind of stupid. Again, none of this is about bringing someone to court and sentencing them. This is about preventing someone from basically pulling the trigger and putting into action a terrorist plan that could result in many deaths. In this case, waterboarding and enhanced interrogations isn't nearly as severe as a sniper's bullet.", 
        "intTime": 20090430, 
        "postID": 33, 
        "quote": "Originally posted by rayld2: quote: Originally posted by catahoulagill: There are no treaties with terrorists that I am aware of. Terrorists also have little use of rule of law. -snip-. Criminals have little use for the law and they did not agree tot he laws either so the US government does not have to follow the laws when dealing with criminals. See how stupid that sounds. The Treaties against torture do NOT just apply between signatories and according to the US Constitutions ratified treaties ARE US LAW.", 
        "reply": " Using treaties and rule of law only for the sake of defining enhanced interrogations to your terms only is kind of stupid. Again, none of this is about bringing someone to court and sentencing them. This is about preventing someone from basically pulling the trigger and putting into action a terrorist plan that could result in many deaths. In this case, waterboarding and enhanced interrogations isn't nearly as severe as a sniper's bullet.", 
        "threadID": "672198221_6500041222001", 
        "time": "2009-04-30 13:25:00", 
        "title": "Obama failing to defend torture law", 
        "userID": "catahoulagill"
    }, 
    {
        "content": "quote: Originally posted by catahoulagill: quote: Originally posted by Grachus: quote: Originally posted by catahoulagill: There are no treaties with terrorists that I am aware of. Terrorists also have little use of rule of law. There are no treaties with child molesters, rapists, whether foreign or domestic. It is US law that bans torture, and everyone in our custody, here or abroad is bound by that law. The Constitution makes no exceptions with Justice. Citizen, non-citizen, all under our custody are bound by our law. When Congress banned enhanced interogation, Bush defacto vetoed the law with a \"signing statement.\" Obama's executive order reverses that \"veto.\" The real villian here is the signing statements, which are patently unconsitutional. Obama has gone along with the entire signing statement fiasco - and thus the executive order. If Congress had any balls they would outlaw these signing statements, making the whole question academic. Dave Why do we have a CIA at all then? Do we need an agency that works for our safety outside our borders where few laws of any nation reach? The NSA and the FBI would be sufficient operating internationally if we were only concerned about individual criminal activity. If there is a need for the CIA to operate outside our borders against those who consider us enemies they wish to destroy, then there is a necessity and lawful grounds for enhanced interogations. There isn't a lot of difference between targeting terrorists in the sites of a rifle holding hostages to save a life and targeting terrorist activity through enhanced interogations to save lives. Both are necessary and within the scope of the office of the President. We are back on the same ole track. Defining enhanced interrogations as torture is the target acquisition of President Bush and the former administration. Is there American Law, OR American tradition that bars spying and intelligence gathering? Does either bar killing an acknowledged enemy? Am I opposed to such CIA programs as supporting the Contra's in Nicarague? You bet I am. But even in that operation the CIA didn't run around torturing people. Now Congress, to its credit, cut off CIA aid to the Contras. No ones passed any laws barring us from killing Al Qaeda members where ever found. And just like a Cop in the situation I describe below, better the Al Qaeda member, then an American. If a Cop shoot an armed criminal, should I make some stupid comment, that he should have pulled a Roy Rogers and shot the gun out of his hand? It's a tough world, and dealing with a dangerous enemy with lethal force is not the same as violating your own moral code of ethics (not to mention violating your own laws). Al Qaeda members are our acknowledged enemy. Killing them, or capturing them, violates no law that I know about, anymore than killing Germans or Japanese in WWII violated them. Nor does it violate our ethics. Torturing them does. Dave", 
        "intTime": 20090430, 
        "postID": 34, 
        "quote": "Originally posted by catahoulagill: quote: Originally posted by Grachus: quote: Originally posted by catahoulagill: There are no treaties with terrorists that I am aware of. Terrorists also have little use of rule of law. There are no treaties with child molesters, rapists, whether foreign or domestic. It is US law that bans torture, and everyone in our custody, here or abroad is bound by that law. The Constitution makes no exceptions with Justice. Citizen, non-citizen, all under our custody are bound by our law. When Congress banned enhanced interogation, Bush defacto vetoed the law with a \"signing statement.\" Obama's executive order reverses that \"veto.\" The real villian here is the signing statements, which are patently unconsitutional. Obama has gone along with the entire signing statement fiasco - and thus the executive order. If Congress had any balls they would outlaw these signing statements, making the whole question academic. Dave Why do we have a CIA at all then? Do we need an agency that works for our safety outside our borders where few laws of any nation reach? The NSA and the FBI would be sufficient operating internationally if we were only concerned about individual criminal activity. If there is a need for the CIA to operate outside our borders against those who consider us enemies they wish to destroy, then there is a necessity and lawful grounds for enhanced interogations. There isn't a lot of difference between targeting terrorists in the sites of a rifle holding hostages to save a life and targeting terrorist activity through enhanced interogations to save lives. Both are necessary and within the scope of the office of the President. We are back on the same ole track. Defining enhanced interrogations as torture is the target acquisition of President Bush and the former administration.", 
        "reply": " Is there American Law, OR American tradition that bars spying and intelligence gathering? Does either bar killing an acknowledged enemy? Am I opposed to such CIA programs as supporting the Contra's in Nicarague? You bet I am. But even in that operation the CIA didn't run around torturing people. Now Congress, to its credit, cut off CIA aid to the Contras. No ones passed any laws barring us from killing Al Qaeda members where ever found. And just like a Cop in the situation I describe below, better the Al Qaeda member, then an American. If a Cop shoot an armed criminal, should I make some stupid comment, that he should have pulled a Roy Rogers and shot the gun out of his hand? It's a tough world, and dealing with a dangerous enemy with lethal force is not the same as violating your own moral code of ethics (not to mention violating your own laws). Al Qaeda members are our acknowledged enemy. Killing them, or capturing them, violates no law that I know about, anymore than killing Germans or Japanese in WWII violated them. Nor does it violate our ethics. Torturing them does. Dave", 
        "threadID": "672198221_6500041222001", 
        "time": "2009-04-30 13:48:00", 
        "title": "Obama failing to defend torture law", 
        "userID": "Grachus"
    }, 
    {
        "content": "The law that is proudly displayed has no effect, no meaning since the bill in 2005 was passed overwhelmingly by both Houses of Congress. Besides that....... Your quote is not found in Title 18. Following was the law prior to 2005. \"http://www.talkleft.com/story/2008/6/21/235132/383 Further, the waterboarding events were not preformed in the United States or in Guatanamo as some indicate, on in Senator Durbins mind, but in foreign lands: Meet Deuce Martinez. Career narcotics agent turned Five-Star CIA interrogator. Credited with getting Khalid Sheikh Mohammed, Abu Zubaydah and Ramzi Binalshibh to talk. Waterboarding, belly slaps, sleep deprivation and more. Martinez didn't like getting his hands dirty with the physical abuse, he waited in the wings while others did it and then conducted the interrogations. If the detainee stopped cooperating, it was back to the torture, then back to Martinez. Ultimately, they talked. The value of their information? The CIA says huge, even accounting for the misinformation they were fed. Of course, there's no way to test that theory. Where did this all occur? Inside the CIA's black hole of choice -- in Poland. [More...] Poland was picked because there were no local cultural and religious ties to Al Qaeda, making infiltration or attack by sympathizers unlikely, one C.I.A. officer said. Most important, Polish intelligence officials were eager to cooperate. “Poland is the 51st state,” one former C.I.A. official recalls James L. Pavitt, then director of the agency’s clandestine service, declaring. “Americans have no idea.” Khalid Sheikh Mohammed was waterboarded 100 times during a two week period. Where is Martinez now? Like many other C.I.A. officers in the post-9/11 security boom, Mr. Martinez left the agency for more lucrative work with government contractors. His life today is quiet by comparison with the secret interrogations of 2002 and 2003. But Mr. Martinez has not turned away entirely from his old world. He now works for Mitchell & Jessen Associates, a consulting company run by former military psychologists who advised the C.I.A. on the use of harsh tactics in the secret program. Martinez refused to be interviewed for the article. [H]is role was described by colleagues. Gen. Michael V. Hayden, director of the C.I.A., and a lawyer representing Mr. Martinez asked that he not be named in this article, saying that the former interrogator believed that the use of his name would invade his privacy and might jeopardize his safety. The New York Times, noting that Mr. Martinez had never worked undercover and that others involved in the campaign against Al Qaeda have been named in news articles and books, declined the request. Good for the Times. As to why the CIA turned to a narcotics agent who didn't speak Arabic and had no formal interrogation skills -- the Times notes that the CIA had made a sudden decision to use \"harsh interrogation techniques\" without doing research or having the personnel. In its scramble, the agency made the momentous decision to use harsh methods the United States had long condemned. With little research or reflection, it borrowed its techniques from an American military training program modeled on the torture repertories of the Soviet Union and other cold-war adversaries, a lineage that would come to haunt the agency. It located its overseas jails based largely on which foreign intelligence officials were most accommodating and rushed to move the prisoners when word of locations leaked. Enter Deuce. After the [9/11] attacks, officials recognized that tracking drug lords was not so different from searching for terrorist masterminds, and Mr. Martinez was among a half dozen or so narcotics analysts moved to the Counterterrorist Center to become “targeting officers” in the hunt for Al Qaeda. Colleagues say Mr. Martinez, then 36, threw himself into the new work with a passion. His expertise: analyzing wiretaps and intercepted communications of drug cartels. On a wall at the American Embassy in Islamabad, he posted a large, blank piece of paper. He wrote Abu Zubaydah’s phone number at the center. Then, over a week or so, he and others added more and more linked phone numbers from the eavesdropping files of the National Security Agency and Pakistani intelligence. His first conquest was Abu Zubaydah. Found in Pakistan, shot three times during his capture, sent for medical treatment and then to a black hole in Thailand for interrogation\".", 
        "intTime": 20090430, 
        "postID": 35, 
        "quote": "", 
        "reply": "The law that is proudly displayed has no effect, no meaning since the bill in 2005 was passed overwhelmingly by both Houses of Congress. Besides that....... Your quote is not found in Title 18. Following was the law prior to 2005. \"http://www.talkleft.com/story/2008/6/21/235132/383 Further, the waterboarding events were not preformed in the United States or in Guatanamo as some indicate, on in Senator Durbins mind, but in foreign lands: Meet Deuce Martinez. Career narcotics agent turned Five-Star CIA interrogator. Credited with getting Khalid Sheikh Mohammed, Abu Zubaydah and Ramzi Binalshibh to talk. Waterboarding, belly slaps, sleep deprivation and more. Martinez didn't like getting his hands dirty with the physical abuse, he waited in the wings while others did it and then conducted the interrogations. If the detainee stopped cooperating, it was back to the torture, then back to Martinez. Ultimately, they talked. The value of their information? The CIA says huge, even accounting for the misinformation they were fed. Of course, there's no way to test that theory. Where did this all occur? Inside the CIA's black hole of choice -- in Poland. [More...] Poland was picked because there were no local cultural and religious ties to Al Qaeda, making infiltration or attack by sympathizers unlikely, one C.I.A. officer said. Most important, Polish intelligence officials were eager to cooperate. “Poland is the 51st state,” one former C.I.A. official recalls James L. Pavitt, then director of the agency’s clandestine service, declaring. “Americans have no idea.” Khalid Sheikh Mohammed was waterboarded 100 times during a two week period. Where is Martinez now? Like many other C.I.A. officers in the post-9/11 security boom, Mr. Martinez left the agency for more lucrative work with government contractors. His life today is quiet by comparison with the secret interrogations of 2002 and 2003. But Mr. Martinez has not turned away entirely from his old world. He now works for Mitchell & Jessen Associates, a consulting company run by former military psychologists who advised the C.I.A. on the use of harsh tactics in the secret program. Martinez refused to be interviewed for the article. [H]is role was described by colleagues. Gen. Michael V. Hayden, director of the C.I.A., and a lawyer representing Mr. Martinez asked that he not be named in this article, saying that the former interrogator believed that the use of his name would invade his privacy and might jeopardize his safety. The New York Times, noting that Mr. Martinez had never worked undercover and that others involved in the campaign against Al Qaeda have been named in news articles and books, declined the request. Good for the Times. As to why the CIA turned to a narcotics agent who didn't speak Arabic and had no formal interrogation skills -- the Times notes that the CIA had made a sudden decision to use \"harsh interrogation techniques\" without doing research or having the personnel. In its scramble, the agency made the momentous decision to use harsh methods the United States had long condemned. With little research or reflection, it borrowed its techniques from an American military training program modeled on the torture repertories of the Soviet Union and other cold-war adversaries, a lineage that would come to haunt the agency. It located its overseas jails based largely on which foreign intelligence officials were most accommodating and rushed to move the prisoners when word of locations leaked. Enter Deuce. After the [9/11] attacks, officials recognized that tracking drug lords was not so different from searching for terrorist masterminds, and Mr. Martinez was among a half dozen or so narcotics analysts moved to the Counterterrorist Center to become “targeting officers” in the hunt for Al Qaeda. Colleagues say Mr. Martinez, then 36, threw himself into the new work with a passion. His expertise: analyzing wiretaps and intercepted communications of drug cartels. On a wall at the American Embassy in Islamabad, he posted a large, blank piece of paper. He wrote Abu Zubaydah’s phone number at the center. Then, over a week or so, he and others added more and more linked phone numbers from the eavesdropping files of the National Security Agency and Pakistani intelligence. His first conquest was Abu Zubaydah. Found in Pakistan, shot three times during his capture, sent for medical treatment and then to a black hole in Thailand for interrogation\".", 
        "threadID": "672198221_6500041222001", 
        "time": "2009-04-30 14:14:00", 
        "title": "Obama failing to defend torture law", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: Originally posted by rayevinsonsr: The law that is proudly displayed has no effect, no meaning since the bill in 2005 was passed overwhelmingly by both Houses of Congress. Besides that....... Your quote is not found in Title 18. Following was the law prior to 2005. \"http://www.talkleft.com/story/2008/6/21/235132/383 Further, the waterboarding events were not preformed in the United States or in Guatanamo as some indicate, on in Senator Durbins mind, but in foreign lands: Meet Deuce Martinez. Career narcotics agent turned Five-Star CIA interrogator. Credited with getting Khalid Sheikh Mohammed, Abu Zubaydah and Ramzi Binalshibh to talk. Waterboarding, belly slaps, sleep deprivation and more. Martinez didn't like getting his hands dirty with the physical abuse, he waited in the wings while others did it and then conducted the interrogations. If the detainee stopped cooperating, it was back to the torture, then back to Martinez. Ultimately, they talked. The value of their information? The CIA says huge, even accounting for the misinformation they were fed. Of course, there's no way to test that theory. Where did this all occur? Inside the CIA's black hole of choice -- in Poland. [More...] Poland was picked because there were no local cultural and religious ties to Al Qaeda, making infiltration or attack by sympathizers unlikely, one C.I.A. officer said. Most important, Polish intelligence officials were eager to cooperate. “Poland is the 51st state,” one former C.I.A. official recalls James L. Pavitt, then director of the agency’s clandestine service, declaring. “Americans have no idea.” Khalid Sheikh Mohammed was waterboarded 100 times during a two week period. Where is Martinez now? Like many other C.I.A. officers in the post-9/11 security boom, Mr. Martinez left the agency for more lucrative work with government contractors. His life today is quiet by comparison with the secret interrogations of 2002 and 2003. But Mr. Martinez has not turned away entirely from his old world. He now works for Mitchell & Jessen Associates, a consulting company run by former military psychologists who advised the C.I.A. on the use of harsh tactics in the secret program. Martinez refused to be interviewed for the article. [H]is role was described by colleagues. Gen. Michael V. Hayden, director of the C.I.A., and a lawyer representing Mr. Martinez asked that he not be named in this article, saying that the former interrogator believed that the use of his name would invade his privacy and might jeopardize his safety. The New York Times, noting that Mr. Martinez had never worked undercover and that others involved in the campaign against Al Qaeda have been named in news articles and books, declined the request. Good for the Times. As to why the CIA turned to a narcotics agent who didn't speak Arabic and had no formal interrogation skills -- the Times notes that the CIA had made a sudden decision to use \"harsh interrogation techniques\" without doing research or having the personnel. In its scramble, the agency made the momentous decision to use harsh methods the United States had long condemned. With little research or reflection, it borrowed its techniques from an American military training program modeled on the torture repertories of the Soviet Union and other cold-war adversaries, a lineage that would come to haunt the agency. It located its overseas jails based largely on which foreign intelligence officials were most accommodating and rushed to move the prisoners when word of locations leaked. Enter Deuce. After the [9/11] attacks, officials recognized that tracking drug lords was not so different from searching for terrorist masterminds, and Mr. Martinez was among a half dozen or so narcotics analysts moved to the Counterterrorist Center to become “targeting officers” in the hunt for Al Qaeda. Colleagues say Mr. Martinez, then 36, threw himself into the new work with a passion. His expertise: analyzing wiretaps and intercepted communications of drug cartels. On a wall at the American Embassy in Islamabad, he posted a large, blank piece of paper. He wrote Abu Zubaydah’s phone number at the center. Then, over a week or so, he and others added more and more linked phone numbers from the eavesdropping files of the National Security Agency and Pakistani intelligence. His first conquest was Abu Zubaydah. Found in Pakistan, shot three times during his capture, sent for medical treatment and then to a black hole in Thailand for interrogation\". Your should read a book called \"Four Came Home\" by Lt.Col. Carroll V. Glines... It will open your eyes, especially chapter 9... Read it and you will know... Respectfully, SUNLINER81", 
        "intTime": 20090430, 
        "postID": 36, 
        "quote": "Originally posted by rayevinsonsr: The law that is proudly displayed has no effect, no meaning since the bill in 2005 was passed overwhelmingly by both Houses of Congress. Besides that....... Your quote is not found in Title 18. Following was the law prior to 2005. \"http://www.talkleft.com/story/2008/6/21/235132/383 Further, the waterboarding events were not preformed in the United States or in Guatanamo as some indicate, on in Senator Durbins mind, but in foreign lands: Meet Deuce Martinez. Career narcotics agent turned Five-Star CIA interrogator. Credited with getting Khalid Sheikh Mohammed, Abu Zubaydah and Ramzi Binalshibh to talk. Waterboarding, belly slaps, sleep deprivation and more. Martinez didn't like getting his hands dirty with the physical abuse, he waited in the wings while others did it and then conducted the interrogations. If the detainee stopped cooperating, it was back to the torture, then back to Martinez. Ultimately, they talked. The value of their information? The CIA says huge, even accounting for the misinformation they were fed. Of course, there's no way to test that theory. Where did this all occur? Inside the CIA's black hole of choice -- in Poland. [More...] Poland was picked because there were no local cultural and religious ties to Al Qaeda, making infiltration or attack by sympathizers unlikely, one C.I.A. officer said. Most important, Polish intelligence officials were eager to cooperate. “Poland is the 51st state,” one former C.I.A. official recalls James L. Pavitt, then director of the agency’s clandestine service, declaring. “Americans have no idea.” Khalid Sheikh Mohammed was waterboarded 100 times during a two week period. Where is Martinez now? Like many other C.I.A. officers in the post-9/11 security boom, Mr. Martinez left the agency for more lucrative work with government contractors. His life today is quiet by comparison with the secret interrogations of 2002 and 2003. But Mr. Martinez has not turned away entirely from his old world. He now works for Mitchell & Jessen Associates, a consulting company run by former military psychologists who advised the C.I.A. on the use of harsh tactics in the secret program. Martinez refused to be interviewed for the article. [H]is role was described by colleagues. Gen. Michael V. Hayden, director of the C.I.A., and a lawyer representing Mr. Martinez asked that he not be named in this article, saying that the former interrogator believed that the use of his name would invade his privacy and might jeopardize his safety. The New York Times, noting that Mr. Martinez had never worked undercover and that others involved in the campaign against Al Qaeda have been named in news articles and books, declined the request. Good for the Times. As to why the CIA turned to a narcotics agent who didn't speak Arabic and had no formal interrogation skills -- the Times notes that the CIA had made a sudden decision to use \"harsh interrogation techniques\" without doing research or having the personnel. In its scramble, the agency made the momentous decision to use harsh methods the United States had long condemned. With little research or reflection, it borrowed its techniques from an American military training program modeled on the torture repertories of the Soviet Union and other cold-war adversaries, a lineage that would come to haunt the agency. It located its overseas jails based largely on which foreign intelligence officials were most accommodating and rushed to move the prisoners when word of locations leaked. Enter Deuce. After the [9/11] attacks, officials recognized that tracking drug lords was not so different from searching for terrorist masterminds, and Mr. Martinez was among a half dozen or so narcotics analysts moved to the Counterterrorist Center to become “targeting officers” in the hunt for Al Qaeda. Colleagues say Mr. Martinez, then 36, threw himself into the new work with a passion. His expertise: analyzing wiretaps and intercepted communications of drug cartels. On a wall at the American Embassy in Islamabad, he posted a large, blank piece of paper. He wrote Abu Zubaydah’s phone number at the center. Then, over a week or so, he and others added more and more linked phone numbers from the eavesdropping files of the National Security Agency and Pakistani intelligence. His first conquest was Abu Zubaydah. Found in Pakistan, shot three times during his capture, sent for medical treatment and then to a black hole in Thailand for interrogation\".", 
        "reply": " Your should read a book called \"Four Came Home\" by Lt.Col. Carroll V. Glines... It will open your eyes, especially chapter 9... Read it and you will know... Respectfully, SUNLINER81", 
        "threadID": "672198221_6500041222001", 
        "time": "2009-04-30 14:20:00", 
        "title": "Obama failing to defend torture law", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Your should read a book called \"Four Came Home\" by Lt.Col. Carroll V. Glines... It will open your eyes, especially chapter 9... Read it and you will know... Respectfully, SUNLINER81 Check this out...June 5th,6th,7th in Reading Pa there are three guys (among other heroes)who were on the Doolittle Raid coming to the WWII show. I and my son will be there. Maybe get a chance to at least stand in their presence. I am looking for the book now. A new one costs $106.00.", 
        "intTime": 20090430, 
        "postID": 37, 
        "quote": "Your should read a book called \"Four Came Home\" by Lt.Col. Carroll V. Glines... It will open your eyes, especially chapter 9... Read it and you will know... Respectfully, SUNLINER81", 
        "reply": " Check this out...June 5th,6th,7th in Reading Pa there are three guys (among other heroes)who were on the Doolittle Raid coming to the WWII show. I and my son will be there. Maybe get a chance to at least stand in their presence. I am looking for the book now. A new one costs $106.00.", 
        "threadID": "672198221_6500041222001", 
        "time": "2009-04-30 14:34:00", 
        "title": "Obama failing to defend torture law", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Why do we have a CIA at all then? Do we need an agency that works for our safety outside our borders where few laws of any nation reach? The NSA and the FBI would be sufficient operating internationally if we were only concerned about individual criminal activity. If there is a need for the CIA to operate outside our borders against those who consider us enemies they wish to destroy, then there is a necessity and lawful grounds for enhanced interogations. There isn't a lot of difference between targeting terrorists in the sites of a rifle holding hostages to save a life and targeting terrorist activity through enhanced interogations to save lives. Both are necessary and within the scope of the office of the President. We are back on the same ole track. Defining enhanced interrogations as torture is the target acquisition of President Bush and the former administration. Very well put", 
        "intTime": 20090430, 
        "postID": 38, 
        "quote": "Why do we have a CIA at all then? Do we need an agency that works for our safety outside our borders where few laws of any nation reach? The NSA and the FBI would be sufficient operating internationally if we were only concerned about individual criminal activity. If there is a need for the CIA to operate outside our borders against those who consider us enemies they wish to destroy, then there is a necessity and lawful grounds for enhanced interogations. There isn't a lot of difference between targeting terrorists in the sites of a rifle holding hostages to save a life and targeting terrorist activity through enhanced interogations to save lives. Both are necessary and within the scope of the office of the President. We are back on the same ole track. Defining enhanced interrogations as torture is the target acquisition of President Bush and the former administration.", 
        "reply": " Very well put", 
        "threadID": "672198221_6500041222001", 
        "time": "2009-04-30 14:40:00", 
        "title": "Obama failing to defend torture law", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by ACR26: quote: Your should read a book called \"Four Came Home\" by Lt.Col. Carroll V. Glines... It will open your eyes, especially chapter 9... Read it and you will know... Respectfully, SUNLINER81 Check this out...June 5th,6th,7th in Reading Pa there are three guys (among other heroes)who were on the Doolittle Raid coming to the WWII show. I and my son will be there. Maybe get a chance to at least stand in their presence. I am looking for the book now. A new one costs $106.00. There are only nine of the Raiders left alive now, of the original eighty... Of the four mentioned in the book, only one, Lt. Robert Hite, later Cpt. Hite, I believe... Chase Jay Nielsen and Jacob Daniel DeShaser, died about one month and two months ago respectively... I think you can get it in paperback also... Great book and if you can get Robert Hite to sign it, WOW!... These men are heroes to me, especially Lt. Ted W. Lawson and Sgt. Jacob DeShazer... I briefly got to talk to Jacob DeShazer by phone, even the sound of his voice conveyed a man of great conviction in his beliefs, all of them, truly great men... We have been blessed as a nation to have such great men as these... IMHO... Respectfully, SUNLINER81 ADDED NOTE: If you can get them, there are several books on the \"Raid\", that you could read... One is \"Thirty Seconds Over Tokyo\" by Lt. Ted W. Lawson and Robert Considine, \"Doolittle Tokyo Raiders\" by Lt.Col. Carroll V. Glines, \"Guests of the Kremlin\" by Lt.[later Colonel] Robert Emmons and there are more but those are about the best... IMHO... Respectfully, SUNLINER81 This message has been edited. Last edited by: SUNLINER81, Thu 30 April 2009 03:12 PM", 
        "intTime": 20090430, 
        "postID": 39, 
        "quote": "Originally posted by ACR26: quote: Your should read a book called \"Four Came Home\" by Lt.Col. Carroll V. Glines... It will open your eyes, especially chapter 9... Read it and you will know... Respectfully, SUNLINER81 Check this out...June 5th,6th,7th in Reading Pa there are three guys (among other heroes)who were on the Doolittle Raid coming to the WWII show. I and my son will be there. Maybe get a chance to at least stand in their presence. I am looking for the book now. A new one costs $106.00.", 
        "reply": " There are only nine of the Raiders left alive now, of the original eighty... Of the four mentioned in the book, only one, Lt. Robert Hite, later Cpt. Hite, I believe... Chase Jay Nielsen and Jacob Daniel DeShaser, died about one month and two months ago respectively... I think you can get it in paperback also... Great book and if you can get Robert Hite to sign it, WOW!... These men are heroes to me, especially Lt. Ted W. Lawson and Sgt. Jacob DeShazer... I briefly got to talk to Jacob DeShazer by phone, even the sound of his voice conveyed a man of great conviction in his beliefs, all of them, truly great men... We have been blessed as a nation to have such great men as these... IMHO... Respectfully, SUNLINER81 ADDED NOTE: If you can get them, there are several books on the \"Raid\", that you could read... One is \"Thirty Seconds Over Tokyo\" by Lt. Ted W. Lawson and Robert Considine, \"Doolittle Tokyo Raiders\" by Lt.Col. Carroll V. Glines, \"Guests of the Kremlin\" by Lt.[later Colonel] Robert Emmons and there are more but those are about the best... IMHO... Respectfully, SUNLINER81 This message has been edited. Last edited by: SUNLINER81, Thu 30 April 2009 03:12 PM", 
        "threadID": "672198221_6500041222001", 
        "time": "2009-04-30 14:44:00", 
        "title": "Obama failing to defend torture law", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by catahoulagill: quote: Originally posted by Grachus: quote: Originally posted by catahoulagill: There are no treaties with terrorists that I am aware of. Terrorists also have little use of rule of law. There are no treaties with child molesters, rapists, whether foreign or domestic. It is US law that bans torture, and everyone in our custody, here or abroad is bound by that law. The Constitution makes no exceptions with Justice. Citizen, non-citizen, all under our custody are bound by our law. When Congress banned enhanced interogation, Bush defacto vetoed the law with a \"signing statement.\" Obama's executive order reverses that \"veto.\" The real villian here is the signing statements, which are patently unconsitutional. Obama has gone along with the entire signing statement fiasco - and thus the executive order. If Congress had any balls they would outlaw these signing statements, making the whole question academic. Dave Why do we have a CIA at all then? Do we need an agency that works for our safety outside our borders where few laws of any nation reach? The NSA and the FBI would be sufficient operating internationally if we were only concerned about individual criminal activity. If there is a need for the CIA to operate outside our borders against those who consider us enemies they wish to destroy, then there is a necessity and lawful grounds for enhanced interogations. There isn't a lot of difference between targeting terrorists in the sites of a rifle holding hostages to save a life and targeting terrorist activity through enhanced interogations to save lives. Both are necessary and within the scope of the office of the President. We are back on the same ole track. Defining enhanced interrogations as torture is the target acquisition of President Bush and the former administration. You have it exactly backwards, we defined torture as enhanced interrogations... The sad thing is, yes, there are some left wingers that are peeing in their pants at the thought of \"getting Bush\", the problem is, that if the former President didn't break the laws, that's multiple laws, then there would be \"nothing to get\"... That is the sad and sorry point of it... Respectfully, SUNLINER81", 
        "intTime": 20090430, 
        "postID": 40, 
        "quote": "Originally posted by catahoulagill: quote: Originally posted by Grachus: quote: Originally posted by catahoulagill: There are no treaties with terrorists that I am aware of. Terrorists also have little use of rule of law. There are no treaties with child molesters, rapists, whether foreign or domestic. It is US law that bans torture, and everyone in our custody, here or abroad is bound by that law. The Constitution makes no exceptions with Justice. Citizen, non-citizen, all under our custody are bound by our law. When Congress banned enhanced interogation, Bush defacto vetoed the law with a \"signing statement.\" Obama's executive order reverses that \"veto.\" The real villian here is the signing statements, which are patently unconsitutional. Obama has gone along with the entire signing statement fiasco - and thus the executive order. If Congress had any balls they would outlaw these signing statements, making the whole question academic. Dave Why do we have a CIA at all then? Do we need an agency that works for our safety outside our borders where few laws of any nation reach? The NSA and the FBI would be sufficient operating internationally if we were only concerned about individual criminal activity. If there is a need for the CIA to operate outside our borders against those who consider us enemies they wish to destroy, then there is a necessity and lawful grounds for enhanced interogations. There isn't a lot of difference between targeting terrorists in the sites of a rifle holding hostages to save a life and targeting terrorist activity through enhanced interogations to save lives. Both are necessary and within the scope of the office of the President. We are back on the same ole track. Defining enhanced interrogations as torture is the target acquisition of President Bush and the former administration.", 
        "reply": " You have it exactly backwards, we defined torture as enhanced interrogations... The sad thing is, yes, there are some left wingers that are peeing in their pants at the thought of \"getting Bush\", the problem is, that if the former President didn't break the laws, that's multiple laws, then there would be \"nothing to get\"... That is the sad and sorry point of it... Respectfully, SUNLINER81", 
        "threadID": "672198221_6500041222001", 
        "time": "2009-04-30 14:48:00", 
        "title": "Obama failing to defend torture law", 
        "userID": "SUNLINER81"
    }
]