[
    {
        "content": "RE: http://www.military.com/opinion/0,15202,188137,00.html Who was it said \"Nations don't have friends, just interests.\" ETCS(SW)USN Ret",
        "intTime": 20090403,
        "postID": 1,
        "quote": "",
        "reply": "RE: http://www.military.com/opinion/0,15202,188137,00.html Who was it said \"Nations don't have friends, just interests.\" ETCS(SW)USN Ret",
        "threadID": "6960020520001_9570027912001",
        "time": "2009-04-03 07:21:00",
        "title": "The US Should Fear Its Friends",
        "userID": "ChuckW65"
    },
    {
        "content": "In \"The Godfather\", Vito Corleone provided some excellent advice: \"keep you friends close, keep your enemies closer...\". When we invaded Afghanistan, we were primarily going after Al Queda. The Taliban were actually willing to surrender Bin Laden, but asked the US for proof that he had been involved in the planning of the 9/11 attacks. The current administration obvious refused to provide any evidence - and therefore the Taliban got kicked out as well. The ISI put the Taliban in place, and were instrumental in providing US aid to Bin Laden when the Soviets invaded Afghanistan. In retrospect, we would've been better off to let the Soviets stay in Afghanistan because now there would at least be some infrastructure (etc.) built at their expense instead of ours. But it did seem like a good idea at the time. Now that Pakistan has these 3 major factions vying for control within their own country (the elected government, the army, and ISI - though it is arguable tha the ISI is merely a part of the army), the US has to find a way to convince them to channel their energies to our (and presumably thier) advantage. But we cannot afford to be under any dilusion that thier interests are the same as ours. Our new president seems to be far more pragmatic than the previous incumbant, so there is hope that the situation will improve. And, since he is confident enough to admit to mistakes it is likely that if the current strategy isn't working out as expected there is a far better chance that corrective action will be taken before it is too late (assuming that it isn't already too late).",
        "intTime": 20090403,
        "postID": 2,
        "quote": "",
        "reply": "In \"The Godfather\", Vito Corleone provided some excellent advice: \"keep you friends close, keep your enemies closer...\". When we invaded Afghanistan, we were primarily going after Al Queda. The Taliban were actually willing to surrender Bin Laden, but asked the US for proof that he had been involved in the planning of the 9/11 attacks. The current administration obvious refused to provide any evidence - and therefore the Taliban got kicked out as well. The ISI put the Taliban in place, and were instrumental in providing US aid to Bin Laden when the Soviets invaded Afghanistan. In retrospect, we would've been better off to let the Soviets stay in Afghanistan because now there would at least be some infrastructure (etc.) built at their expense instead of ours. But it did seem like a good idea at the time. Now that Pakistan has these 3 major factions vying for control within their own country (the elected government, the army, and ISI - though it is arguable tha the ISI is merely a part of the army), the US has to find a way to convince them to channel their energies to our (and presumably thier) advantage. But we cannot afford to be under any dilusion that thier interests are the same as ours. Our new president seems to be far more pragmatic than the previous incumbant, so there is hope that the situation will improve. And, since he is confident enough to admit to mistakes it is likely that if the current strategy isn't working out as expected there is a far better chance that corrective action will be taken before it is too late (assuming that it isn't already too late).",
        "threadID": "6960020520001_9570027912001",
        "time": "2009-04-03 08:53:00",
        "title": "The US Should Fear Its Friends",
        "userID": "PolicyWonk"
    },
    {
        "content": "US should fear it's leaders !",
        "intTime": 20090403,
        "postID": 3,
        "quote": "",
        "reply": "US should fear it's leaders !",
        "threadID": "6960020520001_9570027912001",
        "time": "2009-04-03 19:26:00",
        "title": "The US Should Fear Its Friends",
        "userID": "got2bfree"
    },
    {
        "content": "The greatest \"friend\" whom we should fear is Israel. The only time Israel considers the US as her friend is when we serve Israel's interests. We fight Israel's wars, give Israel billions in aid, supply Israel with our latest weaponry used to slaughter Palestinians and Lebanese (many Christians included) and protect Israel against the righteous indignation of the civilized world. Israel reciprocates by spying on her major benefactor, spitting in our faces, and stealing us blind through their international banking cabal. Joe Liberman is a prime example of an \"Israel First\" Jew who uses his power as a \"US\" Senator to push through Israel's agenda. As Sharon said, \"Don't worry about American pressure, we, the Jewish people control America\". (Oct 3, 2001).",
        "intTime": 20090404,
        "postID": 4,
        "quote": "",
        "reply": "The greatest \"friend\" whom we should fear is Israel. The only time Israel considers the US as her friend is when we serve Israel's interests. We fight Israel's wars, give Israel billions in aid, supply Israel with our latest weaponry used to slaughter Palestinians and Lebanese (many Christians included) and protect Israel against the righteous indignation of the civilized world. Israel reciprocates by spying on her major benefactor, spitting in our faces, and stealing us blind through their international banking cabal. Joe Liberman is a prime example of an \"Israel First\" Jew who uses his power as a \"US\" Senator to push through Israel's agenda. As Sharon said, \"Don't worry about American pressure, we, the Jewish people control America\". (Oct 3, 2001).",
        "threadID": "6960020520001_9570027912001",
        "time": "2009-04-04 05:11:00",
        "title": "The US Should Fear Its Friends",
        "userID": "Misanthrope2"
    },
    {
        "content": "Pragmatic? More like Idealistic. He thinks he can offer \"honourable reconciliation\" to the Taliban, (which they called a \"lunatic idea\") if thats pragmatism then I bet U will believe Detroit is gonna win next years superbowl. ! Oh, I almost forgot, his reaching out to the Iranians sure went over well!",
        "intTime": 20090404,
        "postID": 5,
        "quote": "",
        "reply": "Pragmatic? More like Idealistic. He thinks he can offer \"honourable reconciliation\" to the Taliban, (which they called a \"lunatic idea\") if thats pragmatism then I bet U will believe Detroit is gonna win next years superbowl. ! Oh, I almost forgot, his reaching out to the Iranians sure went over well!",
        "threadID": "6960020520001_9570027912001",
        "time": "2009-04-04 21:21:00",
        "title": "The US Should Fear Its Friends",
        "userID": "ryerye13B"
    },
    {
        "content": "quote: Originally posted by ryerye13B: Pragmatic? More like Idealistic. He thinks he can offer \"honourable reconciliation\" to the Taliban, (which they called a \"lunatic idea\") if thats pragmatism then I bet U will believe Detroit is gonna win next years superbowl. ! Oh, I almost forgot, his reaching out to the Iranians sure went over well! Idealistic is what I considered GWB to be - after all - only a crazy person would think that \"faith-based\" policy making that consistently ignored the facts on the ground would have even a snowballs chance in hell (Detroit by comparison would have a FAR better chance of winning the Superbowl next year that most of these policies ever working out - and the results speak for themselves). The nutjobs in that administration used to brag about ignoring the facts and making their \"own\" reality! The results made for a different reality for the rest of the country. I'm not crazy about making any deals with the Taliban - but lets not forget that when GWB asked them for Bin Laden, they said they would turn him over if the US would simply provide proof that he was an accessory to the crime. GWB notably refused, invaded, and tossed them out (notably failing to nail Bin Laden). Our beef wasn't with the Taliban (though thier brand of \"government\" left a lot to be desired): it was going after Bin Laden/Al Queda. Note that this policy (such as it is) was also recommended by the local commanders. And was it a good idea to reach out to the Iranians the way he did? I don't think so either (it should've been done quietly though back channels). But the man is making an effort to clean up 8 years of disastrous mismanagment in the shortest time possible, so perhaps I'm inclined to cut him some slack (note that the Iranian people really liked the speech, as did the majority of arabs). Perfect? No. Trying to undo 8 years of disaster? Yes.",
        "intTime": 20090406,
        "postID": 6,
        "quote": "Originally posted by ryerye13B: Pragmatic? More like Idealistic. He thinks he can offer \"honourable reconciliation\" to the Taliban, (which they called a \"lunatic idea\") if thats pragmatism then I bet U will believe Detroit is gonna win next years superbowl. ! Oh, I almost forgot, his reaching out to the Iranians sure went over well!",
        "reply": " Idealistic is what I considered GWB to be - after all - only a crazy person would think that \"faith-based\" policy making that consistently ignored the facts on the ground would have even a snowballs chance in hell (Detroit by comparison would have a FAR better chance of winning the Superbowl next year that most of these policies ever working out - and the results speak for themselves). The nutjobs in that administration used to brag about ignoring the facts and making their \"own\" reality! The results made for a different reality for the rest of the country. I'm not crazy about making any deals with the Taliban - but lets not forget that when GWB asked them for Bin Laden, they said they would turn him over if the US would simply provide proof that he was an accessory to the crime. GWB notably refused, invaded, and tossed them out (notably failing to nail Bin Laden). Our beef wasn't with the Taliban (though thier brand of \"government\" left a lot to be desired): it was going after Bin Laden/Al Queda. Note that this policy (such as it is) was also recommended by the local commanders. And was it a good idea to reach out to the Iranians the way he did? I don't think so either (it should've been done quietly though back channels). But the man is making an effort to clean up 8 years of disastrous mismanagment in the shortest time possible, so perhaps I'm inclined to cut him some slack (note that the Iranian people really liked the speech, as did the majority of arabs). Perfect? No. Trying to undo 8 years of disaster? Yes.",
        "threadID": "6960020520001_9570027912001",
        "time": "2009-04-06 08:22:00",
        "title": "The US Should Fear Its Friends",
        "userID": "PolicyWonk"
    },
    {
        "content": "So Eland tells us to pull out of the Stans. What does he suggest we do to prevent another attack against the US or its interests? I guess we let the all mighty UN draw up some unenforceable mandate before sanctions that will never be carried out. How about not buying products like leather goods made in Pakistan? There's a small start.",
        "intTime": 20090406,
        "postID": 7,
        "quote": "",
        "reply": "So Eland tells us to pull out of the Stans. What does he suggest we do to prevent another attack against the US or its interests? I guess we let the all mighty UN draw up some unenforceable mandate before sanctions that will never be carried out. How about not buying products like leather goods made in Pakistan? There's a small start.",
        "threadID": "6960020520001_9570027912001",
        "time": "2009-04-06 10:53:00",
        "title": "The US Should Fear Its Friends",
        "userID": "yanqui69"
    },
    {
        "content": "\"But the U.S. press recently reported that the ISI, the Pakistani intelligence service, supposedly a U.S. ally since the war against the Soviets in the 1980s, was supporting militant Islamic fighters against U.S. and NATO forces in Afghanistan. This information should not be new or surprising. During the Soviet war, the CIA funneled billions of dollars through the ISI to militant Islamic fighters. The ISI chose which groups to finance with CIA money. Serving its own interests, the ISI funded the most radical Islamic fighters, including Osama bin Laden, when more moderate groups were better anti-Soviet fighters.\" I'am not sure the US has ever considered Saudi or Pakistan friends, mabe somebody we have to deal with from time to time, but friends? nawwwww I don't think so. Friends are somebody you invite to your house for dinner. \"Fear\" is not the right word, cause we should fear no one. \"Wary\" would be a better choice.",
        "intTime": 20090406,
        "postID": 8,
        "quote": "",
        "reply": "\"But the U.S. press recently reported that the ISI, the Pakistani intelligence service, supposedly a U.S. ally since the war against the Soviets in the 1980s, was supporting militant Islamic fighters against U.S. and NATO forces in Afghanistan. This information should not be new or surprising. During the Soviet war, the CIA funneled billions of dollars through the ISI to militant Islamic fighters. The ISI chose which groups to finance with CIA money. Serving its own interests, the ISI funded the most radical Islamic fighters, including Osama bin Laden, when more moderate groups were better anti-Soviet fighters.\" I'am not sure the US has ever considered Saudi or Pakistan friends, mabe somebody we have to deal with from time to time, but friends? nawwwww I don't think so. Friends are somebody you invite to your house for dinner. \"Fear\" is not the right word, cause we should fear no one. \"Wary\" would be a better choice.",
        "threadID": "6960020520001_9570027912001",
        "time": "2009-04-06 12:10:00",
        "title": "The US Should Fear Its Friends",
        "userID": "wtpworrier"
    },
    {
        "content": "quote: Originally posted by wtpworrier: \"But the U.S. press recently reported that the ISI, the Pakistani intelligence service, supposedly a U.S. ally since the war against the Soviets in the 1980s, was supporting militant Islamic fighters against U.S. and NATO forces in Afghanistan. This information should not be new or surprising. During the Soviet war, the CIA funneled billions of dollars through the ISI to militant Islamic fighters. The ISI chose which groups to finance with CIA money. Serving its own interests, the ISI funded the most radical Islamic fighters, including Osama bin Laden, when more moderate groups were better anti-Soviet fighters.\" I'am not sure the US has ever considered Saudi or Pakistan friends, mabe somebody we have to deal with from time to time, but friends? nawwwww I don't think so. Friends are somebody you invite to your house for dinner. \"Fear\" is not the right word, cause we should fear no one. \"Wary\" would be a better choice. Well, w/r/t the Saudi's being considered friends - I can assure you that in fact they are very dear friends to none other than the Bush Family (3 generations, starting with George Prescott Bush). They have made each other fabulously wealthy (via the Carlyle Group, among others). That old family relationship was what made G W Bush's last trip to Saudi Arabia (to ask them to drill more oil when gas was hitting $4.00+ per gallon in the US) so pathetic (i.e. they turned him down flat after giving him a few trinkets). Immediately after that trip, the House of Faud also published (in their family owned newspaper no less!) an editorial that was uncharacteristically harsh toward their old friends son - our sitting president. I am paraphrasing here, but its pretty close: Nothing in the middle east will change until this president leaves office... All of his policies, whether foreign or domestic have turned to dust... This was after notably, as a favor to the House of Faud, the entire Bin Laden family (all those in the US), along with some Faud family members were in the only aircraft flying out of the US on 9/11. Pakistan as far as I know doesn't have any friends of that nature in the United States. Unless you include Dick Cheney, who after learning about Pakistan's A Q Kahn selling nuclear technology (from the CIA and DIA) \"forgot\" to inform President Reagan about this little factoid. You see, Dick Cheney was overseeing a sale of F-16 fighter jets to Pakistan, and the deal most likely wouldn't have gone through if the president was informed of Pakistans activities that have since caused us so may problems (A Q Khan sold nuclear technology to Iran, North Korea, Libya, and a few others that have or are giving us problems today). So their best friend is now out of high office, and hopefully less able to cause us such harm.",
        "intTime": 20090406,
        "postID": 9,
        "quote": "Originally posted by wtpworrier: \"But the U.S. press recently reported that the ISI, the Pakistani intelligence service, supposedly a U.S. ally since the war against the Soviets in the 1980s, was supporting militant Islamic fighters against U.S. and NATO forces in Afghanistan. This information should not be new or surprising. During the Soviet war, the CIA funneled billions of dollars through the ISI to militant Islamic fighters. The ISI chose which groups to finance with CIA money. Serving its own interests, the ISI funded the most radical Islamic fighters, including Osama bin Laden, when more moderate groups were better anti-Soviet fighters.\" I'am not sure the US has ever considered Saudi or Pakistan friends, mabe somebody we have to deal with from time to time, but friends? nawwwww I don't think so. Friends are somebody you invite to your house for dinner. \"Fear\" is not the right word, cause we should fear no one. \"Wary\" would be a better choice.",
        "reply": " Well, w/r/t the Saudi's being considered friends - I can assure you that in fact they are very dear friends to none other than the Bush Family (3 generations, starting with George Prescott Bush). They have made each other fabulously wealthy (via the Carlyle Group, among others). That old family relationship was what made G W Bush's last trip to Saudi Arabia (to ask them to drill more oil when gas was hitting $4.00+ per gallon in the US) so pathetic (i.e. they turned him down flat after giving him a few trinkets). Immediately after that trip, the House of Faud also published (in their family owned newspaper no less!) an editorial that was uncharacteristically harsh toward their old friends son - our sitting president. I am paraphrasing here, but its pretty close: Nothing in the middle east will change until this president leaves office... All of his policies, whether foreign or domestic have turned to dust... This was after notably, as a favor to the House of Faud, the entire Bin Laden family (all those in the US), along with some Faud family members were in the only aircraft flying out of the US on 9/11. Pakistan as far as I know doesn't have any friends of that nature in the United States. Unless you include Dick Cheney, who after learning about Pakistan's A Q Kahn selling nuclear technology (from the CIA and DIA) \"forgot\" to inform President Reagan about this little factoid. You see, Dick Cheney was overseeing a sale of F-16 fighter jets to Pakistan, and the deal most likely wouldn't have gone through if the president was informed of Pakistans activities that have since caused us so may problems (A Q Khan sold nuclear technology to Iran, North Korea, Libya, and a few others that have or are giving us problems today). So their best friend is now out of high office, and hopefully less able to cause us such harm.",
        "threadID": "6960020520001_9570027912001",
        "time": "2009-04-06 13:38:00",
        "title": "The US Should Fear Its Friends",
        "userID": "PolicyWonk"
    },
    {
        "content": "Policy Wonk, Read \"Sleeping With The Devil\" by Robert Baer and you will see how deep Saudi money runs into our government, learning institutions, and financial enterprises. This is both Republican and Democrat. I was fuming when I finished reading it. Learn both sides to a story. Both sides of the government are corrupt and need to be leveraged by the people.",
        "intTime": 20090408,
        "postID": 10,
        "quote": "",
        "reply": "Policy Wonk, Read \"Sleeping With The Devil\" by Robert Baer and you will see how deep Saudi money runs into our government, learning institutions, and financial enterprises. This is both Republican and Democrat. I was fuming when I finished reading it. Learn both sides to a story. Both sides of the government are corrupt and need to be leveraged by the people.",
        "threadID": "6960020520001_9570027912001",
        "time": "2009-04-08 00:11:00",
        "title": "The US Should Fear Its Friends",
        "userID": "yanqui69"
    },
    {
        "content": "quote: Originally posted by yanqui69: Policy Wonk, Read \"Sleeping With The Devil\" by Robert Baer and you will see how deep Saudi money runs into our government, learning institutions, and financial enterprises. This is both Republican and Democrat. I was fuming when I finished reading it. Learn both sides to a story. Both sides of the government are corrupt and need to be leveraged by the people. I will add that to the reading list. You are correct that oil money (not just the Saudis) has polluted our government, etc. And the problem has become considerably worse since the Supreme Court equated donations of cash to political campaigns, PIGS/PACS, etc, with \"free speech\". Without severe campaign reform, heavy restrictions on lobbying and cash donations, etc, we as a nation will not have our best interests served. The fact remains that we do have a carbon-based economy. The wake-up call to that vulnerability became clear to many during the more recent Bush years - and now there seems to be reason for hope that action will be taken to reduce our reliance on foreign sources of energy.",
        "intTime": 20090408,
        "postID": 11,
        "quote": "Originally posted by yanqui69: Policy Wonk, Read \"Sleeping With The Devil\" by Robert Baer and you will see how deep Saudi money runs into our government, learning institutions, and financial enterprises. This is both Republican and Democrat. I was fuming when I finished reading it. Learn both sides to a story. Both sides of the government are corrupt and need to be leveraged by the people.",
        "reply": " I will add that to the reading list. You are correct that oil money (not just the Saudis) has polluted our government, etc. And the problem has become considerably worse since the Supreme Court equated donations of cash to political campaigns, PIGS/PACS, etc, with \"free speech\". Without severe campaign reform, heavy restrictions on lobbying and cash donations, etc, we as a nation will not have our best interests served. The fact remains that we do have a carbon-based economy. The wake-up call to that vulnerability became clear to many during the more recent Bush years - and now there seems to be reason for hope that action will be taken to reduce our reliance on foreign sources of energy.",
        "threadID": "6960020520001_9570027912001",
        "time": "2009-04-08 07:52:00",
        "title": "The US Should Fear Its Friends",
        "userID": "PolicyWonk"
    },
    {
        "content": "We should research other types of fuel and of course, drill here and drill now. I'm more of the \"all of the above\" energy choice person without sacrificing industry or the quality of life for Americans.",
        "intTime": 20090415,
        "postID": 12,
        "quote": "",
        "reply": "We should research other types of fuel and of course, drill here and drill now. I'm more of the \"all of the above\" energy choice person without sacrificing industry or the quality of life for Americans.",
        "threadID": "6960020520001_9570027912001",
        "time": "2009-04-15 03:56:00",
        "title": "The US Should Fear Its Friends",
        "userID": "yanqui69"
    },
    {
        "content": "quote: Nations don't have friends, just interests Lord Palmerston, and if you knew anything about the man or his policies, you wouldn't be so quick to use his quote to describe the situation. If there was ever such thing as a misguided amatuer diplomat, he was your man. Under his 'guidance' Britain lurched from crisis to crisis in the 1850s and 60s(Crimea, Indian Mutiny, Arrow incident, Second Opium War, support of the Confederacy, etc.). Surprise, surprise. Saudi Arabia has its thumb in many pies, and the Middle East is a quagmire of conflicting policies involving nearly every nation. Where have you people been since 1973? I mean 1967.... er, 1948....I mean 1917? That was the year the British started dealing with what would become the Saudi and Jordanian Royal Families (Hussein's kids, Faisal and Abdullah). It was a frost from the start, mainly because of the inability of the west to perceive the motivations of the Saudis in the Arab Revolt. In case you've read the book of that title by that fool Lawrence, please note he got it dead wrong. But then again, what do you expect from a half-crazed idealistic staff wienie? A better understanding of the situation is in the book 'A Peace to End all Peace'. Read, and understand. In case you're wondering, the Sharif of Mecca (Hussein) only wanted British help in preventing the Turks from completing the railroad to the holy shrines of Mecca, thus cutting into his highly lucrative 'protection service' (if caravans paid for his service, they weren't robbed, if not, his operatives targeted them). This was the 'noble family' that Lawrence was so impressed with. The rest, as they say, is history. Sullivan013",
        "intTime": 20090415,
        "postID": 13,
        "quote": "Nations don't have friends, just interests",
        "reply": " Lord Palmerston, and if you knew anything about the man or his policies, you wouldn't be so quick to use his quote to describe the situation. If there was ever such thing as a misguided amatuer diplomat, he was your man. Under his 'guidance' Britain lurched from crisis to crisis in the 1850s and 60s(Crimea, Indian Mutiny, Arrow incident, Second Opium War, support of the Confederacy, etc.). Surprise, surprise. Saudi Arabia has its thumb in many pies, and the Middle East is a quagmire of conflicting policies involving nearly every nation. Where have you people been since 1973? I mean 1967.... er, 1948....I mean 1917? That was the year the British started dealing with what would become the Saudi and Jordanian Royal Families (Hussein's kids, Faisal and Abdullah). It was a frost from the start, mainly because of the inability of the west to perceive the motivations of the Saudis in the Arab Revolt. In case you've read the book of that title by that fool Lawrence, please note he got it dead wrong. But then again, what do you expect from a half-crazed idealistic staff wienie? A better understanding of the situation is in the book 'A Peace to End all Peace'. Read, and understand. In case you're wondering, the Sharif of Mecca (Hussein) only wanted British help in preventing the Turks from completing the railroad to the holy shrines of Mecca, thus cutting into his highly lucrative 'protection service' (if caravans paid for his service, they weren't robbed, if not, his operatives targeted them). This was the 'noble family' that Lawrence was so impressed with. The rest, as they say, is history. Sullivan013",
        "threadID": "6960020520001_9570027912001",
        "time": "2009-04-15 05:03:00",
        "title": "The US Should Fear Its Friends",
        "userID": "sullivan013"
    }
]