[
    {
        "content": "RE: http://www.military.com/opinion/0,15202,189954,00.html Very, Very mixed.",
        "intTime": 20090427,
        "postID": 1,
        "quote": "",
        "reply": "RE: http://www.military.com/opinion/0,15202,189954,00.html Very, Very mixed.",
        "threadID": "6960020520001_3260049122001",
        "time": "2009-04-27 21:20:00",
        "title": "A Mixed Record in the First 100 Days",
        "userID": "21246220"
    },
    {
        "content": "Ho hum. Remember when we were warned that Obama was completely out of his depth, clueless, unqualified? President Obama has done a great job. He is engaged, he asks for opposing opinions, he thinks deeply and acts wiesly. He has acted on many occasions with great decisiveness. He has taken responsibility for his actions. In short, he has been everything the previous president was not. Walt",
        "intTime": 20090428,
        "postID": 2,
        "quote": "",
        "reply": "Ho hum. Remember when we were warned that Obama was completely out of his depth, clueless, unqualified? President Obama has done a great job. He is engaged, he asks for opposing opinions, he thinks deeply and acts wiesly. He has acted on many occasions with great decisiveness. He has taken responsibility for his actions. In short, he has been everything the previous president was not. Walt",
        "threadID": "6960020520001_3260049122001",
        "time": "2009-04-28 04:59:00",
        "title": "A Mixed Record in the First 100 Days",
        "userID": "WhiskeyPapa"
    },
    {
        "content": "Very, Very subjective, and missing facts to back up the claims. quote: Both Hoover and FDR tried to artificially pump up the economy by increasing credit, aiding banks, and increasing federal expenditures, including spending on futile \"make-work\" public works programs—all of which required the economy to fall farther back toward equilibrium, thus turning a mundane recession into the Great Depression. We all know (or should know) that FDR was trying to prop up the economy and cheer people's spirits at the same time in what was (until now) the worst economic mess in our history... and that is fact. That the writer claims Hoover did ANYTHING to prop up the economy is a complete Fallacy. Hoover did NOTHING to prop up the economy, and THAT is why it continued to tank and reach for an ever lower economic bottom(which happened in 1932-33), UNTIL FDR took office, and even then it took 4 YEARS to get most people back to work, and another 5 for the Depression to finally end. This President may not be FDR, and he is certainly no Hoover. What he is is a dynamic, honest and intellectually superb President who has demonstrated that he knows what he is doing and isn't afraid to tackle any of our problems and look for solutions. Thankfully and finally we have such a person in the White House.",
        "intTime": 20090428,
        "postID": 3,
        "quote": "Both Hoover and FDR tried to artificially pump up the economy by increasing credit, aiding banks, and increasing federal expenditures, including spending on futile \"make-work\" public works programs—all of which required the economy to fall farther back toward equilibrium, thus turning a mundane recession into the Great Depression.",
        "reply": "Very, Very subjective, and missing facts to back up the claims.  We all know (or should know) that FDR was trying to prop up the economy and cheer people's spirits at the same time in what was (until now) the worst economic mess in our history... and that is fact. That the writer claims Hoover did ANYTHING to prop up the economy is a complete Fallacy. Hoover did NOTHING to prop up the economy, and THAT is why it continued to tank and reach for an ever lower economic bottom(which happened in 1932-33), UNTIL FDR took office, and even then it took 4 YEARS to get most people back to work, and another 5 for the Depression to finally end. This President may not be FDR, and he is certainly no Hoover. What he is is a dynamic, honest and intellectually superb President who has demonstrated that he knows what he is doing and isn't afraid to tackle any of our problems and look for solutions. Thankfully and finally we have such a person in the White House.",
        "threadID": "6960020520001_3260049122001",
        "time": "2009-04-28 05:04:00",
        "title": "A Mixed Record in the First 100 Days",
        "userID": "Bill_Fold"
    },
    {
        "content": "quote: Originally posted by Bill_Fold: This President may not be FDR, and he is certainly no Hoover. What he is is a dynamic, honest and intellectually superb President who has demonstrated that he knows what he is doing and isn't afraid to tackle any of pour problems, and look for solutions. Thankfully and finally we have such a person in the White House. Bears repeating. Walt",
        "intTime": 20090428,
        "postID": 4,
        "quote": "Originally posted by Bill_Fold: This President may not be FDR, and he is certainly no Hoover. What he is is a dynamic, honest and intellectually superb President who has demonstrated that he knows what he is doing and isn't afraid to tackle any of pour problems, and look for solutions. Thankfully and finally we have such a person in the White House.",
        "reply": " Bears repeating. Walt",
        "threadID": "6960020520001_3260049122001",
        "time": "2009-04-28 05:09:00",
        "title": "A Mixed Record in the First 100 Days",
        "userID": "WhiskeyPapa"
    },
    {
        "content": "Thank You, Walt. Ditto.",
        "intTime": 20090428,
        "postID": 5,
        "quote": "",
        "reply": "Thank You, Walt. Ditto.",
        "threadID": "6960020520001_3260049122001",
        "time": "2009-04-28 05:11:00",
        "title": "A Mixed Record in the First 100 Days",
        "userID": "Bill_Fold"
    },
    {
        "content": "As much as I might grade Obama differently on these matters, Mr. Eland gets an \"A\" for writing a thought provoking op-ed. I contrast this with the purely propagandistic op-ed of his fellow op-ed writer, O. North. I solidly agree with Mr. Eland's overall premise, that the 100-day report card is grossly overrated, oversold, and overdone. Reasoned criticism makes for good democracy.",
        "intTime": 20090428,
        "postID": 6,
        "quote": "",
        "reply": "As much as I might grade Obama differently on these matters, Mr. Eland gets an \"A\" for writing a thought provoking op-ed. I contrast this with the purely propagandistic op-ed of his fellow op-ed writer, O. North. I solidly agree with Mr. Eland's overall premise, that the 100-day report card is grossly overrated, oversold, and overdone. Reasoned criticism makes for good democracy.",
        "threadID": "6960020520001_3260049122001",
        "time": "2009-04-28 06:58:00",
        "title": "A Mixed Record in the First 100 Days",
        "userID": "bwf27"
    },
    {
        "content": "How dare this author critique the \"chosen one\" in any negative manner!",
        "intTime": 20090428,
        "postID": 7,
        "quote": "",
        "reply": "How dare this author critique the \"chosen one\" in any negative manner!",
        "threadID": "6960020520001_3260049122001",
        "time": "2009-04-28 07:00:00",
        "title": "A Mixed Record in the First 100 Days",
        "userID": "ryerye13B"
    },
    {
        "content": "quote: Unlike the younger Bush, Obama gets a \"B\" for realizing that popular opinion in Arab and Muslim countries does matter to U.S. security and attempting to raise U.S. standing in those nations by ending U.S. torture and closing Guantanamo and CIA secret prisons. Unfortunately, he doesn't seem to realize that the main cause of radical Islamists being converted to militant Islamist terrorists and guerrillas is the non-Muslim occupation of Muslim lands. If he did, he would realize that the U.S. occupation of Afghanistan has worsened terrorism by creating a resurgent Taliban (and allied groups) in both Afghanistan and Pakistan. In the case with Afghanistan, when the US first went in it was with the support of the Afghani people. They didn't like the Taliban either and were tired of being constantly in some kind of state of war (civil or otherwise). And, President Bush told the Afghani people that we were going to help them, but decided somewhere along the line that it would be far more fun (if not oil-licious) to go for an uninvited visit into Iraq. But years have gone by since we went into Afghanistan and the US became hopelessly distracted in Iraq, and little was done. The Afghani people have been waiting for a long time and have since grown impatient. The areas that the Taliban were chased out of didn't have sufficient troops, police, etc, to keep the criminals away so the country side became increasingly unstable. The Taliban, for all its problems, at least provided more security than the current Afghani government and US forces did. The evidence of our helping the people largely didn't materialize outside of Kabul: hence the problems we are now facing (i.e. the opportunity may have already vanished before the new guy even got started). That said, President Obama seems to be a very smart, pragmatic man. I am relieved that we have a president that understands that doing business with other cultures requires methods other than those used in the US. As an added bonus, rather than constantly denying mistakes no matter how obvious, he seems to have the courage to make corrections. Refreshing indeed...",
        "intTime": 20090428,
        "postID": 8,
        "quote": "Unlike the younger Bush, Obama gets a \"B\" for realizing that popular opinion in Arab and Muslim countries does matter to U.S. security and attempting to raise U.S. standing in those nations by ending U.S. torture and closing Guantanamo and CIA secret prisons. Unfortunately, he doesn't seem to realize that the main cause of radical Islamists being converted to militant Islamist terrorists and guerrillas is the non-Muslim occupation of Muslim lands. If he did, he would realize that the U.S. occupation of Afghanistan has worsened terrorism by creating a resurgent Taliban (and allied groups) in both Afghanistan and Pakistan.",
        "reply": " In the case with Afghanistan, when the US first went in it was with the support of the Afghani people. They didn't like the Taliban either and were tired of being constantly in some kind of state of war (civil or otherwise). And, President Bush told the Afghani people that we were going to help them, but decided somewhere along the line that it would be far more fun (if not oil-licious) to go for an uninvited visit into Iraq. But years have gone by since we went into Afghanistan and the US became hopelessly distracted in Iraq, and little was done. The Afghani people have been waiting for a long time and have since grown impatient. The areas that the Taliban were chased out of didn't have sufficient troops, police, etc, to keep the criminals away so the country side became increasingly unstable. The Taliban, for all its problems, at least provided more security than the current Afghani government and US forces did. The evidence of our helping the people largely didn't materialize outside of Kabul: hence the problems we are now facing (i.e. the opportunity may have already vanished before the new guy even got started). That said, President Obama seems to be a very smart, pragmatic man. I am relieved that we have a president that understands that doing business with other cultures requires methods other than those used in the US. As an added bonus, rather than constantly denying mistakes no matter how obvious, he seems to have the courage to make corrections. Refreshing indeed...",
        "threadID": "6960020520001_3260049122001",
        "time": "2009-04-28 07:47:00",
        "title": "A Mixed Record in the First 100 Days",
        "userID": "PolicyWonk"
    },
    {
        "content": "quote: Originally posted by Bill_Fold: Very, Very subjective, and missing facts to back up the claims. quote: Both Hoover and FDR tried to artificially pump up the economy by increasing credit, aiding banks, and increasing federal expenditures, including spending on futile \"make-work\" public works programs—all of which required the economy to fall farther back toward equilibrium, thus turning a mundane recession into the Great Depression. We all know (or should know) that FDR was trying to prop up the economy and cheer people's spirits at the same time in what was (until now) the worst economic mess in our history... and that is fact. That the writer claims Hoover did ANYTHING to prop up the economy is a complete Fallacy. Hoover did NOTHING to prop up the economy, and THAT is why it continued to tank and reach for an ever lower economic bottom(which happened in 1932-33), UNTIL FDR took office, and even then it took 4 YEARS to get most people back to work, and another 5 for the Depression to finally end. This President may not be FDR, and he is certainly no Hoover. What he is is a dynamic, honest and intellectually superb President who has demonstrated that he knows what he is doing and isn't afraid to tackle any of our problems and look for solutions. Thankfully and finally we have such a person in the White House. I'd like to add to this that our financial systems are very different now compared to the 1920's & 1930's FDR and Hoover administrations. Cheers.",
        "intTime": 20090428,
        "postID": 9,
        "quote": "Originally posted by Bill_Fold: Very, Very subjective, and missing facts to back up the claims. quote: Both Hoover and FDR tried to artificially pump up the economy by increasing credit, aiding banks, and increasing federal expenditures, including spending on futile \"make-work\" public works programs—all of which required the economy to fall farther back toward equilibrium, thus turning a mundane recession into the Great Depression. We all know (or should know) that FDR was trying to prop up the economy and cheer people's spirits at the same time in what was (until now) the worst economic mess in our history... and that is fact. That the writer claims Hoover did ANYTHING to prop up the economy is a complete Fallacy. Hoover did NOTHING to prop up the economy, and THAT is why it continued to tank and reach for an ever lower economic bottom(which happened in 1932-33), UNTIL FDR took office, and even then it took 4 YEARS to get most people back to work, and another 5 for the Depression to finally end. This President may not be FDR, and he is certainly no Hoover. What he is is a dynamic, honest and intellectually superb President who has demonstrated that he knows what he is doing and isn't afraid to tackle any of our problems and look for solutions. Thankfully and finally we have such a person in the White House.",
        "reply": " I'd like to add to this that our financial systems are very different now compared to the 1920's & 1930's FDR and Hoover administrations. Cheers.",
        "threadID": "6960020520001_3260049122001",
        "time": "2009-04-28 07:52:00",
        "title": "A Mixed Record in the First 100 Days",
        "userID": "PolicyWonk"
    },
    {
        "content": "\"but decided somewhere along the line that it would be far more fun (if not oil-licious) to go for an uninvited visit into Iraq.\" Ah yes the lefts favorite tag-line, \"war for oil\", kinda like \"Bush let the Bin Ladens leave on Sept 11th, the only flight out.\" Let us not forget that all of our favorite Dems jumped on board for this excursion, funny how when the political winds changed those same Dems jumped ship. I wonder if people will still be singing the presidents praise when this country is so far in debt, because of his outta control spending, our great great grandchildren will be picking up the tab? Please spare me the \"Bush did it\" argument, I'm no Bush apologist or supporter so if you reply with this argument it falls on deaf ears! I am fully aware of what Bush did! And Yes he is making the same mistakes as Hoover and FDR! Carbon Tax anyone? Maybe another trillion to those who are mostly responsible for this mess will turn it around? Bill-Fold while your learning a few their history please include how we, as a country, recovered from the depression? I'll give ya a hint WWII. This recession is not worse than the Great Depression, at least not yet! Obama is just another politician.",
        "intTime": 20090428,
        "postID": 10,
        "quote": "",
        "reply": "\"but decided somewhere along the line that it would be far more fun (if not oil-licious) to go for an uninvited visit into Iraq.\" Ah yes the lefts favorite tag-line, \"war for oil\", kinda like \"Bush let the Bin Ladens leave on Sept 11th, the only flight out.\" Let us not forget that all of our favorite Dems jumped on board for this excursion, funny how when the political winds changed those same Dems jumped ship. I wonder if people will still be singing the presidents praise when this country is so far in debt, because of his outta control spending, our great great grandchildren will be picking up the tab? Please spare me the \"Bush did it\" argument, I'm no Bush apologist or supporter so if you reply with this argument it falls on deaf ears! I am fully aware of what Bush did! And Yes he is making the same mistakes as Hoover and FDR! Carbon Tax anyone? Maybe another trillion to those who are mostly responsible for this mess will turn it around? Bill-Fold while your learning a few their history please include how we, as a country, recovered from the depression? I'll give ya a hint WWII. This recession is not worse than the Great Depression, at least not yet! Obama is just another politician.",
        "threadID": "6960020520001_3260049122001",
        "time": "2009-04-28 08:16:00",
        "title": "A Mixed Record in the First 100 Days",
        "userID": "ryerye13B"
    },
    {
        "content": "quote: Originally posted by ryerye13B: \"but decided somewhere along the line that it would be far more fun (if not oil-licious) to go for an uninvited visit into Iraq.\" Ah yes the lefts favorite tag-line, \"war for oil\", kinda like \"Bush let the Bin Ladens leave on Sept 11th, the only flight out.\" Let us not forget that all of our favorite Dems jumped on board for this excursion, funny how when the political winds changed those same Dems jumped ship. I wonder if people will still be singing the presidents praise when this country is so far in debt, because of his outta control spending, our great great grandchildren will be picking up the tab? Please spare me the \"Bush did it\" argument, I'm no Bush apologist or supporter so if you reply with this argument it falls on deaf ears! I am fully aware of what Bush did! And Yes he is making the same mistakes as Hoover and FDR! Carbon Tax anyone? Maybe another trillion to those who are mostly responsible for this mess will turn it around? Bill-Fold while your learning a few their history please include how we, as a country, recovered from the depression? I'll give ya a hint WWII. This recession is not worse than the Great Depression, at least not yet! Obama is just another politician. The Dems jumped aboard that excursion because they were carefully fed highly focused, bogus, biased, cooked, and otherwise highly suspect intelligence from sources the administration were warned to be pathologically dishonest by our allies intelligence agencies (and in a number of notable cases, our own CIA). No one has better access to intelligence than the White House, and they deliberately manipulated the facts to get congress to approve actions when they had already decided to go to war. Note that the political winds didn't change w/r/t Iraq until a number of events occurred: 1. The depth of outright incompetence that became the trademark of the Bush Administration became apparent. 2. The quantities of lies told by the administration to all that would listen to goad the nation into accepting war were realized. 3. Virtually none of the major reasons for going to war turned out to be true (note how many times the reasons changed). Were you one of the complainers when G W Bush couldn't find a spending bill too outrageous to veto for the first 6 years of his lamentable administration? I was!!! It took the democrats finally taking over the agenda (with too small of a majority to have any other power) to create a budget that he would veto. Now that 8 years of horrify incompetence have left our nation but a shell of what it used to be, now the republicans finally start complaining about the budget. Its too late for them. They have all but evaporated as a party and now resort to buffoonery when attempting to argue a point. As an example, look at the 18-page alternative budget they came up with: it is 99.999% content free for your protection, with nary a single digit referencing dollars throughout. At least they provide some comic relief... But even Arlen Spector has had enough: He is about to announce that he is resigning his republican affiliation to become a member of the democratic party. It is reported that the republican party has swung so far to the right that it is now the wrong party for him.",
        "intTime": 20090428,
        "postID": 11,
        "quote": "Originally posted by ryerye13B: \"but decided somewhere along the line that it would be far more fun (if not oil-licious) to go for an uninvited visit into Iraq.\" Ah yes the lefts favorite tag-line, \"war for oil\", kinda like \"Bush let the Bin Ladens leave on Sept 11th, the only flight out.\" Let us not forget that all of our favorite Dems jumped on board for this excursion, funny how when the political winds changed those same Dems jumped ship. I wonder if people will still be singing the presidents praise when this country is so far in debt, because of his outta control spending, our great great grandchildren will be picking up the tab? Please spare me the \"Bush did it\" argument, I'm no Bush apologist or supporter so if you reply with this argument it falls on deaf ears! I am fully aware of what Bush did! And Yes he is making the same mistakes as Hoover and FDR! Carbon Tax anyone? Maybe another trillion to those who are mostly responsible for this mess will turn it around? Bill-Fold while your learning a few their history please include how we, as a country, recovered from the depression? I'll give ya a hint WWII. This recession is not worse than the Great Depression, at least not yet! Obama is just another politician.",
        "reply": " The Dems jumped aboard that excursion because they were carefully fed highly focused, bogus, biased, cooked, and otherwise highly suspect intelligence from sources the administration were warned to be pathologically dishonest by our allies intelligence agencies (and in a number of notable cases, our own CIA). No one has better access to intelligence than the White House, and they deliberately manipulated the facts to get congress to approve actions when they had already decided to go to war. Note that the political winds didn't change w/r/t Iraq until a number of events occurred: 1. The depth of outright incompetence that became the trademark of the Bush Administration became apparent. 2. The quantities of lies told by the administration to all that would listen to goad the nation into accepting war were realized. 3. Virtually none of the major reasons for going to war turned out to be true (note how many times the reasons changed). Were you one of the complainers when G W Bush couldn't find a spending bill too outrageous to veto for the first 6 years of his lamentable administration? I was!!! It took the democrats finally taking over the agenda (with too small of a majority to have any other power) to create a budget that he would veto. Now that 8 years of horrify incompetence have left our nation but a shell of what it used to be, now the republicans finally start complaining about the budget. Its too late for them. They have all but evaporated as a party and now resort to buffoonery when attempting to argue a point. As an example, look at the 18-page alternative budget they came up with: it is 99.999% content free for your protection, with nary a single digit referencing dollars throughout. At least they provide some comic relief... But even Arlen Spector has had enough: He is about to announce that he is resigning his republican affiliation to become a member of the democratic party. It is reported that the republican party has swung so far to the right that it is now the wrong party for him.",
        "threadID": "6960020520001_3260049122001",
        "time": "2009-04-28 12:56:00",
        "title": "A Mixed Record in the First 100 Days",
        "userID": "PolicyWonk"
    },
    {
        "content": "When a fair weather politician decides to renounce his/her affilitation with either party because of diffences of philosophy with that party, he/she has violated his/her contract with those that elected him/her and instead should resign from his/her office. Hold a special election and IF that politician wins it, they can then join the other party. This should alos apply to any third party or Independant that wants to change affiliation as well.",
        "intTime": 20090428,
        "postID": 12,
        "quote": "",
        "reply": "When a fair weather politician decides to renounce his/her affilitation with either party because of diffences of philosophy with that party, he/she has violated his/her contract with those that elected him/her and instead should resign from his/her office. Hold a special election and IF that politician wins it, they can then join the other party. This should alos apply to any third party or Independant that wants to change affiliation as well.",
        "threadID": "6960020520001_3260049122001",
        "time": "2009-04-28 14:29:00",
        "title": "A Mixed Record in the First 100 Days",
        "userID": "21246220"
    },
    {
        "content": "As for Spector, did not have to swing very far, as he was already to the left of center on a lot os issues.",
        "intTime": 20090428,
        "postID": 13,
        "quote": "",
        "reply": "As for Spector, did not have to swing very far, as he was already to the left of center on a lot os issues.",
        "threadID": "6960020520001_3260049122001",
        "time": "2009-04-28 14:29:00",
        "title": "A Mixed Record in the First 100 Days",
        "userID": "21246220"
    },
    {
        "content": "quote: quote: Originally posted by ryerye13B: \"but decided somewhere along the line that it would be far more fun (if not oil-licious) to go for an uninvited visit into Iraq.\" Ah yes the lefts favorite tag-line, \"war for oil\", kinda like \"Bush let the Bin Ladens leave on Sept 11th, the only flight out.\" Let us not forget that all of our favorite Dems jumped on board for this excursion, funny how when the political winds changed those same Dems jumped ship. I wonder if people will still be singing the presidents praise when this country is so far in debt, because of his outta control spending, our great great grandchildren will be picking up the tab? Please spare me the \"Bush did it\" argument, I'm no Bush apologist or supporter so if you reply with this argument it falls on deaf ears! I am fully aware of what Bush did! And Yes he is making the same mistakes as Hoover and FDR! Carbon Tax anyone? Maybe another trillion to those who are mostly responsible for this mess will turn it around? Bill-Fold while your learning a few their history please include how we, as a country, recovered from the depression? I'll give ya a hint WWII. This recession is not worse than the Great Depression, at least not yet! Obama is just another politician. The Dems jumped aboard that excursion because they were carefully fed highly focused, bogus, biased, cooked, and otherwise highly suspect intelligence from sources the administration were warned to be pathologically dishonest by our allies intelligence agencies (and in a number of notable cases, our own CIA). No one has better access to intelligence than the White House, and they deliberately manipulated the facts to get congress to approve actions when they had already decided to go to war. Note that the political winds didn't change w/r/t Iraq until a number of events occurred: 1. The depth of outright incompetence that became the trademark of the Bush Administration became apparent. 2. The quantities of lies told by the administration to all that would listen to goad the nation into accepting war were realized. 3. Virtually none of the major reasons for going to war turned out to be true (note how many times the reasons changed). Were you one of the complainers when G W Bush couldn't find a spending bill too outrageous to veto for the first 6 years of his lamentable administration? I was!!! It took the democrats finally taking over the agenda (with too small of a majority to have any other power) to create a budget that he would veto. Now that 8 years of horrify incompetence have left our nation but a shell of what it used to be, now the republicans finally start complaining about the budget. Its too late for them. They have all but evaporated as a party and now resort to buffoonery when attempting to argue a point. As an example, look at the 18-page alternative budget they came up with: it is 99.999% content free for your protection, with nary a single digit referencing dollars throughout. At least they provide some comic relief... But even Arlen Spector has had enough: He is about to announce that he is resigning his republican affiliation to become a member of the democratic party. It is reported that the republican party has swung so far to the right that it is now the wrong party for him. Alright where to begin? So basically what your telling me is the the Dems are so incompetant they didn't question the admin? If so, why do people continue to support these same people? If I could provide links I could show you the list of Dem supporters that also believed there were WMD, a former president who made a speach declaring Iraq had WMD. This was also believed by numerous intelligence agencies across the globe, the UK being just 1, did Bush cook up some grand conspiracy and get these other countries on board with us and his war? Doubtful, it might just be that everyone actually thought he had WMD. Please provide the proof that the WH or the admin deliberatly manipulated the facts. If he lied as you say how come no court has proven this or even taken up the case? A Spanish judge just threw a war crimes case out. You have absolutely no proof the admin lied to go to war. That is a left ideology that has no legs to support it. If he knowingly lied about going to war, how come he isn't up on war crimes, or even members of his admin? Why isn't the new president going after the former admin? Since when has Arlen Spector been a conservative? Maybe a R but no conservative. He is really a poor example to use in this debate. The R party is dead rhetoric is hardly new, the D's were scrambling in \"00\" and \"04\". After Nixon everyone thought the R party was a thing of the past. I was one of those outraged at Bushes liberal spending policies, but does that make it OK for Obama to continue the trend? What will your excuse for Obama be if he spends us into a depression? You can only blame Bush for so long! All of these politicos were duped by Bush I guess? \"We begin with the common belief that Saddam Hussein is a tyrant and a threat to the peace and stability of the region. He has ignored the mandate of the United Nations and is building weapons of mass destruction and the means of delivering them.\" - Sen. Carl Levin (D, MI), September 19, 2002 \"We know that he has stored secret supplies of biological and chemical weapons throughout his country.\" - Al Gore, September 23, 2002 \"Iraq's search for weapons of mass destruction has proven impossible to deter and we should assume that it will continue for as long as Saddam is in power.\" - Al Gore, September 23, 2002 \"We have known for many years that Saddam Hussein is seeking and developing weapons of mass destruction.\" - Sen. Ted Kennedy (D, MA), September 27, 2002 \"The last UN weapons inspectors left Iraq in October of 1998. We are confident that Saddam Hussein retains some stockpiles of chemical and biological weapons, and that he has since embarked on a crash course to build up his chemical and biological warfare capabilities. Intelligence reports indicate that he is seeking nuclear weapons...\" - Sen. Robert Byrd (D, WV), October 3, 2002 \"I will be voting to give the President of the United States the authority to use force -- if necessary -- to disarm Saddam Hussein because I believe that a deadly arsenal of weapons of mass destruction in his hands is a real and grave threat to our security.\" - Sen. John F. Kerry (D, MA), October 9, 2002 \"There is unmistakable evidence that Saddam Hussein is working aggressively to develop nuclear weapons and will likely have nuclear weapons within the next five years ... We also should remember we have always underestimated the progress Saddam has made in development of weapons of mass destruction.\" - Sen. Jay Rockefeller (D, WV), October 10, 2002 \"In the four years since the inspectors left, intelligence reports show that Saddam Hussein has worked to rebuild his chemical and biological weapons stock, his missile delivery capability, and his nuclear program. He has also given aid, comfort, and sanctuary to terrorists, including al Qaeda members ... It is clear, however, that if left unchecked, Saddam Hussein will continue to increase his capacity to wage biological and chemical warfare, and will keep trying to develop nuclear weapons.\" - Sen. Hillary Clinton (D, NY), October 10, 2002 \"We are in possession of what I think to be compelling evidence that Saddam Hussein has, and has had for a number of years, a developing capacity for the production and storage of weapons of mass destruction.\" - Sen. Bob Graham (D, FL), December 8, 2002 \"Every day Saddam remains in power with chemical weapons, biological weapons, and the development of nuclear weapons is a day of danger for the United States.\" -Sen. Joseph Lieberman (D-CT) September 4, 2002 \"If we wait for the [Iraq] danger to become clear, it could be too late.\" -Sen. Joseph Biden (D-Del) September 4, 2002 \"Iraq both poses a continuing threat to the national security of the United States and international peace and security in the Persian Gulf region and remains in material and unacceptable breach of its international obligations by, among other things, continuing to possess and develop a significant chemical and biological weapons capability, actively seeking a nuclear weapons capability, and supporting and harboring terrorist organizations.\" -Sen. Hillary Clinton (D-NY) February 5, 2003 \"Without question, we need to disarm Saddam Hussein. He is a brutal, murderous dictator, leading an oppressive regime ... He presents a particularly grievous threat because he is so consistently prone to miscalculation ... And now he is miscalculating America's response to his continued deceit and his consistent grasp for weapons of mass destruction ... So the threat of Saddam Hussein with weapons of mass destruction is real...\" - Sen. John F. Kerry (D, MA), January 23. 2003 What about these quotes before Bush was even a thought? \"One way or the other, we are determined to deny Iraq the capacity to develop weapons of mass destruction and the missiles to deliver them. That is our bottom line.\" - President Bill Clinton, February 4, 1998 \"If Saddam rejects peace and we have to use force, our purpose is clear. We want to seriously diminish the threat posed by Iraq's weapons of mass destruction program.\" - President Bill Clinton, February 17, 1998 \"We must stop Saddam from ever again jeopardizing the stability and security of his neighbors with weapons of mass destruction.\" - Madeline Albright, February 1, 1998 \"He will use those weapons of mass destruction again, as he has ten times since 1983.\" - Sandy Berger, Clinton National Security Adviser, February 18, 1998 \"[W]e urge you, after consulting with Congress, and consistent with the U.S. Constitution and laws, to take necessary actions (including, if appropriate, air and missile strikes on suspect Iraqi sites) to respond effectively to the threat posed by Iraq's refusal to end its weapons of mass destruction programs.\" Letter to President Clinton. - (D) Senators Carl Levin, Tom Daschle, John Kerry, others, October 9, 1998 \"Saddam Hussein has been engaged in the development of weapons of mass destruction technology which is a threat to countries in the region and he has made a mockery of the weapons inspection process.\" - Rep. Nancy Pelosi (D, CA), December 16, 1998 \"Hussein has ... chosen to spend his money on building weapons of mass destruction and palaces for his cronies.\" - Madeline Albright, Clinton's Secretary of State, November 10, 1999",
        "intTime": 20090428,
        "postID": 14,
        "quote": "quote: Originally posted by ryerye13B: \"but decided somewhere along the line that it would be far more fun (if not oil-licious) to go for an uninvited visit into Iraq.\" Ah yes the lefts favorite tag-line, \"war for oil\", kinda like \"Bush let the Bin Ladens leave on Sept 11th, the only flight out.\" Let us not forget that all of our favorite Dems jumped on board for this excursion, funny how when the political winds changed those same Dems jumped ship. I wonder if people will still be singing the presidents praise when this country is so far in debt, because of his outta control spending, our great great grandchildren will be picking up the tab? Please spare me the \"Bush did it\" argument, I'm no Bush apologist or supporter so if you reply with this argument it falls on deaf ears! I am fully aware of what Bush did! And Yes he is making the same mistakes as Hoover and FDR! Carbon Tax anyone? Maybe another trillion to those who are mostly responsible for this mess will turn it around? Bill-Fold while your learning a few their history please include how we, as a country, recovered from the depression? I'll give ya a hint WWII. This recession is not worse than the Great Depression, at least not yet! Obama is just another politician. The Dems jumped aboard that excursion because they were carefully fed highly focused, bogus, biased, cooked, and otherwise highly suspect intelligence from sources the administration were warned to be pathologically dishonest by our allies intelligence agencies (and in a number of notable cases, our own CIA). No one has better access to intelligence than the White House, and they deliberately manipulated the facts to get congress to approve actions when they had already decided to go to war. Note that the political winds didn't change w/r/t Iraq until a number of events occurred: 1. The depth of outright incompetence that became the trademark of the Bush Administration became apparent. 2. The quantities of lies told by the administration to all that would listen to goad the nation into accepting war were realized. 3. Virtually none of the major reasons for going to war turned out to be true (note how many times the reasons changed). Were you one of the complainers when G W Bush couldn't find a spending bill too outrageous to veto for the first 6 years of his lamentable administration? I was!!! It took the democrats finally taking over the agenda (with too small of a majority to have any other power) to create a budget that he would veto. Now that 8 years of horrify incompetence have left our nation but a shell of what it used to be, now the republicans finally start complaining about the budget. Its too late for them. They have all but evaporated as a party and now resort to buffoonery when attempting to argue a point. As an example, look at the 18-page alternative budget they came up with: it is 99.999% content free for your protection, with nary a single digit referencing dollars throughout. At least they provide some comic relief... But even Arlen Spector has had enough: He is about to announce that he is resigning his republican affiliation to become a member of the democratic party. It is reported that the republican party has swung so far to the right that it is now the wrong party for him.",
        "reply": " Alright where to begin? So basically what your telling me is the the Dems are so incompetant they didn't question the admin? If so, why do people continue to support these same people? If I could provide links I could show you the list of Dem supporters that also believed there were WMD, a former president who made a speach declaring Iraq had WMD. This was also believed by numerous intelligence agencies across the globe, the UK being just 1, did Bush cook up some grand conspiracy and get these other countries on board with us and his war? Doubtful, it might just be that everyone actually thought he had WMD. Please provide the proof that the WH or the admin deliberatly manipulated the facts. If he lied as you say how come no court has proven this or even taken up the case? A Spanish judge just threw a war crimes case out. You have absolutely no proof the admin lied to go to war. That is a left ideology that has no legs to support it. If he knowingly lied about going to war, how come he isn't up on war crimes, or even members of his admin? Why isn't the new president going after the former admin? Since when has Arlen Spector been a conservative? Maybe a R but no conservative. He is really a poor example to use in this debate. The R party is dead rhetoric is hardly new, the D's were scrambling in \"00\" and \"04\". After Nixon everyone thought the R party was a thing of the past. I was one of those outraged at Bushes liberal spending policies, but does that make it OK for Obama to continue the trend? What will your excuse for Obama be if he spends us into a depression? You can only blame Bush for so long! All of these politicos were duped by Bush I guess? \"We begin with the common belief that Saddam Hussein is a tyrant and a threat to the peace and stability of the region. He has ignored the mandate of the United Nations and is building weapons of mass destruction and the means of delivering them.\" - Sen. Carl Levin (D, MI), September 19, 2002 \"We know that he has stored secret supplies of biological and chemical weapons throughout his country.\" - Al Gore, September 23, 2002 \"Iraq's search for weapons of mass destruction has proven impossible to deter and we should assume that it will continue for as long as Saddam is in power.\" - Al Gore, September 23, 2002 \"We have known for many years that Saddam Hussein is seeking and developing weapons of mass destruction.\" - Sen. Ted Kennedy (D, MA), September 27, 2002 \"The last UN weapons inspectors left Iraq in October of 1998. We are confident that Saddam Hussein retains some stockpiles of chemical and biological weapons, and that he has since embarked on a crash course to build up his chemical and biological warfare capabilities. Intelligence reports indicate that he is seeking nuclear weapons...\" - Sen. Robert Byrd (D, WV), October 3, 2002 \"I will be voting to give the President of the United States the authority to use force -- if necessary -- to disarm Saddam Hussein because I believe that a deadly arsenal of weapons of mass destruction in his hands is a real and grave threat to our security.\" - Sen. John F. Kerry (D, MA), October 9, 2002 \"There is unmistakable evidence that Saddam Hussein is working aggressively to develop nuclear weapons and will likely have nuclear weapons within the next five years ... We also should remember we have always underestimated the progress Saddam has made in development of weapons of mass destruction.\" - Sen. Jay Rockefeller (D, WV), October 10, 2002 \"In the four years since the inspectors left, intelligence reports show that Saddam Hussein has worked to rebuild his chemical and biological weapons stock, his missile delivery capability, and his nuclear program. He has also given aid, comfort, and sanctuary to terrorists, including al Qaeda members ... It is clear, however, that if left unchecked, Saddam Hussein will continue to increase his capacity to wage biological and chemical warfare, and will keep trying to develop nuclear weapons.\" - Sen. Hillary Clinton (D, NY), October 10, 2002 \"We are in possession of what I think to be compelling evidence that Saddam Hussein has, and has had for a number of years, a developing capacity for the production and storage of weapons of mass destruction.\" - Sen. Bob Graham (D, FL), December 8, 2002 \"Every day Saddam remains in power with chemical weapons, biological weapons, and the development of nuclear weapons is a day of danger for the United States.\" -Sen. Joseph Lieberman (D-CT) September 4, 2002 \"If we wait for the [Iraq] danger to become clear, it could be too late.\" -Sen. Joseph Biden (D-Del) September 4, 2002 \"Iraq both poses a continuing threat to the national security of the United States and international peace and security in the Persian Gulf region and remains in material and unacceptable breach of its international obligations by, among other things, continuing to possess and develop a significant chemical and biological weapons capability, actively seeking a nuclear weapons capability, and supporting and harboring terrorist organizations.\" -Sen. Hillary Clinton (D-NY) February 5, 2003 \"Without question, we need to disarm Saddam Hussein. He is a brutal, murderous dictator, leading an oppressive regime ... He presents a particularly grievous threat because he is so consistently prone to miscalculation ... And now he is miscalculating America's response to his continued deceit and his consistent grasp for weapons of mass destruction ... So the threat of Saddam Hussein with weapons of mass destruction is real...\" - Sen. John F. Kerry (D, MA), January 23. 2003 What about these quotes before Bush was even a thought? \"One way or the other, we are determined to deny Iraq the capacity to develop weapons of mass destruction and the missiles to deliver them. That is our bottom line.\" - President Bill Clinton, February 4, 1998 \"If Saddam rejects peace and we have to use force, our purpose is clear. We want to seriously diminish the threat posed by Iraq's weapons of mass destruction program.\" - President Bill Clinton, February 17, 1998 \"We must stop Saddam from ever again jeopardizing the stability and security of his neighbors with weapons of mass destruction.\" - Madeline Albright, February 1, 1998 \"He will use those weapons of mass destruction again, as he has ten times since 1983.\" - Sandy Berger, Clinton National Security Adviser, February 18, 1998 \"[W]e urge you, after consulting with Congress, and consistent with the U.S. Constitution and laws, to take necessary actions (including, if appropriate, air and missile strikes on suspect Iraqi sites) to respond effectively to the threat posed by Iraq's refusal to end its weapons of mass destruction programs.\" Letter to President Clinton. - (D) Senators Carl Levin, Tom Daschle, John Kerry, others, October 9, 1998 \"Saddam Hussein has been engaged in the development of weapons of mass destruction technology which is a threat to countries in the region and he has made a mockery of the weapons inspection process.\" - Rep. Nancy Pelosi (D, CA), December 16, 1998 \"Hussein has ... chosen to spend his money on building weapons of mass destruction and palaces for his cronies.\" - Madeline Albright, Clinton's Secretary of State, November 10, 1999",
        "threadID": "6960020520001_3260049122001",
        "time": "2009-04-28 16:01:00",
        "title": "A Mixed Record in the First 100 Days",
        "userID": "ryerye13B"
    },
    {
        "content": "The one big thing missing from all of these quotes is the reality called Mutually Assured Destruction (MAD). We have nut job countries right now that possess nuclear weapons, but are we invading them and going through all kinds of machinations to pump up the scare factor? By the same standard why didn't Bush invade NKorea. So take all of your wacky preemptive ideology that essentially held that \"Iraq was a threat\" so we HAD to take them out, and compare that with reality--which demolishes this neocon fantasy. It was all about oil, get over it case closed. PS Happy 100 days President Obama! Pres. Obama has higher ratings than Bush or Clinton did for their respective 100 day mark. Plus now Obama has the new Democrat Senator Specter. Ya just gotta love it! Will someone turn out the lights for the Republican Party?",
        "intTime": 20090428,
        "postID": 15,
        "quote": "",
        "reply": "The one big thing missing from all of these quotes is the reality called Mutually Assured Destruction (MAD). We have nut job countries right now that possess nuclear weapons, but are we invading them and going through all kinds of machinations to pump up the scare factor? By the same standard why didn't Bush invade NKorea. So take all of your wacky preemptive ideology that essentially held that \"Iraq was a threat\" so we HAD to take them out, and compare that with reality--which demolishes this neocon fantasy. It was all about oil, get over it case closed. PS Happy 100 days President Obama! Pres. Obama has higher ratings than Bush or Clinton did for their respective 100 day mark. Plus now Obama has the new Democrat Senator Specter. Ya just gotta love it! Will someone turn out the lights for the Republican Party?",
        "threadID": "6960020520001_3260049122001",
        "time": "2009-04-28 21:08:00",
        "title": "A Mixed Record in the First 100 Days",
        "userID": "rockriver04"
    },
    {
        "content": "Forget the ratings, the pre-911 mentality is in full force by this administration acting like we don't have enemies. Breaking news!! Due to the outbreak of friendliness, kissing our enemies behind is now a standard operating procedure. Pleeaaassssee!!!",
        "intTime": 20090428,
        "postID": 16,
        "quote": "",
        "reply": "Forget the ratings, the pre-911 mentality is in full force by this administration acting like we don't have enemies. Breaking news!! Due to the outbreak of friendliness, kissing our enemies behind is now a standard operating procedure. Pleeaaassssee!!!",
        "threadID": "6960020520001_3260049122001",
        "time": "2009-04-28 21:44:00",
        "title": "A Mixed Record in the First 100 Days",
        "userID": "LouieSuzara"
    },
    {
        "content": "quote: Plus now Obama has the new Democrat Senator Specter Great freaking news, finally he got the nerve to come out of the closet, what a political cross dresser he is. Good riddance flip flopper!!",
        "intTime": 20090428,
        "postID": 17,
        "quote": "Plus now Obama has the new Democrat Senator Specter",
        "reply": " Great freaking news, finally he got the nerve to come out of the closet, what a political cross dresser he is. Good riddance flip flopper!!",
        "threadID": "6960020520001_3260049122001",
        "time": "2009-04-28 21:51:00",
        "title": "A Mixed Record in the First 100 Days",
        "userID": "LouieSuzara"
    },
    {
        "content": "Straight from the mouth of an \"Air America\" listening Dem party hack, who can't form his own opinion! \"It was all about oil, get over it case closed.\" Prove it! Bet ya can't! Truth hurt? It's not my wacky preemptive ideology, these quotes came straight out the horses.......er........donkeys mouths! Wonder if your gonna be in lock-step mode with this pres when he spends us into REAL debt? Or if the unemployed numbers keep getting higher than what is forecasted? Maybe another trillion to those mostly responsible will turn this ship around!? LOL!! Higher inflation anyone? What happens when this guy kills the Dem party? Will we all wake up and relize the 2 party system is a joke and that the difference between the 2 are very small? I doubt it cuz we will still have our party shrills trying to push their failed ideology upon the masses and the ignorant and stupid will still buy into the BS!",
        "intTime": 20090429,
        "postID": 18,
        "quote": "",
        "reply": "Straight from the mouth of an \"Air America\" listening Dem party hack, who can't form his own opinion! \"It was all about oil, get over it case closed.\" Prove it! Bet ya can't! Truth hurt? It's not my wacky preemptive ideology, these quotes came straight out the horses.......er........donkeys mouths! Wonder if your gonna be in lock-step mode with this pres when he spends us into REAL debt? Or if the unemployed numbers keep getting higher than what is forecasted? Maybe another trillion to those mostly responsible will turn this ship around!? LOL!! Higher inflation anyone? What happens when this guy kills the Dem party? Will we all wake up and relize the 2 party system is a joke and that the difference between the 2 are very small? I doubt it cuz we will still have our party shrills trying to push their failed ideology upon the masses and the ignorant and stupid will still buy into the BS!",
        "threadID": "6960020520001_3260049122001",
        "time": "2009-04-29 07:19:00",
        "title": "A Mixed Record in the First 100 Days",
        "userID": "ryerye13B"
    },
    {
        "content": "quote: Originally posted by ryerye13B: quote: quote: Originally posted by ryerye13B: \"but decided somewhere along the line that it would be far more fun (if not oil-licious) to go for an uninvited visit into Iraq.\" Ah yes the lefts favorite tag-line, \"war for oil\", kinda like \"Bush let the Bin Ladens leave on Sept 11th, the only flight out.\" Let us not forget that all of our favorite Dems jumped on board for this excursion, funny how when the political winds changed those same Dems jumped ship. I wonder if people will still be singing the presidents praise when this country is so far in debt, because of his outta control spending, our great great grandchildren will be picking up the tab? Please spare me the \"Bush did it\" argument, I'm no Bush apologist or supporter so if you reply with this argument it falls on deaf ears! I am fully aware of what Bush did! And Yes he is making the same mistakes as Hoover and FDR! Carbon Tax anyone? Maybe another trillion to those who are mostly responsible for this mess will turn it around? Bill-Fold while your learning a few their history please include how we, as a country, recovered from the depression? I'll give ya a hint WWII. This recession is not worse than the Great Depression, at least not yet! Obama is just another politician. The Dems jumped aboard that excursion because they were carefully fed highly focused, bogus, biased, cooked, and otherwise highly suspect intelligence from sources the administration were warned to be pathologically dishonest by our allies intelligence agencies (and in a number of notable cases, our own CIA). No one has better access to intelligence than the White House, and they deliberately manipulated the facts to get congress to approve actions when they had already decided to go to war. Note that the political winds didn't change w/r/t Iraq until a number of events occurred: 1. The depth of outright incompetence that became the trademark of the Bush Administration became apparent. 2. The quantities of lies told by the administration to all that would listen to goad the nation into accepting war were realized. 3. Virtually none of the major reasons for going to war turned out to be true (note how many times the reasons changed). Were you one of the complainers when G W Bush couldn't find a spending bill too outrageous to veto for the first 6 years of his lamentable administration? I was!!! It took the democrats finally taking over the agenda (with too small of a majority to have any other power) to create a budget that he would veto. Now that 8 years of horrify incompetence have left our nation but a shell of what it used to be, now the republicans finally start complaining about the budget. Its too late for them. They have all but evaporated as a party and now resort to buffoonery when attempting to argue a point. As an example, look at the 18-page alternative budget they came up with: it is 99.999% content free for your protection, with nary a single digit referencing dollars throughout. At least they provide some comic relief... But even Arlen Spector has had enough: He is about to announce that he is resigning his republican affiliation to become a member of the democratic party. It is reported that the republican party has swung so far to the right that it is now the wrong party for him. Alright where to begin? So basically what your telling me is the the Dems are so incompetant they didn't question the admin? If so, why do people continue to support these same people? If I could provide links I could show you the list of Dem supporters that also believed there were WMD, a former president who made a speach declaring Iraq had WMD. This was also believed by numerous intelligence agencies across the globe, the UK being just 1, did Bush cook up some grand conspiracy and get these other countries on board with us and his war? Doubtful, it might just be that everyone actually thought he had WMD. Please provide the proof that the WH or the admin deliberatly manipulated the facts. If he lied as you say how come no court has proven this or even taken up the case? A Spanish judge just threw a war crimes case out. You have absolutely no proof the admin lied to go to war. That is a left ideology that has no legs to support it. If he knowingly lied about going to war, how come he isn't up on war crimes, or even members of his admin? Why isn't the new president going after the former admin? Since when has Arlen Spector been a conservative? Maybe a R but no conservative. He is really a poor example to use in this debate. The R party is dead rhetoric is hardly new, the D's were scrambling in \"00\" and \"04\". After Nixon everyone thought the R party was a thing of the past. I was one of those outraged at Bushes liberal spending policies, but does that make it OK for Obama to continue the trend? What will your excuse for Obama be if he spends us into a depression? You can only blame Bush for so long! All of these politicos were duped by Bush I guess? \"We begin with the common belief that Saddam Hussein is a tyrant and a threat to the peace and stability of the region. He has ignored the mandate of the United Nations and is building weapons of mass destruction and the means of delivering them.\" - Sen. Carl Levin (D, MI), September 19, 2002 \"We know that he has stored secret supplies of biological and chemical weapons throughout his country.\" - Al Gore, September 23, 2002 \"Iraq's search for weapons of mass destruction has proven impossible to deter and we should assume that it will continue for as long as Saddam is in power.\" - Al Gore, September 23, 2002 \"We have known for many years that Saddam Hussein is seeking and developing weapons of mass destruction.\" - Sen. Ted Kennedy (D, MA), September 27, 2002 \"The last UN weapons inspectors left Iraq in October of 1998. We are confident that Saddam Hussein retains some stockpiles of chemical and biological weapons, and that he has since embarked on a crash course to build up his chemical and biological warfare capabilities. Intelligence reports indicate that he is seeking nuclear weapons...\" - Sen. Robert Byrd (D, WV), October 3, 2002 \"I will be voting to give the President of the United States the authority to use force -- if necessary -- to disarm Saddam Hussein because I believe that a deadly arsenal of weapons of mass destruction in his hands is a real and grave threat to our security.\" - Sen. John F. Kerry (D, MA), October 9, 2002 \"There is unmistakable evidence that Saddam Hussein is working aggressively to develop nuclear weapons and will likely have nuclear weapons within the next five years ... We also should remember we have always underestimated the progress Saddam has made in development of weapons of mass destruction.\" - Sen. Jay Rockefeller (D, WV), October 10, 2002 \"In the four years since the inspectors left, intelligence reports show that Saddam Hussein has worked to rebuild his chemical and biological weapons stock, his missile delivery capability, and his nuclear program. He has also given aid, comfort, and sanctuary to terrorists, including al Qaeda members ... It is clear, however, that if left unchecked, Saddam Hussein will continue to increase his capacity to wage biological and chemical warfare, and will keep trying to develop nuclear weapons.\" - Sen. Hillary Clinton (D, NY), October 10, 2002 \"We are in possession of what I think to be compelling evidence that Saddam Hussein has, and has had for a number of years, a developing capacity for the production and storage of weapons of mass destruction.\" - Sen. Bob Graham (D, FL), December 8, 2002 \"Every day Saddam remains in power with chemical weapons, biological weapons, and the development of nuclear weapons is a day of danger for the United States.\" -Sen. Joseph Lieberman (D-CT) September 4, 2002 \"If we wait for the [Iraq] danger to become clear, it could be too late.\" -Sen. Joseph Biden (D-Del) September 4, 2002 \"Iraq both poses a continuing threat to the national security of the United States and international peace and security in the Persian Gulf region and remains in material and unacceptable breach of its international obligations by, among other things, continuing to possess and develop a significant chemical and biological weapons capability, actively seeking a nuclear weapons capability, and supporting and harboring terrorist organizations.\" -Sen. Hillary Clinton (D-NY) February 5, 2003 \"Without question, we need to disarm Saddam Hussein. He is a brutal, murderous dictator, leading an oppressive regime ... He presents a particularly grievous threat because he is so consistently prone to miscalculation ... And now he is miscalculating America's response to his continued deceit and his consistent grasp for weapons of mass destruction ... So the threat of Saddam Hussein with weapons of mass destruction is real...\" - Sen. John F. Kerry (D, MA), January 23. 2003 What about these quotes before Bush was even a thought? \"One way or the other, we are determined to deny Iraq the capacity to develop weapons of mass destruction and the missiles to deliver them. That is our bottom line.\" - President Bill Clinton, February 4, 1998 \"If Saddam rejects peace and we have to use force, our purpose is clear. We want to seriously diminish the threat posed by Iraq's weapons of mass destruction program.\" - President Bill Clinton, February 17, 1998 \"We must stop Saddam from ever again jeopardizing the stability and security of his neighbors with weapons of mass destruction.\" - Madeline Albright, February 1, 1998 \"He will use those weapons of mass destruction again, as he has ten times since 1983.\" - Sandy Berger, Clinton National Security Adviser, February 18, 1998 \"[W]e urge you, after consulting with Congress, and consistent with the U.S. Constitution and laws, to take necessary actions (including, if appropriate, air and missile strikes on suspect Iraqi sites) to respond effectively to the threat posed by Iraq's refusal to end its weapons of mass destruction programs.\" Letter to President Clinton. - (D) Senators Carl Levin, Tom Daschle, John Kerry, others, October 9, 1998 \"Saddam Hussein has been engaged in the development of weapons of mass destruction technology which is a threat to countries in the region and he has made a mockery of the weapons inspection process.\" - Rep. Nancy Pelosi (D, CA), December 16, 1998 \"Hussein has ... chosen to spend his money on building weapons of mass destruction and palaces for his cronies.\" - Madeline Albright, Clinton's Secretary of State, November 10, 1999 Excellent article. The left doesn't like to admit that they thought just like most Americans that Saddam had WMD and are ashamed to admit it. Everybody knows that Saddam didn't care about any UN laws or his people. He did what ever he wanted and that is just a fact of life.",
        "intTime": 20090429,
        "postID": 19,
        "quote": "Originally posted by ryerye13B: quote: quote: Originally posted by ryerye13B: \"but decided somewhere along the line that it would be far more fun (if not oil-licious) to go for an uninvited visit into Iraq.\" Ah yes the lefts favorite tag-line, \"war for oil\", kinda like \"Bush let the Bin Ladens leave on Sept 11th, the only flight out.\" Let us not forget that all of our favorite Dems jumped on board for this excursion, funny how when the political winds changed those same Dems jumped ship. I wonder if people will still be singing the presidents praise when this country is so far in debt, because of his outta control spending, our great great grandchildren will be picking up the tab? Please spare me the \"Bush did it\" argument, I'm no Bush apologist or supporter so if you reply with this argument it falls on deaf ears! I am fully aware of what Bush did! And Yes he is making the same mistakes as Hoover and FDR! Carbon Tax anyone? Maybe another trillion to those who are mostly responsible for this mess will turn it around? Bill-Fold while your learning a few their history please include how we, as a country, recovered from the depression? I'll give ya a hint WWII. This recession is not worse than the Great Depression, at least not yet! Obama is just another politician. The Dems jumped aboard that excursion because they were carefully fed highly focused, bogus, biased, cooked, and otherwise highly suspect intelligence from sources the administration were warned to be pathologically dishonest by our allies intelligence agencies (and in a number of notable cases, our own CIA). No one has better access to intelligence than the White House, and they deliberately manipulated the facts to get congress to approve actions when they had already decided to go to war. Note that the political winds didn't change w/r/t Iraq until a number of events occurred: 1. The depth of outright incompetence that became the trademark of the Bush Administration became apparent. 2. The quantities of lies told by the administration to all that would listen to goad the nation into accepting war were realized. 3. Virtually none of the major reasons for going to war turned out to be true (note how many times the reasons changed). Were you one of the complainers when G W Bush couldn't find a spending bill too outrageous to veto for the first 6 years of his lamentable administration? I was!!! It took the democrats finally taking over the agenda (with too small of a majority to have any other power) to create a budget that he would veto. Now that 8 years of horrify incompetence have left our nation but a shell of what it used to be, now the republicans finally start complaining about the budget. Its too late for them. They have all but evaporated as a party and now resort to buffoonery when attempting to argue a point. As an example, look at the 18-page alternative budget they came up with: it is 99.999% content free for your protection, with nary a single digit referencing dollars throughout. At least they provide some comic relief... But even Arlen Spector has had enough: He is about to announce that he is resigning his republican affiliation to become a member of the democratic party. It is reported that the republican party has swung so far to the right that it is now the wrong party for him. Alright where to begin? So basically what your telling me is the the Dems are so incompetant they didn't question the admin? If so, why do people continue to support these same people? If I could provide links I could show you the list of Dem supporters that also believed there were WMD, a former president who made a speach declaring Iraq had WMD. This was also believed by numerous intelligence agencies across the globe, the UK being just 1, did Bush cook up some grand conspiracy and get these other countries on board with us and his war? Doubtful, it might just be that everyone actually thought he had WMD. Please provide the proof that the WH or the admin deliberatly manipulated the facts. If he lied as you say how come no court has proven this or even taken up the case? A Spanish judge just threw a war crimes case out. You have absolutely no proof the admin lied to go to war. That is a left ideology that has no legs to support it. If he knowingly lied about going to war, how come he isn't up on war crimes, or even members of his admin? Why isn't the new president going after the former admin? Since when has Arlen Spector been a conservative? Maybe a R but no conservative. He is really a poor example to use in this debate. The R party is dead rhetoric is hardly new, the D's were scrambling in \"00\" and \"04\". After Nixon everyone thought the R party was a thing of the past. I was one of those outraged at Bushes liberal spending policies, but does that make it OK for Obama to continue the trend? What will your excuse for Obama be if he spends us into a depression? You can only blame Bush for so long! All of these politicos were duped by Bush I guess? \"We begin with the common belief that Saddam Hussein is a tyrant and a threat to the peace and stability of the region. He has ignored the mandate of the United Nations and is building weapons of mass destruction and the means of delivering them.\" - Sen. Carl Levin (D, MI), September 19, 2002 \"We know that he has stored secret supplies of biological and chemical weapons throughout his country.\" - Al Gore, September 23, 2002 \"Iraq's search for weapons of mass destruction has proven impossible to deter and we should assume that it will continue for as long as Saddam is in power.\" - Al Gore, September 23, 2002 \"We have known for many years that Saddam Hussein is seeking and developing weapons of mass destruction.\" - Sen. Ted Kennedy (D, MA), September 27, 2002 \"The last UN weapons inspectors left Iraq in October of 1998. We are confident that Saddam Hussein retains some stockpiles of chemical and biological weapons, and that he has since embarked on a crash course to build up his chemical and biological warfare capabilities. Intelligence reports indicate that he is seeking nuclear weapons...\" - Sen. Robert Byrd (D, WV), October 3, 2002 \"I will be voting to give the President of the United States the authority to use force -- if necessary -- to disarm Saddam Hussein because I believe that a deadly arsenal of weapons of mass destruction in his hands is a real and grave threat to our security.\" - Sen. John F. Kerry (D, MA), October 9, 2002 \"There is unmistakable evidence that Saddam Hussein is working aggressively to develop nuclear weapons and will likely have nuclear weapons within the next five years ... We also should remember we have always underestimated the progress Saddam has made in development of weapons of mass destruction.\" - Sen. Jay Rockefeller (D, WV), October 10, 2002 \"In the four years since the inspectors left, intelligence reports show that Saddam Hussein has worked to rebuild his chemical and biological weapons stock, his missile delivery capability, and his nuclear program. He has also given aid, comfort, and sanctuary to terrorists, including al Qaeda members ... It is clear, however, that if left unchecked, Saddam Hussein will continue to increase his capacity to wage biological and chemical warfare, and will keep trying to develop nuclear weapons.\" - Sen. Hillary Clinton (D, NY), October 10, 2002 \"We are in possession of what I think to be compelling evidence that Saddam Hussein has, and has had for a number of years, a developing capacity for the production and storage of weapons of mass destruction.\" - Sen. Bob Graham (D, FL), December 8, 2002 \"Every day Saddam remains in power with chemical weapons, biological weapons, and the development of nuclear weapons is a day of danger for the United States.\" -Sen. Joseph Lieberman (D-CT) September 4, 2002 \"If we wait for the [Iraq] danger to become clear, it could be too late.\" -Sen. Joseph Biden (D-Del) September 4, 2002 \"Iraq both poses a continuing threat to the national security of the United States and international peace and security in the Persian Gulf region and remains in material and unacceptable breach of its international obligations by, among other things, continuing to possess and develop a significant chemical and biological weapons capability, actively seeking a nuclear weapons capability, and supporting and harboring terrorist organizations.\" -Sen. Hillary Clinton (D-NY) February 5, 2003 \"Without question, we need to disarm Saddam Hussein. He is a brutal, murderous dictator, leading an oppressive regime ... He presents a particularly grievous threat because he is so consistently prone to miscalculation ... And now he is miscalculating America's response to his continued deceit and his consistent grasp for weapons of mass destruction ... So the threat of Saddam Hussein with weapons of mass destruction is real...\" - Sen. John F. Kerry (D, MA), January 23. 2003 What about these quotes before Bush was even a thought? \"One way or the other, we are determined to deny Iraq the capacity to develop weapons of mass destruction and the missiles to deliver them. That is our bottom line.\" - President Bill Clinton, February 4, 1998 \"If Saddam rejects peace and we have to use force, our purpose is clear. We want to seriously diminish the threat posed by Iraq's weapons of mass destruction program.\" - President Bill Clinton, February 17, 1998 \"We must stop Saddam from ever again jeopardizing the stability and security of his neighbors with weapons of mass destruction.\" - Madeline Albright, February 1, 1998 \"He will use those weapons of mass destruction again, as he has ten times since 1983.\" - Sandy Berger, Clinton National Security Adviser, February 18, 1998 \"[W]e urge you, after consulting with Congress, and consistent with the U.S. Constitution and laws, to take necessary actions (including, if appropriate, air and missile strikes on suspect Iraqi sites) to respond effectively to the threat posed by Iraq's refusal to end its weapons of mass destruction programs.\" Letter to President Clinton. - (D) Senators Carl Levin, Tom Daschle, John Kerry, others, October 9, 1998 \"Saddam Hussein has been engaged in the development of weapons of mass destruction technology which is a threat to countries in the region and he has made a mockery of the weapons inspection process.\" - Rep. Nancy Pelosi (D, CA), December 16, 1998 \"Hussein has ... chosen to spend his money on building weapons of mass destruction and palaces for his cronies.\" - Madeline Albright, Clinton's Secretary of State, November 10, 1999",
        "reply": " Excellent article. The left doesn't like to admit that they thought just like most Americans that Saddam had WMD and are ashamed to admit it. Everybody knows that Saddam didn't care about any UN laws or his people. He did what ever he wanted and that is just a fact of life.",
        "threadID": "6960020520001_3260049122001",
        "time": "2009-04-29 07:45:00",
        "title": "A Mixed Record in the First 100 Days",
        "userID": "3529237"
    },
    {
        "content": "quote: Originally posted by LouieSuzara: quote: Plus now Obama has the new Democrat Senator Specter Great freaking news, finally he got the nerve to come out of the closet, what a political cross dresser he is. Good riddance flip flopper!! I agree.",
        "intTime": 20090429,
        "postID": 20,
        "quote": "Originally posted by LouieSuzara: quote: Plus now Obama has the new Democrat Senator Specter Great freaking news, finally he got the nerve to come out of the closet, what a political cross dresser he is. Good riddance flip flopper!!",
        "reply": " I agree.",
        "threadID": "6960020520001_3260049122001",
        "time": "2009-04-29 07:56:00",
        "title": "A Mixed Record in the First 100 Days",
        "userID": "3529237"
    },
    {
        "content": "RE: http://www.military.com/opinion/0,15202,189954,00.html Very, Very mixed.",
        "intTime": 20090427,
        "postID": 21,
        "quote": "",
        "reply": "RE: http://www.military.com/opinion/0,15202,189954,00.html Very, Very mixed.",
        "threadID": "6960020520001_3260049122001",
        "time": "2009-04-27 21:20:00",
        "title": "A Mixed Record in the First 100 Days",
        "userID": "21246220"
    },
    {
        "content": "Ho hum. Remember when we were warned that Obama was completely out of his depth, clueless, unqualified? President Obama has done a great job. He is engaged, he asks for opposing opinions, he thinks deeply and acts wiesly. He has acted on many occasions with great decisiveness. He has taken responsibility for his actions. In short, he has been everything the previous president was not. Walt",
        "intTime": 20090428,
        "postID": 22,
        "quote": "",
        "reply": "Ho hum. Remember when we were warned that Obama was completely out of his depth, clueless, unqualified? President Obama has done a great job. He is engaged, he asks for opposing opinions, he thinks deeply and acts wiesly. He has acted on many occasions with great decisiveness. He has taken responsibility for his actions. In short, he has been everything the previous president was not. Walt",
        "threadID": "6960020520001_3260049122001",
        "time": "2009-04-28 04:59:00",
        "title": "A Mixed Record in the First 100 Days",
        "userID": "WhiskeyPapa"
    },
    {
        "content": "Very, Very subjective, and missing facts to back up the claims. quote: Both Hoover and FDR tried to artificially pump up the economy by increasing credit, aiding banks, and increasing federal expenditures, including spending on futile \"make-work\" public works programs—all of which required the economy to fall farther back toward equilibrium, thus turning a mundane recession into the Great Depression. We all know (or should know) that FDR was trying to prop up the economy and cheer people's spirits at the same time in what was (until now) the worst economic mess in our history... and that is fact. That the writer claims Hoover did ANYTHING to prop up the economy is a complete Fallacy. Hoover did NOTHING to prop up the economy, and THAT is why it continued to tank and reach for an ever lower economic bottom(which happened in 1932-33), UNTIL FDR took office, and even then it took 4 YEARS to get most people back to work, and another 5 for the Depression to finally end. This President may not be FDR, and he is certainly no Hoover. What he is is a dynamic, honest and intellectually superb President who has demonstrated that he knows what he is doing and isn't afraid to tackle any of our problems and look for solutions. Thankfully and finally we have such a person in the White House.",
        "intTime": 20090428,
        "postID": 23,
        "quote": "Both Hoover and FDR tried to artificially pump up the economy by increasing credit, aiding banks, and increasing federal expenditures, including spending on futile \"make-work\" public works programs—all of which required the economy to fall farther back toward equilibrium, thus turning a mundane recession into the Great Depression.",
        "reply": "Very, Very subjective, and missing facts to back up the claims.  We all know (or should know) that FDR was trying to prop up the economy and cheer people's spirits at the same time in what was (until now) the worst economic mess in our history... and that is fact. That the writer claims Hoover did ANYTHING to prop up the economy is a complete Fallacy. Hoover did NOTHING to prop up the economy, and THAT is why it continued to tank and reach for an ever lower economic bottom(which happened in 1932-33), UNTIL FDR took office, and even then it took 4 YEARS to get most people back to work, and another 5 for the Depression to finally end. This President may not be FDR, and he is certainly no Hoover. What he is is a dynamic, honest and intellectually superb President who has demonstrated that he knows what he is doing and isn't afraid to tackle any of our problems and look for solutions. Thankfully and finally we have such a person in the White House.",
        "threadID": "6960020520001_3260049122001",
        "time": "2009-04-28 05:04:00",
        "title": "A Mixed Record in the First 100 Days",
        "userID": "Bill_Fold"
    },
    {
        "content": "quote: Originally posted by Bill_Fold: This President may not be FDR, and he is certainly no Hoover. What he is is a dynamic, honest and intellectually superb President who has demonstrated that he knows what he is doing and isn't afraid to tackle any of pour problems, and look for solutions. Thankfully and finally we have such a person in the White House. Bears repeating. Walt",
        "intTime": 20090428,
        "postID": 24,
        "quote": "Originally posted by Bill_Fold: This President may not be FDR, and he is certainly no Hoover. What he is is a dynamic, honest and intellectually superb President who has demonstrated that he knows what he is doing and isn't afraid to tackle any of pour problems, and look for solutions. Thankfully and finally we have such a person in the White House.",
        "reply": " Bears repeating. Walt",
        "threadID": "6960020520001_3260049122001",
        "time": "2009-04-28 05:09:00",
        "title": "A Mixed Record in the First 100 Days",
        "userID": "WhiskeyPapa"
    },
    {
        "content": "Thank You, Walt. Ditto.",
        "intTime": 20090428,
        "postID": 25,
        "quote": "",
        "reply": "Thank You, Walt. Ditto.",
        "threadID": "6960020520001_3260049122001",
        "time": "2009-04-28 05:11:00",
        "title": "A Mixed Record in the First 100 Days",
        "userID": "Bill_Fold"
    },
    {
        "content": "As much as I might grade Obama differently on these matters, Mr. Eland gets an \"A\" for writing a thought provoking op-ed. I contrast this with the purely propagandistic op-ed of his fellow op-ed writer, O. North. I solidly agree with Mr. Eland's overall premise, that the 100-day report card is grossly overrated, oversold, and overdone. Reasoned criticism makes for good democracy.",
        "intTime": 20090428,
        "postID": 26,
        "quote": "",
        "reply": "As much as I might grade Obama differently on these matters, Mr. Eland gets an \"A\" for writing a thought provoking op-ed. I contrast this with the purely propagandistic op-ed of his fellow op-ed writer, O. North. I solidly agree with Mr. Eland's overall premise, that the 100-day report card is grossly overrated, oversold, and overdone. Reasoned criticism makes for good democracy.",
        "threadID": "6960020520001_3260049122001",
        "time": "2009-04-28 06:58:00",
        "title": "A Mixed Record in the First 100 Days",
        "userID": "bwf27"
    },
    {
        "content": "How dare this author critique the \"chosen one\" in any negative manner!",
        "intTime": 20090428,
        "postID": 27,
        "quote": "",
        "reply": "How dare this author critique the \"chosen one\" in any negative manner!",
        "threadID": "6960020520001_3260049122001",
        "time": "2009-04-28 07:00:00",
        "title": "A Mixed Record in the First 100 Days",
        "userID": "ryerye13B"
    },
    {
        "content": "quote: Unlike the younger Bush, Obama gets a \"B\" for realizing that popular opinion in Arab and Muslim countries does matter to U.S. security and attempting to raise U.S. standing in those nations by ending U.S. torture and closing Guantanamo and CIA secret prisons. Unfortunately, he doesn't seem to realize that the main cause of radical Islamists being converted to militant Islamist terrorists and guerrillas is the non-Muslim occupation of Muslim lands. If he did, he would realize that the U.S. occupation of Afghanistan has worsened terrorism by creating a resurgent Taliban (and allied groups) in both Afghanistan and Pakistan. In the case with Afghanistan, when the US first went in it was with the support of the Afghani people. They didn't like the Taliban either and were tired of being constantly in some kind of state of war (civil or otherwise). And, President Bush told the Afghani people that we were going to help them, but decided somewhere along the line that it would be far more fun (if not oil-licious) to go for an uninvited visit into Iraq. But years have gone by since we went into Afghanistan and the US became hopelessly distracted in Iraq, and little was done. The Afghani people have been waiting for a long time and have since grown impatient. The areas that the Taliban were chased out of didn't have sufficient troops, police, etc, to keep the criminals away so the country side became increasingly unstable. The Taliban, for all its problems, at least provided more security than the current Afghani government and US forces did. The evidence of our helping the people largely didn't materialize outside of Kabul: hence the problems we are now facing (i.e. the opportunity may have already vanished before the new guy even got started). That said, President Obama seems to be a very smart, pragmatic man. I am relieved that we have a president that understands that doing business with other cultures requires methods other than those used in the US. As an added bonus, rather than constantly denying mistakes no matter how obvious, he seems to have the courage to make corrections. Refreshing indeed...",
        "intTime": 20090428,
        "postID": 28,
        "quote": "Unlike the younger Bush, Obama gets a \"B\" for realizing that popular opinion in Arab and Muslim countries does matter to U.S. security and attempting to raise U.S. standing in those nations by ending U.S. torture and closing Guantanamo and CIA secret prisons. Unfortunately, he doesn't seem to realize that the main cause of radical Islamists being converted to militant Islamist terrorists and guerrillas is the non-Muslim occupation of Muslim lands. If he did, he would realize that the U.S. occupation of Afghanistan has worsened terrorism by creating a resurgent Taliban (and allied groups) in both Afghanistan and Pakistan.",
        "reply": " In the case with Afghanistan, when the US first went in it was with the support of the Afghani people. They didn't like the Taliban either and were tired of being constantly in some kind of state of war (civil or otherwise). And, President Bush told the Afghani people that we were going to help them, but decided somewhere along the line that it would be far more fun (if not oil-licious) to go for an uninvited visit into Iraq. But years have gone by since we went into Afghanistan and the US became hopelessly distracted in Iraq, and little was done. The Afghani people have been waiting for a long time and have since grown impatient. The areas that the Taliban were chased out of didn't have sufficient troops, police, etc, to keep the criminals away so the country side became increasingly unstable. The Taliban, for all its problems, at least provided more security than the current Afghani government and US forces did. The evidence of our helping the people largely didn't materialize outside of Kabul: hence the problems we are now facing (i.e. the opportunity may have already vanished before the new guy even got started). That said, President Obama seems to be a very smart, pragmatic man. I am relieved that we have a president that understands that doing business with other cultures requires methods other than those used in the US. As an added bonus, rather than constantly denying mistakes no matter how obvious, he seems to have the courage to make corrections. Refreshing indeed...",
        "threadID": "6960020520001_3260049122001",
        "time": "2009-04-28 07:47:00",
        "title": "A Mixed Record in the First 100 Days",
        "userID": "PolicyWonk"
    },
    {
        "content": "quote: Originally posted by Bill_Fold: Very, Very subjective, and missing facts to back up the claims. quote: Both Hoover and FDR tried to artificially pump up the economy by increasing credit, aiding banks, and increasing federal expenditures, including spending on futile \"make-work\" public works programs—all of which required the economy to fall farther back toward equilibrium, thus turning a mundane recession into the Great Depression. We all know (or should know) that FDR was trying to prop up the economy and cheer people's spirits at the same time in what was (until now) the worst economic mess in our history... and that is fact. That the writer claims Hoover did ANYTHING to prop up the economy is a complete Fallacy. Hoover did NOTHING to prop up the economy, and THAT is why it continued to tank and reach for an ever lower economic bottom(which happened in 1932-33), UNTIL FDR took office, and even then it took 4 YEARS to get most people back to work, and another 5 for the Depression to finally end. This President may not be FDR, and he is certainly no Hoover. What he is is a dynamic, honest and intellectually superb President who has demonstrated that he knows what he is doing and isn't afraid to tackle any of our problems and look for solutions. Thankfully and finally we have such a person in the White House. I'd like to add to this that our financial systems are very different now compared to the 1920's & 1930's FDR and Hoover administrations. Cheers.",
        "intTime": 20090428,
        "postID": 29,
        "quote": "Originally posted by Bill_Fold: Very, Very subjective, and missing facts to back up the claims. quote: Both Hoover and FDR tried to artificially pump up the economy by increasing credit, aiding banks, and increasing federal expenditures, including spending on futile \"make-work\" public works programs—all of which required the economy to fall farther back toward equilibrium, thus turning a mundane recession into the Great Depression. We all know (or should know) that FDR was trying to prop up the economy and cheer people's spirits at the same time in what was (until now) the worst economic mess in our history... and that is fact. That the writer claims Hoover did ANYTHING to prop up the economy is a complete Fallacy. Hoover did NOTHING to prop up the economy, and THAT is why it continued to tank and reach for an ever lower economic bottom(which happened in 1932-33), UNTIL FDR took office, and even then it took 4 YEARS to get most people back to work, and another 5 for the Depression to finally end. This President may not be FDR, and he is certainly no Hoover. What he is is a dynamic, honest and intellectually superb President who has demonstrated that he knows what he is doing and isn't afraid to tackle any of our problems and look for solutions. Thankfully and finally we have such a person in the White House.",
        "reply": " I'd like to add to this that our financial systems are very different now compared to the 1920's & 1930's FDR and Hoover administrations. Cheers.",
        "threadID": "6960020520001_3260049122001",
        "time": "2009-04-28 07:52:00",
        "title": "A Mixed Record in the First 100 Days",
        "userID": "PolicyWonk"
    },
    {
        "content": "\"but decided somewhere along the line that it would be far more fun (if not oil-licious) to go for an uninvited visit into Iraq.\" Ah yes the lefts favorite tag-line, \"war for oil\", kinda like \"Bush let the Bin Ladens leave on Sept 11th, the only flight out.\" Let us not forget that all of our favorite Dems jumped on board for this excursion, funny how when the political winds changed those same Dems jumped ship. I wonder if people will still be singing the presidents praise when this country is so far in debt, because of his outta control spending, our great great grandchildren will be picking up the tab? Please spare me the \"Bush did it\" argument, I'm no Bush apologist or supporter so if you reply with this argument it falls on deaf ears! I am fully aware of what Bush did! And Yes he is making the same mistakes as Hoover and FDR! Carbon Tax anyone? Maybe another trillion to those who are mostly responsible for this mess will turn it around? Bill-Fold while your learning a few their history please include how we, as a country, recovered from the depression? I'll give ya a hint WWII. This recession is not worse than the Great Depression, at least not yet! Obama is just another politician.",
        "intTime": 20090428,
        "postID": 30,
        "quote": "",
        "reply": "\"but decided somewhere along the line that it would be far more fun (if not oil-licious) to go for an uninvited visit into Iraq.\" Ah yes the lefts favorite tag-line, \"war for oil\", kinda like \"Bush let the Bin Ladens leave on Sept 11th, the only flight out.\" Let us not forget that all of our favorite Dems jumped on board for this excursion, funny how when the political winds changed those same Dems jumped ship. I wonder if people will still be singing the presidents praise when this country is so far in debt, because of his outta control spending, our great great grandchildren will be picking up the tab? Please spare me the \"Bush did it\" argument, I'm no Bush apologist or supporter so if you reply with this argument it falls on deaf ears! I am fully aware of what Bush did! And Yes he is making the same mistakes as Hoover and FDR! Carbon Tax anyone? Maybe another trillion to those who are mostly responsible for this mess will turn it around? Bill-Fold while your learning a few their history please include how we, as a country, recovered from the depression? I'll give ya a hint WWII. This recession is not worse than the Great Depression, at least not yet! Obama is just another politician.",
        "threadID": "6960020520001_3260049122001",
        "time": "2009-04-28 08:16:00",
        "title": "A Mixed Record in the First 100 Days",
        "userID": "ryerye13B"
    },
    {
        "content": "quote: Originally posted by ryerye13B: \"but decided somewhere along the line that it would be far more fun (if not oil-licious) to go for an uninvited visit into Iraq.\" Ah yes the lefts favorite tag-line, \"war for oil\", kinda like \"Bush let the Bin Ladens leave on Sept 11th, the only flight out.\" Let us not forget that all of our favorite Dems jumped on board for this excursion, funny how when the political winds changed those same Dems jumped ship. I wonder if people will still be singing the presidents praise when this country is so far in debt, because of his outta control spending, our great great grandchildren will be picking up the tab? Please spare me the \"Bush did it\" argument, I'm no Bush apologist or supporter so if you reply with this argument it falls on deaf ears! I am fully aware of what Bush did! And Yes he is making the same mistakes as Hoover and FDR! Carbon Tax anyone? Maybe another trillion to those who are mostly responsible for this mess will turn it around? Bill-Fold while your learning a few their history please include how we, as a country, recovered from the depression? I'll give ya a hint WWII. This recession is not worse than the Great Depression, at least not yet! Obama is just another politician. The Dems jumped aboard that excursion because they were carefully fed highly focused, bogus, biased, cooked, and otherwise highly suspect intelligence from sources the administration were warned to be pathologically dishonest by our allies intelligence agencies (and in a number of notable cases, our own CIA). No one has better access to intelligence than the White House, and they deliberately manipulated the facts to get congress to approve actions when they had already decided to go to war. Note that the political winds didn't change w/r/t Iraq until a number of events occurred: 1. The depth of outright incompetence that became the trademark of the Bush Administration became apparent. 2. The quantities of lies told by the administration to all that would listen to goad the nation into accepting war were realized. 3. Virtually none of the major reasons for going to war turned out to be true (note how many times the reasons changed). Were you one of the complainers when G W Bush couldn't find a spending bill too outrageous to veto for the first 6 years of his lamentable administration? I was!!! It took the democrats finally taking over the agenda (with too small of a majority to have any other power) to create a budget that he would veto. Now that 8 years of horrify incompetence have left our nation but a shell of what it used to be, now the republicans finally start complaining about the budget. Its too late for them. They have all but evaporated as a party and now resort to buffoonery when attempting to argue a point. As an example, look at the 18-page alternative budget they came up with: it is 99.999% content free for your protection, with nary a single digit referencing dollars throughout. At least they provide some comic relief... But even Arlen Spector has had enough: He is about to announce that he is resigning his republican affiliation to become a member of the democratic party. It is reported that the republican party has swung so far to the right that it is now the wrong party for him.",
        "intTime": 20090428,
        "postID": 31,
        "quote": "Originally posted by ryerye13B: \"but decided somewhere along the line that it would be far more fun (if not oil-licious) to go for an uninvited visit into Iraq.\" Ah yes the lefts favorite tag-line, \"war for oil\", kinda like \"Bush let the Bin Ladens leave on Sept 11th, the only flight out.\" Let us not forget that all of our favorite Dems jumped on board for this excursion, funny how when the political winds changed those same Dems jumped ship. I wonder if people will still be singing the presidents praise when this country is so far in debt, because of his outta control spending, our great great grandchildren will be picking up the tab? Please spare me the \"Bush did it\" argument, I'm no Bush apologist or supporter so if you reply with this argument it falls on deaf ears! I am fully aware of what Bush did! And Yes he is making the same mistakes as Hoover and FDR! Carbon Tax anyone? Maybe another trillion to those who are mostly responsible for this mess will turn it around? Bill-Fold while your learning a few their history please include how we, as a country, recovered from the depression? I'll give ya a hint WWII. This recession is not worse than the Great Depression, at least not yet! Obama is just another politician.",
        "reply": " The Dems jumped aboard that excursion because they were carefully fed highly focused, bogus, biased, cooked, and otherwise highly suspect intelligence from sources the administration were warned to be pathologically dishonest by our allies intelligence agencies (and in a number of notable cases, our own CIA). No one has better access to intelligence than the White House, and they deliberately manipulated the facts to get congress to approve actions when they had already decided to go to war. Note that the political winds didn't change w/r/t Iraq until a number of events occurred: 1. The depth of outright incompetence that became the trademark of the Bush Administration became apparent. 2. The quantities of lies told by the administration to all that would listen to goad the nation into accepting war were realized. 3. Virtually none of the major reasons for going to war turned out to be true (note how many times the reasons changed). Were you one of the complainers when G W Bush couldn't find a spending bill too outrageous to veto for the first 6 years of his lamentable administration? I was!!! It took the democrats finally taking over the agenda (with too small of a majority to have any other power) to create a budget that he would veto. Now that 8 years of horrify incompetence have left our nation but a shell of what it used to be, now the republicans finally start complaining about the budget. Its too late for them. They have all but evaporated as a party and now resort to buffoonery when attempting to argue a point. As an example, look at the 18-page alternative budget they came up with: it is 99.999% content free for your protection, with nary a single digit referencing dollars throughout. At least they provide some comic relief... But even Arlen Spector has had enough: He is about to announce that he is resigning his republican affiliation to become a member of the democratic party. It is reported that the republican party has swung so far to the right that it is now the wrong party for him.",
        "threadID": "6960020520001_3260049122001",
        "time": "2009-04-28 12:56:00",
        "title": "A Mixed Record in the First 100 Days",
        "userID": "PolicyWonk"
    },
    {
        "content": "When a fair weather politician decides to renounce his/her affilitation with either party because of diffences of philosophy with that party, he/she has violated his/her contract with those that elected him/her and instead should resign from his/her office. Hold a special election and IF that politician wins it, they can then join the other party. This should alos apply to any third party or Independant that wants to change affiliation as well.",
        "intTime": 20090428,
        "postID": 32,
        "quote": "",
        "reply": "When a fair weather politician decides to renounce his/her affilitation with either party because of diffences of philosophy with that party, he/she has violated his/her contract with those that elected him/her and instead should resign from his/her office. Hold a special election and IF that politician wins it, they can then join the other party. This should alos apply to any third party or Independant that wants to change affiliation as well.",
        "threadID": "6960020520001_3260049122001",
        "time": "2009-04-28 14:29:00",
        "title": "A Mixed Record in the First 100 Days",
        "userID": "21246220"
    },
    {
        "content": "As for Spector, did not have to swing very far, as he was already to the left of center on a lot os issues.",
        "intTime": 20090428,
        "postID": 33,
        "quote": "",
        "reply": "As for Spector, did not have to swing very far, as he was already to the left of center on a lot os issues.",
        "threadID": "6960020520001_3260049122001",
        "time": "2009-04-28 14:29:00",
        "title": "A Mixed Record in the First 100 Days",
        "userID": "21246220"
    },
    {
        "content": "quote: quote: Originally posted by ryerye13B: \"but decided somewhere along the line that it would be far more fun (if not oil-licious) to go for an uninvited visit into Iraq.\" Ah yes the lefts favorite tag-line, \"war for oil\", kinda like \"Bush let the Bin Ladens leave on Sept 11th, the only flight out.\" Let us not forget that all of our favorite Dems jumped on board for this excursion, funny how when the political winds changed those same Dems jumped ship. I wonder if people will still be singing the presidents praise when this country is so far in debt, because of his outta control spending, our great great grandchildren will be picking up the tab? Please spare me the \"Bush did it\" argument, I'm no Bush apologist or supporter so if you reply with this argument it falls on deaf ears! I am fully aware of what Bush did! And Yes he is making the same mistakes as Hoover and FDR! Carbon Tax anyone? Maybe another trillion to those who are mostly responsible for this mess will turn it around? Bill-Fold while your learning a few their history please include how we, as a country, recovered from the depression? I'll give ya a hint WWII. This recession is not worse than the Great Depression, at least not yet! Obama is just another politician. The Dems jumped aboard that excursion because they were carefully fed highly focused, bogus, biased, cooked, and otherwise highly suspect intelligence from sources the administration were warned to be pathologically dishonest by our allies intelligence agencies (and in a number of notable cases, our own CIA). No one has better access to intelligence than the White House, and they deliberately manipulated the facts to get congress to approve actions when they had already decided to go to war. Note that the political winds didn't change w/r/t Iraq until a number of events occurred: 1. The depth of outright incompetence that became the trademark of the Bush Administration became apparent. 2. The quantities of lies told by the administration to all that would listen to goad the nation into accepting war were realized. 3. Virtually none of the major reasons for going to war turned out to be true (note how many times the reasons changed). Were you one of the complainers when G W Bush couldn't find a spending bill too outrageous to veto for the first 6 years of his lamentable administration? I was!!! It took the democrats finally taking over the agenda (with too small of a majority to have any other power) to create a budget that he would veto. Now that 8 years of horrify incompetence have left our nation but a shell of what it used to be, now the republicans finally start complaining about the budget. Its too late for them. They have all but evaporated as a party and now resort to buffoonery when attempting to argue a point. As an example, look at the 18-page alternative budget they came up with: it is 99.999% content free for your protection, with nary a single digit referencing dollars throughout. At least they provide some comic relief... But even Arlen Spector has had enough: He is about to announce that he is resigning his republican affiliation to become a member of the democratic party. It is reported that the republican party has swung so far to the right that it is now the wrong party for him. Alright where to begin? So basically what your telling me is the the Dems are so incompetant they didn't question the admin? If so, why do people continue to support these same people? If I could provide links I could show you the list of Dem supporters that also believed there were WMD, a former president who made a speach declaring Iraq had WMD. This was also believed by numerous intelligence agencies across the globe, the UK being just 1, did Bush cook up some grand conspiracy and get these other countries on board with us and his war? Doubtful, it might just be that everyone actually thought he had WMD. Please provide the proof that the WH or the admin deliberatly manipulated the facts. If he lied as you say how come no court has proven this or even taken up the case? A Spanish judge just threw a war crimes case out. You have absolutely no proof the admin lied to go to war. That is a left ideology that has no legs to support it. If he knowingly lied about going to war, how come he isn't up on war crimes, or even members of his admin? Why isn't the new president going after the former admin? Since when has Arlen Spector been a conservative? Maybe a R but no conservative. He is really a poor example to use in this debate. The R party is dead rhetoric is hardly new, the D's were scrambling in \"00\" and \"04\". After Nixon everyone thought the R party was a thing of the past. I was one of those outraged at Bushes liberal spending policies, but does that make it OK for Obama to continue the trend? What will your excuse for Obama be if he spends us into a depression? You can only blame Bush for so long! All of these politicos were duped by Bush I guess? \"We begin with the common belief that Saddam Hussein is a tyrant and a threat to the peace and stability of the region. He has ignored the mandate of the United Nations and is building weapons of mass destruction and the means of delivering them.\" - Sen. Carl Levin (D, MI), September 19, 2002 \"We know that he has stored secret supplies of biological and chemical weapons throughout his country.\" - Al Gore, September 23, 2002 \"Iraq's search for weapons of mass destruction has proven impossible to deter and we should assume that it will continue for as long as Saddam is in power.\" - Al Gore, September 23, 2002 \"We have known for many years that Saddam Hussein is seeking and developing weapons of mass destruction.\" - Sen. Ted Kennedy (D, MA), September 27, 2002 \"The last UN weapons inspectors left Iraq in October of 1998. We are confident that Saddam Hussein retains some stockpiles of chemical and biological weapons, and that he has since embarked on a crash course to build up his chemical and biological warfare capabilities. Intelligence reports indicate that he is seeking nuclear weapons...\" - Sen. Robert Byrd (D, WV), October 3, 2002 \"I will be voting to give the President of the United States the authority to use force -- if necessary -- to disarm Saddam Hussein because I believe that a deadly arsenal of weapons of mass destruction in his hands is a real and grave threat to our security.\" - Sen. John F. Kerry (D, MA), October 9, 2002 \"There is unmistakable evidence that Saddam Hussein is working aggressively to develop nuclear weapons and will likely have nuclear weapons within the next five years ... We also should remember we have always underestimated the progress Saddam has made in development of weapons of mass destruction.\" - Sen. Jay Rockefeller (D, WV), October 10, 2002 \"In the four years since the inspectors left, intelligence reports show that Saddam Hussein has worked to rebuild his chemical and biological weapons stock, his missile delivery capability, and his nuclear program. He has also given aid, comfort, and sanctuary to terrorists, including al Qaeda members ... It is clear, however, that if left unchecked, Saddam Hussein will continue to increase his capacity to wage biological and chemical warfare, and will keep trying to develop nuclear weapons.\" - Sen. Hillary Clinton (D, NY), October 10, 2002 \"We are in possession of what I think to be compelling evidence that Saddam Hussein has, and has had for a number of years, a developing capacity for the production and storage of weapons of mass destruction.\" - Sen. Bob Graham (D, FL), December 8, 2002 \"Every day Saddam remains in power with chemical weapons, biological weapons, and the development of nuclear weapons is a day of danger for the United States.\" -Sen. Joseph Lieberman (D-CT) September 4, 2002 \"If we wait for the [Iraq] danger to become clear, it could be too late.\" -Sen. Joseph Biden (D-Del) September 4, 2002 \"Iraq both poses a continuing threat to the national security of the United States and international peace and security in the Persian Gulf region and remains in material and unacceptable breach of its international obligations by, among other things, continuing to possess and develop a significant chemical and biological weapons capability, actively seeking a nuclear weapons capability, and supporting and harboring terrorist organizations.\" -Sen. Hillary Clinton (D-NY) February 5, 2003 \"Without question, we need to disarm Saddam Hussein. He is a brutal, murderous dictator, leading an oppressive regime ... He presents a particularly grievous threat because he is so consistently prone to miscalculation ... And now he is miscalculating America's response to his continued deceit and his consistent grasp for weapons of mass destruction ... So the threat of Saddam Hussein with weapons of mass destruction is real...\" - Sen. John F. Kerry (D, MA), January 23. 2003 What about these quotes before Bush was even a thought? \"One way or the other, we are determined to deny Iraq the capacity to develop weapons of mass destruction and the missiles to deliver them. That is our bottom line.\" - President Bill Clinton, February 4, 1998 \"If Saddam rejects peace and we have to use force, our purpose is clear. We want to seriously diminish the threat posed by Iraq's weapons of mass destruction program.\" - President Bill Clinton, February 17, 1998 \"We must stop Saddam from ever again jeopardizing the stability and security of his neighbors with weapons of mass destruction.\" - Madeline Albright, February 1, 1998 \"He will use those weapons of mass destruction again, as he has ten times since 1983.\" - Sandy Berger, Clinton National Security Adviser, February 18, 1998 \"[W]e urge you, after consulting with Congress, and consistent with the U.S. Constitution and laws, to take necessary actions (including, if appropriate, air and missile strikes on suspect Iraqi sites) to respond effectively to the threat posed by Iraq's refusal to end its weapons of mass destruction programs.\" Letter to President Clinton. - (D) Senators Carl Levin, Tom Daschle, John Kerry, others, October 9, 1998 \"Saddam Hussein has been engaged in the development of weapons of mass destruction technology which is a threat to countries in the region and he has made a mockery of the weapons inspection process.\" - Rep. Nancy Pelosi (D, CA), December 16, 1998 \"Hussein has ... chosen to spend his money on building weapons of mass destruction and palaces for his cronies.\" - Madeline Albright, Clinton's Secretary of State, November 10, 1999",
        "intTime": 20090428,
        "postID": 34,
        "quote": "quote: Originally posted by ryerye13B: \"but decided somewhere along the line that it would be far more fun (if not oil-licious) to go for an uninvited visit into Iraq.\" Ah yes the lefts favorite tag-line, \"war for oil\", kinda like \"Bush let the Bin Ladens leave on Sept 11th, the only flight out.\" Let us not forget that all of our favorite Dems jumped on board for this excursion, funny how when the political winds changed those same Dems jumped ship. I wonder if people will still be singing the presidents praise when this country is so far in debt, because of his outta control spending, our great great grandchildren will be picking up the tab? Please spare me the \"Bush did it\" argument, I'm no Bush apologist or supporter so if you reply with this argument it falls on deaf ears! I am fully aware of what Bush did! And Yes he is making the same mistakes as Hoover and FDR! Carbon Tax anyone? Maybe another trillion to those who are mostly responsible for this mess will turn it around? Bill-Fold while your learning a few their history please include how we, as a country, recovered from the depression? I'll give ya a hint WWII. This recession is not worse than the Great Depression, at least not yet! Obama is just another politician. The Dems jumped aboard that excursion because they were carefully fed highly focused, bogus, biased, cooked, and otherwise highly suspect intelligence from sources the administration were warned to be pathologically dishonest by our allies intelligence agencies (and in a number of notable cases, our own CIA). No one has better access to intelligence than the White House, and they deliberately manipulated the facts to get congress to approve actions when they had already decided to go to war. Note that the political winds didn't change w/r/t Iraq until a number of events occurred: 1. The depth of outright incompetence that became the trademark of the Bush Administration became apparent. 2. The quantities of lies told by the administration to all that would listen to goad the nation into accepting war were realized. 3. Virtually none of the major reasons for going to war turned out to be true (note how many times the reasons changed). Were you one of the complainers when G W Bush couldn't find a spending bill too outrageous to veto for the first 6 years of his lamentable administration? I was!!! It took the democrats finally taking over the agenda (with too small of a majority to have any other power) to create a budget that he would veto. Now that 8 years of horrify incompetence have left our nation but a shell of what it used to be, now the republicans finally start complaining about the budget. Its too late for them. They have all but evaporated as a party and now resort to buffoonery when attempting to argue a point. As an example, look at the 18-page alternative budget they came up with: it is 99.999% content free for your protection, with nary a single digit referencing dollars throughout. At least they provide some comic relief... But even Arlen Spector has had enough: He is about to announce that he is resigning his republican affiliation to become a member of the democratic party. It is reported that the republican party has swung so far to the right that it is now the wrong party for him.",
        "reply": " Alright where to begin? So basically what your telling me is the the Dems are so incompetant they didn't question the admin? If so, why do people continue to support these same people? If I could provide links I could show you the list of Dem supporters that also believed there were WMD, a former president who made a speach declaring Iraq had WMD. This was also believed by numerous intelligence agencies across the globe, the UK being just 1, did Bush cook up some grand conspiracy and get these other countries on board with us and his war? Doubtful, it might just be that everyone actually thought he had WMD. Please provide the proof that the WH or the admin deliberatly manipulated the facts. If he lied as you say how come no court has proven this or even taken up the case? A Spanish judge just threw a war crimes case out. You have absolutely no proof the admin lied to go to war. That is a left ideology that has no legs to support it. If he knowingly lied about going to war, how come he isn't up on war crimes, or even members of his admin? Why isn't the new president going after the former admin? Since when has Arlen Spector been a conservative? Maybe a R but no conservative. He is really a poor example to use in this debate. The R party is dead rhetoric is hardly new, the D's were scrambling in \"00\" and \"04\". After Nixon everyone thought the R party was a thing of the past. I was one of those outraged at Bushes liberal spending policies, but does that make it OK for Obama to continue the trend? What will your excuse for Obama be if he spends us into a depression? You can only blame Bush for so long! All of these politicos were duped by Bush I guess? \"We begin with the common belief that Saddam Hussein is a tyrant and a threat to the peace and stability of the region. He has ignored the mandate of the United Nations and is building weapons of mass destruction and the means of delivering them.\" - Sen. Carl Levin (D, MI), September 19, 2002 \"We know that he has stored secret supplies of biological and chemical weapons throughout his country.\" - Al Gore, September 23, 2002 \"Iraq's search for weapons of mass destruction has proven impossible to deter and we should assume that it will continue for as long as Saddam is in power.\" - Al Gore, September 23, 2002 \"We have known for many years that Saddam Hussein is seeking and developing weapons of mass destruction.\" - Sen. Ted Kennedy (D, MA), September 27, 2002 \"The last UN weapons inspectors left Iraq in October of 1998. We are confident that Saddam Hussein retains some stockpiles of chemical and biological weapons, and that he has since embarked on a crash course to build up his chemical and biological warfare capabilities. Intelligence reports indicate that he is seeking nuclear weapons...\" - Sen. Robert Byrd (D, WV), October 3, 2002 \"I will be voting to give the President of the United States the authority to use force -- if necessary -- to disarm Saddam Hussein because I believe that a deadly arsenal of weapons of mass destruction in his hands is a real and grave threat to our security.\" - Sen. John F. Kerry (D, MA), October 9, 2002 \"There is unmistakable evidence that Saddam Hussein is working aggressively to develop nuclear weapons and will likely have nuclear weapons within the next five years ... We also should remember we have always underestimated the progress Saddam has made in development of weapons of mass destruction.\" - Sen. Jay Rockefeller (D, WV), October 10, 2002 \"In the four years since the inspectors left, intelligence reports show that Saddam Hussein has worked to rebuild his chemical and biological weapons stock, his missile delivery capability, and his nuclear program. He has also given aid, comfort, and sanctuary to terrorists, including al Qaeda members ... It is clear, however, that if left unchecked, Saddam Hussein will continue to increase his capacity to wage biological and chemical warfare, and will keep trying to develop nuclear weapons.\" - Sen. Hillary Clinton (D, NY), October 10, 2002 \"We are in possession of what I think to be compelling evidence that Saddam Hussein has, and has had for a number of years, a developing capacity for the production and storage of weapons of mass destruction.\" - Sen. Bob Graham (D, FL), December 8, 2002 \"Every day Saddam remains in power with chemical weapons, biological weapons, and the development of nuclear weapons is a day of danger for the United States.\" -Sen. Joseph Lieberman (D-CT) September 4, 2002 \"If we wait for the [Iraq] danger to become clear, it could be too late.\" -Sen. Joseph Biden (D-Del) September 4, 2002 \"Iraq both poses a continuing threat to the national security of the United States and international peace and security in the Persian Gulf region and remains in material and unacceptable breach of its international obligations by, among other things, continuing to possess and develop a significant chemical and biological weapons capability, actively seeking a nuclear weapons capability, and supporting and harboring terrorist organizations.\" -Sen. Hillary Clinton (D-NY) February 5, 2003 \"Without question, we need to disarm Saddam Hussein. He is a brutal, murderous dictator, leading an oppressive regime ... He presents a particularly grievous threat because he is so consistently prone to miscalculation ... And now he is miscalculating America's response to his continued deceit and his consistent grasp for weapons of mass destruction ... So the threat of Saddam Hussein with weapons of mass destruction is real...\" - Sen. John F. Kerry (D, MA), January 23. 2003 What about these quotes before Bush was even a thought? \"One way or the other, we are determined to deny Iraq the capacity to develop weapons of mass destruction and the missiles to deliver them. That is our bottom line.\" - President Bill Clinton, February 4, 1998 \"If Saddam rejects peace and we have to use force, our purpose is clear. We want to seriously diminish the threat posed by Iraq's weapons of mass destruction program.\" - President Bill Clinton, February 17, 1998 \"We must stop Saddam from ever again jeopardizing the stability and security of his neighbors with weapons of mass destruction.\" - Madeline Albright, February 1, 1998 \"He will use those weapons of mass destruction again, as he has ten times since 1983.\" - Sandy Berger, Clinton National Security Adviser, February 18, 1998 \"[W]e urge you, after consulting with Congress, and consistent with the U.S. Constitution and laws, to take necessary actions (including, if appropriate, air and missile strikes on suspect Iraqi sites) to respond effectively to the threat posed by Iraq's refusal to end its weapons of mass destruction programs.\" Letter to President Clinton. - (D) Senators Carl Levin, Tom Daschle, John Kerry, others, October 9, 1998 \"Saddam Hussein has been engaged in the development of weapons of mass destruction technology which is a threat to countries in the region and he has made a mockery of the weapons inspection process.\" - Rep. Nancy Pelosi (D, CA), December 16, 1998 \"Hussein has ... chosen to spend his money on building weapons of mass destruction and palaces for his cronies.\" - Madeline Albright, Clinton's Secretary of State, November 10, 1999",
        "threadID": "6960020520001_3260049122001",
        "time": "2009-04-28 16:01:00",
        "title": "A Mixed Record in the First 100 Days",
        "userID": "ryerye13B"
    },
    {
        "content": "The one big thing missing from all of these quotes is the reality called Mutually Assured Destruction (MAD). We have nut job countries right now that possess nuclear weapons, but are we invading them and going through all kinds of machinations to pump up the scare factor? By the same standard why didn't Bush invade NKorea. So take all of your wacky preemptive ideology that essentially held that \"Iraq was a threat\" so we HAD to take them out, and compare that with reality--which demolishes this neocon fantasy. It was all about oil, get over it case closed. PS Happy 100 days President Obama! Pres. Obama has higher ratings than Bush or Clinton did for their respective 100 day mark. Plus now Obama has the new Democrat Senator Specter. Ya just gotta love it! Will someone turn out the lights for the Republican Party?",
        "intTime": 20090428,
        "postID": 35,
        "quote": "",
        "reply": "The one big thing missing from all of these quotes is the reality called Mutually Assured Destruction (MAD). We have nut job countries right now that possess nuclear weapons, but are we invading them and going through all kinds of machinations to pump up the scare factor? By the same standard why didn't Bush invade NKorea. So take all of your wacky preemptive ideology that essentially held that \"Iraq was a threat\" so we HAD to take them out, and compare that with reality--which demolishes this neocon fantasy. It was all about oil, get over it case closed. PS Happy 100 days President Obama! Pres. Obama has higher ratings than Bush or Clinton did for their respective 100 day mark. Plus now Obama has the new Democrat Senator Specter. Ya just gotta love it! Will someone turn out the lights for the Republican Party?",
        "threadID": "6960020520001_3260049122001",
        "time": "2009-04-28 21:08:00",
        "title": "A Mixed Record in the First 100 Days",
        "userID": "rockriver04"
    },
    {
        "content": "Forget the ratings, the pre-911 mentality is in full force by this administration acting like we don't have enemies. Breaking news!! Due to the outbreak of friendliness, kissing our enemies behind is now a standard operating procedure. Pleeaaassssee!!!",
        "intTime": 20090428,
        "postID": 36,
        "quote": "",
        "reply": "Forget the ratings, the pre-911 mentality is in full force by this administration acting like we don't have enemies. Breaking news!! Due to the outbreak of friendliness, kissing our enemies behind is now a standard operating procedure. Pleeaaassssee!!!",
        "threadID": "6960020520001_3260049122001",
        "time": "2009-04-28 21:44:00",
        "title": "A Mixed Record in the First 100 Days",
        "userID": "LouieSuzara"
    },
    {
        "content": "quote: Plus now Obama has the new Democrat Senator Specter Great freaking news, finally he got the nerve to come out of the closet, what a political cross dresser he is. Good riddance flip flopper!!",
        "intTime": 20090428,
        "postID": 37,
        "quote": "Plus now Obama has the new Democrat Senator Specter",
        "reply": " Great freaking news, finally he got the nerve to come out of the closet, what a political cross dresser he is. Good riddance flip flopper!!",
        "threadID": "6960020520001_3260049122001",
        "time": "2009-04-28 21:51:00",
        "title": "A Mixed Record in the First 100 Days",
        "userID": "LouieSuzara"
    },
    {
        "content": "Straight from the mouth of an \"Air America\" listening Dem party hack, who can't form his own opinion! \"It was all about oil, get over it case closed.\" Prove it! Bet ya can't! Truth hurt? It's not my wacky preemptive ideology, these quotes came straight out the horses.......er........donkeys mouths! Wonder if your gonna be in lock-step mode with this pres when he spends us into REAL debt? Or if the unemployed numbers keep getting higher than what is forecasted? Maybe another trillion to those mostly responsible will turn this ship around!? LOL!! Higher inflation anyone? What happens when this guy kills the Dem party? Will we all wake up and relize the 2 party system is a joke and that the difference between the 2 are very small? I doubt it cuz we will still have our party shrills trying to push their failed ideology upon the masses and the ignorant and stupid will still buy into the BS!",
        "intTime": 20090429,
        "postID": 38,
        "quote": "",
        "reply": "Straight from the mouth of an \"Air America\" listening Dem party hack, who can't form his own opinion! \"It was all about oil, get over it case closed.\" Prove it! Bet ya can't! Truth hurt? It's not my wacky preemptive ideology, these quotes came straight out the horses.......er........donkeys mouths! Wonder if your gonna be in lock-step mode with this pres when he spends us into REAL debt? Or if the unemployed numbers keep getting higher than what is forecasted? Maybe another trillion to those mostly responsible will turn this ship around!? LOL!! Higher inflation anyone? What happens when this guy kills the Dem party? Will we all wake up and relize the 2 party system is a joke and that the difference between the 2 are very small? I doubt it cuz we will still have our party shrills trying to push their failed ideology upon the masses and the ignorant and stupid will still buy into the BS!",
        "threadID": "6960020520001_3260049122001",
        "time": "2009-04-29 07:19:00",
        "title": "A Mixed Record in the First 100 Days",
        "userID": "ryerye13B"
    },
    {
        "content": "quote: Originally posted by ryerye13B: quote: quote: Originally posted by ryerye13B: \"but decided somewhere along the line that it would be far more fun (if not oil-licious) to go for an uninvited visit into Iraq.\" Ah yes the lefts favorite tag-line, \"war for oil\", kinda like \"Bush let the Bin Ladens leave on Sept 11th, the only flight out.\" Let us not forget that all of our favorite Dems jumped on board for this excursion, funny how when the political winds changed those same Dems jumped ship. I wonder if people will still be singing the presidents praise when this country is so far in debt, because of his outta control spending, our great great grandchildren will be picking up the tab? Please spare me the \"Bush did it\" argument, I'm no Bush apologist or supporter so if you reply with this argument it falls on deaf ears! I am fully aware of what Bush did! And Yes he is making the same mistakes as Hoover and FDR! Carbon Tax anyone? Maybe another trillion to those who are mostly responsible for this mess will turn it around? Bill-Fold while your learning a few their history please include how we, as a country, recovered from the depression? I'll give ya a hint WWII. This recession is not worse than the Great Depression, at least not yet! Obama is just another politician. The Dems jumped aboard that excursion because they were carefully fed highly focused, bogus, biased, cooked, and otherwise highly suspect intelligence from sources the administration were warned to be pathologically dishonest by our allies intelligence agencies (and in a number of notable cases, our own CIA). No one has better access to intelligence than the White House, and they deliberately manipulated the facts to get congress to approve actions when they had already decided to go to war. Note that the political winds didn't change w/r/t Iraq until a number of events occurred: 1. The depth of outright incompetence that became the trademark of the Bush Administration became apparent. 2. The quantities of lies told by the administration to all that would listen to goad the nation into accepting war were realized. 3. Virtually none of the major reasons for going to war turned out to be true (note how many times the reasons changed). Were you one of the complainers when G W Bush couldn't find a spending bill too outrageous to veto for the first 6 years of his lamentable administration? I was!!! It took the democrats finally taking over the agenda (with too small of a majority to have any other power) to create a budget that he would veto. Now that 8 years of horrify incompetence have left our nation but a shell of what it used to be, now the republicans finally start complaining about the budget. Its too late for them. They have all but evaporated as a party and now resort to buffoonery when attempting to argue a point. As an example, look at the 18-page alternative budget they came up with: it is 99.999% content free for your protection, with nary a single digit referencing dollars throughout. At least they provide some comic relief... But even Arlen Spector has had enough: He is about to announce that he is resigning his republican affiliation to become a member of the democratic party. It is reported that the republican party has swung so far to the right that it is now the wrong party for him. Alright where to begin? So basically what your telling me is the the Dems are so incompetant they didn't question the admin? If so, why do people continue to support these same people? If I could provide links I could show you the list of Dem supporters that also believed there were WMD, a former president who made a speach declaring Iraq had WMD. This was also believed by numerous intelligence agencies across the globe, the UK being just 1, did Bush cook up some grand conspiracy and get these other countries on board with us and his war? Doubtful, it might just be that everyone actually thought he had WMD. Please provide the proof that the WH or the admin deliberatly manipulated the facts. If he lied as you say how come no court has proven this or even taken up the case? A Spanish judge just threw a war crimes case out. You have absolutely no proof the admin lied to go to war. That is a left ideology that has no legs to support it. If he knowingly lied about going to war, how come he isn't up on war crimes, or even members of his admin? Why isn't the new president going after the former admin? Since when has Arlen Spector been a conservative? Maybe a R but no conservative. He is really a poor example to use in this debate. The R party is dead rhetoric is hardly new, the D's were scrambling in \"00\" and \"04\". After Nixon everyone thought the R party was a thing of the past. I was one of those outraged at Bushes liberal spending policies, but does that make it OK for Obama to continue the trend? What will your excuse for Obama be if he spends us into a depression? You can only blame Bush for so long! All of these politicos were duped by Bush I guess? \"We begin with the common belief that Saddam Hussein is a tyrant and a threat to the peace and stability of the region. He has ignored the mandate of the United Nations and is building weapons of mass destruction and the means of delivering them.\" - Sen. Carl Levin (D, MI), September 19, 2002 \"We know that he has stored secret supplies of biological and chemical weapons throughout his country.\" - Al Gore, September 23, 2002 \"Iraq's search for weapons of mass destruction has proven impossible to deter and we should assume that it will continue for as long as Saddam is in power.\" - Al Gore, September 23, 2002 \"We have known for many years that Saddam Hussein is seeking and developing weapons of mass destruction.\" - Sen. Ted Kennedy (D, MA), September 27, 2002 \"The last UN weapons inspectors left Iraq in October of 1998. We are confident that Saddam Hussein retains some stockpiles of chemical and biological weapons, and that he has since embarked on a crash course to build up his chemical and biological warfare capabilities. Intelligence reports indicate that he is seeking nuclear weapons...\" - Sen. Robert Byrd (D, WV), October 3, 2002 \"I will be voting to give the President of the United States the authority to use force -- if necessary -- to disarm Saddam Hussein because I believe that a deadly arsenal of weapons of mass destruction in his hands is a real and grave threat to our security.\" - Sen. John F. Kerry (D, MA), October 9, 2002 \"There is unmistakable evidence that Saddam Hussein is working aggressively to develop nuclear weapons and will likely have nuclear weapons within the next five years ... We also should remember we have always underestimated the progress Saddam has made in development of weapons of mass destruction.\" - Sen. Jay Rockefeller (D, WV), October 10, 2002 \"In the four years since the inspectors left, intelligence reports show that Saddam Hussein has worked to rebuild his chemical and biological weapons stock, his missile delivery capability, and his nuclear program. He has also given aid, comfort, and sanctuary to terrorists, including al Qaeda members ... It is clear, however, that if left unchecked, Saddam Hussein will continue to increase his capacity to wage biological and chemical warfare, and will keep trying to develop nuclear weapons.\" - Sen. Hillary Clinton (D, NY), October 10, 2002 \"We are in possession of what I think to be compelling evidence that Saddam Hussein has, and has had for a number of years, a developing capacity for the production and storage of weapons of mass destruction.\" - Sen. Bob Graham (D, FL), December 8, 2002 \"Every day Saddam remains in power with chemical weapons, biological weapons, and the development of nuclear weapons is a day of danger for the United States.\" -Sen. Joseph Lieberman (D-CT) September 4, 2002 \"If we wait for the [Iraq] danger to become clear, it could be too late.\" -Sen. Joseph Biden (D-Del) September 4, 2002 \"Iraq both poses a continuing threat to the national security of the United States and international peace and security in the Persian Gulf region and remains in material and unacceptable breach of its international obligations by, among other things, continuing to possess and develop a significant chemical and biological weapons capability, actively seeking a nuclear weapons capability, and supporting and harboring terrorist organizations.\" -Sen. Hillary Clinton (D-NY) February 5, 2003 \"Without question, we need to disarm Saddam Hussein. He is a brutal, murderous dictator, leading an oppressive regime ... He presents a particularly grievous threat because he is so consistently prone to miscalculation ... And now he is miscalculating America's response to his continued deceit and his consistent grasp for weapons of mass destruction ... So the threat of Saddam Hussein with weapons of mass destruction is real...\" - Sen. John F. Kerry (D, MA), January 23. 2003 What about these quotes before Bush was even a thought? \"One way or the other, we are determined to deny Iraq the capacity to develop weapons of mass destruction and the missiles to deliver them. That is our bottom line.\" - President Bill Clinton, February 4, 1998 \"If Saddam rejects peace and we have to use force, our purpose is clear. We want to seriously diminish the threat posed by Iraq's weapons of mass destruction program.\" - President Bill Clinton, February 17, 1998 \"We must stop Saddam from ever again jeopardizing the stability and security of his neighbors with weapons of mass destruction.\" - Madeline Albright, February 1, 1998 \"He will use those weapons of mass destruction again, as he has ten times since 1983.\" - Sandy Berger, Clinton National Security Adviser, February 18, 1998 \"[W]e urge you, after consulting with Congress, and consistent with the U.S. Constitution and laws, to take necessary actions (including, if appropriate, air and missile strikes on suspect Iraqi sites) to respond effectively to the threat posed by Iraq's refusal to end its weapons of mass destruction programs.\" Letter to President Clinton. - (D) Senators Carl Levin, Tom Daschle, John Kerry, others, October 9, 1998 \"Saddam Hussein has been engaged in the development of weapons of mass destruction technology which is a threat to countries in the region and he has made a mockery of the weapons inspection process.\" - Rep. Nancy Pelosi (D, CA), December 16, 1998 \"Hussein has ... chosen to spend his money on building weapons of mass destruction and palaces for his cronies.\" - Madeline Albright, Clinton's Secretary of State, November 10, 1999 Excellent article. The left doesn't like to admit that they thought just like most Americans that Saddam had WMD and are ashamed to admit it. Everybody knows that Saddam didn't care about any UN laws or his people. He did what ever he wanted and that is just a fact of life.",
        "intTime": 20090429,
        "postID": 39,
        "quote": "Originally posted by ryerye13B: quote: quote: Originally posted by ryerye13B: \"but decided somewhere along the line that it would be far more fun (if not oil-licious) to go for an uninvited visit into Iraq.\" Ah yes the lefts favorite tag-line, \"war for oil\", kinda like \"Bush let the Bin Ladens leave on Sept 11th, the only flight out.\" Let us not forget that all of our favorite Dems jumped on board for this excursion, funny how when the political winds changed those same Dems jumped ship. I wonder if people will still be singing the presidents praise when this country is so far in debt, because of his outta control spending, our great great grandchildren will be picking up the tab? Please spare me the \"Bush did it\" argument, I'm no Bush apologist or supporter so if you reply with this argument it falls on deaf ears! I am fully aware of what Bush did! And Yes he is making the same mistakes as Hoover and FDR! Carbon Tax anyone? Maybe another trillion to those who are mostly responsible for this mess will turn it around? Bill-Fold while your learning a few their history please include how we, as a country, recovered from the depression? I'll give ya a hint WWII. This recession is not worse than the Great Depression, at least not yet! Obama is just another politician. The Dems jumped aboard that excursion because they were carefully fed highly focused, bogus, biased, cooked, and otherwise highly suspect intelligence from sources the administration were warned to be pathologically dishonest by our allies intelligence agencies (and in a number of notable cases, our own CIA). No one has better access to intelligence than the White House, and they deliberately manipulated the facts to get congress to approve actions when they had already decided to go to war. Note that the political winds didn't change w/r/t Iraq until a number of events occurred: 1. The depth of outright incompetence that became the trademark of the Bush Administration became apparent. 2. The quantities of lies told by the administration to all that would listen to goad the nation into accepting war were realized. 3. Virtually none of the major reasons for going to war turned out to be true (note how many times the reasons changed). Were you one of the complainers when G W Bush couldn't find a spending bill too outrageous to veto for the first 6 years of his lamentable administration? I was!!! It took the democrats finally taking over the agenda (with too small of a majority to have any other power) to create a budget that he would veto. Now that 8 years of horrify incompetence have left our nation but a shell of what it used to be, now the republicans finally start complaining about the budget. Its too late for them. They have all but evaporated as a party and now resort to buffoonery when attempting to argue a point. As an example, look at the 18-page alternative budget they came up with: it is 99.999% content free for your protection, with nary a single digit referencing dollars throughout. At least they provide some comic relief... But even Arlen Spector has had enough: He is about to announce that he is resigning his republican affiliation to become a member of the democratic party. It is reported that the republican party has swung so far to the right that it is now the wrong party for him. Alright where to begin? So basically what your telling me is the the Dems are so incompetant they didn't question the admin? If so, why do people continue to support these same people? If I could provide links I could show you the list of Dem supporters that also believed there were WMD, a former president who made a speach declaring Iraq had WMD. This was also believed by numerous intelligence agencies across the globe, the UK being just 1, did Bush cook up some grand conspiracy and get these other countries on board with us and his war? Doubtful, it might just be that everyone actually thought he had WMD. Please provide the proof that the WH or the admin deliberatly manipulated the facts. If he lied as you say how come no court has proven this or even taken up the case? A Spanish judge just threw a war crimes case out. You have absolutely no proof the admin lied to go to war. That is a left ideology that has no legs to support it. If he knowingly lied about going to war, how come he isn't up on war crimes, or even members of his admin? Why isn't the new president going after the former admin? Since when has Arlen Spector been a conservative? Maybe a R but no conservative. He is really a poor example to use in this debate. The R party is dead rhetoric is hardly new, the D's were scrambling in \"00\" and \"04\". After Nixon everyone thought the R party was a thing of the past. I was one of those outraged at Bushes liberal spending policies, but does that make it OK for Obama to continue the trend? What will your excuse for Obama be if he spends us into a depression? You can only blame Bush for so long! All of these politicos were duped by Bush I guess? \"We begin with the common belief that Saddam Hussein is a tyrant and a threat to the peace and stability of the region. He has ignored the mandate of the United Nations and is building weapons of mass destruction and the means of delivering them.\" - Sen. Carl Levin (D, MI), September 19, 2002 \"We know that he has stored secret supplies of biological and chemical weapons throughout his country.\" - Al Gore, September 23, 2002 \"Iraq's search for weapons of mass destruction has proven impossible to deter and we should assume that it will continue for as long as Saddam is in power.\" - Al Gore, September 23, 2002 \"We have known for many years that Saddam Hussein is seeking and developing weapons of mass destruction.\" - Sen. Ted Kennedy (D, MA), September 27, 2002 \"The last UN weapons inspectors left Iraq in October of 1998. We are confident that Saddam Hussein retains some stockpiles of chemical and biological weapons, and that he has since embarked on a crash course to build up his chemical and biological warfare capabilities. Intelligence reports indicate that he is seeking nuclear weapons...\" - Sen. Robert Byrd (D, WV), October 3, 2002 \"I will be voting to give the President of the United States the authority to use force -- if necessary -- to disarm Saddam Hussein because I believe that a deadly arsenal of weapons of mass destruction in his hands is a real and grave threat to our security.\" - Sen. John F. Kerry (D, MA), October 9, 2002 \"There is unmistakable evidence that Saddam Hussein is working aggressively to develop nuclear weapons and will likely have nuclear weapons within the next five years ... We also should remember we have always underestimated the progress Saddam has made in development of weapons of mass destruction.\" - Sen. Jay Rockefeller (D, WV), October 10, 2002 \"In the four years since the inspectors left, intelligence reports show that Saddam Hussein has worked to rebuild his chemical and biological weapons stock, his missile delivery capability, and his nuclear program. He has also given aid, comfort, and sanctuary to terrorists, including al Qaeda members ... It is clear, however, that if left unchecked, Saddam Hussein will continue to increase his capacity to wage biological and chemical warfare, and will keep trying to develop nuclear weapons.\" - Sen. Hillary Clinton (D, NY), October 10, 2002 \"We are in possession of what I think to be compelling evidence that Saddam Hussein has, and has had for a number of years, a developing capacity for the production and storage of weapons of mass destruction.\" - Sen. Bob Graham (D, FL), December 8, 2002 \"Every day Saddam remains in power with chemical weapons, biological weapons, and the development of nuclear weapons is a day of danger for the United States.\" -Sen. Joseph Lieberman (D-CT) September 4, 2002 \"If we wait for the [Iraq] danger to become clear, it could be too late.\" -Sen. Joseph Biden (D-Del) September 4, 2002 \"Iraq both poses a continuing threat to the national security of the United States and international peace and security in the Persian Gulf region and remains in material and unacceptable breach of its international obligations by, among other things, continuing to possess and develop a significant chemical and biological weapons capability, actively seeking a nuclear weapons capability, and supporting and harboring terrorist organizations.\" -Sen. Hillary Clinton (D-NY) February 5, 2003 \"Without question, we need to disarm Saddam Hussein. He is a brutal, murderous dictator, leading an oppressive regime ... He presents a particularly grievous threat because he is so consistently prone to miscalculation ... And now he is miscalculating America's response to his continued deceit and his consistent grasp for weapons of mass destruction ... So the threat of Saddam Hussein with weapons of mass destruction is real...\" - Sen. John F. Kerry (D, MA), January 23. 2003 What about these quotes before Bush was even a thought? \"One way or the other, we are determined to deny Iraq the capacity to develop weapons of mass destruction and the missiles to deliver them. That is our bottom line.\" - President Bill Clinton, February 4, 1998 \"If Saddam rejects peace and we have to use force, our purpose is clear. We want to seriously diminish the threat posed by Iraq's weapons of mass destruction program.\" - President Bill Clinton, February 17, 1998 \"We must stop Saddam from ever again jeopardizing the stability and security of his neighbors with weapons of mass destruction.\" - Madeline Albright, February 1, 1998 \"He will use those weapons of mass destruction again, as he has ten times since 1983.\" - Sandy Berger, Clinton National Security Adviser, February 18, 1998 \"[W]e urge you, after consulting with Congress, and consistent with the U.S. Constitution and laws, to take necessary actions (including, if appropriate, air and missile strikes on suspect Iraqi sites) to respond effectively to the threat posed by Iraq's refusal to end its weapons of mass destruction programs.\" Letter to President Clinton. - (D) Senators Carl Levin, Tom Daschle, John Kerry, others, October 9, 1998 \"Saddam Hussein has been engaged in the development of weapons of mass destruction technology which is a threat to countries in the region and he has made a mockery of the weapons inspection process.\" - Rep. Nancy Pelosi (D, CA), December 16, 1998 \"Hussein has ... chosen to spend his money on building weapons of mass destruction and palaces for his cronies.\" - Madeline Albright, Clinton's Secretary of State, November 10, 1999",
        "reply": " Excellent article. The left doesn't like to admit that they thought just like most Americans that Saddam had WMD and are ashamed to admit it. Everybody knows that Saddam didn't care about any UN laws or his people. He did what ever he wanted and that is just a fact of life.",
        "threadID": "6960020520001_3260049122001",
        "time": "2009-04-29 07:45:00",
        "title": "A Mixed Record in the First 100 Days",
        "userID": "3529237"
    },
    {
        "content": "quote: Originally posted by LouieSuzara: quote: Plus now Obama has the new Democrat Senator Specter Great freaking news, finally he got the nerve to come out of the closet, what a political cross dresser he is. Good riddance flip flopper!! I agree.",
        "intTime": 20090429,
        "postID": 40,
        "quote": "Originally posted by LouieSuzara: quote: Plus now Obama has the new Democrat Senator Specter Great freaking news, finally he got the nerve to come out of the closet, what a political cross dresser he is. Good riddance flip flopper!!",
        "reply": " I agree.",
        "threadID": "6960020520001_3260049122001",
        "time": "2009-04-29 07:56:00",
        "title": "A Mixed Record in the First 100 Days",
        "userID": "3529237"
    },
    {
        "content": "RE: http://www.military.com/opinion/0,15202,189954,00.html Very, Very mixed.",
        "intTime": 20090427,
        "postID": 41,
        "quote": "",
        "reply": "RE: http://www.military.com/opinion/0,15202,189954,00.html Very, Very mixed.",
        "threadID": "6960020520001_3260049122001",
        "time": "2009-04-27 21:20:00",
        "title": "A Mixed Record in the First 100 Days",
        "userID": "21246220"
    },
    {
        "content": "Ho hum. Remember when we were warned that Obama was completely out of his depth, clueless, unqualified? President Obama has done a great job. He is engaged, he asks for opposing opinions, he thinks deeply and acts wiesly. He has acted on many occasions with great decisiveness. He has taken responsibility for his actions. In short, he has been everything the previous president was not. Walt",
        "intTime": 20090428,
        "postID": 42,
        "quote": "",
        "reply": "Ho hum. Remember when we were warned that Obama was completely out of his depth, clueless, unqualified? President Obama has done a great job. He is engaged, he asks for opposing opinions, he thinks deeply and acts wiesly. He has acted on many occasions with great decisiveness. He has taken responsibility for his actions. In short, he has been everything the previous president was not. Walt",
        "threadID": "6960020520001_3260049122001",
        "time": "2009-04-28 04:59:00",
        "title": "A Mixed Record in the First 100 Days",
        "userID": "WhiskeyPapa"
    },
    {
        "content": "Very, Very subjective, and missing facts to back up the claims. quote: Both Hoover and FDR tried to artificially pump up the economy by increasing credit, aiding banks, and increasing federal expenditures, including spending on futile \"make-work\" public works programs—all of which required the economy to fall farther back toward equilibrium, thus turning a mundane recession into the Great Depression. We all know (or should know) that FDR was trying to prop up the economy and cheer people's spirits at the same time in what was (until now) the worst economic mess in our history... and that is fact. That the writer claims Hoover did ANYTHING to prop up the economy is a complete Fallacy. Hoover did NOTHING to prop up the economy, and THAT is why it continued to tank and reach for an ever lower economic bottom(which happened in 1932-33), UNTIL FDR took office, and even then it took 4 YEARS to get most people back to work, and another 5 for the Depression to finally end. This President may not be FDR, and he is certainly no Hoover. What he is is a dynamic, honest and intellectually superb President who has demonstrated that he knows what he is doing and isn't afraid to tackle any of our problems and look for solutions. Thankfully and finally we have such a person in the White House.",
        "intTime": 20090428,
        "postID": 43,
        "quote": "Both Hoover and FDR tried to artificially pump up the economy by increasing credit, aiding banks, and increasing federal expenditures, including spending on futile \"make-work\" public works programs—all of which required the economy to fall farther back toward equilibrium, thus turning a mundane recession into the Great Depression.",
        "reply": "Very, Very subjective, and missing facts to back up the claims.  We all know (or should know) that FDR was trying to prop up the economy and cheer people's spirits at the same time in what was (until now) the worst economic mess in our history... and that is fact. That the writer claims Hoover did ANYTHING to prop up the economy is a complete Fallacy. Hoover did NOTHING to prop up the economy, and THAT is why it continued to tank and reach for an ever lower economic bottom(which happened in 1932-33), UNTIL FDR took office, and even then it took 4 YEARS to get most people back to work, and another 5 for the Depression to finally end. This President may not be FDR, and he is certainly no Hoover. What he is is a dynamic, honest and intellectually superb President who has demonstrated that he knows what he is doing and isn't afraid to tackle any of our problems and look for solutions. Thankfully and finally we have such a person in the White House.",
        "threadID": "6960020520001_3260049122001",
        "time": "2009-04-28 05:04:00",
        "title": "A Mixed Record in the First 100 Days",
        "userID": "Bill_Fold"
    },
    {
        "content": "quote: Originally posted by Bill_Fold: This President may not be FDR, and he is certainly no Hoover. What he is is a dynamic, honest and intellectually superb President who has demonstrated that he knows what he is doing and isn't afraid to tackle any of pour problems, and look for solutions. Thankfully and finally we have such a person in the White House. Bears repeating. Walt",
        "intTime": 20090428,
        "postID": 44,
        "quote": "Originally posted by Bill_Fold: This President may not be FDR, and he is certainly no Hoover. What he is is a dynamic, honest and intellectually superb President who has demonstrated that he knows what he is doing and isn't afraid to tackle any of pour problems, and look for solutions. Thankfully and finally we have such a person in the White House.",
        "reply": " Bears repeating. Walt",
        "threadID": "6960020520001_3260049122001",
        "time": "2009-04-28 05:09:00",
        "title": "A Mixed Record in the First 100 Days",
        "userID": "WhiskeyPapa"
    },
    {
        "content": "Thank You, Walt. Ditto.",
        "intTime": 20090428,
        "postID": 45,
        "quote": "",
        "reply": "Thank You, Walt. Ditto.",
        "threadID": "6960020520001_3260049122001",
        "time": "2009-04-28 05:11:00",
        "title": "A Mixed Record in the First 100 Days",
        "userID": "Bill_Fold"
    },
    {
        "content": "As much as I might grade Obama differently on these matters, Mr. Eland gets an \"A\" for writing a thought provoking op-ed. I contrast this with the purely propagandistic op-ed of his fellow op-ed writer, O. North. I solidly agree with Mr. Eland's overall premise, that the 100-day report card is grossly overrated, oversold, and overdone. Reasoned criticism makes for good democracy.",
        "intTime": 20090428,
        "postID": 46,
        "quote": "",
        "reply": "As much as I might grade Obama differently on these matters, Mr. Eland gets an \"A\" for writing a thought provoking op-ed. I contrast this with the purely propagandistic op-ed of his fellow op-ed writer, O. North. I solidly agree with Mr. Eland's overall premise, that the 100-day report card is grossly overrated, oversold, and overdone. Reasoned criticism makes for good democracy.",
        "threadID": "6960020520001_3260049122001",
        "time": "2009-04-28 06:58:00",
        "title": "A Mixed Record in the First 100 Days",
        "userID": "bwf27"
    },
    {
        "content": "How dare this author critique the \"chosen one\" in any negative manner!",
        "intTime": 20090428,
        "postID": 47,
        "quote": "",
        "reply": "How dare this author critique the \"chosen one\" in any negative manner!",
        "threadID": "6960020520001_3260049122001",
        "time": "2009-04-28 07:00:00",
        "title": "A Mixed Record in the First 100 Days",
        "userID": "ryerye13B"
    },
    {
        "content": "quote: Unlike the younger Bush, Obama gets a \"B\" for realizing that popular opinion in Arab and Muslim countries does matter to U.S. security and attempting to raise U.S. standing in those nations by ending U.S. torture and closing Guantanamo and CIA secret prisons. Unfortunately, he doesn't seem to realize that the main cause of radical Islamists being converted to militant Islamist terrorists and guerrillas is the non-Muslim occupation of Muslim lands. If he did, he would realize that the U.S. occupation of Afghanistan has worsened terrorism by creating a resurgent Taliban (and allied groups) in both Afghanistan and Pakistan. In the case with Afghanistan, when the US first went in it was with the support of the Afghani people. They didn't like the Taliban either and were tired of being constantly in some kind of state of war (civil or otherwise). And, President Bush told the Afghani people that we were going to help them, but decided somewhere along the line that it would be far more fun (if not oil-licious) to go for an uninvited visit into Iraq. But years have gone by since we went into Afghanistan and the US became hopelessly distracted in Iraq, and little was done. The Afghani people have been waiting for a long time and have since grown impatient. The areas that the Taliban were chased out of didn't have sufficient troops, police, etc, to keep the criminals away so the country side became increasingly unstable. The Taliban, for all its problems, at least provided more security than the current Afghani government and US forces did. The evidence of our helping the people largely didn't materialize outside of Kabul: hence the problems we are now facing (i.e. the opportunity may have already vanished before the new guy even got started). That said, President Obama seems to be a very smart, pragmatic man. I am relieved that we have a president that understands that doing business with other cultures requires methods other than those used in the US. As an added bonus, rather than constantly denying mistakes no matter how obvious, he seems to have the courage to make corrections. Refreshing indeed...",
        "intTime": 20090428,
        "postID": 48,
        "quote": "Unlike the younger Bush, Obama gets a \"B\" for realizing that popular opinion in Arab and Muslim countries does matter to U.S. security and attempting to raise U.S. standing in those nations by ending U.S. torture and closing Guantanamo and CIA secret prisons. Unfortunately, he doesn't seem to realize that the main cause of radical Islamists being converted to militant Islamist terrorists and guerrillas is the non-Muslim occupation of Muslim lands. If he did, he would realize that the U.S. occupation of Afghanistan has worsened terrorism by creating a resurgent Taliban (and allied groups) in both Afghanistan and Pakistan.",
        "reply": " In the case with Afghanistan, when the US first went in it was with the support of the Afghani people. They didn't like the Taliban either and were tired of being constantly in some kind of state of war (civil or otherwise). And, President Bush told the Afghani people that we were going to help them, but decided somewhere along the line that it would be far more fun (if not oil-licious) to go for an uninvited visit into Iraq. But years have gone by since we went into Afghanistan and the US became hopelessly distracted in Iraq, and little was done. The Afghani people have been waiting for a long time and have since grown impatient. The areas that the Taliban were chased out of didn't have sufficient troops, police, etc, to keep the criminals away so the country side became increasingly unstable. The Taliban, for all its problems, at least provided more security than the current Afghani government and US forces did. The evidence of our helping the people largely didn't materialize outside of Kabul: hence the problems we are now facing (i.e. the opportunity may have already vanished before the new guy even got started). That said, President Obama seems to be a very smart, pragmatic man. I am relieved that we have a president that understands that doing business with other cultures requires methods other than those used in the US. As an added bonus, rather than constantly denying mistakes no matter how obvious, he seems to have the courage to make corrections. Refreshing indeed...",
        "threadID": "6960020520001_3260049122001",
        "time": "2009-04-28 07:47:00",
        "title": "A Mixed Record in the First 100 Days",
        "userID": "PolicyWonk"
    },
    {
        "content": "quote: Originally posted by Bill_Fold: Very, Very subjective, and missing facts to back up the claims. quote: Both Hoover and FDR tried to artificially pump up the economy by increasing credit, aiding banks, and increasing federal expenditures, including spending on futile \"make-work\" public works programs—all of which required the economy to fall farther back toward equilibrium, thus turning a mundane recession into the Great Depression. We all know (or should know) that FDR was trying to prop up the economy and cheer people's spirits at the same time in what was (until now) the worst economic mess in our history... and that is fact. That the writer claims Hoover did ANYTHING to prop up the economy is a complete Fallacy. Hoover did NOTHING to prop up the economy, and THAT is why it continued to tank and reach for an ever lower economic bottom(which happened in 1932-33), UNTIL FDR took office, and even then it took 4 YEARS to get most people back to work, and another 5 for the Depression to finally end. This President may not be FDR, and he is certainly no Hoover. What he is is a dynamic, honest and intellectually superb President who has demonstrated that he knows what he is doing and isn't afraid to tackle any of our problems and look for solutions. Thankfully and finally we have such a person in the White House. I'd like to add to this that our financial systems are very different now compared to the 1920's & 1930's FDR and Hoover administrations. Cheers.",
        "intTime": 20090428,
        "postID": 49,
        "quote": "Originally posted by Bill_Fold: Very, Very subjective, and missing facts to back up the claims. quote: Both Hoover and FDR tried to artificially pump up the economy by increasing credit, aiding banks, and increasing federal expenditures, including spending on futile \"make-work\" public works programs—all of which required the economy to fall farther back toward equilibrium, thus turning a mundane recession into the Great Depression. We all know (or should know) that FDR was trying to prop up the economy and cheer people's spirits at the same time in what was (until now) the worst economic mess in our history... and that is fact. That the writer claims Hoover did ANYTHING to prop up the economy is a complete Fallacy. Hoover did NOTHING to prop up the economy, and THAT is why it continued to tank and reach for an ever lower economic bottom(which happened in 1932-33), UNTIL FDR took office, and even then it took 4 YEARS to get most people back to work, and another 5 for the Depression to finally end. This President may not be FDR, and he is certainly no Hoover. What he is is a dynamic, honest and intellectually superb President who has demonstrated that he knows what he is doing and isn't afraid to tackle any of our problems and look for solutions. Thankfully and finally we have such a person in the White House.",
        "reply": " I'd like to add to this that our financial systems are very different now compared to the 1920's & 1930's FDR and Hoover administrations. Cheers.",
        "threadID": "6960020520001_3260049122001",
        "time": "2009-04-28 07:52:00",
        "title": "A Mixed Record in the First 100 Days",
        "userID": "PolicyWonk"
    },
    {
        "content": "\"but decided somewhere along the line that it would be far more fun (if not oil-licious) to go for an uninvited visit into Iraq.\" Ah yes the lefts favorite tag-line, \"war for oil\", kinda like \"Bush let the Bin Ladens leave on Sept 11th, the only flight out.\" Let us not forget that all of our favorite Dems jumped on board for this excursion, funny how when the political winds changed those same Dems jumped ship. I wonder if people will still be singing the presidents praise when this country is so far in debt, because of his outta control spending, our great great grandchildren will be picking up the tab? Please spare me the \"Bush did it\" argument, I'm no Bush apologist or supporter so if you reply with this argument it falls on deaf ears! I am fully aware of what Bush did! And Yes he is making the same mistakes as Hoover and FDR! Carbon Tax anyone? Maybe another trillion to those who are mostly responsible for this mess will turn it around? Bill-Fold while your learning a few their history please include how we, as a country, recovered from the depression? I'll give ya a hint WWII. This recession is not worse than the Great Depression, at least not yet! Obama is just another politician.",
        "intTime": 20090428,
        "postID": 50,
        "quote": "",
        "reply": "\"but decided somewhere along the line that it would be far more fun (if not oil-licious) to go for an uninvited visit into Iraq.\" Ah yes the lefts favorite tag-line, \"war for oil\", kinda like \"Bush let the Bin Ladens leave on Sept 11th, the only flight out.\" Let us not forget that all of our favorite Dems jumped on board for this excursion, funny how when the political winds changed those same Dems jumped ship. I wonder if people will still be singing the presidents praise when this country is so far in debt, because of his outta control spending, our great great grandchildren will be picking up the tab? Please spare me the \"Bush did it\" argument, I'm no Bush apologist or supporter so if you reply with this argument it falls on deaf ears! I am fully aware of what Bush did! And Yes he is making the same mistakes as Hoover and FDR! Carbon Tax anyone? Maybe another trillion to those who are mostly responsible for this mess will turn it around? Bill-Fold while your learning a few their history please include how we, as a country, recovered from the depression? I'll give ya a hint WWII. This recession is not worse than the Great Depression, at least not yet! Obama is just another politician.",
        "threadID": "6960020520001_3260049122001",
        "time": "2009-04-28 08:16:00",
        "title": "A Mixed Record in the First 100 Days",
        "userID": "ryerye13B"
    },
    {
        "content": "quote: Originally posted by ryerye13B: \"but decided somewhere along the line that it would be far more fun (if not oil-licious) to go for an uninvited visit into Iraq.\" Ah yes the lefts favorite tag-line, \"war for oil\", kinda like \"Bush let the Bin Ladens leave on Sept 11th, the only flight out.\" Let us not forget that all of our favorite Dems jumped on board for this excursion, funny how when the political winds changed those same Dems jumped ship. I wonder if people will still be singing the presidents praise when this country is so far in debt, because of his outta control spending, our great great grandchildren will be picking up the tab? Please spare me the \"Bush did it\" argument, I'm no Bush apologist or supporter so if you reply with this argument it falls on deaf ears! I am fully aware of what Bush did! And Yes he is making the same mistakes as Hoover and FDR! Carbon Tax anyone? Maybe another trillion to those who are mostly responsible for this mess will turn it around? Bill-Fold while your learning a few their history please include how we, as a country, recovered from the depression? I'll give ya a hint WWII. This recession is not worse than the Great Depression, at least not yet! Obama is just another politician. The Dems jumped aboard that excursion because they were carefully fed highly focused, bogus, biased, cooked, and otherwise highly suspect intelligence from sources the administration were warned to be pathologically dishonest by our allies intelligence agencies (and in a number of notable cases, our own CIA). No one has better access to intelligence than the White House, and they deliberately manipulated the facts to get congress to approve actions when they had already decided to go to war. Note that the political winds didn't change w/r/t Iraq until a number of events occurred: 1. The depth of outright incompetence that became the trademark of the Bush Administration became apparent. 2. The quantities of lies told by the administration to all that would listen to goad the nation into accepting war were realized. 3. Virtually none of the major reasons for going to war turned out to be true (note how many times the reasons changed). Were you one of the complainers when G W Bush couldn't find a spending bill too outrageous to veto for the first 6 years of his lamentable administration? I was!!! It took the democrats finally taking over the agenda (with too small of a majority to have any other power) to create a budget that he would veto. Now that 8 years of horrify incompetence have left our nation but a shell of what it used to be, now the republicans finally start complaining about the budget. Its too late for them. They have all but evaporated as a party and now resort to buffoonery when attempting to argue a point. As an example, look at the 18-page alternative budget they came up with: it is 99.999% content free for your protection, with nary a single digit referencing dollars throughout. At least they provide some comic relief... But even Arlen Spector has had enough: He is about to announce that he is resigning his republican affiliation to become a member of the democratic party. It is reported that the republican party has swung so far to the right that it is now the wrong party for him.",
        "intTime": 20090428,
        "postID": 51,
        "quote": "Originally posted by ryerye13B: \"but decided somewhere along the line that it would be far more fun (if not oil-licious) to go for an uninvited visit into Iraq.\" Ah yes the lefts favorite tag-line, \"war for oil\", kinda like \"Bush let the Bin Ladens leave on Sept 11th, the only flight out.\" Let us not forget that all of our favorite Dems jumped on board for this excursion, funny how when the political winds changed those same Dems jumped ship. I wonder if people will still be singing the presidents praise when this country is so far in debt, because of his outta control spending, our great great grandchildren will be picking up the tab? Please spare me the \"Bush did it\" argument, I'm no Bush apologist or supporter so if you reply with this argument it falls on deaf ears! I am fully aware of what Bush did! And Yes he is making the same mistakes as Hoover and FDR! Carbon Tax anyone? Maybe another trillion to those who are mostly responsible for this mess will turn it around? Bill-Fold while your learning a few their history please include how we, as a country, recovered from the depression? I'll give ya a hint WWII. This recession is not worse than the Great Depression, at least not yet! Obama is just another politician.",
        "reply": " The Dems jumped aboard that excursion because they were carefully fed highly focused, bogus, biased, cooked, and otherwise highly suspect intelligence from sources the administration were warned to be pathologically dishonest by our allies intelligence agencies (and in a number of notable cases, our own CIA). No one has better access to intelligence than the White House, and they deliberately manipulated the facts to get congress to approve actions when they had already decided to go to war. Note that the political winds didn't change w/r/t Iraq until a number of events occurred: 1. The depth of outright incompetence that became the trademark of the Bush Administration became apparent. 2. The quantities of lies told by the administration to all that would listen to goad the nation into accepting war were realized. 3. Virtually none of the major reasons for going to war turned out to be true (note how many times the reasons changed). Were you one of the complainers when G W Bush couldn't find a spending bill too outrageous to veto for the first 6 years of his lamentable administration? I was!!! It took the democrats finally taking over the agenda (with too small of a majority to have any other power) to create a budget that he would veto. Now that 8 years of horrify incompetence have left our nation but a shell of what it used to be, now the republicans finally start complaining about the budget. Its too late for them. They have all but evaporated as a party and now resort to buffoonery when attempting to argue a point. As an example, look at the 18-page alternative budget they came up with: it is 99.999% content free for your protection, with nary a single digit referencing dollars throughout. At least they provide some comic relief... But even Arlen Spector has had enough: He is about to announce that he is resigning his republican affiliation to become a member of the democratic party. It is reported that the republican party has swung so far to the right that it is now the wrong party for him.",
        "threadID": "6960020520001_3260049122001",
        "time": "2009-04-28 12:56:00",
        "title": "A Mixed Record in the First 100 Days",
        "userID": "PolicyWonk"
    },
    {
        "content": "When a fair weather politician decides to renounce his/her affilitation with either party because of diffences of philosophy with that party, he/she has violated his/her contract with those that elected him/her and instead should resign from his/her office. Hold a special election and IF that politician wins it, they can then join the other party. This should alos apply to any third party or Independant that wants to change affiliation as well.",
        "intTime": 20090428,
        "postID": 52,
        "quote": "",
        "reply": "When a fair weather politician decides to renounce his/her affilitation with either party because of diffences of philosophy with that party, he/she has violated his/her contract with those that elected him/her and instead should resign from his/her office. Hold a special election and IF that politician wins it, they can then join the other party. This should alos apply to any third party or Independant that wants to change affiliation as well.",
        "threadID": "6960020520001_3260049122001",
        "time": "2009-04-28 14:29:00",
        "title": "A Mixed Record in the First 100 Days",
        "userID": "21246220"
    },
    {
        "content": "As for Spector, did not have to swing very far, as he was already to the left of center on a lot os issues.",
        "intTime": 20090428,
        "postID": 53,
        "quote": "",
        "reply": "As for Spector, did not have to swing very far, as he was already to the left of center on a lot os issues.",
        "threadID": "6960020520001_3260049122001",
        "time": "2009-04-28 14:29:00",
        "title": "A Mixed Record in the First 100 Days",
        "userID": "21246220"
    },
    {
        "content": "quote: quote: Originally posted by ryerye13B: \"but decided somewhere along the line that it would be far more fun (if not oil-licious) to go for an uninvited visit into Iraq.\" Ah yes the lefts favorite tag-line, \"war for oil\", kinda like \"Bush let the Bin Ladens leave on Sept 11th, the only flight out.\" Let us not forget that all of our favorite Dems jumped on board for this excursion, funny how when the political winds changed those same Dems jumped ship. I wonder if people will still be singing the presidents praise when this country is so far in debt, because of his outta control spending, our great great grandchildren will be picking up the tab? Please spare me the \"Bush did it\" argument, I'm no Bush apologist or supporter so if you reply with this argument it falls on deaf ears! I am fully aware of what Bush did! And Yes he is making the same mistakes as Hoover and FDR! Carbon Tax anyone? Maybe another trillion to those who are mostly responsible for this mess will turn it around? Bill-Fold while your learning a few their history please include how we, as a country, recovered from the depression? I'll give ya a hint WWII. This recession is not worse than the Great Depression, at least not yet! Obama is just another politician. The Dems jumped aboard that excursion because they were carefully fed highly focused, bogus, biased, cooked, and otherwise highly suspect intelligence from sources the administration were warned to be pathologically dishonest by our allies intelligence agencies (and in a number of notable cases, our own CIA). No one has better access to intelligence than the White House, and they deliberately manipulated the facts to get congress to approve actions when they had already decided to go to war. Note that the political winds didn't change w/r/t Iraq until a number of events occurred: 1. The depth of outright incompetence that became the trademark of the Bush Administration became apparent. 2. The quantities of lies told by the administration to all that would listen to goad the nation into accepting war were realized. 3. Virtually none of the major reasons for going to war turned out to be true (note how many times the reasons changed). Were you one of the complainers when G W Bush couldn't find a spending bill too outrageous to veto for the first 6 years of his lamentable administration? I was!!! It took the democrats finally taking over the agenda (with too small of a majority to have any other power) to create a budget that he would veto. Now that 8 years of horrify incompetence have left our nation but a shell of what it used to be, now the republicans finally start complaining about the budget. Its too late for them. They have all but evaporated as a party and now resort to buffoonery when attempting to argue a point. As an example, look at the 18-page alternative budget they came up with: it is 99.999% content free for your protection, with nary a single digit referencing dollars throughout. At least they provide some comic relief... But even Arlen Spector has had enough: He is about to announce that he is resigning his republican affiliation to become a member of the democratic party. It is reported that the republican party has swung so far to the right that it is now the wrong party for him. Alright where to begin? So basically what your telling me is the the Dems are so incompetant they didn't question the admin? If so, why do people continue to support these same people? If I could provide links I could show you the list of Dem supporters that also believed there were WMD, a former president who made a speach declaring Iraq had WMD. This was also believed by numerous intelligence agencies across the globe, the UK being just 1, did Bush cook up some grand conspiracy and get these other countries on board with us and his war? Doubtful, it might just be that everyone actually thought he had WMD. Please provide the proof that the WH or the admin deliberatly manipulated the facts. If he lied as you say how come no court has proven this or even taken up the case? A Spanish judge just threw a war crimes case out. You have absolutely no proof the admin lied to go to war. That is a left ideology that has no legs to support it. If he knowingly lied about going to war, how come he isn't up on war crimes, or even members of his admin? Why isn't the new president going after the former admin? Since when has Arlen Spector been a conservative? Maybe a R but no conservative. He is really a poor example to use in this debate. The R party is dead rhetoric is hardly new, the D's were scrambling in \"00\" and \"04\". After Nixon everyone thought the R party was a thing of the past. I was one of those outraged at Bushes liberal spending policies, but does that make it OK for Obama to continue the trend? What will your excuse for Obama be if he spends us into a depression? You can only blame Bush for so long! All of these politicos were duped by Bush I guess? \"We begin with the common belief that Saddam Hussein is a tyrant and a threat to the peace and stability of the region. He has ignored the mandate of the United Nations and is building weapons of mass destruction and the means of delivering them.\" - Sen. Carl Levin (D, MI), September 19, 2002 \"We know that he has stored secret supplies of biological and chemical weapons throughout his country.\" - Al Gore, September 23, 2002 \"Iraq's search for weapons of mass destruction has proven impossible to deter and we should assume that it will continue for as long as Saddam is in power.\" - Al Gore, September 23, 2002 \"We have known for many years that Saddam Hussein is seeking and developing weapons of mass destruction.\" - Sen. Ted Kennedy (D, MA), September 27, 2002 \"The last UN weapons inspectors left Iraq in October of 1998. We are confident that Saddam Hussein retains some stockpiles of chemical and biological weapons, and that he has since embarked on a crash course to build up his chemical and biological warfare capabilities. Intelligence reports indicate that he is seeking nuclear weapons...\" - Sen. Robert Byrd (D, WV), October 3, 2002 \"I will be voting to give the President of the United States the authority to use force -- if necessary -- to disarm Saddam Hussein because I believe that a deadly arsenal of weapons of mass destruction in his hands is a real and grave threat to our security.\" - Sen. John F. Kerry (D, MA), October 9, 2002 \"There is unmistakable evidence that Saddam Hussein is working aggressively to develop nuclear weapons and will likely have nuclear weapons within the next five years ... We also should remember we have always underestimated the progress Saddam has made in development of weapons of mass destruction.\" - Sen. Jay Rockefeller (D, WV), October 10, 2002 \"In the four years since the inspectors left, intelligence reports show that Saddam Hussein has worked to rebuild his chemical and biological weapons stock, his missile delivery capability, and his nuclear program. He has also given aid, comfort, and sanctuary to terrorists, including al Qaeda members ... It is clear, however, that if left unchecked, Saddam Hussein will continue to increase his capacity to wage biological and chemical warfare, and will keep trying to develop nuclear weapons.\" - Sen. Hillary Clinton (D, NY), October 10, 2002 \"We are in possession of what I think to be compelling evidence that Saddam Hussein has, and has had for a number of years, a developing capacity for the production and storage of weapons of mass destruction.\" - Sen. Bob Graham (D, FL), December 8, 2002 \"Every day Saddam remains in power with chemical weapons, biological weapons, and the development of nuclear weapons is a day of danger for the United States.\" -Sen. Joseph Lieberman (D-CT) September 4, 2002 \"If we wait for the [Iraq] danger to become clear, it could be too late.\" -Sen. Joseph Biden (D-Del) September 4, 2002 \"Iraq both poses a continuing threat to the national security of the United States and international peace and security in the Persian Gulf region and remains in material and unacceptable breach of its international obligations by, among other things, continuing to possess and develop a significant chemical and biological weapons capability, actively seeking a nuclear weapons capability, and supporting and harboring terrorist organizations.\" -Sen. Hillary Clinton (D-NY) February 5, 2003 \"Without question, we need to disarm Saddam Hussein. He is a brutal, murderous dictator, leading an oppressive regime ... He presents a particularly grievous threat because he is so consistently prone to miscalculation ... And now he is miscalculating America's response to his continued deceit and his consistent grasp for weapons of mass destruction ... So the threat of Saddam Hussein with weapons of mass destruction is real...\" - Sen. John F. Kerry (D, MA), January 23. 2003 What about these quotes before Bush was even a thought? \"One way or the other, we are determined to deny Iraq the capacity to develop weapons of mass destruction and the missiles to deliver them. That is our bottom line.\" - President Bill Clinton, February 4, 1998 \"If Saddam rejects peace and we have to use force, our purpose is clear. We want to seriously diminish the threat posed by Iraq's weapons of mass destruction program.\" - President Bill Clinton, February 17, 1998 \"We must stop Saddam from ever again jeopardizing the stability and security of his neighbors with weapons of mass destruction.\" - Madeline Albright, February 1, 1998 \"He will use those weapons of mass destruction again, as he has ten times since 1983.\" - Sandy Berger, Clinton National Security Adviser, February 18, 1998 \"[W]e urge you, after consulting with Congress, and consistent with the U.S. Constitution and laws, to take necessary actions (including, if appropriate, air and missile strikes on suspect Iraqi sites) to respond effectively to the threat posed by Iraq's refusal to end its weapons of mass destruction programs.\" Letter to President Clinton. - (D) Senators Carl Levin, Tom Daschle, John Kerry, others, October 9, 1998 \"Saddam Hussein has been engaged in the development of weapons of mass destruction technology which is a threat to countries in the region and he has made a mockery of the weapons inspection process.\" - Rep. Nancy Pelosi (D, CA), December 16, 1998 \"Hussein has ... chosen to spend his money on building weapons of mass destruction and palaces for his cronies.\" - Madeline Albright, Clinton's Secretary of State, November 10, 1999",
        "intTime": 20090428,
        "postID": 54,
        "quote": "quote: Originally posted by ryerye13B: \"but decided somewhere along the line that it would be far more fun (if not oil-licious) to go for an uninvited visit into Iraq.\" Ah yes the lefts favorite tag-line, \"war for oil\", kinda like \"Bush let the Bin Ladens leave on Sept 11th, the only flight out.\" Let us not forget that all of our favorite Dems jumped on board for this excursion, funny how when the political winds changed those same Dems jumped ship. I wonder if people will still be singing the presidents praise when this country is so far in debt, because of his outta control spending, our great great grandchildren will be picking up the tab? Please spare me the \"Bush did it\" argument, I'm no Bush apologist or supporter so if you reply with this argument it falls on deaf ears! I am fully aware of what Bush did! And Yes he is making the same mistakes as Hoover and FDR! Carbon Tax anyone? Maybe another trillion to those who are mostly responsible for this mess will turn it around? Bill-Fold while your learning a few their history please include how we, as a country, recovered from the depression? I'll give ya a hint WWII. This recession is not worse than the Great Depression, at least not yet! Obama is just another politician. The Dems jumped aboard that excursion because they were carefully fed highly focused, bogus, biased, cooked, and otherwise highly suspect intelligence from sources the administration were warned to be pathologically dishonest by our allies intelligence agencies (and in a number of notable cases, our own CIA). No one has better access to intelligence than the White House, and they deliberately manipulated the facts to get congress to approve actions when they had already decided to go to war. Note that the political winds didn't change w/r/t Iraq until a number of events occurred: 1. The depth of outright incompetence that became the trademark of the Bush Administration became apparent. 2. The quantities of lies told by the administration to all that would listen to goad the nation into accepting war were realized. 3. Virtually none of the major reasons for going to war turned out to be true (note how many times the reasons changed). Were you one of the complainers when G W Bush couldn't find a spending bill too outrageous to veto for the first 6 years of his lamentable administration? I was!!! It took the democrats finally taking over the agenda (with too small of a majority to have any other power) to create a budget that he would veto. Now that 8 years of horrify incompetence have left our nation but a shell of what it used to be, now the republicans finally start complaining about the budget. Its too late for them. They have all but evaporated as a party and now resort to buffoonery when attempting to argue a point. As an example, look at the 18-page alternative budget they came up with: it is 99.999% content free for your protection, with nary a single digit referencing dollars throughout. At least they provide some comic relief... But even Arlen Spector has had enough: He is about to announce that he is resigning his republican affiliation to become a member of the democratic party. It is reported that the republican party has swung so far to the right that it is now the wrong party for him.",
        "reply": " Alright where to begin? So basically what your telling me is the the Dems are so incompetant they didn't question the admin? If so, why do people continue to support these same people? If I could provide links I could show you the list of Dem supporters that also believed there were WMD, a former president who made a speach declaring Iraq had WMD. This was also believed by numerous intelligence agencies across the globe, the UK being just 1, did Bush cook up some grand conspiracy and get these other countries on board with us and his war? Doubtful, it might just be that everyone actually thought he had WMD. Please provide the proof that the WH or the admin deliberatly manipulated the facts. If he lied as you say how come no court has proven this or even taken up the case? A Spanish judge just threw a war crimes case out. You have absolutely no proof the admin lied to go to war. That is a left ideology that has no legs to support it. If he knowingly lied about going to war, how come he isn't up on war crimes, or even members of his admin? Why isn't the new president going after the former admin? Since when has Arlen Spector been a conservative? Maybe a R but no conservative. He is really a poor example to use in this debate. The R party is dead rhetoric is hardly new, the D's were scrambling in \"00\" and \"04\". After Nixon everyone thought the R party was a thing of the past. I was one of those outraged at Bushes liberal spending policies, but does that make it OK for Obama to continue the trend? What will your excuse for Obama be if he spends us into a depression? You can only blame Bush for so long! All of these politicos were duped by Bush I guess? \"We begin with the common belief that Saddam Hussein is a tyrant and a threat to the peace and stability of the region. He has ignored the mandate of the United Nations and is building weapons of mass destruction and the means of delivering them.\" - Sen. Carl Levin (D, MI), September 19, 2002 \"We know that he has stored secret supplies of biological and chemical weapons throughout his country.\" - Al Gore, September 23, 2002 \"Iraq's search for weapons of mass destruction has proven impossible to deter and we should assume that it will continue for as long as Saddam is in power.\" - Al Gore, September 23, 2002 \"We have known for many years that Saddam Hussein is seeking and developing weapons of mass destruction.\" - Sen. Ted Kennedy (D, MA), September 27, 2002 \"The last UN weapons inspectors left Iraq in October of 1998. We are confident that Saddam Hussein retains some stockpiles of chemical and biological weapons, and that he has since embarked on a crash course to build up his chemical and biological warfare capabilities. Intelligence reports indicate that he is seeking nuclear weapons...\" - Sen. Robert Byrd (D, WV), October 3, 2002 \"I will be voting to give the President of the United States the authority to use force -- if necessary -- to disarm Saddam Hussein because I believe that a deadly arsenal of weapons of mass destruction in his hands is a real and grave threat to our security.\" - Sen. John F. Kerry (D, MA), October 9, 2002 \"There is unmistakable evidence that Saddam Hussein is working aggressively to develop nuclear weapons and will likely have nuclear weapons within the next five years ... We also should remember we have always underestimated the progress Saddam has made in development of weapons of mass destruction.\" - Sen. Jay Rockefeller (D, WV), October 10, 2002 \"In the four years since the inspectors left, intelligence reports show that Saddam Hussein has worked to rebuild his chemical and biological weapons stock, his missile delivery capability, and his nuclear program. He has also given aid, comfort, and sanctuary to terrorists, including al Qaeda members ... It is clear, however, that if left unchecked, Saddam Hussein will continue to increase his capacity to wage biological and chemical warfare, and will keep trying to develop nuclear weapons.\" - Sen. Hillary Clinton (D, NY), October 10, 2002 \"We are in possession of what I think to be compelling evidence that Saddam Hussein has, and has had for a number of years, a developing capacity for the production and storage of weapons of mass destruction.\" - Sen. Bob Graham (D, FL), December 8, 2002 \"Every day Saddam remains in power with chemical weapons, biological weapons, and the development of nuclear weapons is a day of danger for the United States.\" -Sen. Joseph Lieberman (D-CT) September 4, 2002 \"If we wait for the [Iraq] danger to become clear, it could be too late.\" -Sen. Joseph Biden (D-Del) September 4, 2002 \"Iraq both poses a continuing threat to the national security of the United States and international peace and security in the Persian Gulf region and remains in material and unacceptable breach of its international obligations by, among other things, continuing to possess and develop a significant chemical and biological weapons capability, actively seeking a nuclear weapons capability, and supporting and harboring terrorist organizations.\" -Sen. Hillary Clinton (D-NY) February 5, 2003 \"Without question, we need to disarm Saddam Hussein. He is a brutal, murderous dictator, leading an oppressive regime ... He presents a particularly grievous threat because he is so consistently prone to miscalculation ... And now he is miscalculating America's response to his continued deceit and his consistent grasp for weapons of mass destruction ... So the threat of Saddam Hussein with weapons of mass destruction is real...\" - Sen. John F. Kerry (D, MA), January 23. 2003 What about these quotes before Bush was even a thought? \"One way or the other, we are determined to deny Iraq the capacity to develop weapons of mass destruction and the missiles to deliver them. That is our bottom line.\" - President Bill Clinton, February 4, 1998 \"If Saddam rejects peace and we have to use force, our purpose is clear. We want to seriously diminish the threat posed by Iraq's weapons of mass destruction program.\" - President Bill Clinton, February 17, 1998 \"We must stop Saddam from ever again jeopardizing the stability and security of his neighbors with weapons of mass destruction.\" - Madeline Albright, February 1, 1998 \"He will use those weapons of mass destruction again, as he has ten times since 1983.\" - Sandy Berger, Clinton National Security Adviser, February 18, 1998 \"[W]e urge you, after consulting with Congress, and consistent with the U.S. Constitution and laws, to take necessary actions (including, if appropriate, air and missile strikes on suspect Iraqi sites) to respond effectively to the threat posed by Iraq's refusal to end its weapons of mass destruction programs.\" Letter to President Clinton. - (D) Senators Carl Levin, Tom Daschle, John Kerry, others, October 9, 1998 \"Saddam Hussein has been engaged in the development of weapons of mass destruction technology which is a threat to countries in the region and he has made a mockery of the weapons inspection process.\" - Rep. Nancy Pelosi (D, CA), December 16, 1998 \"Hussein has ... chosen to spend his money on building weapons of mass destruction and palaces for his cronies.\" - Madeline Albright, Clinton's Secretary of State, November 10, 1999",
        "threadID": "6960020520001_3260049122001",
        "time": "2009-04-28 16:01:00",
        "title": "A Mixed Record in the First 100 Days",
        "userID": "ryerye13B"
    },
    {
        "content": "The one big thing missing from all of these quotes is the reality called Mutually Assured Destruction (MAD). We have nut job countries right now that possess nuclear weapons, but are we invading them and going through all kinds of machinations to pump up the scare factor? By the same standard why didn't Bush invade NKorea. So take all of your wacky preemptive ideology that essentially held that \"Iraq was a threat\" so we HAD to take them out, and compare that with reality--which demolishes this neocon fantasy. It was all about oil, get over it case closed. PS Happy 100 days President Obama! Pres. Obama has higher ratings than Bush or Clinton did for their respective 100 day mark. Plus now Obama has the new Democrat Senator Specter. Ya just gotta love it! Will someone turn out the lights for the Republican Party?",
        "intTime": 20090428,
        "postID": 55,
        "quote": "",
        "reply": "The one big thing missing from all of these quotes is the reality called Mutually Assured Destruction (MAD). We have nut job countries right now that possess nuclear weapons, but are we invading them and going through all kinds of machinations to pump up the scare factor? By the same standard why didn't Bush invade NKorea. So take all of your wacky preemptive ideology that essentially held that \"Iraq was a threat\" so we HAD to take them out, and compare that with reality--which demolishes this neocon fantasy. It was all about oil, get over it case closed. PS Happy 100 days President Obama! Pres. Obama has higher ratings than Bush or Clinton did for their respective 100 day mark. Plus now Obama has the new Democrat Senator Specter. Ya just gotta love it! Will someone turn out the lights for the Republican Party?",
        "threadID": "6960020520001_3260049122001",
        "time": "2009-04-28 21:08:00",
        "title": "A Mixed Record in the First 100 Days",
        "userID": "rockriver04"
    },
    {
        "content": "Forget the ratings, the pre-911 mentality is in full force by this administration acting like we don't have enemies. Breaking news!! Due to the outbreak of friendliness, kissing our enemies behind is now a standard operating procedure. Pleeaaassssee!!!",
        "intTime": 20090428,
        "postID": 56,
        "quote": "",
        "reply": "Forget the ratings, the pre-911 mentality is in full force by this administration acting like we don't have enemies. Breaking news!! Due to the outbreak of friendliness, kissing our enemies behind is now a standard operating procedure. Pleeaaassssee!!!",
        "threadID": "6960020520001_3260049122001",
        "time": "2009-04-28 21:44:00",
        "title": "A Mixed Record in the First 100 Days",
        "userID": "LouieSuzara"
    },
    {
        "content": "quote: Plus now Obama has the new Democrat Senator Specter Great freaking news, finally he got the nerve to come out of the closet, what a political cross dresser he is. Good riddance flip flopper!!",
        "intTime": 20090428,
        "postID": 57,
        "quote": "Plus now Obama has the new Democrat Senator Specter",
        "reply": " Great freaking news, finally he got the nerve to come out of the closet, what a political cross dresser he is. Good riddance flip flopper!!",
        "threadID": "6960020520001_3260049122001",
        "time": "2009-04-28 21:51:00",
        "title": "A Mixed Record in the First 100 Days",
        "userID": "LouieSuzara"
    },
    {
        "content": "Straight from the mouth of an \"Air America\" listening Dem party hack, who can't form his own opinion! \"It was all about oil, get over it case closed.\" Prove it! Bet ya can't! Truth hurt? It's not my wacky preemptive ideology, these quotes came straight out the horses.......er........donkeys mouths! Wonder if your gonna be in lock-step mode with this pres when he spends us into REAL debt? Or if the unemployed numbers keep getting higher than what is forecasted? Maybe another trillion to those mostly responsible will turn this ship around!? LOL!! Higher inflation anyone? What happens when this guy kills the Dem party? Will we all wake up and relize the 2 party system is a joke and that the difference between the 2 are very small? I doubt it cuz we will still have our party shrills trying to push their failed ideology upon the masses and the ignorant and stupid will still buy into the BS!",
        "intTime": 20090429,
        "postID": 58,
        "quote": "",
        "reply": "Straight from the mouth of an \"Air America\" listening Dem party hack, who can't form his own opinion! \"It was all about oil, get over it case closed.\" Prove it! Bet ya can't! Truth hurt? It's not my wacky preemptive ideology, these quotes came straight out the horses.......er........donkeys mouths! Wonder if your gonna be in lock-step mode with this pres when he spends us into REAL debt? Or if the unemployed numbers keep getting higher than what is forecasted? Maybe another trillion to those mostly responsible will turn this ship around!? LOL!! Higher inflation anyone? What happens when this guy kills the Dem party? Will we all wake up and relize the 2 party system is a joke and that the difference between the 2 are very small? I doubt it cuz we will still have our party shrills trying to push their failed ideology upon the masses and the ignorant and stupid will still buy into the BS!",
        "threadID": "6960020520001_3260049122001",
        "time": "2009-04-29 07:19:00",
        "title": "A Mixed Record in the First 100 Days",
        "userID": "ryerye13B"
    },
    {
        "content": "quote: Originally posted by ryerye13B: quote: quote: Originally posted by ryerye13B: \"but decided somewhere along the line that it would be far more fun (if not oil-licious) to go for an uninvited visit into Iraq.\" Ah yes the lefts favorite tag-line, \"war for oil\", kinda like \"Bush let the Bin Ladens leave on Sept 11th, the only flight out.\" Let us not forget that all of our favorite Dems jumped on board for this excursion, funny how when the political winds changed those same Dems jumped ship. I wonder if people will still be singing the presidents praise when this country is so far in debt, because of his outta control spending, our great great grandchildren will be picking up the tab? Please spare me the \"Bush did it\" argument, I'm no Bush apologist or supporter so if you reply with this argument it falls on deaf ears! I am fully aware of what Bush did! And Yes he is making the same mistakes as Hoover and FDR! Carbon Tax anyone? Maybe another trillion to those who are mostly responsible for this mess will turn it around? Bill-Fold while your learning a few their history please include how we, as a country, recovered from the depression? I'll give ya a hint WWII. This recession is not worse than the Great Depression, at least not yet! Obama is just another politician. The Dems jumped aboard that excursion because they were carefully fed highly focused, bogus, biased, cooked, and otherwise highly suspect intelligence from sources the administration were warned to be pathologically dishonest by our allies intelligence agencies (and in a number of notable cases, our own CIA). No one has better access to intelligence than the White House, and they deliberately manipulated the facts to get congress to approve actions when they had already decided to go to war. Note that the political winds didn't change w/r/t Iraq until a number of events occurred: 1. The depth of outright incompetence that became the trademark of the Bush Administration became apparent. 2. The quantities of lies told by the administration to all that would listen to goad the nation into accepting war were realized. 3. Virtually none of the major reasons for going to war turned out to be true (note how many times the reasons changed). Were you one of the complainers when G W Bush couldn't find a spending bill too outrageous to veto for the first 6 years of his lamentable administration? I was!!! It took the democrats finally taking over the agenda (with too small of a majority to have any other power) to create a budget that he would veto. Now that 8 years of horrify incompetence have left our nation but a shell of what it used to be, now the republicans finally start complaining about the budget. Its too late for them. They have all but evaporated as a party and now resort to buffoonery when attempting to argue a point. As an example, look at the 18-page alternative budget they came up with: it is 99.999% content free for your protection, with nary a single digit referencing dollars throughout. At least they provide some comic relief... But even Arlen Spector has had enough: He is about to announce that he is resigning his republican affiliation to become a member of the democratic party. It is reported that the republican party has swung so far to the right that it is now the wrong party for him. Alright where to begin? So basically what your telling me is the the Dems are so incompetant they didn't question the admin? If so, why do people continue to support these same people? If I could provide links I could show you the list of Dem supporters that also believed there were WMD, a former president who made a speach declaring Iraq had WMD. This was also believed by numerous intelligence agencies across the globe, the UK being just 1, did Bush cook up some grand conspiracy and get these other countries on board with us and his war? Doubtful, it might just be that everyone actually thought he had WMD. Please provide the proof that the WH or the admin deliberatly manipulated the facts. If he lied as you say how come no court has proven this or even taken up the case? A Spanish judge just threw a war crimes case out. You have absolutely no proof the admin lied to go to war. That is a left ideology that has no legs to support it. If he knowingly lied about going to war, how come he isn't up on war crimes, or even members of his admin? Why isn't the new president going after the former admin? Since when has Arlen Spector been a conservative? Maybe a R but no conservative. He is really a poor example to use in this debate. The R party is dead rhetoric is hardly new, the D's were scrambling in \"00\" and \"04\". After Nixon everyone thought the R party was a thing of the past. I was one of those outraged at Bushes liberal spending policies, but does that make it OK for Obama to continue the trend? What will your excuse for Obama be if he spends us into a depression? You can only blame Bush for so long! All of these politicos were duped by Bush I guess? \"We begin with the common belief that Saddam Hussein is a tyrant and a threat to the peace and stability of the region. He has ignored the mandate of the United Nations and is building weapons of mass destruction and the means of delivering them.\" - Sen. Carl Levin (D, MI), September 19, 2002 \"We know that he has stored secret supplies of biological and chemical weapons throughout his country.\" - Al Gore, September 23, 2002 \"Iraq's search for weapons of mass destruction has proven impossible to deter and we should assume that it will continue for as long as Saddam is in power.\" - Al Gore, September 23, 2002 \"We have known for many years that Saddam Hussein is seeking and developing weapons of mass destruction.\" - Sen. Ted Kennedy (D, MA), September 27, 2002 \"The last UN weapons inspectors left Iraq in October of 1998. We are confident that Saddam Hussein retains some stockpiles of chemical and biological weapons, and that he has since embarked on a crash course to build up his chemical and biological warfare capabilities. Intelligence reports indicate that he is seeking nuclear weapons...\" - Sen. Robert Byrd (D, WV), October 3, 2002 \"I will be voting to give the President of the United States the authority to use force -- if necessary -- to disarm Saddam Hussein because I believe that a deadly arsenal of weapons of mass destruction in his hands is a real and grave threat to our security.\" - Sen. John F. Kerry (D, MA), October 9, 2002 \"There is unmistakable evidence that Saddam Hussein is working aggressively to develop nuclear weapons and will likely have nuclear weapons within the next five years ... We also should remember we have always underestimated the progress Saddam has made in development of weapons of mass destruction.\" - Sen. Jay Rockefeller (D, WV), October 10, 2002 \"In the four years since the inspectors left, intelligence reports show that Saddam Hussein has worked to rebuild his chemical and biological weapons stock, his missile delivery capability, and his nuclear program. He has also given aid, comfort, and sanctuary to terrorists, including al Qaeda members ... It is clear, however, that if left unchecked, Saddam Hussein will continue to increase his capacity to wage biological and chemical warfare, and will keep trying to develop nuclear weapons.\" - Sen. Hillary Clinton (D, NY), October 10, 2002 \"We are in possession of what I think to be compelling evidence that Saddam Hussein has, and has had for a number of years, a developing capacity for the production and storage of weapons of mass destruction.\" - Sen. Bob Graham (D, FL), December 8, 2002 \"Every day Saddam remains in power with chemical weapons, biological weapons, and the development of nuclear weapons is a day of danger for the United States.\" -Sen. Joseph Lieberman (D-CT) September 4, 2002 \"If we wait for the [Iraq] danger to become clear, it could be too late.\" -Sen. Joseph Biden (D-Del) September 4, 2002 \"Iraq both poses a continuing threat to the national security of the United States and international peace and security in the Persian Gulf region and remains in material and unacceptable breach of its international obligations by, among other things, continuing to possess and develop a significant chemical and biological weapons capability, actively seeking a nuclear weapons capability, and supporting and harboring terrorist organizations.\" -Sen. Hillary Clinton (D-NY) February 5, 2003 \"Without question, we need to disarm Saddam Hussein. He is a brutal, murderous dictator, leading an oppressive regime ... He presents a particularly grievous threat because he is so consistently prone to miscalculation ... And now he is miscalculating America's response to his continued deceit and his consistent grasp for weapons of mass destruction ... So the threat of Saddam Hussein with weapons of mass destruction is real...\" - Sen. John F. Kerry (D, MA), January 23. 2003 What about these quotes before Bush was even a thought? \"One way or the other, we are determined to deny Iraq the capacity to develop weapons of mass destruction and the missiles to deliver them. That is our bottom line.\" - President Bill Clinton, February 4, 1998 \"If Saddam rejects peace and we have to use force, our purpose is clear. We want to seriously diminish the threat posed by Iraq's weapons of mass destruction program.\" - President Bill Clinton, February 17, 1998 \"We must stop Saddam from ever again jeopardizing the stability and security of his neighbors with weapons of mass destruction.\" - Madeline Albright, February 1, 1998 \"He will use those weapons of mass destruction again, as he has ten times since 1983.\" - Sandy Berger, Clinton National Security Adviser, February 18, 1998 \"[W]e urge you, after consulting with Congress, and consistent with the U.S. Constitution and laws, to take necessary actions (including, if appropriate, air and missile strikes on suspect Iraqi sites) to respond effectively to the threat posed by Iraq's refusal to end its weapons of mass destruction programs.\" Letter to President Clinton. - (D) Senators Carl Levin, Tom Daschle, John Kerry, others, October 9, 1998 \"Saddam Hussein has been engaged in the development of weapons of mass destruction technology which is a threat to countries in the region and he has made a mockery of the weapons inspection process.\" - Rep. Nancy Pelosi (D, CA), December 16, 1998 \"Hussein has ... chosen to spend his money on building weapons of mass destruction and palaces for his cronies.\" - Madeline Albright, Clinton's Secretary of State, November 10, 1999 Excellent article. The left doesn't like to admit that they thought just like most Americans that Saddam had WMD and are ashamed to admit it. Everybody knows that Saddam didn't care about any UN laws or his people. He did what ever he wanted and that is just a fact of life.",
        "intTime": 20090429,
        "postID": 59,
        "quote": "Originally posted by ryerye13B: quote: quote: Originally posted by ryerye13B: \"but decided somewhere along the line that it would be far more fun (if not oil-licious) to go for an uninvited visit into Iraq.\" Ah yes the lefts favorite tag-line, \"war for oil\", kinda like \"Bush let the Bin Ladens leave on Sept 11th, the only flight out.\" Let us not forget that all of our favorite Dems jumped on board for this excursion, funny how when the political winds changed those same Dems jumped ship. I wonder if people will still be singing the presidents praise when this country is so far in debt, because of his outta control spending, our great great grandchildren will be picking up the tab? Please spare me the \"Bush did it\" argument, I'm no Bush apologist or supporter so if you reply with this argument it falls on deaf ears! I am fully aware of what Bush did! And Yes he is making the same mistakes as Hoover and FDR! Carbon Tax anyone? Maybe another trillion to those who are mostly responsible for this mess will turn it around? Bill-Fold while your learning a few their history please include how we, as a country, recovered from the depression? I'll give ya a hint WWII. This recession is not worse than the Great Depression, at least not yet! Obama is just another politician. The Dems jumped aboard that excursion because they were carefully fed highly focused, bogus, biased, cooked, and otherwise highly suspect intelligence from sources the administration were warned to be pathologically dishonest by our allies intelligence agencies (and in a number of notable cases, our own CIA). No one has better access to intelligence than the White House, and they deliberately manipulated the facts to get congress to approve actions when they had already decided to go to war. Note that the political winds didn't change w/r/t Iraq until a number of events occurred: 1. The depth of outright incompetence that became the trademark of the Bush Administration became apparent. 2. The quantities of lies told by the administration to all that would listen to goad the nation into accepting war were realized. 3. Virtually none of the major reasons for going to war turned out to be true (note how many times the reasons changed). Were you one of the complainers when G W Bush couldn't find a spending bill too outrageous to veto for the first 6 years of his lamentable administration? I was!!! It took the democrats finally taking over the agenda (with too small of a majority to have any other power) to create a budget that he would veto. Now that 8 years of horrify incompetence have left our nation but a shell of what it used to be, now the republicans finally start complaining about the budget. Its too late for them. They have all but evaporated as a party and now resort to buffoonery when attempting to argue a point. As an example, look at the 18-page alternative budget they came up with: it is 99.999% content free for your protection, with nary a single digit referencing dollars throughout. At least they provide some comic relief... But even Arlen Spector has had enough: He is about to announce that he is resigning his republican affiliation to become a member of the democratic party. It is reported that the republican party has swung so far to the right that it is now the wrong party for him. Alright where to begin? So basically what your telling me is the the Dems are so incompetant they didn't question the admin? If so, why do people continue to support these same people? If I could provide links I could show you the list of Dem supporters that also believed there were WMD, a former president who made a speach declaring Iraq had WMD. This was also believed by numerous intelligence agencies across the globe, the UK being just 1, did Bush cook up some grand conspiracy and get these other countries on board with us and his war? Doubtful, it might just be that everyone actually thought he had WMD. Please provide the proof that the WH or the admin deliberatly manipulated the facts. If he lied as you say how come no court has proven this or even taken up the case? A Spanish judge just threw a war crimes case out. You have absolutely no proof the admin lied to go to war. That is a left ideology that has no legs to support it. If he knowingly lied about going to war, how come he isn't up on war crimes, or even members of his admin? Why isn't the new president going after the former admin? Since when has Arlen Spector been a conservative? Maybe a R but no conservative. He is really a poor example to use in this debate. The R party is dead rhetoric is hardly new, the D's were scrambling in \"00\" and \"04\". After Nixon everyone thought the R party was a thing of the past. I was one of those outraged at Bushes liberal spending policies, but does that make it OK for Obama to continue the trend? What will your excuse for Obama be if he spends us into a depression? You can only blame Bush for so long! All of these politicos were duped by Bush I guess? \"We begin with the common belief that Saddam Hussein is a tyrant and a threat to the peace and stability of the region. He has ignored the mandate of the United Nations and is building weapons of mass destruction and the means of delivering them.\" - Sen. Carl Levin (D, MI), September 19, 2002 \"We know that he has stored secret supplies of biological and chemical weapons throughout his country.\" - Al Gore, September 23, 2002 \"Iraq's search for weapons of mass destruction has proven impossible to deter and we should assume that it will continue for as long as Saddam is in power.\" - Al Gore, September 23, 2002 \"We have known for many years that Saddam Hussein is seeking and developing weapons of mass destruction.\" - Sen. Ted Kennedy (D, MA), September 27, 2002 \"The last UN weapons inspectors left Iraq in October of 1998. We are confident that Saddam Hussein retains some stockpiles of chemical and biological weapons, and that he has since embarked on a crash course to build up his chemical and biological warfare capabilities. Intelligence reports indicate that he is seeking nuclear weapons...\" - Sen. Robert Byrd (D, WV), October 3, 2002 \"I will be voting to give the President of the United States the authority to use force -- if necessary -- to disarm Saddam Hussein because I believe that a deadly arsenal of weapons of mass destruction in his hands is a real and grave threat to our security.\" - Sen. John F. Kerry (D, MA), October 9, 2002 \"There is unmistakable evidence that Saddam Hussein is working aggressively to develop nuclear weapons and will likely have nuclear weapons within the next five years ... We also should remember we have always underestimated the progress Saddam has made in development of weapons of mass destruction.\" - Sen. Jay Rockefeller (D, WV), October 10, 2002 \"In the four years since the inspectors left, intelligence reports show that Saddam Hussein has worked to rebuild his chemical and biological weapons stock, his missile delivery capability, and his nuclear program. He has also given aid, comfort, and sanctuary to terrorists, including al Qaeda members ... It is clear, however, that if left unchecked, Saddam Hussein will continue to increase his capacity to wage biological and chemical warfare, and will keep trying to develop nuclear weapons.\" - Sen. Hillary Clinton (D, NY), October 10, 2002 \"We are in possession of what I think to be compelling evidence that Saddam Hussein has, and has had for a number of years, a developing capacity for the production and storage of weapons of mass destruction.\" - Sen. Bob Graham (D, FL), December 8, 2002 \"Every day Saddam remains in power with chemical weapons, biological weapons, and the development of nuclear weapons is a day of danger for the United States.\" -Sen. Joseph Lieberman (D-CT) September 4, 2002 \"If we wait for the [Iraq] danger to become clear, it could be too late.\" -Sen. Joseph Biden (D-Del) September 4, 2002 \"Iraq both poses a continuing threat to the national security of the United States and international peace and security in the Persian Gulf region and remains in material and unacceptable breach of its international obligations by, among other things, continuing to possess and develop a significant chemical and biological weapons capability, actively seeking a nuclear weapons capability, and supporting and harboring terrorist organizations.\" -Sen. Hillary Clinton (D-NY) February 5, 2003 \"Without question, we need to disarm Saddam Hussein. He is a brutal, murderous dictator, leading an oppressive regime ... He presents a particularly grievous threat because he is so consistently prone to miscalculation ... And now he is miscalculating America's response to his continued deceit and his consistent grasp for weapons of mass destruction ... So the threat of Saddam Hussein with weapons of mass destruction is real...\" - Sen. John F. Kerry (D, MA), January 23. 2003 What about these quotes before Bush was even a thought? \"One way or the other, we are determined to deny Iraq the capacity to develop weapons of mass destruction and the missiles to deliver them. That is our bottom line.\" - President Bill Clinton, February 4, 1998 \"If Saddam rejects peace and we have to use force, our purpose is clear. We want to seriously diminish the threat posed by Iraq's weapons of mass destruction program.\" - President Bill Clinton, February 17, 1998 \"We must stop Saddam from ever again jeopardizing the stability and security of his neighbors with weapons of mass destruction.\" - Madeline Albright, February 1, 1998 \"He will use those weapons of mass destruction again, as he has ten times since 1983.\" - Sandy Berger, Clinton National Security Adviser, February 18, 1998 \"[W]e urge you, after consulting with Congress, and consistent with the U.S. Constitution and laws, to take necessary actions (including, if appropriate, air and missile strikes on suspect Iraqi sites) to respond effectively to the threat posed by Iraq's refusal to end its weapons of mass destruction programs.\" Letter to President Clinton. - (D) Senators Carl Levin, Tom Daschle, John Kerry, others, October 9, 1998 \"Saddam Hussein has been engaged in the development of weapons of mass destruction technology which is a threat to countries in the region and he has made a mockery of the weapons inspection process.\" - Rep. Nancy Pelosi (D, CA), December 16, 1998 \"Hussein has ... chosen to spend his money on building weapons of mass destruction and palaces for his cronies.\" - Madeline Albright, Clinton's Secretary of State, November 10, 1999",
        "reply": " Excellent article. The left doesn't like to admit that they thought just like most Americans that Saddam had WMD and are ashamed to admit it. Everybody knows that Saddam didn't care about any UN laws or his people. He did what ever he wanted and that is just a fact of life.",
        "threadID": "6960020520001_3260049122001",
        "time": "2009-04-29 07:45:00",
        "title": "A Mixed Record in the First 100 Days",
        "userID": "3529237"
    },
    {
        "content": "quote: Originally posted by LouieSuzara: quote: Plus now Obama has the new Democrat Senator Specter Great freaking news, finally he got the nerve to come out of the closet, what a political cross dresser he is. Good riddance flip flopper!! I agree.",
        "intTime": 20090429,
        "postID": 60,
        "quote": "Originally posted by LouieSuzara: quote: Plus now Obama has the new Democrat Senator Specter Great freaking news, finally he got the nerve to come out of the closet, what a political cross dresser he is. Good riddance flip flopper!!",
        "reply": " I agree.",
        "threadID": "6960020520001_3260049122001",
        "time": "2009-04-29 07:56:00",
        "title": "A Mixed Record in the First 100 Days",
        "userID": "3529237"
    }
]