[
    {
        "content": "RE: http://www.military.com/opinion/0,15202,190336,00.html quote: Neo-conservatives used the Republican Party as a vehicle to promote and employ their policies of muscular nation-building overseas. But like the parasite that eventually kills its host, the Republican Party's virtual collapse, in large part because of the failed nation-building adventure in Iraq, has left neo-conservatives discredited and facing policy extinction. Unfortunately, neo-conservatism will probably live on by changing hosts. There are many reasons for the neoconservative/republican collapse - and the invasion of Iraq is only a part of it (albeit a blunder of historical/notable merit). The neoconservatives share some thimgs in common with both traditional republicans and democrats: but they also share many notable policies that have more in common with facism (at least the policies that have been championed by Peter Brooks, Ollie North, and Frank Gaffney, for starters). The neoconservatives took over the republican party in name, because they lack the courage to call themselves what they really are (probably because that would be a certain election losing prospect). However, there was also a large number of dirty tricks, abuses of power, crimes committed, careers destroyed, and corruption that was tolerated if not condoned by the inaction of the republican run houses of representatives during the first 6 years of the administration. Much of which might've been forgiven IF the Bush Administrations policies had turned out to be wildly successful (or for that matter, moderately). But alas - those policies were historic failures. quote: Ironically, today, the Republican Party, which once had hopes of becoming the majority party in the country, has followed George W. Bush over a cliff and has once again been reduced to largely a regional party of the old South and a few other conservative states. As long as Democrats in more libertarian mountain states stand up for gun rights, most states in that entire region are ripe for permanent status in the Democratic column. The most telling moment in the 2008 election was when Arizona, the Republican nominee's home state, was too close to call. It would have gone Democratic had a native son not been running. The republican party did achieve the status of majority - but they became so drunk with power that they failed to live up to their former principals, failed to curb the excesses of their president (and some of those within thier party), and thereby failed the American people. The party that used to stand for fiscal conservatism, personal liberty, health care, rule of law, small and effective government, and the environment opted instead to stand behind phoney issues like \"family values\", using mendacity as a basis of governance, divisiveness, and trying to win campaigns by claiming that the other guy is scarier than they are. The evidence is obvious: what they sold the American people was not what was delivered. Americans aren't quite as stupid as the remaining (what passes for) republicans think: They looked at the state of the country inherited left behind by W J Clinton, and compared that to the state of the country left behind by G W Bush. The results were/are not flattering. Ever since the election republicans/neoconservatives have been attempting to blame the problems they created on the democrats and the mean old \"liberal media\". It is notable that it isn't only the press in the United States that considers the administration of G W Bush (and therefore, the neconservatives and republicans as well) to be the worst in the past century: it is the overwhelming opinion of the worlds press regardless of friend or foe, liberal or conservative. And what are the republican's doing now? Moving even further to the fringe... This is most unfortunate, because reducing the republican party to the role of buffoon when the country needs a healthy (and rational) opposition isn't a good thing.",
        "intTime": 20090505,
        "postID": 1,
        "quote": "Neo-conservatives used the Republican Party as a vehicle to promote and employ their policies of muscular nation-building overseas. But like the parasite that eventually kills its host, the Republican Party's virtual collapse, in large part because of the failed nation-building adventure in Iraq, has left neo-conservatives discredited and facing policy extinction. Unfortunately, neo-conservatism will probably live on by changing hosts.",
        "reply": "RE: http://www.military.com/opinion/0,15202,190336,00.html  There are many reasons for the neoconservative/republican collapse - and the invasion of Iraq is only a part of it (albeit a blunder of historical/notable merit). The neoconservatives share some thimgs in common with both traditional republicans and democrats: but they also share many notable policies that have more in common with facism (at least the policies that have been championed by Peter Brooks, Ollie North, and Frank Gaffney, for starters). The neoconservatives took over the republican party in name, because they lack the courage to call themselves what they really are (probably because that would be a certain election losing prospect). However, there was also a large number of dirty tricks, abuses of power, crimes committed, careers destroyed, and corruption that was tolerated if not condoned by the inaction of the republican run houses of representatives during the first 6 years of the administration. Much of which might've been forgiven IF the Bush Administrations policies had turned out to be wildly successful (or for that matter, moderately). But alas - those policies were historic failures. quote: Ironically, today, the Republican Party, which once had hopes of becoming the majority party in the country, has followed George W. Bush over a cliff and has once again been reduced to largely a regional party of the old South and a few other conservative states. As long as Democrats in more libertarian mountain states stand up for gun rights, most states in that entire region are ripe for permanent status in the Democratic column. The most telling moment in the 2008 election was when Arizona, the Republican nominee's home state, was too close to call. It would have gone Democratic had a native son not been running. The republican party did achieve the status of majority - but they became so drunk with power that they failed to live up to their former principals, failed to curb the excesses of their president (and some of those within thier party), and thereby failed the American people. The party that used to stand for fiscal conservatism, personal liberty, health care, rule of law, small and effective government, and the environment opted instead to stand behind phoney issues like \"family values\", using mendacity as a basis of governance, divisiveness, and trying to win campaigns by claiming that the other guy is scarier than they are. The evidence is obvious: what they sold the American people was not what was delivered. Americans aren't quite as stupid as the remaining (what passes for) republicans think: They looked at the state of the country inherited left behind by W J Clinton, and compared that to the state of the country left behind by G W Bush. The results were/are not flattering. Ever since the election republicans/neoconservatives have been attempting to blame the problems they created on the democrats and the mean old \"liberal media\". It is notable that it isn't only the press in the United States that considers the administration of G W Bush (and therefore, the neconservatives and republicans as well) to be the worst in the past century: it is the overwhelming opinion of the worlds press regardless of friend or foe, liberal or conservative. And what are the republican's doing now? Moving even further to the fringe... This is most unfortunate, because reducing the republican party to the role of buffoon when the country needs a healthy (and rational) opposition isn't a good thing.",
        "threadID": "6960020520001_8220055222001",
        "time": "2009-05-05 09:46:00",
        "title": "Stake through the heart???",
        "userID": "PolicyWonk"
    },
    {
        "content": "I'm so sorry that I'm so naive to think the very idea of a political party trying to run this country is assine and ignorant. I thought that instead or it being my party right or wrong, it was suppose to be \"my country- right or wrong!\" I don't vote for parties to represent me- I voted for the best man for the position regardless of party. I voted for people I thought would put the nation 1st- my state 2d, us 3-d and themselves last, w/o the party ever being on the list. Maybe if they stopped putting the Party's agenda first and moved to do what their voters thought was best for the nation- thing would work better!To hell with the schisms! and up with the US and majority rule with safeguards for all minorities!",
        "intTime": 20090505,
        "postID": 2,
        "quote": "",
        "reply": "I'm so sorry that I'm so naive to think the very idea of a political party trying to run this country is assine and ignorant. I thought that instead or it being my party right or wrong, it was suppose to be \"my country- right or wrong!\" I don't vote for parties to represent me- I voted for the best man for the position regardless of party. I voted for people I thought would put the nation 1st- my state 2d, us 3-d and themselves last, w/o the party ever being on the list. Maybe if they stopped putting the Party's agenda first and moved to do what their voters thought was best for the nation- thing would work better!To hell with the schisms! and up with the US and majority rule with safeguards for all minorities!",
        "threadID": "6960020520001_8220055222001",
        "time": "2009-05-05 10:11:00",
        "title": "Stake through the heart???",
        "userID": "lovatscot"
    },
    {
        "content": "Excellent piece by Mr. Eland. Excellent elaboration by PolicyWonk. Excellent point by lovatscot about political parties. Mr. Eland's caution that the parasitic neoconservative movement might infect the Democrats should be headed.",
        "intTime": 20090505,
        "postID": 3,
        "quote": "",
        "reply": "Excellent piece by Mr. Eland. Excellent elaboration by PolicyWonk. Excellent point by lovatscot about political parties. Mr. Eland's caution that the parasitic neoconservative movement might infect the Democrats should be headed.",
        "threadID": "6960020520001_8220055222001",
        "time": "2009-05-05 11:14:00",
        "title": "Stake through the heart???",
        "userID": "bwf27"
    },
    {
        "content": "Policy wonk article - the average American does not sucsribe or care about the \"inside the Beltway\" article. Not even a good article for this posting.",
        "intTime": 20090505,
        "postID": 4,
        "quote": "",
        "reply": "Policy wonk article - the average American does not sucsribe or care about the \"inside the Beltway\" article. Not even a good article for this posting.",
        "threadID": "6960020520001_8220055222001",
        "time": "2009-05-05 12:05:00",
        "title": "Stake through the heart???",
        "userID": "Young57"
    },
    {
        "content": "Collapse? really? From what evidence? What, because we have a Dem majority in Congress and one in the WH? Seems to me we had a Rep majority Congress and one in the WH in '04... were the Dems in danger of collapsing then? Policywonk, you make an interesting observation about the Reps getting drunk on power and leaving behind their policies of fiscal conservatism, etc... and most conservatives would readily agree, but doesn't that also say that they were booted out of power because the people still believe in what they originally voted them into office for? If so, how is the current Dem controlled government doing anything different to sway those people? We all know that Obama ran as those things, but we are seeing him doing the opposite or leaving many promises by the wayside. The so called stimulus package and a budget nearly twice as large as anything Bush ever proposed certainly does not fall under \"fiscal responsibility\", he says he is for \"lean\" government but continues to expand it (or at least make proposals that will)... maybe he feels government is under weight? I get your point that the U.S. shouldn't walk around like the big bad bulldog on the block picking fights, but I think a rational argument can be made that this admin has pulled so far back from being the bulldog, that we're more like the dog who rolls over and exposes his belly when anyone else comes by. I don't want to get bogged down in finger pointing, name calling etc etc that these boards seemed to always devolve into when I left before, but if the fringe neo-cons took over the Rep party, can you honestly say that the fringe leftists have not done the same with the Dem party? And if you do agree, won't the Dems be in the same position in 4 or 8 years?",
        "intTime": 20090505,
        "postID": 5,
        "quote": "",
        "reply": "Collapse? really? From what evidence? What, because we have a Dem majority in Congress and one in the WH? Seems to me we had a Rep majority Congress and one in the WH in '04... were the Dems in danger of collapsing then? Policywonk, you make an interesting observation about the Reps getting drunk on power and leaving behind their policies of fiscal conservatism, etc... and most conservatives would readily agree, but doesn't that also say that they were booted out of power because the people still believe in what they originally voted them into office for? If so, how is the current Dem controlled government doing anything different to sway those people? We all know that Obama ran as those things, but we are seeing him doing the opposite or leaving many promises by the wayside. The so called stimulus package and a budget nearly twice as large as anything Bush ever proposed certainly does not fall under \"fiscal responsibility\", he says he is for \"lean\" government but continues to expand it (or at least make proposals that will)... maybe he feels government is under weight? I get your point that the U.S. shouldn't walk around like the big bad bulldog on the block picking fights, but I think a rational argument can be made that this admin has pulled so far back from being the bulldog, that we're more like the dog who rolls over and exposes his belly when anyone else comes by. I don't want to get bogged down in finger pointing, name calling etc etc that these boards seemed to always devolve into when I left before, but if the fringe neo-cons took over the Rep party, can you honestly say that the fringe leftists have not done the same with the Dem party? And if you do agree, won't the Dems be in the same position in 4 or 8 years?",
        "threadID": "6960020520001_8220055222001",
        "time": "2009-05-05 13:15:00",
        "title": "Stake through the heart???",
        "userID": "DevilDog2847"
    },
    {
        "content": "quote: Policywonk, you make an interesting observation about the Reps getting drunk on power and leaving behind their policies of fiscal conservatism, etc... and most conservatives would readily agree, but doesn't that also say that they were booted out of power because the people still believe in what they originally voted them into office for? Indeed it does - but what I'm saying is that if the republicans don't shed the neoconservatives (and ill-concieved policies) that polluted their party and platform: then they are well on their way to irrellevence. quote: If so, how is the current Dem controlled government doing anything different to sway those people? We all know that Obama ran as those things, but we are seeing him doing the opposite or leaving many promises by the wayside. The government in power now has only been in for just over 100 days, and got elected because the republicans caused so much damage to the country that the people felt it was time for them to go. Note also, that President Obama's popularity ratings are really pretty high: most people approve of his performance (well over 60%). People are also cognizant of the horrifying state of the nation left behind by his predecessor (and his party). They know that the job of POTUS is the toughest job on the planet in the best of times, but this isn't the best of times (to the contrary). He simply cannot do everything in 100 days. What gets me, is how the neoconservatives/republicans had such low expectations for presidential peformance just 5 short months ago, but now the bar is so high God Himself couldn't make the grade. quote: The so called stimulus package and a budget nearly twice as large as anything Bush ever proposed certainly does not fall under \"fiscal responsibility\", he says he is for \"lean\" government but continues to expand it (or at least make proposals that will)... maybe he feels government is under weight? You are right that the stimulous package is huge. There are economists that say it isn't big enough! There is a lot of damage to undo, but there are also considerable investments in energy, infrastructure, and education included. What is interesting though, is that when Obama went to work (with the transition team), they started planning how to do it and roll it out immeidately after the election was over. As the aspects of the plan started getting rolled out (at first), a lot of people weren't too happy. But as other parts of the plan started coming out and people started to see how it all fit together, they have become a lot more comfortable. quote: I get your point that the U.S. shouldn't walk around like the big bad bulldog on the block picking fights, but I think a rational argument can be made that this admin has pulled so far back from being the bulldog, that we're more like the dog who rolls over and exposes his belly when anyone else comes by. Still too eary to tell - but I don't think this president is an idiot. He has a much better understanding of American power and its limits (thats the drift I get from my friends in the general staff: it is reported that he actually listens to the senior commanders very carefully). The previous guy didn't understand either the limits or proper use of American power (diplomatic or military), and it would've served him well to take some advice from Don Corleane (i.e. \"The Godfather\"): \"Keep your friends - keep you enemies closer...\". quote: I don't want to get bogged down in finger pointing, name calling etc etc that these boards seemed to always devolve into when I left before, but if the fringe neo-cons took over the Rep party, can you honestly say that the fringe leftists have not done the same with the Dem party? And if you do agree, won't the Dems be in the same position in 4 or 8 years? I for one hope that the hard-core lefties haven't taken over: I think this president is smarter than that (and I hope I'm not wrong!). Whats kind of weird is that the democrats have largely moved to the center and the republicans have moved so far to the right that they are almost putting themselves out of business (hence the premise of this article). For me personally, if something happens (heaven forbid) to both Obama and Biden, thereby making Nancy Pelosi president: maybe then its time to leave the country. Cheers. Cheers.",
        "intTime": 20090505,
        "postID": 6,
        "quote": "Policywonk, you make an interesting observation about the Reps getting drunk on power and leaving behind their policies of fiscal conservatism, etc... and most conservatives would readily agree, but doesn't that also say that they were booted out of power because the people still believe in what they originally voted them into office for?",
        "reply": " Indeed it does - but what I'm saying is that if the republicans don't shed the neoconservatives (and ill-concieved policies) that polluted their party and platform: then they are well on their way to irrellevence. quote: If so, how is the current Dem controlled government doing anything different to sway those people? We all know that Obama ran as those things, but we are seeing him doing the opposite or leaving many promises by the wayside. The government in power now has only been in for just over 100 days, and got elected because the republicans caused so much damage to the country that the people felt it was time for them to go. Note also, that President Obama's popularity ratings are really pretty high: most people approve of his performance (well over 60%). People are also cognizant of the horrifying state of the nation left behind by his predecessor (and his party). They know that the job of POTUS is the toughest job on the planet in the best of times, but this isn't the best of times (to the contrary). He simply cannot do everything in 100 days. What gets me, is how the neoconservatives/republicans had such low expectations for presidential peformance just 5 short months ago, but now the bar is so high God Himself couldn't make the grade. quote: The so called stimulus package and a budget nearly twice as large as anything Bush ever proposed certainly does not fall under \"fiscal responsibility\", he says he is for \"lean\" government but continues to expand it (or at least make proposals that will)... maybe he feels government is under weight? You are right that the stimulous package is huge. There are economists that say it isn't big enough! There is a lot of damage to undo, but there are also considerable investments in energy, infrastructure, and education included. What is interesting though, is that when Obama went to work (with the transition team), they started planning how to do it and roll it out immeidately after the election was over. As the aspects of the plan started getting rolled out (at first), a lot of people weren't too happy. But as other parts of the plan started coming out and people started to see how it all fit together, they have become a lot more comfortable. quote: I get your point that the U.S. shouldn't walk around like the big bad bulldog on the block picking fights, but I think a rational argument can be made that this admin has pulled so far back from being the bulldog, that we're more like the dog who rolls over and exposes his belly when anyone else comes by. Still too eary to tell - but I don't think this president is an idiot. He has a much better understanding of American power and its limits (thats the drift I get from my friends in the general staff: it is reported that he actually listens to the senior commanders very carefully). The previous guy didn't understand either the limits or proper use of American power (diplomatic or military), and it would've served him well to take some advice from Don Corleane (i.e. \"The Godfather\"): \"Keep your friends - keep you enemies closer...\". quote: I don't want to get bogged down in finger pointing, name calling etc etc that these boards seemed to always devolve into when I left before, but if the fringe neo-cons took over the Rep party, can you honestly say that the fringe leftists have not done the same with the Dem party? And if you do agree, won't the Dems be in the same position in 4 or 8 years? I for one hope that the hard-core lefties haven't taken over: I think this president is smarter than that (and I hope I'm not wrong!). Whats kind of weird is that the democrats have largely moved to the center and the republicans have moved so far to the right that they are almost putting themselves out of business (hence the premise of this article). For me personally, if something happens (heaven forbid) to both Obama and Biden, thereby making Nancy Pelosi president: maybe then its time to leave the country. Cheers. Cheers.",
        "threadID": "6960020520001_8220055222001",
        "time": "2009-05-05 13:54:00",
        "title": "Stake through the heart???",
        "userID": "PolicyWonk"
    },
    {
        "content": "wonk quote: The republican party did achieve the status of majority - but they became so drunk with power that they failed to live up to their former principals, failed to curb the excesses of their president (and some of those within thier party), and thereby failed the American people. The party that used to stand for fiscal conservatism, personal liberty, health care, rule of law, small and effective government, and the environment opted instead to stand behind phoney issues like \"family values ect. XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX It would be naive to think that party doesnt stand for those principals now... just that the jack-asses that did not represent the grassroots of the republican party are now gone..or on their way out. Core values will never change, thats human behavior. There will be a huge recoil from the current spending that is going on. Once this nation is out of money, hopefully everyone is voted out; and fundamental changes come into government (like term limits). Government (Reps & Dems) are just as much to blame as the corportations & the US consumer for the problems we face now.",
        "intTime": 20090505,
        "postID": 7,
        "quote": "The republican party did achieve the status of majority - but they became so drunk with power that they failed to live up to their former principals, failed to curb the excesses of their president (and some of those within thier party), and thereby failed the American people. The party that used to stand for fiscal conservatism, personal liberty, health care, rule of law, small and effective government, and the environment opted instead to stand behind phoney issues like \"family values",
        "reply": "wonk  ect. XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX It would be naive to think that party doesnt stand for those principals now... just that the jack-asses that did not represent the grassroots of the republican party are now gone..or on their way out. Core values will never change, thats human behavior. There will be a huge recoil from the current spending that is going on. Once this nation is out of money, hopefully everyone is voted out; and fundamental changes come into government (like term limits). Government (Reps & Dems) are just as much to blame as the corportations & the US consumer for the problems we face now.",
        "threadID": "6960020520001_8220055222001",
        "time": "2009-05-05 17:53:00",
        "title": "Stake through the heart???",
        "userID": "puresalt01"
    },
    {
        "content": "Look at history, Iraq and Afghanistan are resounding successes. No other time in history have countries re-established themselves so swiftly. And remember Rome was not built in a day.",
        "intTime": 20090505,
        "postID": 8,
        "quote": "",
        "reply": "Look at history, Iraq and Afghanistan are resounding successes. No other time in history have countries re-established themselves so swiftly. And remember Rome was not built in a day.",
        "threadID": "6960020520001_8220055222001",
        "time": "2009-05-05 21:08:00",
        "title": "Stake through the heart???",
        "userID": "somethintobraggabout"
    },
    {
        "content": "I don't believe that Obama or anyone, including Bush, who rises to such a level is genuinely stupid. I think Obama's biggest 100 day accomplishment is that he does seem to be getting a better handle on the concept of the Office of the President, but I think a solid argument can be made that with everything he's put his hands in, he's gotten himself in the deep end of the pool a little too soon. I'd go into examples but I think it would stray off topic... I think what needs to be cleared up is what \"extreme conservatism\" really means. Remember, according to the Left, and I guess lately Homeland Security, all those things that Republicans left behind in the \"drunkeness of power\" is considered extreme: strong national defense, personal liberty, low taxes, SMALL government, states rights, etc. The author supposes that the Rep party will collapse, but what he doesn't point out is that the our politicians are too intrenched in the two party system to allow it to happen. There is no way that the Dems would allow it to happen because they will not risk the Reps desolving and a new \"common man, grass roots\" party kicking them out of power which is what it would do. Same goes if the situation was reversed. Between '00 and '04 the Reps could have broken the Dems back, but didn't. If the Rep party DOES go the way of the Dodo, it won't be because the vast majority of the country is center left or liberal. It will be because of a largely uneducated or as we see more and more in our public schools, miseducated populace. A lot of the core principals PolicyWonk mentioned are taken straight from the Constitution. People today by and large do not understand the importance of things like states rights, fair taxation, or the the relevance of the Constitution and the process to begin with. Americans sadly enough have short memories and our culture is about instant gratification. Many Americans in the moment say \"Yes! Government needs to step in and regulate the evil countries as much as possible\" forgetting that government interference to such a large degree is not what has been succesful for this country for 250years. I don't believe Obama is stupid at all. I really do believe he knows and believes in what he is trying to accomplish. I just don't think it has become clear to the public at large what his true intentions are.",
        "intTime": 20090506,
        "postID": 9,
        "quote": "",
        "reply": "I don't believe that Obama or anyone, including Bush, who rises to such a level is genuinely stupid. I think Obama's biggest 100 day accomplishment is that he does seem to be getting a better handle on the concept of the Office of the President, but I think a solid argument can be made that with everything he's put his hands in, he's gotten himself in the deep end of the pool a little too soon. I'd go into examples but I think it would stray off topic... I think what needs to be cleared up is what \"extreme conservatism\" really means. Remember, according to the Left, and I guess lately Homeland Security, all those things that Republicans left behind in the \"drunkeness of power\" is considered extreme: strong national defense, personal liberty, low taxes, SMALL government, states rights, etc. The author supposes that the Rep party will collapse, but what he doesn't point out is that the our politicians are too intrenched in the two party system to allow it to happen. There is no way that the Dems would allow it to happen because they will not risk the Reps desolving and a new \"common man, grass roots\" party kicking them out of power which is what it would do. Same goes if the situation was reversed. Between '00 and '04 the Reps could have broken the Dems back, but didn't. If the Rep party DOES go the way of the Dodo, it won't be because the vast majority of the country is center left or liberal. It will be because of a largely uneducated or as we see more and more in our public schools, miseducated populace. A lot of the core principals PolicyWonk mentioned are taken straight from the Constitution. People today by and large do not understand the importance of things like states rights, fair taxation, or the the relevance of the Constitution and the process to begin with. Americans sadly enough have short memories and our culture is about instant gratification. Many Americans in the moment say \"Yes! Government needs to step in and regulate the evil countries as much as possible\" forgetting that government interference to such a large degree is not what has been succesful for this country for 250years. I don't believe Obama is stupid at all. I really do believe he knows and believes in what he is trying to accomplish. I just don't think it has become clear to the public at large what his true intentions are.",
        "threadID": "6960020520001_8220055222001",
        "time": "2009-05-06 07:16:00",
        "title": "Stake through the heart???",
        "userID": "DevilDog2847"
    },
    {
        "content": "Terrible article. I love how the word neocon became so popular with the looney left. It gave them an opportunity to use a word that was associated with Liberal Dumbocrats for a while now. The only thing the Republicans need to is to be actual conservatives which means Strong defense, pro life, pro capitalism, free market economy, limit the role of the federal government and give more local control, strong and relevant border security to stop the illegal flow of Mexicans, tax breaks and tax credits and project a positive and moral direction worldview for our country. Obama and his administration are the direct opposite of what was just described. To project that waht is wrong with the Republican party is that they are not a big tent party is another hypocrisy of the looney left. Where are all the pro life speakers at Democrat Conventions? Where are all the second amendment speeches given from a Dumbocrat? Do the Dumbocrats support or fight the NRA? Why does this administration have people in place that call patriotic christians and veterans and as right wing extremists who could be a terrorist threat? Why does this administration seek to publish pictures of Guantanomo yet hides pictures of Air Force One terrorizing New Yorkers? Why did Obama lie about earmarks and having full disclosure on all bills? Why do Democrats continually look to be the torch bearers for constitutional rights of detainees and yet seek to silence Christians and Conservatives who are US citizens via a new Fairness Doctrine. Why did Bill Clinton refuse to take Bin Laden every time he had the chance? Why did he turn a blind military eye to attacks on the US embassies in Kenya and Tanzania, the USS Cole and the 1993 WTC bombing? Why not an article about all that? Yet we start from the premise that this all started on 9/11 and Bush's reaction to a world wide threat. Unbeleivable.",
        "intTime": 20090506,
        "postID": 10,
        "quote": "",
        "reply": "Terrible article. I love how the word neocon became so popular with the looney left. It gave them an opportunity to use a word that was associated with Liberal Dumbocrats for a while now. The only thing the Republicans need to is to be actual conservatives which means Strong defense, pro life, pro capitalism, free market economy, limit the role of the federal government and give more local control, strong and relevant border security to stop the illegal flow of Mexicans, tax breaks and tax credits and project a positive and moral direction worldview for our country. Obama and his administration are the direct opposite of what was just described. To project that waht is wrong with the Republican party is that they are not a big tent party is another hypocrisy of the looney left. Where are all the pro life speakers at Democrat Conventions? Where are all the second amendment speeches given from a Dumbocrat? Do the Dumbocrats support or fight the NRA? Why does this administration have people in place that call patriotic christians and veterans and as right wing extremists who could be a terrorist threat? Why does this administration seek to publish pictures of Guantanomo yet hides pictures of Air Force One terrorizing New Yorkers? Why did Obama lie about earmarks and having full disclosure on all bills? Why do Democrats continually look to be the torch bearers for constitutional rights of detainees and yet seek to silence Christians and Conservatives who are US citizens via a new Fairness Doctrine. Why did Bill Clinton refuse to take Bin Laden every time he had the chance? Why did he turn a blind military eye to attacks on the US embassies in Kenya and Tanzania, the USS Cole and the 1993 WTC bombing? Why not an article about all that? Yet we start from the premise that this all started on 9/11 and Bush's reaction to a world wide threat. Unbeleivable.",
        "threadID": "6960020520001_8220055222001",
        "time": "2009-05-06 10:32:00",
        "title": "Stake through the heart???",
        "userID": "tobdrue69"
    },
    {
        "content": "quote: Originally posted by tobdrue69: Terrible article. I love how the word neocon became so popular with the looney left. It gave them an opportunity to use a word that was associated with Liberal Dumbocrats for a while now. The only thing the Republicans need to is to be actual conservatives which means Strong defense, pro life, pro capitalism, free market economy, limit the role of the federal government and give more local control, strong and relevant border security to stop the illegal flow of Mexicans, tax breaks and tax credits and project a positive and moral direction worldview for our country. Obama and his administration are the direct opposite of what was just described. To project that waht is wrong with the Republican party is that they are not a big tent party is another hypocrisy of the looney left. Where are all the pro life speakers at Democrat Conventions? Where are all the second amendment speeches given from a Dumbocrat? Do the Dumbocrats support or fight the NRA? Why does this administration have people in place that call patriotic christians and veterans and as right wing extremists who could be a terrorist threat? Why does this administration seek to publish pictures of Guantanomo yet hides pictures of Air Force One terrorizing New Yorkers? Why did Obama lie about earmarks and having full disclosure on all bills? Why do Democrats continually look to be the torch bearers for constitutional rights of detainees and yet seek to silence Christians and Conservatives who are US citizens via a new Fairness Doctrine. Why did Bill Clinton refuse to take Bin Laden every time he had the chance? Why did he turn a blind military eye to attacks on the US embassies in Kenya and Tanzania, the USS Cole and the 1993 WTC bombing? Why not an article about all that? Yet we start from the premise that this all started on 9/11 and Bush's reaction to a world wide threat. Unbeleivable. Actually the term was used to describe themselves from my recollection (by Bill Kristol, for example). You might want to have a look at what less regulation did for this country recently - the results weren't pretty. In an ideal world, deregulation is a wonderful thing. But the assumption that these regulations aren't useful immeidately falls apart when dishonest people take advantage of others, cause a catastrophy, and get away with it. That is why we have these regulations: they weren't put there to **** people off, they were put there because crimes were committed by dishonest people. I am facinated by people that think every pet problem they have should've been solved by Obama by now, and since he didn't, he lied to the nation. It is extraordinary that just over 100 days ago the expectation for acceptable presidential performance was so low you needed a backhoe to see the light of day. But now the expectation is higher than God Himself could ever reach - especially considering the state of the country that he inherited. All things considered - he's really doing pretty well.",
        "intTime": 20090506,
        "postID": 11,
        "quote": "Originally posted by tobdrue69: Terrible article. I love how the word neocon became so popular with the looney left. It gave them an opportunity to use a word that was associated with Liberal Dumbocrats for a while now. The only thing the Republicans need to is to be actual conservatives which means Strong defense, pro life, pro capitalism, free market economy, limit the role of the federal government and give more local control, strong and relevant border security to stop the illegal flow of Mexicans, tax breaks and tax credits and project a positive and moral direction worldview for our country. Obama and his administration are the direct opposite of what was just described. To project that waht is wrong with the Republican party is that they are not a big tent party is another hypocrisy of the looney left. Where are all the pro life speakers at Democrat Conventions? Where are all the second amendment speeches given from a Dumbocrat? Do the Dumbocrats support or fight the NRA? Why does this administration have people in place that call patriotic christians and veterans and as right wing extremists who could be a terrorist threat? Why does this administration seek to publish pictures of Guantanomo yet hides pictures of Air Force One terrorizing New Yorkers? Why did Obama lie about earmarks and having full disclosure on all bills? Why do Democrats continually look to be the torch bearers for constitutional rights of detainees and yet seek to silence Christians and Conservatives who are US citizens via a new Fairness Doctrine. Why did Bill Clinton refuse to take Bin Laden every time he had the chance? Why did he turn a blind military eye to attacks on the US embassies in Kenya and Tanzania, the USS Cole and the 1993 WTC bombing? Why not an article about all that? Yet we start from the premise that this all started on 9/11 and Bush's reaction to a world wide threat. Unbeleivable.",
        "reply": " Actually the term was used to describe themselves from my recollection (by Bill Kristol, for example). You might want to have a look at what less regulation did for this country recently - the results weren't pretty. In an ideal world, deregulation is a wonderful thing. But the assumption that these regulations aren't useful immeidately falls apart when dishonest people take advantage of others, cause a catastrophy, and get away with it. That is why we have these regulations: they weren't put there to **** people off, they were put there because crimes were committed by dishonest people. I am facinated by people that think every pet problem they have should've been solved by Obama by now, and since he didn't, he lied to the nation. It is extraordinary that just over 100 days ago the expectation for acceptable presidential performance was so low you needed a backhoe to see the light of day. But now the expectation is higher than God Himself could ever reach - especially considering the state of the country that he inherited. All things considered - he's really doing pretty well.",
        "threadID": "6960020520001_8220055222001",
        "time": "2009-05-06 14:19:00",
        "title": "Stake through the heart???",
        "userID": "PolicyWonk"
    },
    {
        "content": "quote: Originally posted by PolicyWonk: Actually the term was used to describe themselves from my recollection (by Bill Kristol, for example). You might want to have a look at what less regulation did for this country recently - the results weren't pretty. In an ideal world, deregulation is a wonderful thing. But the assumption that these regulations aren't useful immeidately falls apart when dishonest people take advantage of others, cause a catastrophy, and get away with it. That is why we have these regulations: they weren't put there to **** people off, they were put there because crimes were committed by dishonest people. I am facinated by people that think every pet problem they have should've been solved by Obama by now, and since he didn't, he lied to the nation. It is extraordinary that just over 100 days ago the expectation for acceptable presidential performance was so low you needed a backhoe to see the light of day. But now the expectation is higher than God Himself could ever reach - especially considering the state of the country that he inherited. All things considered - he's really doing pretty well. Spot on, PW. I have always enjoyed the right wing concept of small government, low taxes, free markets---everyone plays by unwritten rules, whether in business, or everyday life. What's not to to like? It sounds good, doesn't ask the true believer to actually think that squishy ideal through. In the conservative mindset, neocons, whatever they want to call themselves, everybody plays nice and simply goes about their business without anyone having to tell them what to do--how unrealistic. But then again, this precisely explains why the Republican party has imploded---reality snuck in and issued a swift kick to their pachyderm behind. Ultimately, any element of their debunked mantra simply crumbles under the current reality. A veritable wasteland of republican ideals is readily apparent across the spectrum: free market? Uhhh, they made billions under our noses without any sound principles other than unmitigated greed. Taxes? The lowest for chiefly the richest all to no avail---where's the economic boom? Now some of these friends of Bush have some \"Ssplaining to do\" because of their offshore accounts. DoD? A lot of needless systems and sweetheart \"no-bid\" contracts awarded to incompetent companies. Blackwater, as an example, hires a pilot who flunked every single check-ride in his short-lived flying career and this non-Top Gun quality pilot ends up crashing into rising terrain--on a clear day---in Afghanistan, because he was joyriding?! Too bad three of our brothers in arms had to pay for these renta-pilots incompetence with their lives. The Blackwater pilots plan? They were knowingly flying into rising terrain with the idiotic belief they could simply perform a 180 and escape back downhill---except guess what? Our renta-Chuck Yeagers forgot that when you turn, your stall speed increases which is exactly what happened. So much for the \"free market\" it's just like this mishap--a smoking hole that could have been prevented if people simply followed the rules, but at the end of the day, people cut rules, they didn't hire good pilots, and like our fragmented economy, greed overrode everything. The real metric is whether the government works not the size of it. G'day!",
        "intTime": 20090506,
        "postID": 12,
        "quote": "Originally posted by PolicyWonk: Actually the term was used to describe themselves from my recollection (by Bill Kristol, for example). You might want to have a look at what less regulation did for this country recently - the results weren't pretty. In an ideal world, deregulation is a wonderful thing. But the assumption that these regulations aren't useful immeidately falls apart when dishonest people take advantage of others, cause a catastrophy, and get away with it. That is why we have these regulations: they weren't put there to **** people off, they were put there because crimes were committed by dishonest people. I am facinated by people that think every pet problem they have should've been solved by Obama by now, and since he didn't, he lied to the nation. It is extraordinary that just over 100 days ago the expectation for acceptable presidential performance was so low you needed a backhoe to see the light of day. But now the expectation is higher than God Himself could ever reach - especially considering the state of the country that he inherited. All things considered - he's really doing pretty well.",
        "reply": " Spot on, PW. I have always enjoyed the right wing concept of small government, low taxes, free markets---everyone plays by unwritten rules, whether in business, or everyday life. What's not to to like? It sounds good, doesn't ask the true believer to actually think that squishy ideal through. In the conservative mindset, neocons, whatever they want to call themselves, everybody plays nice and simply goes about their business without anyone having to tell them what to do--how unrealistic. But then again, this precisely explains why the Republican party has imploded---reality snuck in and issued a swift kick to their pachyderm behind. Ultimately, any element of their debunked mantra simply crumbles under the current reality. A veritable wasteland of republican ideals is readily apparent across the spectrum: free market? Uhhh, they made billions under our noses without any sound principles other than unmitigated greed. Taxes? The lowest for chiefly the richest all to no avail---where's the economic boom? Now some of these friends of Bush have some \"Ssplaining to do\" because of their offshore accounts. DoD? A lot of needless systems and sweetheart \"no-bid\" contracts awarded to incompetent companies. Blackwater, as an example, hires a pilot who flunked every single check-ride in his short-lived flying career and this non-Top Gun quality pilot ends up crashing into rising terrain--on a clear day---in Afghanistan, because he was joyriding?! Too bad three of our brothers in arms had to pay for these renta-pilots incompetence with their lives. The Blackwater pilots plan? They were knowingly flying into rising terrain with the idiotic belief they could simply perform a 180 and escape back downhill---except guess what? Our renta-Chuck Yeagers forgot that when you turn, your stall speed increases which is exactly what happened. So much for the \"free market\" it's just like this mishap--a smoking hole that could have been prevented if people simply followed the rules, but at the end of the day, people cut rules, they didn't hire good pilots, and like our fragmented economy, greed overrode everything. The real metric is whether the government works not the size of it. G'day!",
        "threadID": "6960020520001_8220055222001",
        "time": "2009-05-06 22:31:00",
        "title": "Stake through the heart???",
        "userID": "rockriver04"
    },
    {
        "content": "quote: Originally posted by rockriver04: quote: Originally posted by PolicyWonk: Actually the term was used to describe themselves from my recollection (by Bill Kristol, for example). You might want to have a look at what less regulation did for this country recently - the results weren't pretty. In an ideal world, deregulation is a wonderful thing. But the assumption that these regulations aren't useful immeidately falls apart when dishonest people take advantage of others, cause a catastrophy, and get away with it. That is why we have these regulations: they weren't put there to **** people off, they were put there because crimes were committed by dishonest people. I am facinated by people that think every pet problem they have should've been solved by Obama by now, and since he didn't, he lied to the nation. It is extraordinary that just over 100 days ago the expectation for acceptable presidential performance was so low you needed a backhoe to see the light of day. But now the expectation is higher than God Himself could ever reach - especially considering the state of the country that he inherited. All things considered - he's really doing pretty well. Spot on, PW. I have always enjoyed the right wing concept of small government, low taxes, free markets---everyone plays by unwritten rules, whether in business, or everyday life. What's not to to like? It sounds good, doesn't ask the true believer to actually think that squishy ideal through. In the conservative mindset, neocons, whatever they want to call themselves, everybody plays nice and simply goes about their business without anyone having to tell them what to do--how unrealistic. But then again, this precisely explains why the Republican party has imploded---reality snuck in and issued a swift kick to their pachyderm behind. Ultimately, any element of their debunked mantra simply crumbles under the current reality. A veritable wasteland of republican ideals is readily apparent across the spectrum: free market? Uhhh, they made billions under our noses without any sound principles other than unmitigated greed. Taxes? The lowest for chiefly the richest all to no avail---where's the economic boom? Now some of these friends of Bush have some \"Ssplaining to do\" because of their offshore accounts. DoD? A lot of needless systems and sweetheart \"no-bid\" contracts awarded to incompetent companies. Blackwater, as an example, hires a pilot who flunked every single check-ride in his short-lived flying career and this non-Top Gun quality pilot ends up crashing into rising terrain--on a clear day---in Afghanistan, because he was joyriding?! Too bad three of our brothers in arms had to pay for these renta-pilots incompetence with their lives. The Blackwater pilots plan? They were knowingly flying into rising terrain with the idiotic belief they could simply perform a 180 and escape back downhill---except guess what? Our renta-Chuck Yeagers forgot that when you turn, your stall speed increases which is exactly what happened. So much for the \"free market\" it's just like this mishap--a smoking hole that could have been prevented if people simply followed the rules, but at the end of the day, people cut rules, they didn't hire good pilots, and like our fragmented economy, greed overrode everything. The real metric is whether the government works not the size of it. G'day! Lets cut the crap, yeah, what the right wing offers isn't perfect. But when you look at the other side... Stop allowing the already cumbersome system of killing murders, rapeists and child molesters in favor killing innocent children for their parents stupidty. Attempt to cast doubt on the most loyal of Americans instead of detaining, convicting and carrying out sentencing on known terrorists. Allowing free enterprise to run through its ups and downs instead of turning everything over to a government thats cares nothing about serving the public or turning a profit and only worries about their own pocket books. Taxing the crap out of everyone and penalizing those who have a talent for making money as opposed to simplified tax systems with no loop holes. Taking away private firearms so people can not protect themselves from criminals who will not disarm versus the ones who just listen to short snipets of phone conversations to see if there is a threat. The problem with truely effective government is like effective counter-terrorsim, the flaws are public and the succeses are never known.",
        "intTime": 20090507,
        "postID": 13,
        "quote": "Originally posted by rockriver04: quote: Originally posted by PolicyWonk: Actually the term was used to describe themselves from my recollection (by Bill Kristol, for example). You might want to have a look at what less regulation did for this country recently - the results weren't pretty. In an ideal world, deregulation is a wonderful thing. But the assumption that these regulations aren't useful immeidately falls apart when dishonest people take advantage of others, cause a catastrophy, and get away with it. That is why we have these regulations: they weren't put there to **** people off, they were put there because crimes were committed by dishonest people. I am facinated by people that think every pet problem they have should've been solved by Obama by now, and since he didn't, he lied to the nation. It is extraordinary that just over 100 days ago the expectation for acceptable presidential performance was so low you needed a backhoe to see the light of day. But now the expectation is higher than God Himself could ever reach - especially considering the state of the country that he inherited. All things considered - he's really doing pretty well. Spot on, PW. I have always enjoyed the right wing concept of small government, low taxes, free markets---everyone plays by unwritten rules, whether in business, or everyday life. What's not to to like? It sounds good, doesn't ask the true believer to actually think that squishy ideal through. In the conservative mindset, neocons, whatever they want to call themselves, everybody plays nice and simply goes about their business without anyone having to tell them what to do--how unrealistic. But then again, this precisely explains why the Republican party has imploded---reality snuck in and issued a swift kick to their pachyderm behind. Ultimately, any element of their debunked mantra simply crumbles under the current reality. A veritable wasteland of republican ideals is readily apparent across the spectrum: free market? Uhhh, they made billions under our noses without any sound principles other than unmitigated greed. Taxes? The lowest for chiefly the richest all to no avail---where's the economic boom? Now some of these friends of Bush have some \"Ssplaining to do\" because of their offshore accounts. DoD? A lot of needless systems and sweetheart \"no-bid\" contracts awarded to incompetent companies. Blackwater, as an example, hires a pilot who flunked every single check-ride in his short-lived flying career and this non-Top Gun quality pilot ends up crashing into rising terrain--on a clear day---in Afghanistan, because he was joyriding?! Too bad three of our brothers in arms had to pay for these renta-pilots incompetence with their lives. The Blackwater pilots plan? They were knowingly flying into rising terrain with the idiotic belief they could simply perform a 180 and escape back downhill---except guess what? Our renta-Chuck Yeagers forgot that when you turn, your stall speed increases which is exactly what happened. So much for the \"free market\" it's just like this mishap--a smoking hole that could have been prevented if people simply followed the rules, but at the end of the day, people cut rules, they didn't hire good pilots, and like our fragmented economy, greed overrode everything. The real metric is whether the government works not the size of it. G'day!",
        "reply": " Lets cut the crap, yeah, what the right wing offers isn't perfect. But when you look at the other side... Stop allowing the already cumbersome system of killing murders, rapeists and child molesters in favor killing innocent children for their parents stupidty. Attempt to cast doubt on the most loyal of Americans instead of detaining, convicting and carrying out sentencing on known terrorists. Allowing free enterprise to run through its ups and downs instead of turning everything over to a government thats cares nothing about serving the public or turning a profit and only worries about their own pocket books. Taxing the crap out of everyone and penalizing those who have a talent for making money as opposed to simplified tax systems with no loop holes. Taking away private firearms so people can not protect themselves from criminals who will not disarm versus the ones who just listen to short snipets of phone conversations to see if there is a threat. The problem with truely effective government is like effective counter-terrorsim, the flaws are public and the succeses are never known.",
        "threadID": "6960020520001_8220055222001",
        "time": "2009-05-07 02:07:00",
        "title": "Stake through the heart???",
        "userID": "somethintobraggabout"
    },
    {
        "content": "While many people may believe American's are less than intelligent when it comes to politics and the condition of America, such a perceived attitude is way off the mark. Events during the past three decades or so has led American's to basically a new form of enlightenment. The right for the most part has abandoned the needs, wishes and desires of the majority in America. Latest polls indicate only 21% of American's identify with the Republican Party, or conservative ideology. Let's face it, the right has abandoned science based upon religious preferences. They have allowed religion to be the be all and end all in their decision making process. Some may not like it but religious political ideology has become an albatros around the necks of Republican leadership, have allowed religious ideology to determine stands taken and votes on legislation the majority can no longer identify with. It has even infected the decisions pertaining to foreign policy, where it now has America involved in two different wars. Add the economic decisions proposed, made and implemented due to political ideology pertaining to capitalism (with the help of some on the left) but at the behest of all conservatives when in power, has only added to the migration of people away from conservative ideology. Bottom line, the Republican Party had better change its loud adherence to religious ideology. If it does not do so, fewer and fewer people will relate to, and embrace conservative ideolgy. The conservative penchant to nearly always comingle religion with politics is not a winning tactic. S/F Gordon",
        "intTime": 20090507,
        "postID": 14,
        "quote": "",
        "reply": "While many people may believe American's are less than intelligent when it comes to politics and the condition of America, such a perceived attitude is way off the mark. Events during the past three decades or so has led American's to basically a new form of enlightenment. The right for the most part has abandoned the needs, wishes and desires of the majority in America. Latest polls indicate only 21% of American's identify with the Republican Party, or conservative ideology. Let's face it, the right has abandoned science based upon religious preferences. They have allowed religion to be the be all and end all in their decision making process. Some may not like it but religious political ideology has become an albatros around the necks of Republican leadership, have allowed religious ideology to determine stands taken and votes on legislation the majority can no longer identify with. It has even infected the decisions pertaining to foreign policy, where it now has America involved in two different wars. Add the economic decisions proposed, made and implemented due to political ideology pertaining to capitalism (with the help of some on the left) but at the behest of all conservatives when in power, has only added to the migration of people away from conservative ideology. Bottom line, the Republican Party had better change its loud adherence to religious ideology. If it does not do so, fewer and fewer people will relate to, and embrace conservative ideolgy. The conservative penchant to nearly always comingle religion with politics is not a winning tactic. S/F Gordon",
        "threadID": "6960020520001_8220055222001",
        "time": "2009-05-07 14:51:00",
        "title": "Stake through the heart???",
        "userID": "uh34d"
    },
    {
        "content": "Member, not Moderator, of this forum. quote: PolicyWonk wrote:...but what I'm saying is that if the republicans don't shed the neoconservatives (and ill-concieved policies) that polluted their party and platform: then they are well on their way to irrellevence. quote: DevilDog2847 wrote:The author supposes that the Rep party will collapse, but what he doesn't point out is that the our politicians are too intrenched in the two party system to allow it to happen. We would do well to remember that irrelevance is fleeting--the mid-terms of 1994 hold some eery similarities (in a BizarroWorld sort of way) to the most recent Congressional elections. Given the opportunity, the Leftist fringe will force history to repeat itself yet again, and quite possibly over the same issue--nationalized health care--that proved to be the undoing of the Democratic super-majority of the early '90s. The Repubs will still be around when the blunder occurs. I also believe that roughly 30 percent of the American electorate would vote D even if it meant a conservative Blue Dog like Mr. Bayh of Indiana were at the top of the ticket; likewise, count on 30 percent to vote R even if Mrs. Collins of Maine were nominated. If Rush Limbaugh and Keith Olbermann were to be nominated, we might finally see a third party candidate have a legitimate chance to reach the White House. Presidential elections are won in the middle---not at the bases of the left nor the right. I don't give much credence to the 'conservative christian patriot' talking heads who claim to be the targets of the oft-mentioned DHS report, nor do I think that most Vets were really the subject of that paper. Many on Fox News (and those who believe the 'news' portion of that name to be appropriate) would love to be seen as the bad-azzes with their pictures in the post office, targeted by a godless liberal government, but the real Right-Wing Extremists are far more dangerous, and very real: >In Ada, Oklahoma, recruiting fliers for the Ku Klux Klan are showing up wrapped around Sunday papers; >In Coeur d'Alene, Idaho, the Aryan Nations are stepping up recruiting efforts, dropping fliers on lawns; These groups claim patriotism and christianity as core values, but they have little desire to operate within the framework of law or politics. The Tim McVeighs of this country are few and far between, but don't doubt for a minute that the KKK and the AN would love to count among their membership more Patriotic Christians who've proved their ability and their willingness to sacrifice self...those disgruntled vets who've been unfairly treated or denied the benefits and care they've earned are likely targets for such recruiting efforts--just ask your friendly local counter-intelligence officer. Tea parties and discussion boards are not signs of decaying civilization--they're signs of a thriving and vital democracy where change is difficult by necessity. While I'm not confusing irrelevance with extinction, I'm also not forgetting that 'Change you can believe in' is not the same as 'Change you'll agree with.' This message has been edited. Last edited by: YooperTJ, Sat 09 May 2009 11:34 PM",
        "intTime": 20090509,
        "postID": 15,
        "quote": "PolicyWonk wrote:...but what I'm saying is that if the republicans don't shed the neoconservatives (and ill-concieved policies) that polluted their party and platform: then they are well on their way to irrellevence.",
        "reply": "Member, not Moderator, of this forum.  quote: DevilDog2847 wrote:The author supposes that the Rep party will collapse, but what he doesn't point out is that the our politicians are too intrenched in the two party system to allow it to happen. We would do well to remember that irrelevance is fleeting--the mid-terms of 1994 hold some eery similarities (in a BizarroWorld sort of way) to the most recent Congressional elections. Given the opportunity, the Leftist fringe will force history to repeat itself yet again, and quite possibly over the same issue--nationalized health care--that proved to be the undoing of the Democratic super-majority of the early '90s. The Repubs will still be around when the blunder occurs. I also believe that roughly 30 percent of the American electorate would vote D even if it meant a conservative Blue Dog like Mr. Bayh of Indiana were at the top of the ticket; likewise, count on 30 percent to vote R even if Mrs. Collins of Maine were nominated. If Rush Limbaugh and Keith Olbermann were to be nominated, we might finally see a third party candidate have a legitimate chance to reach the White House. Presidential elections are won in the middle---not at the bases of the left nor the right. I don't give much credence to the 'conservative christian patriot' talking heads who claim to be the targets of the oft-mentioned DHS report, nor do I think that most Vets were really the subject of that paper. Many on Fox News (and those who believe the 'news' portion of that name to be appropriate) would love to be seen as the bad-azzes with their pictures in the post office, targeted by a godless liberal government, but the real Right-Wing Extremists are far more dangerous, and very real: >In Ada, Oklahoma, recruiting fliers for the Ku Klux Klan are showing up wrapped around Sunday papers; >In Coeur d'Alene, Idaho, the Aryan Nations are stepping up recruiting efforts, dropping fliers on lawns; These groups claim patriotism and christianity as core values, but they have little desire to operate within the framework of law or politics. The Tim McVeighs of this country are few and far between, but don't doubt for a minute that the KKK and the AN would love to count among their membership more Patriotic Christians who've proved their ability and their willingness to sacrifice self...those disgruntled vets who've been unfairly treated or denied the benefits and care they've earned are likely targets for such recruiting efforts--just ask your friendly local counter-intelligence officer. Tea parties and discussion boards are not signs of decaying civilization--they're signs of a thriving and vital democracy where change is difficult by necessity. While I'm not confusing irrelevance with extinction, I'm also not forgetting that 'Change you can believe in' is not the same as 'Change you'll agree with.' This message has been edited. Last edited by: YooperTJ, Sat 09 May 2009 11:34 PM",
        "threadID": "6960020520001_8220055222001",
        "time": "2009-05-09 23:18:00",
        "title": "Stake through the heart???",
        "userID": "YooperTJ"
    },
    {
        "content": "quote: Originally posted by PolicyWonk: quote: Policywonk, you make an interesting observation about the Reps getting drunk on power and leaving behind their policies of fiscal conservatism, etc... and most conservatives would readily agree, but doesn't that also say that they were booted out of power because the people still believe in what they originally voted them into office for? Indeed it does - but what I'm saying is that if the republicans don't shed the neoconservatives (and ill-concieved policies) that polluted their party and platform: then they are well on their way to irrellevence. quote: If so, how is the current Dem controlled government doing anything different to sway those people? We all know that Obama ran as those things, but we are seeing him doing the opposite or leaving many promises by the wayside. The government in power now has only been in for just over 100 days, and got elected because the republicans caused so much damage to the country that the people felt it was time for them to go. Note also, that President Obama's popularity ratings are really pretty high: most people approve of his performance (well over 60%). People are also cognizant of the horrifying state of the nation left behind by his predecessor (and his party). They know that the job of POTUS is the toughest job on the planet in the best of times, but this isn't the best of times (to the contrary). He simply cannot do everything in 100 days. What gets me, is how the neoconservatives/republicans had such low expectations for presidential peformance just 5 short months ago, but now the bar is so high God Himself couldn't make the grade. quote: The so called stimulus package and a budget nearly twice as large as anything Bush ever proposed certainly does not fall under \"fiscal responsibility\", he says he is for \"lean\" government but continues to expand it (or at least make proposals that will)... maybe he feels government is under weight? You are right that the stimulous package is huge. There are economists that say it isn't big enough! There is a lot of damage to undo, but there are also considerable investments in energy, infrastructure, and education included. What is interesting though, is that when Obama went to work (with the transition team), they started planning how to do it and roll it out immeidately after the election was over. As the aspects of the plan started getting rolled out (at first), a lot of people weren't too happy. But as other parts of the plan started coming out and people started to see how it all fit together, they have become a lot more comfortable. quote: I get your point that the U.S. shouldn't walk around like the big bad bulldog on the block picking fights, but I think a rational argument can be made that this admin has pulled so far back from being the bulldog, that we're more like the dog who rolls over and exposes his belly when anyone else comes by. Still too eary to tell - but I don't think this president is an idiot. He has a much better understanding of American power and its limits (thats the drift I get from my friends in the general staff: it is reported that he actually listens to the senior commanders very carefully). The previous guy didn't understand either the limits or proper use of American power (diplomatic or military), and it would've served him well to take some advice from Don Corleane (i.e. \"The Godfather\"): \"Keep your friends - keep you enemies closer...\". quote: I don't want to get bogged down in finger pointing, name calling etc etc that these boards seemed to always devolve into when I left before, but if the fringe neo-cons took over the Rep party, can you honestly say that the fringe leftists have not done the same with the Dem party? And if you do agree, won't the Dems be in the same position in 4 or 8 years? I for one hope that the hard-core lefties haven't taken over: I think this president is smarter than that (and I hope I'm not wrong!). Whats kind of weird is that the democrats have largely moved to the center and the republicans have moved so far to the right that they are almost putting themselves out of business (hence the premise of this article). For me personally, if something happens (heaven forbid) to both Obama and Biden, thereby making Nancy Pelosi president: maybe then its time to leave the country. Cheers. Cheers. How about this, define neoconservative and then shove that assinine term where the sun don't shine. We're not new, we've been neck deep in serving our country for more years than there has been a Democrat party. We helped form this country, we bled and died for freedom in more wars and tossed to the wayside more times than is concienable and we were kicked and spit upon when we came home from Vietnam as we walked off planes on crutches or in wheel chairs by those most in need of our sacrifice. We resisted the urge to join a NAZI style movement which is very seductive to those abused by people who refuse to educate themselves beyond their blind Kent State fashion that discouraged truely individual thinking. We are not new and and we will never die.",
        "intTime": 20090510,
        "postID": 16,
        "quote": "Originally posted by PolicyWonk: quote: Policywonk, you make an interesting observation about the Reps getting drunk on power and leaving behind their policies of fiscal conservatism, etc... and most conservatives would readily agree, but doesn't that also say that they were booted out of power because the people still believe in what they originally voted them into office for? Indeed it does - but what I'm saying is that if the republicans don't shed the neoconservatives (and ill-concieved policies) that polluted their party and platform: then they are well on their way to irrellevence. quote: If so, how is the current Dem controlled government doing anything different to sway those people? We all know that Obama ran as those things, but we are seeing him doing the opposite or leaving many promises by the wayside. The government in power now has only been in for just over 100 days, and got elected because the republicans caused so much damage to the country that the people felt it was time for them to go. Note also, that President Obama's popularity ratings are really pretty high: most people approve of his performance (well over 60%). People are also cognizant of the horrifying state of the nation left behind by his predecessor (and his party). They know that the job of POTUS is the toughest job on the planet in the best of times, but this isn't the best of times (to the contrary). He simply cannot do everything in 100 days. What gets me, is how the neoconservatives/republicans had such low expectations for presidential peformance just 5 short months ago, but now the bar is so high God Himself couldn't make the grade. quote: The so called stimulus package and a budget nearly twice as large as anything Bush ever proposed certainly does not fall under \"fiscal responsibility\", he says he is for \"lean\" government but continues to expand it (or at least make proposals that will)... maybe he feels government is under weight? You are right that the stimulous package is huge. There are economists that say it isn't big enough! There is a lot of damage to undo, but there are also considerable investments in energy, infrastructure, and education included. What is interesting though, is that when Obama went to work (with the transition team), they started planning how to do it and roll it out immeidately after the election was over. As the aspects of the plan started getting rolled out (at first), a lot of people weren't too happy. But as other parts of the plan started coming out and people started to see how it all fit together, they have become a lot more comfortable. quote: I get your point that the U.S. shouldn't walk around like the big bad bulldog on the block picking fights, but I think a rational argument can be made that this admin has pulled so far back from being the bulldog, that we're more like the dog who rolls over and exposes his belly when anyone else comes by. Still too eary to tell - but I don't think this president is an idiot. He has a much better understanding of American power and its limits (thats the drift I get from my friends in the general staff: it is reported that he actually listens to the senior commanders very carefully). The previous guy didn't understand either the limits or proper use of American power (diplomatic or military), and it would've served him well to take some advice from Don Corleane (i.e. \"The Godfather\"): \"Keep your friends - keep you enemies closer...\". quote: I don't want to get bogged down in finger pointing, name calling etc etc that these boards seemed to always devolve into when I left before, but if the fringe neo-cons took over the Rep party, can you honestly say that the fringe leftists have not done the same with the Dem party? And if you do agree, won't the Dems be in the same position in 4 or 8 years? I for one hope that the hard-core lefties haven't taken over: I think this president is smarter than that (and I hope I'm not wrong!). Whats kind of weird is that the democrats have largely moved to the center and the republicans have moved so far to the right that they are almost putting themselves out of business (hence the premise of this article). For me personally, if something happens (heaven forbid) to both Obama and Biden, thereby making Nancy Pelosi president: maybe then its time to leave the country. Cheers. Cheers.",
        "reply": " How about this, define neoconservative and then shove that assinine term where the sun don't shine. We're not new, we've been neck deep in serving our country for more years than there has been a Democrat party. We helped form this country, we bled and died for freedom in more wars and tossed to the wayside more times than is concienable and we were kicked and spit upon when we came home from Vietnam as we walked off planes on crutches or in wheel chairs by those most in need of our sacrifice. We resisted the urge to join a NAZI style movement which is very seductive to those abused by people who refuse to educate themselves beyond their blind Kent State fashion that discouraged truely individual thinking. We are not new and and we will never die.",
        "threadID": "6960020520001_8220055222001",
        "time": "2009-05-10 21:22:00",
        "title": "Stake through the heart???",
        "userID": "somethintobraggabout"
    }
]