[
    {
        "content": "RE: http://www.military.com/opinion/0,15202,188058,00.html quote: Conrad is correct. A Defense Secretary calling to plead for more money for the State Department isn't something the Washington establishment is accustomed to seeing. But it goes in line with what we now know about the wars in Iraq and Afghanistan: That they're not going to be won or lost on the success or failure of our military. Instead, while our main goal of eradicating both international terrorism and its safe havens remains intact, ultimate success in both places hinges on a mix of political reconciliation, diplomacy, and reconstruction. Good for Def. Sec. Gates. It would've been better had he done so years ago, but that would've likely forced the man out of the job for the wrong reasons. There are limits to what can be accomplished by military force alone, and diplomacy when applied correctly (and for the long run) can yield far more positive and lasting results.",
        "intTime": 20090402,
        "postID": 1,
        "quote": "Conrad is correct. A Defense Secretary calling to plead for more money for the State Department isn't something the Washington establishment is accustomed to seeing. But it goes in line with what we now know about the wars in Iraq and Afghanistan: That they're not going to be won or lost on the success or failure of our military. Instead, while our main goal of eradicating both international terrorism and its safe havens remains intact, ultimate success in both places hinges on a mix of political reconciliation, diplomacy, and reconstruction.",
        "reply": "RE: http://www.military.com/opinion/0,15202,188058,00.html  Good for Def. Sec. Gates. It would've been better had he done so years ago, but that would've likely forced the man out of the job for the wrong reasons. There are limits to what can be accomplished by military force alone, and diplomacy when applied correctly (and for the long run) can yield far more positive and lasting results.",
        "threadID": "6960020520001_4400036912001",
        "time": "2009-04-02 08:45:00",
        "title": "Gates is Right on Funding",
        "userID": "PolicyWonk"
    },
    {
        "content": "We can save even more money by forcing all recipients of federal educational scholarship money to serve in the Stans and Iraq as a civilian overseas contingency operation. Put them in place and pull out the troops. After all, the war on terror is over...",
        "intTime": 20090406,
        "postID": 2,
        "quote": "",
        "reply": "We can save even more money by forcing all recipients of federal educational scholarship money to serve in the Stans and Iraq as a civilian overseas contingency operation. Put them in place and pull out the troops. After all, the war on terror is over...",
        "threadID": "6960020520001_4400036912001",
        "time": "2009-04-06 11:11:00",
        "title": "Gates is Right on Funding",
        "userID": "yanqui69"
    }
]