[
    {
        "content": "RE: http://www.military.com/opinion/0,15202,187004,00.html Since tthe OpEds seem to use the 'old style' comments, I will probably read them more often. Interesting Article, he actually seems to hit both sides of the political spectrum with his barbs. Did see an interesting comment in our local 'B1tch & Gripes' page the other day: 'President Obama does not want to talk to anyone that listens to Rush Limbaugh but is willing to sit down and talk to Iran without any preconditions'. For the last 8-years the ultra-right have been lambasting the ultra-left for attacks on the President and the ultra-left has been proclaiming their right of free-speech. Now the ultra-left is lambasting the ultra-right for not supporting the President and basically telling them to STFU. At one time both major political parties had Conservative, Moderate and Liberal wings. Now things have gotten so polorized and demonizing one's opponents is see as acceptable. Shame this has happened. We also have 10% of the people paying almost 50% of the taxes, and many people seem to think they are not paying enough. Maybe it is time we went to a straight Value Added Tax system, no income taxes, no deductions - you pay for what you consume.",
        "intTime": 20090317,
        "postID": 1,
        "quote": "",
        "reply": "RE: http://www.military.com/opinion/0,15202,187004,00.html Since tthe OpEds seem to use the 'old style' comments, I will probably read them more often. Interesting Article, he actually seems to hit both sides of the political spectrum with his barbs. Did see an interesting comment in our local 'B1tch & Gripes' page the other day: 'President Obama does not want to talk to anyone that listens to Rush Limbaugh but is willing to sit down and talk to Iran without any preconditions'. For the last 8-years the ultra-right have been lambasting the ultra-left for attacks on the President and the ultra-left has been proclaiming their right of free-speech. Now the ultra-left is lambasting the ultra-right for not supporting the President and basically telling them to STFU. At one time both major political parties had Conservative, Moderate and Liberal wings. Now things have gotten so polorized and demonizing one's opponents is see as acceptable. Shame this has happened. We also have 10% of the people paying almost 50% of the taxes, and many people seem to think they are not paying enough. Maybe it is time we went to a straight Value Added Tax system, no income taxes, no deductions - you pay for what you consume.",
        "threadID": "6960020520001_4750080812001",
        "time": "2009-03-17 07:45:00",
        "title": "Hypocrisy in Government",
        "userID": "oseles"
    },
    {
        "content": "A balanced editorial lambasting both sides of the aisle, and appropriately so. If there are a few things that are consistent in politics, it is hypocracy and inconsistency (much to the detriment of our nation). Additionally unfortunate, is that politics and parties have become so polarized (much more so over the past 8 years than even in previous administrations), because it does nothing to help the country at the end of the day (week, month, year, etc). Ironically, President Bush who claimed to be a \"uniter, not a divider\", divided our nation and united the rest of the world against us. It would've been one thing if it had ended up with the United States being extra prosperous and highly respected globally, but ultimately his presidency is a failure by the most generous of measures. But to be fair, some of the writers comments are not entirely accurate. For example: President Bush invaded Iraq with almost unanimous support across both sides of the aisle, but as was found out later, he used that support and took that opportunity to instill himself with extraordinary presidential powers that remained unchecked throughout his presidency by the republican led houses of representatives. And later it was discovered that most of the reasons for the invasion were outright lies and distortions (935 known lies told to the country, our allies, and houses of representatives in the lead up to the war). He didn't get criticized until the scope of this mendacity became clear, and the abuses of power became obvious. Other comments: - With liberals using this crisis to fund clean energy projects, education, and health initiatives at least these are things that benefit the population at large, instead of only going to the wealthiest .5% (or less) of the country. Education funding is rarely a bad investment, and makes sense (as John Kerry's botched joke was intended to point out). Clean energy and health initiatives are also long-term investment items that can serve the country well if handled correctly. Healthcare costs are out of control, and the US is the only western nation without a national health plan. And that is hurting our competetiveness globally while strangling our economy. - I consider negotiating with the Taliban a bad idea, mainly because they have no history of keeping to their end of whatever bargain they enter into, and merely use cease-fires, etc, as an opportunity to rearm/regroup. - With Isreal and the Palestinians, funding both sides is ultimately bad news. To me, if we are going to fund the repairs in Gaza, then we should correspondingly remove the same amount of money from the yearly funding going to Isreal (i.e. you can't attack these guys and not expect to pay for it). Isreal, while sharing many interests in common with the US, also have their own interests in mind that are highly determental to the long term interests of the United States. If we are not happy with what they are doing, we have to articulate that and demonstrate our displeasure. - Addressing terrorism as a \"Global War\" instead of simple organized crime was a deeply stupid, and shortsighted thing to do, as it elevates terrorists (ones mans terrorist is anothers freedom fighter) to the status of a soldier. Terrorists are not soldiers and have no allegence to a recognized country or army, and I personally have a problem with somehow equating them with soldiers that do. Plus, as I have mentioned before, by addressing terrorists as a criminals, you can then remove politics from the equation and go after those who fund, plan, or otherwise support these crimes as aiding/abetting conspirators thereby making them legitimate targets as well.",
        "intTime": 20090317,
        "postID": 2,
        "quote": "",
        "reply": "A balanced editorial lambasting both sides of the aisle, and appropriately so. If there are a few things that are consistent in politics, it is hypocracy and inconsistency (much to the detriment of our nation). Additionally unfortunate, is that politics and parties have become so polarized (much more so over the past 8 years than even in previous administrations), because it does nothing to help the country at the end of the day (week, month, year, etc). Ironically, President Bush who claimed to be a \"uniter, not a divider\", divided our nation and united the rest of the world against us. It would've been one thing if it had ended up with the United States being extra prosperous and highly respected globally, but ultimately his presidency is a failure by the most generous of measures. But to be fair, some of the writers comments are not entirely accurate. For example: President Bush invaded Iraq with almost unanimous support across both sides of the aisle, but as was found out later, he used that support and took that opportunity to instill himself with extraordinary presidential powers that remained unchecked throughout his presidency by the republican led houses of representatives. And later it was discovered that most of the reasons for the invasion were outright lies and distortions (935 known lies told to the country, our allies, and houses of representatives in the lead up to the war). He didn't get criticized until the scope of this mendacity became clear, and the abuses of power became obvious. Other comments: - With liberals using this crisis to fund clean energy projects, education, and health initiatives at least these are things that benefit the population at large, instead of only going to the wealthiest .5% (or less) of the country. Education funding is rarely a bad investment, and makes sense (as John Kerry's botched joke was intended to point out). Clean energy and health initiatives are also long-term investment items that can serve the country well if handled correctly. Healthcare costs are out of control, and the US is the only western nation without a national health plan. And that is hurting our competetiveness globally while strangling our economy. - I consider negotiating with the Taliban a bad idea, mainly because they have no history of keeping to their end of whatever bargain they enter into, and merely use cease-fires, etc, as an opportunity to rearm/regroup. - With Isreal and the Palestinians, funding both sides is ultimately bad news. To me, if we are going to fund the repairs in Gaza, then we should correspondingly remove the same amount of money from the yearly funding going to Isreal (i.e. you can't attack these guys and not expect to pay for it). Isreal, while sharing many interests in common with the US, also have their own interests in mind that are highly determental to the long term interests of the United States. If we are not happy with what they are doing, we have to articulate that and demonstrate our displeasure. - Addressing terrorism as a \"Global War\" instead of simple organized crime was a deeply stupid, and shortsighted thing to do, as it elevates terrorists (ones mans terrorist is anothers freedom fighter) to the status of a soldier. Terrorists are not soldiers and have no allegence to a recognized country or army, and I personally have a problem with somehow equating them with soldiers that do. Plus, as I have mentioned before, by addressing terrorists as a criminals, you can then remove politics from the equation and go after those who fund, plan, or otherwise support these crimes as aiding/abetting conspirators thereby making them legitimate targets as well.",
        "threadID": "6960020520001_4750080812001",
        "time": "2009-03-17 09:37:00",
        "title": "Hypocrisy in Government",
        "userID": "PolicyWonk"
    },
    {
        "content": "As the author stated, \"Hypocrisy in government is nothing new and is certainly not more prevalent in one party or the other.\" Unfortunately, this fact is being demonstrated on a daily basis and people wonder why so many are so cynical of government and the politicians who seem to act as if they were parasites on the backsides of American taxpayers.",
        "intTime": 20090317,
        "postID": 3,
        "quote": "",
        "reply": "As the author stated, \"Hypocrisy in government is nothing new and is certainly not more prevalent in one party or the other.\" Unfortunately, this fact is being demonstrated on a daily basis and people wonder why so many are so cynical of government and the politicians who seem to act as if they were parasites on the backsides of American taxpayers.",
        "threadID": "6960020520001_4750080812001",
        "time": "2009-03-17 09:55:00",
        "title": "Hypocrisy in Government",
        "userID": "mattkay4"
    },
    {
        "content": "\"Recent statements by President Barack Obama, Secretary of State Hillary Clinton, and White House Chief of Staff Rahm Emanuel, admitting that they were going to use the economic crisis to get other things done, are at least surprisingly honest. But they are also hypocritical. Remember when some of these same people criticized George W. Bush for using the 9/11 tragedy to invade the unrelated nation of Iraq?\" I don't recall that at all. I recall that Clinton voted -for- the invasion of Iraq. I recall that President Obama steadfastly opposed the gross folly and murdereous incompetence of the Bush Administration. He was open and upfront, he was not hypocritical. This is just another right wing hit piece playing on the ignorance of the American people. Walt",
        "intTime": 20090317,
        "postID": 4,
        "quote": "",
        "reply": "\"Recent statements by President Barack Obama, Secretary of State Hillary Clinton, and White House Chief of Staff Rahm Emanuel, admitting that they were going to use the economic crisis to get other things done, are at least surprisingly honest. But they are also hypocritical. Remember when some of these same people criticized George W. Bush for using the 9/11 tragedy to invade the unrelated nation of Iraq?\" I don't recall that at all. I recall that Clinton voted -for- the invasion of Iraq. I recall that President Obama steadfastly opposed the gross folly and murdereous incompetence of the Bush Administration. He was open and upfront, he was not hypocritical. This is just another right wing hit piece playing on the ignorance of the American people. Walt",
        "threadID": "6960020520001_4750080812001",
        "time": "2009-03-17 10:34:00",
        "title": "Hypocrisy in Government",
        "userID": "WhiskeyPapa"
    },
    {
        "content": "\"And what about all of that U.S. rhetoric supporting democracy? All of a sudden, Hamid Karzai, the democratically elected president of Afghanistan, is on the outs with the United States.\" This guy is a piece of work. Does he mean the same Hamid Karzai who is often referred to the \"Mayor of Kabul\"? He ought to be on the outs. No one would produce an article like this unless he thought his audience was a bunch of morons. You know, the modus operandi of FOX News. Walt",
        "intTime": 20090317,
        "postID": 5,
        "quote": "",
        "reply": "\"And what about all of that U.S. rhetoric supporting democracy? All of a sudden, Hamid Karzai, the democratically elected president of Afghanistan, is on the outs with the United States.\" This guy is a piece of work. Does he mean the same Hamid Karzai who is often referred to the \"Mayor of Kabul\"? He ought to be on the outs. No one would produce an article like this unless he thought his audience was a bunch of morons. You know, the modus operandi of FOX News. Walt",
        "threadID": "6960020520001_4750080812001",
        "time": "2009-03-17 13:24:00",
        "title": "Hypocrisy in Government",
        "userID": "WhiskeyPapa"
    },
    {
        "content": "PolicyWonk, Was not surprised you could not resist taking a shot at the Bush Administration: quote: Additionally unfortunate, is that politics and parties have become so polarized (much more so over the past 8 years than even in previous administrations), But the Politics of Destruction really began prior to that. Remember the First Lady talking about the \"Vast right Wing CONSPIRACY\" that was out to get her husband, of file-Gate, where they were culling information to use to attack all that opposed them? As for Bush's 2004 tax cuts benifiting the 0.5%, that CBO study clearly shows that the taxes were reduced for the top 20%, and they are still paying a larger share of the tax liability than their share of the income. Remember, the 2001 Median Income for the top 10% was $283,100, so his plan to raise taxes on those earning more than $250,000 probably reached down to the top 12 or 13%. The top 20% earn 54% of the total income and pay 64% of the total tax liability, and their taxes were only cut 1.2% by 2010. I don't think you and I will ever come into agreement about that issue. I agree that education could be a good way to spend money, but the whole education system is being dumbed down to the least common denominator. Enonomist worry that if we do not turn it around and start turning out hard-core science, math, physics, engineers, etc - we are scr*wed. We probably should stop giving Jocks bigger scolarships than the Hard Science students, but we know that isn't going to happen. As for clean energy - good goal, just as long as you don't kill our economy to get there. Having read your comments on the VA costs being pushed to private insurance I am surprised you want to go to socialized medicine. People from countries that have those type of programs come to the US for treatment (I may be money out of pocket, but it is better and it is NOW). As for taking money away from Isreal, no one was penalizing the Palistinians for 8 years of attacks on Isreal and that Isreal took that long to say enough is really surprising that they did not do something earlier. If they had been thinking about it they would have gone into Gaza right after we saw the pictures of the Palistinians dancing in the streets celibrating 9-11. I don't think any American would have objected too much then. As for your comments on terrorism, I will address them another time as I have to scoot.",
        "intTime": 20090317,
        "postID": 6,
        "quote": "Additionally unfortunate, is that politics and parties have become so polarized (much more so over the past 8 years than even in previous administrations),",
        "reply": "PolicyWonk, Was not surprised you could not resist taking a shot at the Bush Administration:  But the Politics of Destruction really began prior to that. Remember the First Lady talking about the \"Vast right Wing CONSPIRACY\" that was out to get her husband, of file-Gate, where they were culling information to use to attack all that opposed them? As for Bush's 2004 tax cuts benifiting the 0.5%, that CBO study clearly shows that the taxes were reduced for the top 20%, and they are still paying a larger share of the tax liability than their share of the income. Remember, the 2001 Median Income for the top 10% was $283,100, so his plan to raise taxes on those earning more than $250,000 probably reached down to the top 12 or 13%. The top 20% earn 54% of the total income and pay 64% of the total tax liability, and their taxes were only cut 1.2% by 2010. I don't think you and I will ever come into agreement about that issue. I agree that education could be a good way to spend money, but the whole education system is being dumbed down to the least common denominator. Enonomist worry that if we do not turn it around and start turning out hard-core science, math, physics, engineers, etc - we are scr*wed. We probably should stop giving Jocks bigger scolarships than the Hard Science students, but we know that isn't going to happen. As for clean energy - good goal, just as long as you don't kill our economy to get there. Having read your comments on the VA costs being pushed to private insurance I am surprised you want to go to socialized medicine. People from countries that have those type of programs come to the US for treatment (I may be money out of pocket, but it is better and it is NOW). As for taking money away from Isreal, no one was penalizing the Palistinians for 8 years of attacks on Isreal and that Isreal took that long to say enough is really surprising that they did not do something earlier. If they had been thinking about it they would have gone into Gaza right after we saw the pictures of the Palistinians dancing in the streets celibrating 9-11. I don't think any American would have objected too much then. As for your comments on terrorism, I will address them another time as I have to scoot.",
        "threadID": "6960020520001_4750080812001",
        "time": "2009-03-17 16:06:00",
        "title": "Hypocrisy in Government",
        "userID": "oseles"
    },
    {
        "content": "quote: Originally posted by oseles: PolicyWonk, Was not surprised you could not resist taking a shot at the Bush Administration: quote: Additionally unfortunate, is that politics and parties have become so polarized (much more so over the past 8 years than even in previous administrations), But the Politics of Destruction really began prior to that. Remember the First Lady talking about the \"Vast right Wing CONSPIRACY\" that was out to get her husband, of file-Gate, where they were culling information to use to attack all that opposed them? As for Bush's 2004 tax cuts benifiting the 0.5%, that CBO study clearly shows that the taxes were reduced for the top 20%, and they are still paying a larger share of the tax liability than their share of the income. Remember, the 2001 Median Income for the top 10% was $283,100, so his plan to raise taxes on those earning more than $250,000 probably reached down to the top 12 or 13%. The top 20% earn 54% of the total income and pay 64% of the total tax liability, and their taxes were only cut 1.2% by 2010. I don't think you and I will ever come into agreement about that issue. I agree that education could be a good way to spend money, but the whole education system is being dumbed down to the least common denominator. Enonomist worry that if we do not turn it around and start turning out hard-core science, math, physics, engineers, etc - we are scr*wed. We probably should stop giving Jocks bigger scolarships than the Hard Science students, but we know that isn't going to happen. As for clean energy - good goal, just as long as you don't kill our economy to get there. Having read your comments on the VA costs being pushed to private insurance I am surprised you want to go to socialized medicine. People from countries that have those type of programs come to the US for treatment (I may be money out of pocket, but it is better and it is NOW). As for taking money away from Isreal, no one was penalizing the Palistinians for 8 years of attacks on Isreal and that Isreal took that long to say enough is really surprising that they did not do something earlier. If they had been thinking about it they would have gone into Gaza right after we saw the pictures of the Palistinians dancing in the streets celibrating 9-11. I don't think any American would have objected too much then. As for your comments on terrorism, I will address them another time as I have to scoot. You are correct that the uber-partisan politics started before the GW Bush Administration. I didn't intend for it to sound like that - I was only making the point that it became a lot *worse* during GW Bush Adminsitration (I seem to recall the bomb-throwing stuff started with Newt Gingrich). W/r/t Taxes, we can agree to disagree. You are correct taht education has been dumbed down, and that has done nothing to help the country over all. The uber-leftie-liberals screwed it up by not wanting to hurt anyones feelings (for example: using a red pen to correct papers with X's for incorrect asnwers hurst the self esteem of whoever screwed up), and the uber-righty's think that \"creationism\" should be taught on par with Darwin (i.e. evolution). I think we would be better off with nationalized medicine (socialized if you prefer: I believe a single payer system is best for the nation) as healthcare for profit is bad for the country (there are other ways to get cost savings). Every other western nation has national healthcare, and Britian has nationalized healthcare with options for \"premium care\" if you can afford it. But if you look at medicare (very efficient system), costs for VA care, and the current system we have, it is clear that it isn't working as our costs have skyrocketed. Most of my physician friends claim to vastly prefer a nationalized system. You are correct there were Palestinians dancing in the streets on 9/11. Sad indeed. But then again, the US used to try to be an honest broker for peace in the Middle East, but that sadly is now a dead and forgotten relic of the past. Many also lit candels and attended vigils as well. Cheers.",
        "intTime": 20090317,
        "postID": 7,
        "quote": "Originally posted by oseles: PolicyWonk, Was not surprised you could not resist taking a shot at the Bush Administration: quote: Additionally unfortunate, is that politics and parties have become so polarized (much more so over the past 8 years than even in previous administrations), But the Politics of Destruction really began prior to that. Remember the First Lady talking about the \"Vast right Wing CONSPIRACY\" that was out to get her husband, of file-Gate, where they were culling information to use to attack all that opposed them? As for Bush's 2004 tax cuts benifiting the 0.5%, that CBO study clearly shows that the taxes were reduced for the top 20%, and they are still paying a larger share of the tax liability than their share of the income. Remember, the 2001 Median Income for the top 10% was $283,100, so his plan to raise taxes on those earning more than $250,000 probably reached down to the top 12 or 13%. The top 20% earn 54% of the total income and pay 64% of the total tax liability, and their taxes were only cut 1.2% by 2010. I don't think you and I will ever come into agreement about that issue. I agree that education could be a good way to spend money, but the whole education system is being dumbed down to the least common denominator. Enonomist worry that if we do not turn it around and start turning out hard-core science, math, physics, engineers, etc - we are scr*wed. We probably should stop giving Jocks bigger scolarships than the Hard Science students, but we know that isn't going to happen. As for clean energy - good goal, just as long as you don't kill our economy to get there. Having read your comments on the VA costs being pushed to private insurance I am surprised you want to go to socialized medicine. People from countries that have those type of programs come to the US for treatment (I may be money out of pocket, but it is better and it is NOW). As for taking money away from Isreal, no one was penalizing the Palistinians for 8 years of attacks on Isreal and that Isreal took that long to say enough is really surprising that they did not do something earlier. If they had been thinking about it they would have gone into Gaza right after we saw the pictures of the Palistinians dancing in the streets celibrating 9-11. I don't think any American would have objected too much then. As for your comments on terrorism, I will address them another time as I have to scoot.",
        "reply": " You are correct that the uber-partisan politics started before the GW Bush Administration. I didn't intend for it to sound like that - I was only making the point that it became a lot *worse* during GW Bush Adminsitration (I seem to recall the bomb-throwing stuff started with Newt Gingrich). W/r/t Taxes, we can agree to disagree. You are correct taht education has been dumbed down, and that has done nothing to help the country over all. The uber-leftie-liberals screwed it up by not wanting to hurt anyones feelings (for example: using a red pen to correct papers with X's for incorrect asnwers hurst the self esteem of whoever screwed up), and the uber-righty's think that \"creationism\" should be taught on par with Darwin (i.e. evolution). I think we would be better off with nationalized medicine (socialized if you prefer: I believe a single payer system is best for the nation) as healthcare for profit is bad for the country (there are other ways to get cost savings). Every other western nation has national healthcare, and Britian has nationalized healthcare with options for \"premium care\" if you can afford it. But if you look at medicare (very efficient system), costs for VA care, and the current system we have, it is clear that it isn't working as our costs have skyrocketed. Most of my physician friends claim to vastly prefer a nationalized system. You are correct there were Palestinians dancing in the streets on 9/11. Sad indeed. But then again, the US used to try to be an honest broker for peace in the Middle East, but that sadly is now a dead and forgotten relic of the past. Many also lit candels and attended vigils as well. Cheers.",
        "threadID": "6960020520001_4750080812001",
        "time": "2009-03-17 16:57:00",
        "title": "Hypocrisy in Government",
        "userID": "PolicyWonk"
    },
    {
        "content": "PW, Newt contributed to the problem, but that was with the whole \"Contract with America\" pitch in 94, 2 years into President Clinton's first term. As you recall, the Republicans lost heavily in 92 based on two mantras from the Democrats: 1) 'Its the Economy STUPID' and 2) 'Read my lips: No new taxes' from President Bush's (Elder) 1988 Republican National Convention acceptance speach. (The BBC had some interesting comments on it) And that was after the Democrat Leadership went to President Bush and convinced him that they ABSOLUTELY had to have taxes raised to get them out of the current recession, causing a revenue shortfall and the PROMISED that it would NOT be used as a campaign issue in his re-election run in 92. Granted that Buchanan used it extensively in his Primary runs, but it was James Carville that really built it into a theme for Cinton. It was regarded as one of the most effective of all of Clinton's campaign ads. Despite the variety of scandals that affected Clinton during the election, polls showed the public viewed Clinton and Bush as similar in integrity. Background from Wikipedia: quote: Once he became president, however, Bush raised taxes as a way to reduce the national budget deficit. Bush refused many times but was making no progress with a Senate and House that was controlled by Democrats. Bush eventually agreed to a compromise with Congressional Democrats to raise several taxes as part of a 1990 budget agreement. ... The budget for the next fiscal year proved far more difficult. Bush initially presented Congress a proposed budget containing steep spending cuts and no new taxes, but congressional Democrats dismissed this out of hand. Negotiations began, but it was clear little progress could be made without a compromise on taxes. ... The alternative would have been to veto any budget bill that came out of Congress, risking a potential government shutdown and possibly triggering the automatic cuts of the Gramm-Rudman-Hollings Act. At the end of June, Bush released a statement stating that \"it is clear to me that both the size of the deficit problem and the need for a package that can be enacted require all of the following: entitlement and mandatory program reform, tax revenue increases, growth incentives, discretionary spending reductions, orderly reductions in defense expenditures, and budget process reform.\" ... Some of the most enraged over the change in policy were other Republicans, including House Whip Newt Gingrich, the Senate leadership, and Vice President Dan Quayle. Saw Tax Revenue increases; Saw some Growth Incentives; Don't really reacall any Discretionary Spending Reductions; Not sure how Orderly the Reductions in Defense Expenditures was; BUT Funny how we have never seen any of the reform. This message has been edited. Last edited by: oseles, Wed 18 March 2009 09:28 AM",
        "intTime": 20090318,
        "postID": 8,
        "quote": "Once he became president, however, Bush raised taxes as a way to reduce the national budget deficit. Bush refused many times but was making no progress with a Senate and House that was controlled by Democrats. Bush eventually agreed to a compromise with Congressional Democrats to raise several taxes as part of a 1990 budget agreement. ... The budget for the next fiscal year proved far more difficult. Bush initially presented Congress a proposed budget containing steep spending cuts and no new taxes, but congressional Democrats dismissed this out of hand. Negotiations began, but it was clear little progress could be made without a compromise on taxes. ... The alternative would have been to veto any budget bill that came out of Congress, risking a potential government shutdown and possibly triggering the automatic cuts of the Gramm-Rudman-Hollings Act. At the end of June, Bush released a statement stating that \"it is clear to me that both the size of the deficit problem and the need for a package that can be enacted require all of the following: entitlement and mandatory program reform, tax revenue increases, growth incentives, discretionary spending reductions, orderly reductions in defense expenditures, and budget process reform.\" ... Some of the most enraged over the change in policy were other Republicans, including House Whip Newt Gingrich, the Senate leadership, and Vice President Dan Quayle.",
        "reply": "PW, Newt contributed to the problem, but that was with the whole \"Contract with America\" pitch in 94, 2 years into President Clinton's first term. As you recall, the Republicans lost heavily in 92 based on two mantras from the Democrats: 1) 'Its the Economy STUPID' and 2) 'Read my lips: No new taxes' from President Bush's (Elder) 1988 Republican National Convention acceptance speach. (The BBC had some interesting comments on it) And that was after the Democrat Leadership went to President Bush and convinced him that they ABSOLUTELY had to have taxes raised to get them out of the current recession, causing a revenue shortfall and the PROMISED that it would NOT be used as a campaign issue in his re-election run in 92. Granted that Buchanan used it extensively in his Primary runs, but it was James Carville that really built it into a theme for Cinton. It was regarded as one of the most effective of all of Clinton's campaign ads. Despite the variety of scandals that affected Clinton during the election, polls showed the public viewed Clinton and Bush as similar in integrity. Background from Wikipedia:  Saw Tax Revenue increases; Saw some Growth Incentives; Don't really reacall any Discretionary Spending Reductions; Not sure how Orderly the Reductions in Defense Expenditures was; BUT Funny how we have never seen any of the reform. This message has been edited. Last edited by: oseles, Wed 18 March 2009 09:28 AM",
        "threadID": "6960020520001_4750080812001",
        "time": "2009-03-18 08:41:00",
        "title": "Hypocrisy in Government",
        "userID": "oseles"
    },
    {
        "content": "quote: Originally posted by oseles: PW, Newt contributed to the problem, but that was with the whole \"Contract with America\" pitch in 94, 2 years into President Clinton's first term. As you recall, the Republicans lost heavily in 92 based on two mantras from the Democrats: 1) 'Its the Economy STUPID' and 2) 'Read my lips: No new taxes' from President Bush's (Elder) 1988 Republican National Convention acceptance speach. (The BBC had some interesting comments on it) And that was after the Democrat Leadership went to President Bush and convinced him that they ABSOLUTELY had to have taxes raised to get them out of the current recession, causing a revenue shortfall and the PROMISED that it would NOT be used as a campaign issue in his re-election run in 92. Granted that Buchanan used it extensively in his Primary runs, but it was James Carville that really built it into a theme for Cinton. It was regarded as one of the most effective of all of Clinton's campaign ads. Despite the variety of scandals that affected Clinton during the election, polls showed the public viewed Clinton and Bush as similar in integrity. Background from Wikipedia: quote: Once he became president, however, Bush raised taxes as a way to reduce the national budget deficit. Bush refused many times but was making no progress with a Senate and House that was controlled by Democrats. Bush eventually agreed to a compromise with Congressional Democrats to raise several taxes as part of a 1990 budget agreement. ... The budget for the next fiscal year proved far more difficult. Bush initially presented Congress a proposed budget containing steep spending cuts and no new taxes, but congressional Democrats dismissed this out of hand. Negotiations began, but it was clear little progress could be made without a compromise on taxes. ... The alternative would have been to veto any budget bill that came out of Congress, risking a potential government shutdown and possibly triggering the automatic cuts of the Gramm-Rudman-Hollings Act. At the end of June, Bush released a statement stating that \"it is clear to me that both the size of the deficit problem and the need for a package that can be enacted require all of the following: entitlement and mandatory program reform, tax revenue increases, growth incentives, discretionary spending reductions, orderly reductions in defense expenditures, and budget process reform.\" ... Some of the most enraged over the change in policy were other Republicans, including House Whip Newt Gingrich, the Senate leadership, and Vice President Dan Quayle. Saw Tax Revenue increases; Saw some Growth Incentives; Don't really reacall any Discretionary Spending Reductions; Not sure how Orderly the Reductions in Defense Expenditures was; BUT Funny how we have never seen any of the reform. Oseles - Thank you for the trip down memory lane (heh!), and I am inclined to agree. Both parties are loaded with back-stabbing problem children for sure (which is why I am not affiliated with either of them). There were significant defense spending reductions during the Clinton years that many conservatives feel is evidence of how much Clinton despised the military, when in fact he merely executed the military reduction plans put into place by the GHW Bush administration under the guise of Gen Colin Powell. Every president inherits the military left behind by his predecessor, and President GW Bush inherited a strong, well trained, well armed military that he took to war in Afghanistan and later Iraq. For some reason, people believe that magically, GW Bush waved a wand and made our military what it was before those campaigns started. He did however, leave behind an exhausted army at the lowest state of readiness since Viet Nam. But w/r/t reform, we certainly need it in a number of key areas: political campaign finance, lobbying, military acquisition, education, energy, and healthcare. For starters. Cheers.",
        "intTime": 20090318,
        "postID": 9,
        "quote": "Originally posted by oseles: PW, Newt contributed to the problem, but that was with the whole \"Contract with America\" pitch in 94, 2 years into President Clinton's first term. As you recall, the Republicans lost heavily in 92 based on two mantras from the Democrats: 1) 'Its the Economy STUPID' and 2) 'Read my lips: No new taxes' from President Bush's (Elder) 1988 Republican National Convention acceptance speach. (The BBC had some interesting comments on it) And that was after the Democrat Leadership went to President Bush and convinced him that they ABSOLUTELY had to have taxes raised to get them out of the current recession, causing a revenue shortfall and the PROMISED that it would NOT be used as a campaign issue in his re-election run in 92. Granted that Buchanan used it extensively in his Primary runs, but it was James Carville that really built it into a theme for Cinton. It was regarded as one of the most effective of all of Clinton's campaign ads. Despite the variety of scandals that affected Clinton during the election, polls showed the public viewed Clinton and Bush as similar in integrity. Background from Wikipedia: quote: Once he became president, however, Bush raised taxes as a way to reduce the national budget deficit. Bush refused many times but was making no progress with a Senate and House that was controlled by Democrats. Bush eventually agreed to a compromise with Congressional Democrats to raise several taxes as part of a 1990 budget agreement. ... The budget for the next fiscal year proved far more difficult. Bush initially presented Congress a proposed budget containing steep spending cuts and no new taxes, but congressional Democrats dismissed this out of hand. Negotiations began, but it was clear little progress could be made without a compromise on taxes. ... The alternative would have been to veto any budget bill that came out of Congress, risking a potential government shutdown and possibly triggering the automatic cuts of the Gramm-Rudman-Hollings Act. At the end of June, Bush released a statement stating that \"it is clear to me that both the size of the deficit problem and the need for a package that can be enacted require all of the following: entitlement and mandatory program reform, tax revenue increases, growth incentives, discretionary spending reductions, orderly reductions in defense expenditures, and budget process reform.\" ... Some of the most enraged over the change in policy were other Republicans, including House Whip Newt Gingrich, the Senate leadership, and Vice President Dan Quayle. Saw Tax Revenue increases; Saw some Growth Incentives; Don't really reacall any Discretionary Spending Reductions; Not sure how Orderly the Reductions in Defense Expenditures was; BUT Funny how we have never seen any of the reform.",
        "reply": " Oseles - Thank you for the trip down memory lane (heh!), and I am inclined to agree. Both parties are loaded with back-stabbing problem children for sure (which is why I am not affiliated with either of them). There were significant defense spending reductions during the Clinton years that many conservatives feel is evidence of how much Clinton despised the military, when in fact he merely executed the military reduction plans put into place by the GHW Bush administration under the guise of Gen Colin Powell. Every president inherits the military left behind by his predecessor, and President GW Bush inherited a strong, well trained, well armed military that he took to war in Afghanistan and later Iraq. For some reason, people believe that magically, GW Bush waved a wand and made our military what it was before those campaigns started. He did however, leave behind an exhausted army at the lowest state of readiness since Viet Nam. But w/r/t reform, we certainly need it in a number of key areas: political campaign finance, lobbying, military acquisition, education, energy, and healthcare. For starters. Cheers.",
        "threadID": "6960020520001_4750080812001",
        "time": "2009-03-18 11:21:00",
        "title": "Hypocrisy in Government",
        "userID": "PolicyWonk"
    },
    {
        "content": "Why the hell are WE giving Gaza $900 mill? Who's idea was this? I wouldn't give them a plugged nickel. As for Bush&Co, after 9/11 Rummy wanted to bomb Iraq. Why? Target rich environment. This is true. Karzai? Corrupt, he is undermining our efforts to kill AQ/T-ban, and his authority is limited to Kabul. A-stan is a tribal society, our mission there is rid A-stan of AQ/T-ban. The military is starting to hit targets all over P-stan-where the problem really is-and should be ramped up and include manned aircraft. We must get this over with ASAP. There are more dangerous problems ahead.",
        "intTime": 20090319,
        "postID": 10,
        "quote": "",
        "reply": "Why the hell are WE giving Gaza $900 mill? Who's idea was this? I wouldn't give them a plugged nickel. As for Bush&Co, after 9/11 Rummy wanted to bomb Iraq. Why? Target rich environment. This is true. Karzai? Corrupt, he is undermining our efforts to kill AQ/T-ban, and his authority is limited to Kabul. A-stan is a tribal society, our mission there is rid A-stan of AQ/T-ban. The military is starting to hit targets all over P-stan-where the problem really is-and should be ramped up and include manned aircraft. We must get this over with ASAP. There are more dangerous problems ahead.",
        "threadID": "6960020520001_4750080812001",
        "time": "2009-03-19 11:03:00",
        "title": "Hypocrisy in Government",
        "userID": "RHYNO506"
    },
    {
        "content": "quote: Originally posted by RHYNO506: Why the hell are WE giving Gaza $900 mill? Who's idea was this? I wouldn't give them a plugged nickel. As for Bush&Co, after 9/11 Rummy wanted to bomb Iraq. Why? Target rich environment. This is true. Karzai? Corrupt, he is undermining our efforts to kill AQ/T-ban, and his authority is limited to Kabul. A-stan is a tribal society, our mission there is rid A-stan of AQ/T-ban. The military is starting to hit targets all over P-stan-where the problem really is-and should be ramped up and include manned aircraft. We must get this over with ASAP. There are more dangerous problems ahead. First question ($900M to Gaza): excellent question, in light of the fact that Hamas refuses to recognize Isreal (this isn't to say I don't see issues with blindly giving Isreal $3B year regardless of them acting in ways destructive to American interests). Rummy and Iraq: The administration wanted their oil, and it was an easy target that couldn't fight back. And it only cost us about $1B - it was cheap!!! (or so Wolfowicz claimed, but it seems he was off the mark a trifle ) Cheers.",
        "intTime": 20090320,
        "postID": 11,
        "quote": "Originally posted by RHYNO506: Why the hell are WE giving Gaza $900 mill? Who's idea was this? I wouldn't give them a plugged nickel. As for Bush&Co, after 9/11 Rummy wanted to bomb Iraq. Why? Target rich environment. This is true. Karzai? Corrupt, he is undermining our efforts to kill AQ/T-ban, and his authority is limited to Kabul. A-stan is a tribal society, our mission there is rid A-stan of AQ/T-ban. The military is starting to hit targets all over P-stan-where the problem really is-and should be ramped up and include manned aircraft. We must get this over with ASAP. There are more dangerous problems ahead.",
        "reply": " First question ($900M to Gaza): excellent question, in light of the fact that Hamas refuses to recognize Isreal (this isn't to say I don't see issues with blindly giving Isreal $3B year regardless of them acting in ways destructive to American interests). Rummy and Iraq: The administration wanted their oil, and it was an easy target that couldn't fight back. And it only cost us about $1B - it was cheap!!! (or so Wolfowicz claimed, but it seems he was off the mark a trifle ) Cheers.",
        "threadID": "6960020520001_4750080812001",
        "time": "2009-03-20 08:45:00",
        "title": "Hypocrisy in Government",
        "userID": "PolicyWonk"
    },
    {
        "content": "1) PW: I'm pretty much with your comments 2) Interesting how Mr. Eland would be called all sorts of things when he criticized Bush/Cheney, especially \"leftie\" or \"lib\" as I remember. We can see now how Mr. Eland is a genuine centrist Libertarian. 3) As to the criticisms of Obama/Biden, some seem fair and some seem based on overgeneralizations. Although not justifying duplicity or deception, there is a genuine difference between using a huge crisis to increase programs for health and/or education versus using a huge crisis to dangerously enhance Executive powers and suppress civil liberties. And openness might be a critical difference in the politics. 4) As to \"the politics\" it's nothing new to wheel and deal and make all sorts of compromises that, to idealists of any stripe, look like selling out. It's the New Age illusion of morality to say that compromise is somehow less than principled and that rigid adherence to a particular campaign promise or position is required to be principled. 5) It's possible that funding reforms in \"new education, energy, and health initiatives\" is totally consistent with what is believed to be the long term solutions to the current economic problems. No hidden agenda. No bait and switch. This is a whole universe away, politically and morally, from using the widely supported invasion of Afghanistan as a disguised staging of the controversial invasion of Iraq.",
        "intTime": 20090324,
        "postID": 12,
        "quote": "",
        "reply": "1) PW: I'm pretty much with your comments 2) Interesting how Mr. Eland would be called all sorts of things when he criticized Bush/Cheney, especially \"leftie\" or \"lib\" as I remember. We can see now how Mr. Eland is a genuine centrist Libertarian. 3) As to the criticisms of Obama/Biden, some seem fair and some seem based on overgeneralizations. Although not justifying duplicity or deception, there is a genuine difference between using a huge crisis to increase programs for health and/or education versus using a huge crisis to dangerously enhance Executive powers and suppress civil liberties. And openness might be a critical difference in the politics. 4) As to \"the politics\" it's nothing new to wheel and deal and make all sorts of compromises that, to idealists of any stripe, look like selling out. It's the New Age illusion of morality to say that compromise is somehow less than principled and that rigid adherence to a particular campaign promise or position is required to be principled. 5) It's possible that funding reforms in \"new education, energy, and health initiatives\" is totally consistent with what is believed to be the long term solutions to the current economic problems. No hidden agenda. No bait and switch. This is a whole universe away, politically and morally, from using the widely supported invasion of Afghanistan as a disguised staging of the controversial invasion of Iraq.",
        "threadID": "6960020520001_4750080812001",
        "time": "2009-03-24 08:31:00",
        "title": "Hypocrisy in Government",
        "userID": "bwf27"
    },
    {
        "content": "quote: Originally posted by bwf27: 1) PW: I'm pretty much with your comments 2) Interesting how Mr. Eland would be called all sorts of things when he criticized Bush/Cheney, especially \"leftie\" or \"lib\" as I remember. We can see now how Mr. Eland is a genuine centrist Libertarian. 3) As to the criticisms of Obama/Biden, some seem fair and some seem based on overgeneralizations. Although not justifying duplicity or deception, there is a genuine difference between using a huge crisis to increase programs for health and/or education versus using a huge crisis to dangerously enhance Executive powers and suppress civil liberties. And openness might be a critical difference in the politics. 4) As to \"the politics\" it's nothing new to wheel and deal and make all sorts of compromises that, to idealists of any stripe, look like selling out. It's the New Age illusion of morality to say that compromise is somehow less than principled and that rigid adherence to a particular campaign promise or position is required to be principled. 5) It's possible that funding reforms in \"new education, energy, and health initiatives\" is totally consistent with what is believed to be the long term solutions to the current economic problems. No hidden agenda. No bait and switch. This is a whole universe away, politically and morally, from using the widely supported invasion of Afghanistan as a disguised staging of the controversial invasion of Iraq. Thank you, sir. W/r/t your comment on the idealists being critical of any compromise and then claiming that whoever did so \"sold out\" their principals. I find that these folks have forgotten that our founding fathers based our government, including the houses of representatives, the executive branch, and the judiciary on the requirement to compromise. They were arguably a collection of the most brilliant political minds in history - and those that discourage their representatives to undermine that design need to go and take a remedial course in civics. Cheers. PW.",
        "intTime": 20090326,
        "postID": 13,
        "quote": "Originally posted by bwf27: 1) PW: I'm pretty much with your comments 2) Interesting how Mr. Eland would be called all sorts of things when he criticized Bush/Cheney, especially \"leftie\" or \"lib\" as I remember. We can see now how Mr. Eland is a genuine centrist Libertarian. 3) As to the criticisms of Obama/Biden, some seem fair and some seem based on overgeneralizations. Although not justifying duplicity or deception, there is a genuine difference between using a huge crisis to increase programs for health and/or education versus using a huge crisis to dangerously enhance Executive powers and suppress civil liberties. And openness might be a critical difference in the politics. 4) As to \"the politics\" it's nothing new to wheel and deal and make all sorts of compromises that, to idealists of any stripe, look like selling out. It's the New Age illusion of morality to say that compromise is somehow less than principled and that rigid adherence to a particular campaign promise or position is required to be principled. 5) It's possible that funding reforms in \"new education, energy, and health initiatives\" is totally consistent with what is believed to be the long term solutions to the current economic problems. No hidden agenda. No bait and switch. This is a whole universe away, politically and morally, from using the widely supported invasion of Afghanistan as a disguised staging of the controversial invasion of Iraq.",
        "reply": " Thank you, sir. W/r/t your comment on the idealists being critical of any compromise and then claiming that whoever did so \"sold out\" their principals. I find that these folks have forgotten that our founding fathers based our government, including the houses of representatives, the executive branch, and the judiciary on the requirement to compromise. They were arguably a collection of the most brilliant political minds in history - and those that discourage their representatives to undermine that design need to go and take a remedial course in civics. Cheers. PW.",
        "threadID": "6960020520001_4750080812001",
        "time": "2009-03-26 13:20:00",
        "title": "Hypocrisy in Government",
        "userID": "PolicyWonk"
    },
    {
        "content": "A few good points brought up by Eland, but it's fish bait. If he thinks the elections in Palestine were fair and Hamas won them without intimidation or cohersion, I want to know what he is smoking. I'd wish he'd show me WHEN throughout US military history have we given habeus corpus to enemy combatants. We held them until the war was over. According to PBO it is no longer a war, so maybe we should turn them over to Murtha's district. Plus, he fails to mention that Lincoln suspended habeus corpus for US citizens during the Civil War (or War of Occupation for the Sons of the Confederates). Eland is trying to distance himself from the left and disguising himself as a Libertarian.",
        "intTime": 20090327,
        "postID": 14,
        "quote": "",
        "reply": "A few good points brought up by Eland, but it's fish bait. If he thinks the elections in Palestine were fair and Hamas won them without intimidation or cohersion, I want to know what he is smoking. I'd wish he'd show me WHEN throughout US military history have we given habeus corpus to enemy combatants. We held them until the war was over. According to PBO it is no longer a war, so maybe we should turn them over to Murtha's district. Plus, he fails to mention that Lincoln suspended habeus corpus for US citizens during the Civil War (or War of Occupation for the Sons of the Confederates). Eland is trying to distance himself from the left and disguising himself as a Libertarian.",
        "threadID": "6960020520001_4750080812001",
        "time": "2009-03-27 13:25:00",
        "title": "Hypocrisy in Government",
        "userID": "yanqui69"
    }
]