[
    {
        "content": "Detailed Account of the Pirates Demise I'll just tell you what I found out from my contacts at NSWC Norfolk and at SOCOM Tampa. by Buddy Wellborn, USNA Class of 1959, First, let me orient you to familiarize you with the \"terrain.\" In Africa from Djibouti at the southern end of the Red Sea eastward through the Gulf of Aden to round Cape Guardafui at the easternmost tip of Africa (also known as \"The Horn of Africa\") is about a 600 nm transit before you stand out into the Indian Ocean. That transit is comparable in distance to that from the mouth of the Mississippi at New Orleans to the tip of Florida at Key West-- except that 600 nm over there is infested with Somalia pirates. Ships turning southward at the Horn of Africa transit the SLOC (Sea Lane of Commerce) along the east coast of Somalia because of the prevailing southerly currents there. It's about 1,500 nm on to Mombassa, which is just south of the equator in Kenya. Comparably, that's about the transit distance from Portland Maine down the east coast of the US to Miami Florida. In other words, the ocean area being patrolled by our naval forces off the coast of Somalia< /st1:country-region> is comparable to that in the Gulf of Mexico from the Mississippi River east to Miami then up the eastern seaboard to Maine. Second, let me globally orient you from our Naval Operating Base in Norfolk, VA, east across the Atlantic to North Africa, thence across the Med to Suez in Egypt, thence southward down the Red Sea to Djibouti at the Gulf of Aden, thence eastward to round Cape Guardafui at the easternmost tip of Africa, and thence southerly some 300 miles down the east cost of Somali out into the high seas of the Indian Ocean to the position of MV ALABAMA is a little more than 7,000 nm, and plus-nine time-zones ahead of EST. Hold that thought, in that, a C-17 transport averaging a little better than 400 kts (SOG) takes the best part of 18 hours to make that trip. In the evening darkness late Thursday night, a team of Navy SEALs from NSWC (Naval Surface Warfare Center) Norfolk parachuted from such a C-17 into the black waters (no refraction of light) of the Indian Ocean-- close-aboard to our 40,000 ton amphibious assault ship, USS BOXER (LHD 4), the flagship of our ESG (Expeditionary Strike Group) in the AOR (Area Of Responsibility, the Gulf of Aden). They not only parachuted in with all of their \"equipment,\" they had their own inflatable boats, RHIB's (Rigid Hull, Inflatable Boats) with them for over-water transport. They went into BOXER's landing dock, debarked, and staged for the rescue-- Thursday night. And, let me comment on time-late: In that the SEAL's quick response-- departing ready-alert in less than 4 hours from Norfolk-- supposedly surprised POTUS's staff, whereas President Obama was miffed not to get his \"cops\" there before the Navy. He reportedly questioned his staff, \"Will 'my' FBI people get there before the Navy does?\" It took the FBI almost 12 hours to put together a team and get them packed-up-- for an \"at sea\" rescue. The FBI was trying to tell him that they are not practiced to do this-- Navy SEALs are. But, BHO wanted the FBI there \"to help,\" that is, carry out the Attorney General's (his) orders to negotiate the release of Captain Phillips peacefully-- because apparently he doesn't trust GW's military to carry out his \"political guidance.\" The flight of the FBI's passenger jet took a little less than 14 hours at 500-some knots to get to Djibouti. BOXER'S helos picked them up and transported them out to the ship. The Navy SEALs were already there, staged, and ready to act by the time POTUS's FBI arrived on board latter that evening. Notably, the first request by the OSC (On Scene Commander) that early Friday morning to take them out and save Captain Phillips was denied, to wit: \"No, wait until 'my' FBI people get there.\" Third, please consider a candid assessment of ability that finds that the FBI snipers had never practiced shooting from a rolling, pitching, yawing, surging, swaying, heaving platform-- and, target-- such as a ship and a lifeboat on the high seas. Navies have been doing since Admiral Nelson who had trained \"Marines\" to shoot muskets from the ship's rigging-- ironically, he was killed at sea in HMS VICTORY at the Battle of Trafalgar by a French Marine rifleman that shot him from the rigging of the French ship that they were grappling alongside. Notably, when I was first training at USNA in 1955, the Navy was doing it with a SATU, Small Arms Training Unit, based at our Little Creek amphib base. Now, Navy SEAL's, in particular SEAL Team SIX (The \"DevGru\") based at NSWC (Naval Surface Warfare Center) a t Little Creek do that training now, and hone their skills professionally-- daily. Shooting small arms from a ship is more of an accomplished \"Art Form\" than it is a practiced skill. When you are \"in the bubble\" and \"in tune\" with the harmonic motion you find, through practice, that you are \"able to put three .308 slugs inside the head of a quarter at 100 meters, in day or night-- or, behind a camouflaged net or a thin enclosure, such as a superstructure bulkhead. Yes, we have the monocular scopes that can \"see\" heat-- and, draw a bead on it. SEALs are absolutely expert at it-- with the movie clips to prove it. Okay, now try to imagine patrolling among the boats fishing everyday out on the Grand Banks off our New England coast, and then responding to a distress call from down around the waters between Florida and the Bahamas. Three points for you to consider here: (1) Time-Distance-Speed relationships for ships on the high seas, for instance, at a 25-knot SOA (Speed Of Advance) it takes 24 hours to make good 600 nm-- BAINBRIDGE did. (2) Fishermen work on the high seas, and (3) The best place to hide as a \"fisherman\" pirate is among other fishermen Early Wednesday morning, 4/8/2009, MV ALABAMA is at sea in the IO about 300 miles off the (east) coast of Somalia en route to Mombassa Kenya. Pirates in small boat start harassing her, and threatening her with weapons. MV ALABAMA's captain sent out the distress call by radio, and ordered his Engineer to shut down the engines as well as the ship-service electrical generators-- in our lingo, \"Go dark and cold.\" He informed his crew by radio what was happen ing, and ordered them to go to an out-of-the-way compartment and lock themselves in it-- from the inside. He would stay in the pilot house to \"negotiate\" with the pirates. The pirates boarded, captured the Captain, and ordered him to start the engines. He said he would order his Engineer to do so, and he called down to Engine Control on the internal communication system, but got no answer. The lead pirate ordered two of his four men to go down and find him and get the engines started. Inside a ship without any lights is like the definition of dark. The advantage goes to the people who work and live there. They jumped the two pirates in a dark passageway. Both pirates lost their weapons, but one managed to scramble and get away. The other they tied up, put tape over his mouth and a knife at his throat. Other members of the crew opened the drain cocks on the pirates boat and cast it adrift. It foundered and sunk. The scrambling pirate made it back to the pilot house and told of his demise. The pirates took the Captain at gun point, and told him to launch one of his rescue boats (not a life boat, per se). As he was lowering the boat for them, the crew appeared with the other pirate to negotiate a trade. The crew let their hostage go too soon, and the pirates kept the captain. But, he purposefully had lowered the boat so it would jam. With the rescue boat jammed, the pirates jumped over to a lifeboat and released it as the captain jumped in the water. They fired at him, made him stop, and grabbed him out of the water. Now, as night falls in the vastness of the Indian Ocean, we have the classic \"Mexican\" standoff, to wit: A life-boat that is just that, a life-boat adrift without any means of propulsion except oars and paddles; and, a huge (by comparison) Motor Vessel Container Ship adrift with a crew that is not going to leave their captain be hind. The pirates are enclosed under its shelter-covering, holding the captain as their hostage. The crew is hunkered down in their ship waiting for the \"posse\" to arrive. After receiving MV ALABAMA'S distress call, USS BAINBRIDGE (DDG 96) was dispatched by the ESG commander to respond to ALABAMA's distress call. At best sustainable speed, she arrived on scene the day after-- that is, in the dark of that early Thursday morning. As BAINBRIDGE quietly and slowly, at darkened-ship without any lights to give her away, arrived on scene, please consider a recorded interview with the Chief Engineer of MV ALABAMA describing BAINBRIDGE's arrival. He said it was something else \"... to see the Navy slide in there like a greyhound!\" He then said as she slipped in closer he could see the \"Stars and Stripes\" flying from her masthead. He got choked up saying it was the \"...proudest moment of my life.\" Phew! Let that sink in. Earlier in the day, one of the U.S. Navy's Maritime Patrol Aircraft, a fixed wing P3C, flew over to recon the scene. They dropped a buoy with a radio to the pirates so that the Navy's interpreter could talk with the pirates. When BAINBRIDGE arrived, the pirates thought the radio to be a beaconing device, and threw it overboard. They wanted a satellite telephone so that they could call home for help. Remember now, they are fishermen, not \"Rocket Scientists,\" in that, they don't know that we can intercept the phone transmission also. MV ALABAMA provided them with a satellite phone. They called home back to \"somebody\" in Eyl Somalia (so that we now know where you live) to come out and get them. The \"somebody\" in Eyl said they would be out right away with other hostages, like 54 of them from other countries, and that they would be coming out in two of their pirated ships. Right-- and, the tooth fairy will let you have sex with her. Yea, in paradise. The \"somebody\" in Eyl just chalked up four more expendables as overhead for \"the cost of operation.\" Next page. Anyway, ESG will continue to \"watch\" Eyl for any ships standing out. The Navy SEAL team, SEAL TEAM SIX, from NSWC briefed the OSC (Commander Castellano, CO BAINBRIDGE) on how they could rescue the captain from the life boat with swimmers-- \"Combat Swimmers,\" per se. That plan was denied by POTUS because it put the captain in danger-- and, involved killing the pirates. The FBI negotiators arrived on scene, and talked the pirates into sending their wounded man over for treatment Saturday morning. Later that afternoon, the SEAL's sent over their RHIB with food and water to recon the life boat but the pirates shot at it. They could have taken them out then (from being fired upon) but were denied again being told that the captain was not in \"imminent danger.\" The FBI negotiators calmed the situation by informing the pirates of threatening weather as they could see storm clouds closing from the horizon, and offered to tow the life boat. The pirates agreed, and BAINBRIDGE took them under tow in their wake at 30 meters-- exactly 30 meters, which is exactly the distance the SEALs practice their shooting skills. With the lifeboat under tow, riding comfortably bow-down on BAINBRIDGE's wake-wave (\"rooster tail\"), had a 17-second period of harmonic motion, and at the end of every half-period (8.5 seconds) was steady on. The light-enhanced (infra-red heat) monocular scopes on the SEAL's .308 caliber Mark 11 Mod 0 H&K suppressor-fitted sniper rifles easily imaged their target very clearly. Pirates in a life boat at 30-meters could be compared to fish in a barrel. &n bsp;All that was necessary was to take out the plexiglass window so that it would not deflect the trajectory of the high velocity .308 round. So, a sniper (one of four) with a wad-cutter round (a flaxen sabot) would take out the window a split second before the kill-shot-- no change in sight-picture, just the window blowing out, clean. Now, here's the part BHO's \"whiz kids\" knew as well as the Navy hierarchy, including CO BAINBRIDGE and CO SEAL TEAM SIX. It's the law in Article 19 of Appendix L in the \"Convention of the High Seas\" that the Commanding Officer of a US Ship on the high seas is obligated to respond to distress signals from any flagged ship (US or otherwise), and protect the life and property thereof when deemed to be in IMMINENT DANGER. So, in the final analysis, it would be Captain Castellano call as to \"Imminent Danger,\" and that he alone was obligated (duty bound) to act accordingly. Got the picture? After medically attending to the wounded pirated, and feeding him, come first light (from the east) on Easter Sunday morning and the pirates saw they were being towed further out to sea (instead of westward toward land), the wounded pirate demanded to be returned to the lifeboat. There would BE NO more negotiations-- and, the four Navy SEAL snipers \"in the bubble\" went \"Unlock.\" The pirate holding Captain Philips raised the gun to his head, and IMMINENT DANGER was so observed and noted in the Log as CO BAINBRIDGE gave the classic order: WEAPONS RELEASED! I can hear the echo in my earpiece now, \"On my count (from 8.5 seconds), 3, 2, 1, !\" POP, BANG! Out went the window, followed by three simultaneous shots. The scoreboard flashed: \"GAME OVER, GAME OVER-- NAVY 3, PIRATES 0!\" I hope you found the above informative as best I know it-- and, please excuse me in that after more than 50 years the Navy is still in me. I submit that AMERICA< /st1:country-region> is going to make a comeback, and more than likely it'll be on the back of our cherished youth serving with honor in Our military. So, let's Look Up, Get Up-- and, Never Give Up! God Bless Our Troops, and GOD SAVE AMERICA! Buddy Wellborn, USNA Class of 1959, Dickinson, Texas.",
        "intTime": 20090503,
        "postID": 1,
        "quote": "",
        "reply": "Detailed Account of the Pirates Demise I'll just tell you what I found out from my contacts at NSWC Norfolk and at SOCOM Tampa. by Buddy Wellborn, USNA Class of 1959, First, let me orient you to familiarize you with the \"terrain.\" In Africa from Djibouti at the southern end of the Red Sea eastward through the Gulf of Aden to round Cape Guardafui at the easternmost tip of Africa (also known as \"The Horn of Africa\") is about a 600 nm transit before you stand out into the Indian Ocean. That transit is comparable in distance to that from the mouth of the Mississippi at New Orleans to the tip of Florida at Key West-- except that 600 nm over there is infested with Somalia pirates. Ships turning southward at the Horn of Africa transit the SLOC (Sea Lane of Commerce) along the east coast of Somalia because of the prevailing southerly currents there. It's about 1,500 nm on to Mombassa, which is just south of the equator in Kenya. Comparably, that's about the transit distance from Portland Maine down the east coast of the US to Miami Florida. In other words, the ocean area being patrolled by our naval forces off the coast of Somalia< /st1:country-region> is comparable to that in the Gulf of Mexico from the Mississippi River east to Miami then up the eastern seaboard to Maine. Second, let me globally orient you from our Naval Operating Base in Norfolk, VA, east across the Atlantic to North Africa, thence across the Med to Suez in Egypt, thence southward down the Red Sea to Djibouti at the Gulf of Aden, thence eastward to round Cape Guardafui at the easternmost tip of Africa, and thence southerly some 300 miles down the east cost of Somali out into the high seas of the Indian Ocean to the position of MV ALABAMA is a little more than 7,000 nm, and plus-nine time-zones ahead of EST. Hold that thought, in that, a C-17 transport averaging a little better than 400 kts (SOG) takes the best part of 18 hours to make that trip. In the evening darkness late Thursday night, a team of Navy SEALs from NSWC (Naval Surface Warfare Center) Norfolk parachuted from such a C-17 into the black waters (no refraction of light) of the Indian Ocean-- close-aboard to our 40,000 ton amphibious assault ship, USS BOXER (LHD 4), the flagship of our ESG (Expeditionary Strike Group) in the AOR (Area Of Responsibility, the Gulf of Aden). They not only parachuted in with all of their \"equipment,\" they had their own inflatable boats, RHIB's (Rigid Hull, Inflatable Boats) with them for over-water transport. They went into BOXER's landing dock, debarked, and staged for the rescue-- Thursday night. And, let me comment on time-late: In that the SEAL's quick response-- departing ready-alert in less than 4 hours from Norfolk-- supposedly surprised POTUS's staff, whereas President Obama was miffed not to get his \"cops\" there before the Navy. He reportedly questioned his staff, \"Will 'my' FBI people get there before the Navy does?\" It took the FBI almost 12 hours to put together a team and get them packed-up-- for an \"at sea\" rescue. The FBI was trying to tell him that they are not practiced to do this-- Navy SEALs are. But, BHO wanted the FBI there \"to help,\" that is, carry out the Attorney General's (his) orders to negotiate the release of Captain Phillips peacefully-- because apparently he doesn't trust GW's military to carry out his \"political guidance.\" The flight of the FBI's passenger jet took a little less than 14 hours at 500-some knots to get to Djibouti. BOXER'S helos picked them up and transported them out to the ship. The Navy SEALs were already there, staged, and ready to act by the time POTUS's FBI arrived on board latter that evening. Notably, the first request by the OSC (On Scene Commander) that early Friday morning to take them out and save Captain Phillips was denied, to wit: \"No, wait until 'my' FBI people get there.\" Third, please consider a candid assessment of ability that finds that the FBI snipers had never practiced shooting from a rolling, pitching, yawing, surging, swaying, heaving platform-- and, target-- such as a ship and a lifeboat on the high seas. Navies have been doing since Admiral Nelson who had trained \"Marines\" to shoot muskets from the ship's rigging-- ironically, he was killed at sea in HMS VICTORY at the Battle of Trafalgar by a French Marine rifleman that shot him from the rigging of the French ship that they were grappling alongside. Notably, when I was first training at USNA in 1955, the Navy was doing it with a SATU, Small Arms Training Unit, based at our Little Creek amphib base. Now, Navy SEAL's, in particular SEAL Team SIX (The \"DevGru\") based at NSWC (Naval Surface Warfare Center) a t Little Creek do that training now, and hone their skills professionally-- daily. Shooting small arms from a ship is more of an accomplished \"Art Form\" than it is a practiced skill. When you are \"in the bubble\" and \"in tune\" with the harmonic motion you find, through practice, that you are \"able to put three .308 slugs inside the head of a quarter at 100 meters, in day or night-- or, behind a camouflaged net or a thin enclosure, such as a superstructure bulkhead. Yes, we have the monocular scopes that can \"see\" heat-- and, draw a bead on it. SEALs are absolutely expert at it-- with the movie clips to prove it. Okay, now try to imagine patrolling among the boats fishing everyday out on the Grand Banks off our New England coast, and then responding to a distress call from down around the waters between Florida and the Bahamas. Three points for you to consider here: (1) Time-Distance-Speed relationships for ships on the high seas, for instance, at a 25-knot SOA (Speed Of Advance) it takes 24 hours to make good 600 nm-- BAINBRIDGE did. (2) Fishermen work on the high seas, and (3) The best place to hide as a \"fisherman\" pirate is among other fishermen Early Wednesday morning, 4/8/2009, MV ALABAMA is at sea in the IO about 300 miles off the (east) coast of Somalia en route to Mombassa Kenya. Pirates in small boat start harassing her, and threatening her with weapons. MV ALABAMA's captain sent out the distress call by radio, and ordered his Engineer to shut down the engines as well as the ship-service electrical generators-- in our lingo, \"Go dark and cold.\" He informed his crew by radio what was happen ing, and ordered them to go to an out-of-the-way compartment and lock themselves in it-- from the inside. He would stay in the pilot house to \"negotiate\" with the pirates. The pirates boarded, captured the Captain, and ordered him to start the engines. He said he would order his Engineer to do so, and he called down to Engine Control on the internal communication system, but got no answer. The lead pirate ordered two of his four men to go down and find him and get the engines started. Inside a ship without any lights is like the definition of dark. The advantage goes to the people who work and live there. They jumped the two pirates in a dark passageway. Both pirates lost their weapons, but one managed to scramble and get away. The other they tied up, put tape over his mouth and a knife at his throat. Other members of the crew opened the drain cocks on the pirates boat and cast it adrift. It foundered and sunk. The scrambling pirate made it back to the pilot house and told of his demise. The pirates took the Captain at gun point, and told him to launch one of his rescue boats (not a life boat, per se). As he was lowering the boat for them, the crew appeared with the other pirate to negotiate a trade. The crew let their hostage go too soon, and the pirates kept the captain. But, he purposefully had lowered the boat so it would jam. With the rescue boat jammed, the pirates jumped over to a lifeboat and released it as the captain jumped in the water. They fired at him, made him stop, and grabbed him out of the water. Now, as night falls in the vastness of the Indian Ocean, we have the classic \"Mexican\" standoff, to wit: A life-boat that is just that, a life-boat adrift without any means of propulsion except oars and paddles; and, a huge (by comparison) Motor Vessel Container Ship adrift with a crew that is not going to leave their captain be hind. The pirates are enclosed under its shelter-covering, holding the captain as their hostage. The crew is hunkered down in their ship waiting for the \"posse\" to arrive. After receiving MV ALABAMA'S distress call, USS BAINBRIDGE (DDG 96) was dispatched by the ESG commander to respond to ALABAMA's distress call. At best sustainable speed, she arrived on scene the day after-- that is, in the dark of that early Thursday morning. As BAINBRIDGE quietly and slowly, at darkened-ship without any lights to give her away, arrived on scene, please consider a recorded interview with the Chief Engineer of MV ALABAMA describing BAINBRIDGE's arrival. He said it was something else \"... to see the Navy slide in there like a greyhound!\" He then said as she slipped in closer he could see the \"Stars and Stripes\" flying from her masthead. He got choked up saying it was the \"...proudest moment of my life.\" Phew! Let that sink in. Earlier in the day, one of the U.S. Navy's Maritime Patrol Aircraft, a fixed wing P3C, flew over to recon the scene. They dropped a buoy with a radio to the pirates so that the Navy's interpreter could talk with the pirates. When BAINBRIDGE arrived, the pirates thought the radio to be a beaconing device, and threw it overboard. They wanted a satellite telephone so that they could call home for help. Remember now, they are fishermen, not \"Rocket Scientists,\" in that, they don't know that we can intercept the phone transmission also. MV ALABAMA provided them with a satellite phone. They called home back to \"somebody\" in Eyl Somalia (so that we now know where you live) to come out and get them. The \"somebody\" in Eyl said they would be out right away with other hostages, like 54 of them from other countries, and that they would be coming out in two of their pirated ships. Right-- and, the tooth fairy will let you have sex with her. Yea, in paradise. The \"somebody\" in Eyl just chalked up four more expendables as overhead for \"the cost of operation.\" Next page. Anyway, ESG will continue to \"watch\" Eyl for any ships standing out. The Navy SEAL team, SEAL TEAM SIX, from NSWC briefed the OSC (Commander Castellano, CO BAINBRIDGE) on how they could rescue the captain from the life boat with swimmers-- \"Combat Swimmers,\" per se. That plan was denied by POTUS because it put the captain in danger-- and, involved killing the pirates. The FBI negotiators arrived on scene, and talked the pirates into sending their wounded man over for treatment Saturday morning. Later that afternoon, the SEAL's sent over their RHIB with food and water to recon the life boat but the pirates shot at it. They could have taken them out then (from being fired upon) but were denied again being told that the captain was not in \"imminent danger.\" The FBI negotiators calmed the situation by informing the pirates of threatening weather as they could see storm clouds closing from the horizon, and offered to tow the life boat. The pirates agreed, and BAINBRIDGE took them under tow in their wake at 30 meters-- exactly 30 meters, which is exactly the distance the SEALs practice their shooting skills. With the lifeboat under tow, riding comfortably bow-down on BAINBRIDGE's wake-wave (\"rooster tail\"), had a 17-second period of harmonic motion, and at the end of every half-period (8.5 seconds) was steady on. The light-enhanced (infra-red heat) monocular scopes on the SEAL's .308 caliber Mark 11 Mod 0 H&K suppressor-fitted sniper rifles easily imaged their target very clearly. Pirates in a life boat at 30-meters could be compared to fish in a barrel. &n bsp;All that was necessary was to take out the plexiglass window so that it would not deflect the trajectory of the high velocity .308 round. So, a sniper (one of four) with a wad-cutter round (a flaxen sabot) would take out the window a split second before the kill-shot-- no change in sight-picture, just the window blowing out, clean. Now, here's the part BHO's \"whiz kids\" knew as well as the Navy hierarchy, including CO BAINBRIDGE and CO SEAL TEAM SIX. It's the law in Article 19 of Appendix L in the \"Convention of the High Seas\" that the Commanding Officer of a US Ship on the high seas is obligated to respond to distress signals from any flagged ship (US or otherwise), and protect the life and property thereof when deemed to be in IMMINENT DANGER. So, in the final analysis, it would be Captain Castellano call as to \"Imminent Danger,\" and that he alone was obligated (duty bound) to act accordingly. Got the picture? After medically attending to the wounded pirated, and feeding him, come first light (from the east) on Easter Sunday morning and the pirates saw they were being towed further out to sea (instead of westward toward land), the wounded pirate demanded to be returned to the lifeboat. There would BE NO more negotiations-- and, the four Navy SEAL snipers \"in the bubble\" went \"Unlock.\" The pirate holding Captain Philips raised the gun to his head, and IMMINENT DANGER was so observed and noted in the Log as CO BAINBRIDGE gave the classic order: WEAPONS RELEASED! I can hear the echo in my earpiece now, \"On my count (from 8.5 seconds), 3, 2, 1, !\" POP, BANG! Out went the window, followed by three simultaneous shots. The scoreboard flashed: \"GAME OVER, GAME OVER-- NAVY 3, PIRATES 0!\" I hope you found the above informative as best I know it-- and, please excuse me in that after more than 50 years the Navy is still in me. I submit that AMERICA< /st1:country-region> is going to make a comeback, and more than likely it'll be on the back of our cherished youth serving with honor in Our military. So, let's Look Up, Get Up-- and, Never Give Up! God Bless Our Troops, and GOD SAVE AMERICA! Buddy Wellborn, USNA Class of 1959, Dickinson, Texas.",
        "threadID": "6960020520001_3250093222001",
        "time": "2009-05-03 09:30:00",
        "title": "Captain of the Bainbridge gave the order to shoot Pirates not POTUS",
        "userID": "20777261"
    }
]