[
    {
        "content": "RE: http://www.military.com/opinion/0,15202,187696,00.html So what is supposed to happened when the three 'peaceable kingdoms' of Iraq sit down to 'share the wealth'? The one sucking hind tit, without any oil reserves, is also the one that represents the largest Muslim group in the area - also the most warlike - the Sunni. Instead of civil war, this has the makings of a regional conflict. Then again a peaceful and united Iraq(middle east?) has been difficult to exploit, hasn't it? Another 'blindsiding', another byproduct of applied stupidity? Or was it part of the game plan all along?",
        "intTime": 20090328,
        "postID": 1,
        "quote": "",
        "reply": "RE: http://www.military.com/opinion/0,15202,187696,00.html So what is supposed to happened when the three 'peaceable kingdoms' of Iraq sit down to 'share the wealth'? The one sucking hind tit, without any oil reserves, is also the one that represents the largest Muslim group in the area - also the most warlike - the Sunni. Instead of civil war, this has the makings of a regional conflict. Then again a peaceful and united Iraq(middle east?) has been difficult to exploit, hasn't it? Another 'blindsiding', another byproduct of applied stupidity? Or was it part of the game plan all along?",
        "threadID": "6960020520001_9320061912001",
        "time": "2009-03-28 05:11:00",
        "title": "Warning from Bosnia for Iraq",
        "userID": "AliBubba"
    },
    {
        "content": "quote: The same is true for Iraq. The U.S. politicians, media, and public were blindsided by the hurricane of violence in Iraq from 2003 until 2008. Not entirely true. The US politicians that were \"blindsided\" were those that opted to ignore the many warnings that came from the Department of State in addition to many middle east experts that tried to get the Bush administration to make a decision based upon FACTS. Anyone who brought these problems up were ridiculed, mocked, demoted, and otherwise ignored. In fact, Eric Shinseki was ridiculed (and worse) for suggesting that securing the country would take in excess of 400k troops (approximately 20 divisions). And of course, when Bagdhad exploded into violence and looting after the invasion, Def. Sec. Rumsfeld played idiot, claiming \"stuff happens\", and later the administration tried to claim \"whoda thunkit?\". And because we didn't have enough forces to secure the country, massive ammunition dumps (as in 1M tons) were simply bypassed and left unguarded (and were empty when the mercenaries were sent in to guard them the following December arrived). That negligence by itself was responsible for many of the IED deaths of our servicemen, and directly compromised the entire mission. It is also notable, that Donald Rumsfeld threatened to fire anyone for planning for the aftermath of the invasion. Willful negligence (and/or incompetence), pure and simple. Unbelievable. However, there is some reason for hope. Because President Obama (unlike his predecessor), is man enough to admit and correct mistakes. But it is the Iraqi government that wants the US to leave, so they will have to ask if they want us to stay longer. Hopefully the circumstances over how such an arrangement would be made has already been agreed to.",
        "intTime": 20090328,
        "postID": 2,
        "quote": "The same is true for Iraq. The U.S. politicians, media, and public were blindsided by the hurricane of violence in Iraq from 2003 until 2008.",
        "reply": " Not entirely true. The US politicians that were \"blindsided\" were those that opted to ignore the many warnings that came from the Department of State in addition to many middle east experts that tried to get the Bush administration to make a decision based upon FACTS. Anyone who brought these problems up were ridiculed, mocked, demoted, and otherwise ignored. In fact, Eric Shinseki was ridiculed (and worse) for suggesting that securing the country would take in excess of 400k troops (approximately 20 divisions). And of course, when Bagdhad exploded into violence and looting after the invasion, Def. Sec. Rumsfeld played idiot, claiming \"stuff happens\", and later the administration tried to claim \"whoda thunkit?\". And because we didn't have enough forces to secure the country, massive ammunition dumps (as in 1M tons) were simply bypassed and left unguarded (and were empty when the mercenaries were sent in to guard them the following December arrived). That negligence by itself was responsible for many of the IED deaths of our servicemen, and directly compromised the entire mission. It is also notable, that Donald Rumsfeld threatened to fire anyone for planning for the aftermath of the invasion. Willful negligence (and/or incompetence), pure and simple. Unbelievable. However, there is some reason for hope. Because President Obama (unlike his predecessor), is man enough to admit and correct mistakes. But it is the Iraqi government that wants the US to leave, so they will have to ask if they want us to stay longer. Hopefully the circumstances over how such an arrangement would be made has already been agreed to.",
        "threadID": "6960020520001_9320061912001",
        "time": "2009-03-28 11:35:00",
        "title": "Warning from Bosnia for Iraq",
        "userID": "PolicyWonk"
    },
    {
        "content": "This isn't an administration policy, it's a national security one. These complicated middle east matters go back to before WWII. I will be lucky if I see all of our troops leave. The current administration stated, \"combat troops\" and the SOFA with Iraq reflects the same. We will leave support and training functions for years to come. If we can only get those Americorps losers trained and deploy their butts as civilian peacecorps non-volunteers to pay back the American taxpayers...",
        "intTime": 20090330,
        "postID": 3,
        "quote": "",
        "reply": "This isn't an administration policy, it's a national security one. These complicated middle east matters go back to before WWII. I will be lucky if I see all of our troops leave. The current administration stated, \"combat troops\" and the SOFA with Iraq reflects the same. We will leave support and training functions for years to come. If we can only get those Americorps losers trained and deploy their butts as civilian peacecorps non-volunteers to pay back the American taxpayers...",
        "threadID": "6960020520001_9320061912001",
        "time": "2009-03-30 00:14:00",
        "title": "Warning from Bosnia for Iraq",
        "userID": "yanqui69"
    },
    {
        "content": "Why are there always some people killed every day?.Peace the world.. I hate gun though i am a police woman.. i like to take pictures and also upload them to internet.. surely no uniform.. you may want to see how nice and even #^# they are under the name This message has been edited. Last edited by: mainedawg, Tue 31 March 2009 03:20 AM",
        "intTime": 20090330,
        "postID": 4,
        "quote": "",
        "reply": "Why are there always some people killed every day?.Peace the world.. I hate gun though i am a police woman.. i like to take pictures and also upload them to internet.. surely no uniform.. you may want to see how nice and even #^# they are under the name This message has been edited. Last edited by: mainedawg, Tue 31 March 2009 03:20 AM",
        "threadID": "6960020520001_9320061912001",
        "time": "2009-03-30 23:58:00",
        "title": "Warning from Bosnia for Iraq",
        "userID": "scott520"
    }
]