[
    {
        "content": "RE: http://www.military.com/opinion/0,15202,188354,00.html What? No rants from the Bushbots who relentlessly supported the Bush appointees, especially the noxious Nicholson? Well, then, let me be the first to give my plaudits to Gen Shinseki, before they show up. ...Alex",
        "intTime": 20090406,
        "postID": 1,
        "quote": "",
        "reply": "RE: http://www.military.com/opinion/0,15202,188354,00.html What? No rants from the Bushbots who relentlessly supported the Bush appointees, especially the noxious Nicholson? Well, then, let me be the first to give my plaudits to Gen Shinseki, before they show up. ...Alex",
        "threadID": "6960020520001_1380000022001",
        "time": "2009-04-06 15:45:00",
        "title": "A new Shinseki Era",
        "userID": "jaluck"
    },
    {
        "content": "General Shinseki is one of my few heroes. He is an honorable man who deserves the support of all those who have served. We are fortunate to have a man who is one of us to head up the VA. Good luck sir!",
        "intTime": 20090407,
        "postID": 2,
        "quote": "",
        "reply": "General Shinseki is one of my few heroes. He is an honorable man who deserves the support of all those who have served. We are fortunate to have a man who is one of us to head up the VA. Good luck sir!",
        "threadID": "6960020520001_1380000022001",
        "time": "2009-04-07 04:29:00",
        "title": "A new Shinseki Era",
        "userID": "Misanthrope2"
    },
    {
        "content": "I respect the General and wish him the best, but will reserve my adoration for the Gov't till I see this is not a flash in the pan. After all was this gov't not considering raising fee's and having your civilian insurance or yourself billed for your military medical problems last month? As for funding, has the VA been granted a budget line like other gov't departments, or is it still discretionary? Meaning the monies given at the beginning of the year can be cut at anytime without warning during the year, which has happened in the past. Sorry, but during my 20+ years and now 10+ retirement years- I saw too many times where fat gov't cats gave themselves 10% pay raises and us 2% or less. Saw where foodstamps & handouts increased while we walked everywhere because the Army didn't have the money to spend on fuel for training, where we fired 1/2 the amount of ammo in training because to fire more would have cut into the war stocks.Where any of my troops with more than 2 kids quailifed for food stamps! Frankly since 1970 the military has had more in common with our \"Native Americans\" than with the civilian population. Broken promises, empty pockets, lilttle care. Would be nice to get a least part of what we were promised, but I will not hold my breath yet!",
        "intTime": 20090407,
        "postID": 3,
        "quote": "",
        "reply": "I respect the General and wish him the best, but will reserve my adoration for the Gov't till I see this is not a flash in the pan. After all was this gov't not considering raising fee's and having your civilian insurance or yourself billed for your military medical problems last month? As for funding, has the VA been granted a budget line like other gov't departments, or is it still discretionary? Meaning the monies given at the beginning of the year can be cut at anytime without warning during the year, which has happened in the past. Sorry, but during my 20+ years and now 10+ retirement years- I saw too many times where fat gov't cats gave themselves 10% pay raises and us 2% or less. Saw where foodstamps & handouts increased while we walked everywhere because the Army didn't have the money to spend on fuel for training, where we fired 1/2 the amount of ammo in training because to fire more would have cut into the war stocks.Where any of my troops with more than 2 kids quailifed for food stamps! Frankly since 1970 the military has had more in common with our \"Native Americans\" than with the civilian population. Broken promises, empty pockets, lilttle care. Would be nice to get a least part of what we were promised, but I will not hold my breath yet!",
        "threadID": "6960020520001_1380000022001",
        "time": "2009-04-07 08:02:00",
        "title": "A new Shinseki Era",
        "userID": "lovatscot"
    },
    {
        "content": "Kudos to Gen. Shinseki for persevering, for speaking truth to power, and for his willingness to accept the appointment to head the VA. Kudos to the Obama/Biden Administration for having the good sense to pick someone like Shinseki. As much as I did not serve in the Military, I have heard from friends and relatives who served in Viet Nam that access to VA services is improving. To give credit where credit is due, some improvements were under way during the previous Administration, but news of late is that improvements continue and seem to be accelerating. Gen. Shinseki did not need to come out of retirement. He chose to. Nuff said.",
        "intTime": 20090407,
        "postID": 4,
        "quote": "",
        "reply": "Kudos to Gen. Shinseki for persevering, for speaking truth to power, and for his willingness to accept the appointment to head the VA. Kudos to the Obama/Biden Administration for having the good sense to pick someone like Shinseki. As much as I did not serve in the Military, I have heard from friends and relatives who served in Viet Nam that access to VA services is improving. To give credit where credit is due, some improvements were under way during the previous Administration, but news of late is that improvements continue and seem to be accelerating. Gen. Shinseki did not need to come out of retirement. He chose to. Nuff said.",
        "threadID": "6960020520001_1380000022001",
        "time": "2009-04-07 11:35:00",
        "title": "A new Shinseki Era",
        "userID": "bwf27"
    },
    {
        "content": "According to Shinseki, \"The 2010 budget and VA's portion of the American Recovery and Reinvestment Act of 2009 also allow us to be forward looking in our desire to design intelligently for the future. Real property improvements, renovations and maintenance are funded VA-wide, with a focus on American products and energy efficiency. New construction incorporates green technology and energy efficient designs for better stewardship of our environment. \" First, I am left wondering if the funding will be continued next year, and the year after that, and so on and then secondly, where do the funds come from?",
        "intTime": 20090407,
        "postID": 5,
        "quote": "",
        "reply": "According to Shinseki, \"The 2010 budget and VA's portion of the American Recovery and Reinvestment Act of 2009 also allow us to be forward looking in our desire to design intelligently for the future. Real property improvements, renovations and maintenance are funded VA-wide, with a focus on American products and energy efficiency. New construction incorporates green technology and energy efficient designs for better stewardship of our environment. \" First, I am left wondering if the funding will be continued next year, and the year after that, and so on and then secondly, where do the funds come from?",
        "threadID": "6960020520001_1380000022001",
        "time": "2009-04-07 12:02:00",
        "title": "A new Shinseki Era",
        "userID": "mattkay4"
    },
    {
        "content": "The President proposes funding level, congress in turn actually allocates the funds. As long as Sec. Shinseki gets the resources and the freedom to fix VA with out congressional interference, VA will get fixed. /salute",
        "intTime": 20090407,
        "postID": 6,
        "quote": "",
        "reply": "The President proposes funding level, congress in turn actually allocates the funds. As long as Sec. Shinseki gets the resources and the freedom to fix VA with out congressional interference, VA will get fixed. /salute",
        "threadID": "6960020520001_1380000022001",
        "time": "2009-04-07 15:37:00",
        "title": "A new Shinseki Era",
        "userID": "oseles"
    },
    {
        "content": "I don't understand why there's such a push to give VA Health Care to Category 8 veterans. The VA Health Care System was developed for service connected disabled veterans. Paying for health care and additional payments for low income seems to be taking money from those who earned it. With disabled veterans feeling that they should get exchange/commissary privileges, MAC flights, etc., why stay in to retirement? Military veterans with 3 years service seem to feel that they deserve everything a retiree with 100 percent service connected disability receives. How can the government budget for everyone who ever served if they're going to be put on an equal playing field?",
        "intTime": 20090407,
        "postID": 7,
        "quote": "",
        "reply": "I don't understand why there's such a push to give VA Health Care to Category 8 veterans. The VA Health Care System was developed for service connected disabled veterans. Paying for health care and additional payments for low income seems to be taking money from those who earned it. With disabled veterans feeling that they should get exchange/commissary privileges, MAC flights, etc., why stay in to retirement? Military veterans with 3 years service seem to feel that they deserve everything a retiree with 100 percent service connected disability receives. How can the government budget for everyone who ever served if they're going to be put on an equal playing field?",
        "threadID": "6960020520001_1380000022001",
        "time": "2009-04-07 20:47:00",
        "title": "A new Shinseki Era",
        "userID": "bkoppinger"
    },
    {
        "content": "quote: Originally posted by bkoppinger: I don't understand why there's such a push to give VA Health Care to Category 8 veterans. The VA Health Care System was developed for service connected disabled veterans. Paying for health care and additional payments for low income seems to be taking money from those who earned it. With disabled veterans feeling that they should get exchange/commissary privileges, MAC flights, etc., why stay in to retirement? Military veterans with 3 years service seem to feel that they deserve everything a retiree with 100 percent service connected disability receives. How can the government budget for everyone who ever served if they're going to be put on an equal playing field? Category 8 are those Veterans that need medical care. Need number one is their health is in need of care. Need number two is that their monetary situation is in need of more income. Someone asked \"where will the money come from?\" The same place the money is coming from to pay for a war that should have never been started. If this government can give away money to fat cat crooks that run countries and use zero of it on what it was intended for then why not use our taxes for the deserving Veterans. If they need the care and they meet the income criteria give them a helping hand. Semper Fidelis. Blackcoat.",
        "intTime": 20090407,
        "postID": 8,
        "quote": "Originally posted by bkoppinger: I don't understand why there's such a push to give VA Health Care to Category 8 veterans. The VA Health Care System was developed for service connected disabled veterans. Paying for health care and additional payments for low income seems to be taking money from those who earned it. With disabled veterans feeling that they should get exchange/commissary privileges, MAC flights, etc., why stay in to retirement? Military veterans with 3 years service seem to feel that they deserve everything a retiree with 100 percent service connected disability receives. How can the government budget for everyone who ever served if they're going to be put on an equal playing field?",
        "reply": " Category 8 are those Veterans that need medical care. Need number one is their health is in need of care. Need number two is that their monetary situation is in need of more income. Someone asked \"where will the money come from?\" The same place the money is coming from to pay for a war that should have never been started. If this government can give away money to fat cat crooks that run countries and use zero of it on what it was intended for then why not use our taxes for the deserving Veterans. If they need the care and they meet the income criteria give them a helping hand. Semper Fidelis. Blackcoat.",
        "threadID": "6960020520001_1380000022001",
        "time": "2009-04-07 22:37:00",
        "title": "A new Shinseki Era",
        "userID": "Blackcoat"
    },
    {
        "content": "Shinseki is a part of the machine and I trust him as far as I do the USSR. No mention here of the proposed, but shot down, GI paying for combat related injury health insurance?",
        "intTime": 20090408,
        "postID": 9,
        "quote": "",
        "reply": "Shinseki is a part of the machine and I trust him as far as I do the USSR. No mention here of the proposed, but shot down, GI paying for combat related injury health insurance?",
        "threadID": "6960020520001_1380000022001",
        "time": "2009-04-08 00:14:00",
        "title": "A new Shinseki Era",
        "userID": "yanqui69"
    },
    {
        "content": "quote: Originally posted by oseles: The President proposes funding level, congress in turn actually allocates the funds. As long as Sec. Shinseki gets the resources and the freedom to fix VA with out congressional interference, VA will get fixed. /salute Okay, so it is unknown if the funding will be proposed by the President and it is unknown if it will be continued by Congress, which could leave some projects partially finished and the funds wasted. Now, if approved and everything, where exactly does the money come from? Increased taxes, diverted funds from other programs, where? How do we sustain the rate we are spending money that is above what is taken in by the Government?",
        "intTime": 20090408,
        "postID": 10,
        "quote": "Originally posted by oseles: The President proposes funding level, congress in turn actually allocates the funds. As long as Sec. Shinseki gets the resources and the freedom to fix VA with out congressional interference, VA will get fixed. /salute",
        "reply": " Okay, so it is unknown if the funding will be proposed by the President and it is unknown if it will be continued by Congress, which could leave some projects partially finished and the funds wasted. Now, if approved and everything, where exactly does the money come from? Increased taxes, diverted funds from other programs, where? How do we sustain the rate we are spending money that is above what is taken in by the Government?",
        "threadID": "6960020520001_1380000022001",
        "time": "2009-04-08 06:11:00",
        "title": "A new Shinseki Era",
        "userID": "mattkay4"
    },
    {
        "content": "My name is Carl C. Marusich and you have some of my files that was sent to you and Dr Peal. As of this date What are your Plans for Me?",
        "intTime": 20090408,
        "postID": 11,
        "quote": "",
        "reply": "My name is Carl C. Marusich and you have some of my files that was sent to you and Dr Peal. As of this date What are your Plans for Me?",
        "threadID": "6960020520001_1380000022001",
        "time": "2009-04-08 08:26:00",
        "title": "A new Shinseki Era",
        "userID": "19429749"
    },
    {
        "content": "Two Comments: 1) One of the 3 main priorities of any worthwhile nation is to \"provide for the protection of the people and their property against all enemies, both foreign and domestic.\" Therefore, the adequate funding of the defense forces is of primary importance and should not be unreasonably restricted, even though the country might be in a deficit position. This concept would surely extend to the promises made by said country to it's defenders, both active and retired. 2) In light of what I have learned about Gen. Shinseki, he appears to be a very fine citizen, and fulfilled his duties as a member of the military in a fashion that would be difficult to surpass. His only shortcoming seems to be that he is too much in awe of his civilian bosses. As a CoS during the Clinton administration I don't recall him ever saying anything in public about the rather irresponsible financial choking-off of the DoD by that administration. Similarily, his comments on the recent effort of the Obama team to saddle military personnel with paying for their own health care, were in support of the CIC. Glad to see that both he and POTUS seem to have had an epiphany on this subject - and hope that he is able accomplish even 75% of what is set forth in the above \"Messege\".",
        "intTime": 20090408,
        "postID": 12,
        "quote": "",
        "reply": "Two Comments: 1) One of the 3 main priorities of any worthwhile nation is to \"provide for the protection of the people and their property against all enemies, both foreign and domestic.\" Therefore, the adequate funding of the defense forces is of primary importance and should not be unreasonably restricted, even though the country might be in a deficit position. This concept would surely extend to the promises made by said country to it's defenders, both active and retired. 2) In light of what I have learned about Gen. Shinseki, he appears to be a very fine citizen, and fulfilled his duties as a member of the military in a fashion that would be difficult to surpass. His only shortcoming seems to be that he is too much in awe of his civilian bosses. As a CoS during the Clinton administration I don't recall him ever saying anything in public about the rather irresponsible financial choking-off of the DoD by that administration. Similarily, his comments on the recent effort of the Obama team to saddle military personnel with paying for their own health care, were in support of the CIC. Glad to see that both he and POTUS seem to have had an epiphany on this subject - and hope that he is able accomplish even 75% of what is set forth in the above \"Messege\".",
        "threadID": "6960020520001_1380000022001",
        "time": "2009-04-08 09:00:00",
        "title": "A new Shinseki Era",
        "userID": "Stevo2324"
    },
    {
        "content": "I'm sure the General is a good man. However, the VA he heads always seem to come up short when they treat veterans. The VA places many roadblocks on the proper treatment of veterans.",
        "intTime": 20090409,
        "postID": 13,
        "quote": "",
        "reply": "I'm sure the General is a good man. However, the VA he heads always seem to come up short when they treat veterans. The VA places many roadblocks on the proper treatment of veterans.",
        "threadID": "6960020520001_1380000022001",
        "time": "2009-04-09 09:02:00",
        "title": "A new Shinseki Era",
        "userID": "Young57"
    },
    {
        "content": "General Shinseki: Welcome and best of luck. First, too bad that idiotic idea made it out the door about having veterans pay from their health plans for their service-connected injuries. What was that all about? It tells me that one, you did not know about it, or two, you did, but were in compliant general mode after your viewpoint was ignored. So the question I have, are you going to finally be a real advocate and passionate about something? 5,000 troops died, because after you resigned you went off to General's Pasture and quietly watched the Iraq/Afghanistan fiasco unfold. You are a patriot, and so is Colin Powell, but he like you went into compliant general mode when his country needed him to serve his country not his president. I hope for the sake of us veterans you will finally stand up and be counted, and call out the idiocy of those who do not understand the sacrifices you and we, your fellow veterans, have made to preserve this nation. The time for docility regarding veterans care is over. Best wishes.",
        "intTime": 20090412,
        "postID": 14,
        "quote": "",
        "reply": "General Shinseki: Welcome and best of luck. First, too bad that idiotic idea made it out the door about having veterans pay from their health plans for their service-connected injuries. What was that all about? It tells me that one, you did not know about it, or two, you did, but were in compliant general mode after your viewpoint was ignored. So the question I have, are you going to finally be a real advocate and passionate about something? 5,000 troops died, because after you resigned you went off to General's Pasture and quietly watched the Iraq/Afghanistan fiasco unfold. You are a patriot, and so is Colin Powell, but he like you went into compliant general mode when his country needed him to serve his country not his president. I hope for the sake of us veterans you will finally stand up and be counted, and call out the idiocy of those who do not understand the sacrifices you and we, your fellow veterans, have made to preserve this nation. The time for docility regarding veterans care is over. Best wishes.",
        "threadID": "6960020520001_1380000022001",
        "time": "2009-04-12 14:54:00",
        "title": "A new Shinseki Era",
        "userID": "rockriver04"
    },
    {
        "content": "I think Shinseki may have been a wise pick and I wish him the best. Thousands of vets are counting on him.",
        "intTime": 20090413,
        "postID": 15,
        "quote": "",
        "reply": "I think Shinseki may have been a wise pick and I wish him the best. Thousands of vets are counting on him.",
        "threadID": "6960020520001_1380000022001",
        "time": "2009-04-13 11:49:00",
        "title": "A new Shinseki Era",
        "userID": "foxred03"
    },
    {
        "content": "I actually worked closely with him when he was the ADC for manuever for the 3rd ID (1992-93 in Wurzburg) and I was a young Signal Captain on the Division Staff. One of the most personable general officers I ever met. Quiet, confident and with an excellent sense of humor that is strangely absent in most senior officers. He was most of all a 'soldier's general' when I knew him. A good Joe. Glad the VA is now in good hands. Sullivan013",
        "intTime": 20090415,
        "postID": 16,
        "quote": "",
        "reply": "I actually worked closely with him when he was the ADC for manuever for the 3rd ID (1992-93 in Wurzburg) and I was a young Signal Captain on the Division Staff. One of the most personable general officers I ever met. Quiet, confident and with an excellent sense of humor that is strangely absent in most senior officers. He was most of all a 'soldier's general' when I knew him. A good Joe. Glad the VA is now in good hands. Sullivan013",
        "threadID": "6960020520001_1380000022001",
        "time": "2009-04-15 04:44:00",
        "title": "A new Shinseki Era",
        "userID": "sullivan013"
    },
    {
        "content": "I heard he has designed a new uniform for VA employees too and that it includes a green beret!",
        "intTime": 20090416,
        "postID": 17,
        "quote": "",
        "reply": "I heard he has designed a new uniform for VA employees too and that it includes a green beret!",
        "threadID": "6960020520001_1380000022001",
        "time": "2009-04-16 15:20:00",
        "title": "A new Shinseki Era",
        "userID": "yanqui69"
    }
]