[
    {
        "content": "It seems Kim Jong Il and his regime are really asking for it. ++http://news.yahoo.com/s/ap/20090526/ap_on_re_as/as_koreas_nuclear quote: By HYUNG-JIN KIM, Associated Press Writer Hyung-jin Kim, Associated Press Writer – 12 mins ago SEOUL, South Korea – North Korea reportedly tested two more short-range missiles Tuesday, a day after detonating a nuclear bomb underground, pushing the regime further into a confrontation with world powers despite the threat of U.N. action. Two missiles — one ground-to-air, the other ground-to-ship — with a range of about 80 miles (130 kilometers) were test-fired from an east coast launchpad, South Korea's Yonhap news agency reported, citing an unidentified government official. Pyongyang also warned ships to stay away from waters off its western coast this week, a sign it may be gearing up for more missile tests, South Korea's coast guard said. (...) North Korea appeared to be displaying its might following its underground atomic test that the U.N. Security Council condemned as a \"clear violation\" of a 2006 resolution banning the regime from developing its nuclear program. France called for new sanctions, while the U.S. and Japan pushed for strong action against North Korea for testing a bomb that Russian officials said was comparable in power to those dropped on the Japanese cities of Hiroshima and Nagasaki in World War II. China said it \"resolutely opposed\" North Korea's test and urged Pyongyang to return to talks on ending its atomic programs. Russia, once a key backer of North Korea, condemned the test. Moscow's U.N. Ambassador Vitaly Churkin, the current Security Council president, said the 15-member council would begin work \"quickly\" on a new resolution. But many questioned whether new punishment would have any effect on a nation already penalized by numerous sanctions and clearly dismissive of the Security Council's jurisdiction. (...) South Korea said it would join a maritime web of more than 90 nations that intercept ships suspected of spreading weapons of mass destruction — a move North Korea warned would constitute an act of war. North Korea's nuclear test raises worries that it could act as a facilitator of the atomic ambitions of other nations and potentially even terrorists. Its test of a long-range missile in July 2006 and its first nuclear test in October 2006 drew stiff sanctions from the Security Council and orders to refrain from engaging in ballistic missile-related activity and to stop developing its nuclear program... (...)",
        "intTime": 20090526,
        "postID": 1,
        "quote": "By HYUNG-JIN KIM, Associated Press Writer Hyung-jin Kim, Associated Press Writer – 12 mins ago SEOUL, South Korea – North Korea reportedly tested two more short-range missiles Tuesday, a day after detonating a nuclear bomb underground, pushing the regime further into a confrontation with world powers despite the threat of U.N. action. Two missiles — one ground-to-air, the other ground-to-ship — with a range of about 80 miles (130 kilometers) were test-fired from an east coast launchpad, South Korea's Yonhap news agency reported, citing an unidentified government official. Pyongyang also warned ships to stay away from waters off its western coast this week, a sign it may be gearing up for more missile tests, South Korea's coast guard said. (...) North Korea appeared to be displaying its might following its underground atomic test that the U.N. Security Council condemned as a \"clear violation\" of a 2006 resolution banning the regime from developing its nuclear program. France called for new sanctions, while the U.S. and Japan pushed for strong action against North Korea for testing a bomb that Russian officials said was comparable in power to those dropped on the Japanese cities of Hiroshima and Nagasaki in World War II. China said it \"resolutely opposed\" North Korea's test and urged Pyongyang to return to talks on ending its atomic programs. Russia, once a key backer of North Korea, condemned the test. Moscow's U.N. Ambassador Vitaly Churkin, the current Security Council president, said the 15-member council would begin work \"quickly\" on a new resolution. But many questioned whether new punishment would have any effect on a nation already penalized by numerous sanctions and clearly dismissive of the Security Council's jurisdiction. (...) South Korea said it would join a maritime web of more than 90 nations that intercept ships suspected of spreading weapons of mass destruction — a move North Korea warned would constitute an act of war. North Korea's nuclear test raises worries that it could act as a facilitator of the atomic ambitions of other nations and potentially even terrorists. Its test of a long-range missile in July 2006 and its first nuclear test in October 2006 drew stiff sanctions from the Security Council and orders to refrain from engaging in ballistic missile-related activity and to stop developing its nuclear program... (...)",
        "reply": "It seems Kim Jong Il and his regime are really asking for it. ++http://news.yahoo.com/s/ap/20090526/ap_on_re_as/as_koreas_nuclear ",
        "threadID": "7871978016_5230003422001",
        "time": "2009-05-26 07:04:00",
        "title": "defiant North Korea test fires TWO more missiles!",
        "userID": "Canuck_Centaur"
    }
]