[
    {
        "content": "Here we go again. The DPRK wants some attention. ++http://ca.news.yahoo.com/s/reuters/090507/world/international_us_korea_north_test quote: North Korea seen readying for new nuclear test SEOUL (Reuters) - There is increased activity at North Korea's known nuclear test site, a South Korean news report said... Impoverished North Korea, whose only nuclear test in October 2006 led to U.N. financial and trade sanctions, could be ready to test another nuclear device in a matter of weeks, experts have said. (...) South Korean authorities are monitoring increased and steady activity at the Phunggye-ri site in the North Hamgyong province where the North conducted the 2006 test, the newspaper said. The North also appears to have stepped up construction at a new long-range missile launch site in the west that had been expected originally to be completed by the end of the year, the government source was quoted as saying. South Korea's Foreign Ministry and the spy agency declined to comment on the report. Last week, the North threatened a new nuclear test unless the U.N. Security Council apologized and withdrew the sanctions, tightened after it launched a long-range rocket in April. Analysts say North Korea wants to play out its test preparations, many of which can be seen by U.S. spy satellites, for as long as possible to increase leverage in negotiations aimed at ending its efforts to build a nuclear arsenal. (...) Experts said the North's first nuclear test in 2006 was only a partial success because the strength of the blast was relatively low, indicating problems with the weapons design or the fissile material at its core. (Reporting by Jack Kim; Editing by David Fox)",
        "intTime": 20090506,
        "postID": 1,
        "quote": "North Korea seen readying for new nuclear test SEOUL (Reuters) - There is increased activity at North Korea's known nuclear test site, a South Korean news report said... Impoverished North Korea, whose only nuclear test in October 2006 led to U.N. financial and trade sanctions, could be ready to test another nuclear device in a matter of weeks, experts have said. (...) South Korean authorities are monitoring increased and steady activity at the Phunggye-ri site in the North Hamgyong province where the North conducted the 2006 test, the newspaper said. The North also appears to have stepped up construction at a new long-range missile launch site in the west that had been expected originally to be completed by the end of the year, the government source was quoted as saying. South Korea's Foreign Ministry and the spy agency declined to comment on the report. Last week, the North threatened a new nuclear test unless the U.N. Security Council apologized and withdrew the sanctions, tightened after it launched a long-range rocket in April. Analysts say North Korea wants to play out its test preparations, many of which can be seen by U.S. spy satellites, for as long as possible to increase leverage in negotiations aimed at ending its efforts to build a nuclear arsenal. (...) Experts said the North's first nuclear test in 2006 was only a partial success because the strength of the blast was relatively low, indicating problems with the weapons design or the fissile material at its core. (Reporting by Jack Kim; Editing by David Fox)",
        "reply": "Here we go again. The DPRK wants some attention. ++http://ca.news.yahoo.com/s/reuters/090507/world/international_us_korea_north_test ",
        "threadID": "7871978016_6240007222001",
        "time": "2009-05-06 22:46:00",
        "title": "North Korea prepares for new nuclear test",
        "userID": "Canuck_Centaur"
    }
]