[
    {
        "content": "Tokyo seems to want to show it can take care of itself against the DPRK. From the Guardian: quote: [Japan warns it may shoot down North Korean satellite launcher • Pyongyang says response would be act of war • Regional tensions rise over missile launch * Justin McCurry in Tokyo * guardian.co.uk, Friday 13 March 2009 12.39 GMT Japan today threatened to shoot down a satellite that North Korea plans to launch early next month if it shows any signs of striking its territory. Tokyo's warning that it would deploy its multibillion-dollar missile defence system raised tensions in the region after North Korea said that it had identified a potential \"danger area\" near Japanese territory along the rocket's flight path. The regime told the International Maritime Organisation that the missile would be launched during daylight between 4 and 8 April, and that its boosters would fall into the Sea of Japan – about 75 miles (120km) from Japan's north-west coast – and the Pacific Ocean. Officials in Tokyo said they reserved the right to destroy any threatening object in mid-flight, despite North Korean warnings that it would consider such a move an act of war. \"Under our law, we can intercept any object if it is falling towards Japan, including any attacks on Japan, for our security,\" Takeo Kawamura, the chief cabinet secretary, told reporters. Despite repeated assurances from Pyongyang that the rocket is a vital part of North Korea's space programme, other countries in the region suspect the hardware is a Taepodong-2 ballistic missile. South Korean intelligence has reported a build-up of activity in recent days near the missile's launch pad at Musudan-ri base on its neighbour's north-east coast. Any missile launch, even one intended to put a satellite into orbit, would represent a snub to the US administration, which has repeatedly invited the communist state to return to negotiations over its nuclear weapons programme. Last month the US secretary of state, Hillary Clinton, urged the north to cancel the launch, which US officials say would be in violation of a 2006 UN security council resolution. The South Korean foreign ministry said in a statement: \"If North Korea goes ahead with the launch, we believe there will be discussions and a response by the security council on the violation of the resolution.\" The UN secretary-general, Ban Ki-moon, said a missile or satellite launch would... (...) Japan has intensified efforts to protect itself against conventional missile attacks since 1998, when the north test-launched a long-range rocket over its territory without warning. In response, Japan and the US have jointly developed a ballistic missile defence system that includes interceptor missiles on board ships and Patriot missiles dotted around Tokyo. But experts believe that a rocket capable of launching a satellite into orbit may be too high to intercept.",
        "intTime": 20090314,
        "postID": 1,
        "quote": "[Japan warns it may shoot down North Korean satellite launcher • Pyongyang says response would be act of war • Regional tensions rise over missile launch * Justin McCurry in Tokyo * guardian.co.uk, Friday 13 March 2009 12.39 GMT Japan today threatened to shoot down a satellite that North Korea plans to launch early next month if it shows any signs of striking its territory. Tokyo's warning that it would deploy its multibillion-dollar missile defence system raised tensions in the region after North Korea said that it had identified a potential \"danger area\" near Japanese territory along the rocket's flight path. The regime told the International Maritime Organisation that the missile would be launched during daylight between 4 and 8 April, and that its boosters would fall into the Sea of Japan – about 75 miles (120km) from Japan's north-west coast – and the Pacific Ocean. Officials in Tokyo said they reserved the right to destroy any threatening object in mid-flight, despite North Korean warnings that it would consider such a move an act of war. \"Under our law, we can intercept any object if it is falling towards Japan, including any attacks on Japan, for our security,\" Takeo Kawamura, the chief cabinet secretary, told reporters. Despite repeated assurances from Pyongyang that the rocket is a vital part of North Korea's space programme, other countries in the region suspect the hardware is a Taepodong-2 ballistic missile. South Korean intelligence has reported a build-up of activity in recent days near the missile's launch pad at Musudan-ri base on its neighbour's north-east coast. Any missile launch, even one intended to put a satellite into orbit, would represent a snub to the US administration, which has repeatedly invited the communist state to return to negotiations over its nuclear weapons programme. Last month the US secretary of state, Hillary Clinton, urged the north to cancel the launch, which US officials say would be in violation of a 2006 UN security council resolution. The South Korean foreign ministry said in a statement: \"If North Korea goes ahead with the launch, we believe there will be discussions and a response by the security council on the violation of the resolution.\" The UN secretary-general, Ban Ki-moon, said a missile or satellite launch would... (...) Japan has intensified efforts to protect itself against conventional missile attacks since 1998, when the north test-launched a long-range rocket over its territory without warning. In response, Japan and the US have jointly developed a ballistic missile defence system that includes interceptor missiles on board ships and Patriot missiles dotted around Tokyo. But experts believe that a rocket capable of launching a satellite into orbit may be too high to intercept.",
        "reply": "Tokyo seems to want to show it can take care of itself against the DPRK. From the Guardian: ",
        "threadID": "7871978016_8440068712001",
        "time": "2009-03-14 12:50:00",
        "title": "Japan threatens to shoot down North Korean rocket-launched-satellite if launched",
        "userID": "Canuck_Centaur"
    },
    {
        "content": "Time for the ROKAF or the JASDF to pull an Osiraq-like precision preemptive air strike on this target? ++http://news.yahoo.com/s/afp/20090326/pl_afp/nkoreanuclearmissileskorea;_ylt=AhL5yzpt4SUCyIKYOlOKAlJ34T0D quote: NKorea places long-range missile on launch pad by Jim Mannion Jim Mannion – 1 hr 12 mins ago WASHINGTON (AFP) – North Korea has placed a long-range missile on a launch pad, a US official has said, as Washington warned it would take the matter to the United Nations if Pyongyang goes ahead with the planned launch. US Secretary of State Hillary Clinton said a launch for any purpose would be a violation of a UN Security Council resolution. \"We intend to raise this violation of the UN Security Council resolution, if it goes forward, in the UN,\" Clinton said during a visit to Mexico City. \"This provocative action in violation of the United Nations mandate will not go unnoticed and there will be consequences,\" she said. A US counter-proliferation official, who spoke on condition of anonymity, told AFP that Japanese press reports that a long-range missile has been placed on a launch pad \"are accurate.\" The official said the missile was believed to be a Taepodong-2, a long-range missile that could, in theory, reach Alaska. Two stages of the missile were visible but the top was covered with a shroud supported by a crane, NBC television reported, citing US officials. North Korea has said it intends to launch a satellite over Japan and into orbit between April 4-8. But the United States, South Korea and Japan suspect that the planned launch is a disguise for a long-range missile test. South Korea Thursday described North Korea's planned rocket launch as a \"serious challenge and provocation\" to regional security. Defence ministry spokesman Won Tae-Jae declined to confirm the US report, saying Seoul... (...) China's military chief, General Chen Bingde, arrived Wednesday in Seoul for talks with senior South Korean officials days before the scheduled launch. China, a traditional ally and major donor for impoverished North Korea as well as a permanent UN Security Council member, has not publicly urged Pyongyang to halt the launch.",
        "intTime": 20090325,
        "postID": 2,
        "quote": "NKorea places long-range missile on launch pad by Jim Mannion Jim Mannion – 1 hr 12 mins ago WASHINGTON (AFP) – North Korea has placed a long-range missile on a launch pad, a US official has said, as Washington warned it would take the matter to the United Nations if Pyongyang goes ahead with the planned launch. US Secretary of State Hillary Clinton said a launch for any purpose would be a violation of a UN Security Council resolution. \"We intend to raise this violation of the UN Security Council resolution, if it goes forward, in the UN,\" Clinton said during a visit to Mexico City. \"This provocative action in violation of the United Nations mandate will not go unnoticed and there will be consequences,\" she said. A US counter-proliferation official, who spoke on condition of anonymity, told AFP that Japanese press reports that a long-range missile has been placed on a launch pad \"are accurate.\" The official said the missile was believed to be a Taepodong-2, a long-range missile that could, in theory, reach Alaska. Two stages of the missile were visible but the top was covered with a shroud supported by a crane, NBC television reported, citing US officials. North Korea has said it intends to launch a satellite over Japan and into orbit between April 4-8. But the United States, South Korea and Japan suspect that the planned launch is a disguise for a long-range missile test. South Korea Thursday described North Korea's planned rocket launch as a \"serious challenge and provocation\" to regional security. Defence ministry spokesman Won Tae-Jae declined to confirm the US report, saying Seoul... (...) China's military chief, General Chen Bingde, arrived Wednesday in Seoul for talks with senior South Korean officials days before the scheduled launch. China, a traditional ally and major donor for impoverished North Korea as well as a permanent UN Security Council member, has not publicly urged Pyongyang to halt the launch.",
        "reply": "Time for the ROKAF or the JASDF to pull an Osiraq-like precision preemptive air strike on this target? ++http://news.yahoo.com/s/afp/20090326/pl_afp/nkoreanuclearmissileskorea;_ylt=AhL5yzpt4SUCyIKYOlOKAlJ34T0D ",
        "threadID": "7871978016_8440068712001",
        "time": "2009-03-25 22:43:00",
        "title": "Japan threatens to shoot down North Korean rocket-launched-satellite if launched",
        "userID": "Canuck_Centaur"
    },
    {
        "content": "An update can be found below at this other thread discussion: The US, Japan and South Korea each move warships into position ahead of the announced North Korean launch of the communications satellite this April: \"USN moves 2 warships into waters off Korean peninsula ahead of North Korean satellite launch\" thread of military.com",
        "intTime": 20090326,
        "postID": 3,
        "quote": "",
        "reply": "An update can be found below at this other thread discussion: The US, Japan and South Korea each move warships into position ahead of the announced North Korean launch of the communications satellite this April: \"USN moves 2 warships into waters off Korean peninsula ahead of North Korean satellite launch\" thread of military.com",
        "threadID": "7871978016_8440068712001",
        "time": "2009-03-26 13:18:00",
        "title": "Japan threatens to shoot down North Korean rocket-launched-satellite if launched",
        "userID": "Canuck_Centaur"
    },
    {
        "content": "An update: and Japan okays the shoot-down of the North Korean satellite launcher! ++http://www.defensenews.com/story.php?i=4010747&c=ASI&s=TOP quote: Japan OKs Shoot-Down of Inbound N. Korean Rocket Agence France-Presse Published: 27 Mar 14:16 EDT (18:16 GMT) TOKYO - Japan's leaders Friday authorized the shooting down of a North Korean rocket or its debris if it threatens to hit the country, said Defense Minister Yasukazu Hamada. \"I issued the necessary order after the (government) security council this morning decided to issue a destruction order in advance,\" he said after a meeting with Prime Minister Taro Aso and other key cabinet ministers. Related TopicsAsia & Pacific Rim \"We will do our best to handle any flying object from North Korea in order to assure the Japanese people's safety and security.\" The defense ministry was expected to deploy two Aegis-equipped destroyers in the Sea of Japan (East Sea) and Patriot interceptors in northern Akita and Iwate prefectures, although Hamada announced no precise plans. The isolated Pyongyang regime has said it will launch a communications satellite over Japanese territory in early April, but the United States and its Asian allies suspect the launch is a ballistic missile test. Tokyo, which has developed a missile defense system with the United States in recent years, has previously warned it will attempt to shoot down any missile or debris that threatens to hit its territory. North Korea, which has announced a launch window of April 4 to 8, says it would regard a rocket intercept as an act of war. The order is Japan's first of its kind after it revised its Self-Defense Forces Law in 2005 and legalized possible interceptions of ballistic missiles. (...) North Korea has warned that the rocket's first booster would likely plunge into the Sea of Japan off Japan's northern Akita prefecture, while the second stage would drop into the Pacific between Japan and Hawaii. Japan has warned that any North Korean launch would be a breach of past U.N. resolutions and has repeatedly urged Pyongyang to refrain from the launch.",
        "intTime": 20090328,
        "postID": 4,
        "quote": "Japan OKs Shoot-Down of Inbound N. Korean Rocket Agence France-Presse Published: 27 Mar 14:16 EDT (18:16 GMT) TOKYO - Japan's leaders Friday authorized the shooting down of a North Korean rocket or its debris if it threatens to hit the country, said Defense Minister Yasukazu Hamada. \"I issued the necessary order after the (government) security council this morning decided to issue a destruction order in advance,\" he said after a meeting with Prime Minister Taro Aso and other key cabinet ministers. Related TopicsAsia & Pacific Rim \"We will do our best to handle any flying object from North Korea in order to assure the Japanese people's safety and security.\" The defense ministry was expected to deploy two Aegis-equipped destroyers in the Sea of Japan (East Sea) and Patriot interceptors in northern Akita and Iwate prefectures, although Hamada announced no precise plans. The isolated Pyongyang regime has said it will launch a communications satellite over Japanese territory in early April, but the United States and its Asian allies suspect the launch is a ballistic missile test. Tokyo, which has developed a missile defense system with the United States in recent years, has previously warned it will attempt to shoot down any missile or debris that threatens to hit its territory. North Korea, which has announced a launch window of April 4 to 8, says it would regard a rocket intercept as an act of war. The order is Japan's first of its kind after it revised its Self-Defense Forces Law in 2005 and legalized possible interceptions of ballistic missiles. (...) North Korea has warned that the rocket's first booster would likely plunge into the Sea of Japan off Japan's northern Akita prefecture, while the second stage would drop into the Pacific between Japan and Hawaii. Japan has warned that any North Korean launch would be a breach of past U.N. resolutions and has repeatedly urged Pyongyang to refrain from the launch.",
        "reply": "An update: and Japan okays the shoot-down of the North Korean satellite launcher! ++http://www.defensenews.com/story.php?i=4010747&c=ASI&s=TOP ",
        "threadID": "7871978016_8440068712001",
        "time": "2009-03-28 09:23:00",
        "title": "Japan threatens to shoot down North Korean rocket-launched-satellite if launched",
        "userID": "Canuck_Centaur"
    },
    {
        "content": "Just a reminder for the regulars here...more updates at the ff. thread: \"US and North Korea trade tough talk before North Korean rocket launch\" thread of military.com",
        "intTime": 20090403,
        "postID": 5,
        "quote": "",
        "reply": "Just a reminder for the regulars here...more updates at the ff. thread: \"US and North Korea trade tough talk before North Korean rocket launch\" thread of military.com",
        "threadID": "7871978016_8440068712001",
        "time": "2009-04-03 09:52:00",
        "title": "Japan threatens to shoot down North Korean rocket-launched-satellite if launched",
        "userID": "Canuck_Centaur"
    },
    {
        "content": "Another update: North Korea finally launched the rocket! Yikes!!! Details are at the latest articles in the thread below: \"North Korea launches rocket!\" thread of military.com",
        "intTime": 20090404,
        "postID": 6,
        "quote": "",
        "reply": "Another update: North Korea finally launched the rocket! Yikes!!! Details are at the latest articles in the thread below: \"North Korea launches rocket!\" thread of military.com",
        "threadID": "7871978016_8440068712001",
        "time": "2009-04-04 21:43:00",
        "title": "Japan threatens to shoot down North Korean rocket-launched-satellite if launched",
        "userID": "Canuck_Centaur"
    }
]