[
    {
        "content": "I s it time 2 finish what GEN Mac. started!",
        "intTime": 20090326,
        "postID": 3,
        "quote": "",
        "reply": "I s it time 2 finish what GEN Mac. started!",
        "threadID": "7871978016_6250009771001",
        "time": "2009-03-26 10:12:00",
        "title": "pre-emptive nuke strike!",
        "userID": "13557256"
    },
    {
        "content": "No nuke strike needed! Simply put a shuttle up and when the NorKs launch that satilite track it, catch it and return it to Kim all shined up in a box. We can let Hillary attach a reboot button on the top just for yucks LOL",
        "intTime": 20090403,
        "postID": 4,
        "quote": "",
        "reply": "No nuke strike needed! Simply put a shuttle up and when the NorKs launch that satilite track it, catch it and return it to Kim all shined up in a box. We can let Hillary attach a reboot button on the top just for yucks LOL",
        "threadID": "7871978016_6250009771001",
        "time": "2009-04-03 09:46:00",
        "title": "pre-emptive nuke strike!",
        "userID": "galloglas"
    },
    {
        "content": "hi",
        "intTime": 20090407,
        "postID": 5,
        "quote": "",
        "reply": "hi",
        "threadID": "7871978016_6250009771001",
        "time": "2009-04-07 12:56:00",
        "title": "pre-emptive nuke strike!",
        "userID": "17234611"
    },
    {
        "content": "quote: Originally posted by 13557256: I s it time 2 finish what GEN Mac. started! MacArthur got his azz kicked when the Chinese got into it. The UN forces were not only kicked out of NK, they were forced back south of Seoul.",
        "intTime": 20090408,
        "postID": 6,
        "quote": "Originally posted by 13557256: I s it time 2 finish what GEN Mac. started!",
        "reply": " MacArthur got his azz kicked when the Chinese got into it. The UN forces were not only kicked out of NK, they were forced back south of Seoul.",
        "threadID": "7871978016_6250009771001",
        "time": "2009-04-08 10:44:00",
        "title": "pre-emptive nuke strike!",
        "userID": "rangerdoug"
    },
    {
        "content": "Let me finish that story that rangerdoug didn't finish.Then the Americans decided they'd had enough playin' with these fools and kicked their butt killing 1.5 million commies, suffering only 130k casualties, and sending them 23 miles [get this] NORTH of Seoul. To make a long story short, MacArthur did woop up on 'em (especially considering his men's kill to death ratio), so much so he got fired by a wuss of a President. Personal Note: If NK wants another bout with a stronger America, I hope China and Russia get in on it, cuz dere gonna need all da help dey can get! \"May God have mercy on my enemies, cuz I won't!\" (I think Patton said that)",
        "intTime": 20090423,
        "postID": 7,
        "quote": "",
        "reply": "Let me finish that story that rangerdoug didn't finish.Then the Americans decided they'd had enough playin' with these fools and kicked their butt killing 1.5 million commies, suffering only 130k casualties, and sending them 23 miles [get this] NORTH of Seoul. To make a long story short, MacArthur did woop up on 'em (especially considering his men's kill to death ratio), so much so he got fired by a wuss of a President. Personal Note: If NK wants another bout with a stronger America, I hope China and Russia get in on it, cuz dere gonna need all da help dey can get! \"May God have mercy on my enemies, cuz I won't!\" (I think Patton said that)",
        "threadID": "7871978016_6250009771001",
        "time": "2009-04-23 18:14:00",
        "title": "pre-emptive nuke strike!",
        "userID": "USisnumber1"
    },
    {
        "content": "iran invades iraq...china takes taiwan....norks invade skorea.. this scenario could happen all at the same time...because they are all allies. talk about a nightmare...and they all have nukes or soon will....rut roh",
        "intTime": 20090514,
        "postID": 8,
        "quote": "",
        "reply": "iran invades iraq...china takes taiwan....norks invade skorea.. this scenario could happen all at the same time...because they are all allies. talk about a nightmare...and they all have nukes or soon will....rut roh",
        "threadID": "7871978016_6250009771001",
        "time": "2009-05-14 01:36:00",
        "title": "pre-emptive nuke strike!",
        "userID": "backtoiraq"
    },
    {
        "content": "quote: iran invades iraq...china takes taiwan....norks invade skorea Not until: The Iranians figure a way operate their military without trucks, fuel or reinforncements - Upon the opening of hostilities we'll drop every bridge and roadway over the Zagros mountain range with our Air Force, leaving any forces west of the mountains out of supply. The Chicoms teach their soldiers how to swim the 112 miles of the Taiwan Straight - Any attempt in boats will be immediately sunk by the two Carrier Battle Groups we'll put there. The North Koreans triples their population and spends the next twenty years modernizing their infrastructure. In 1950 they were roughly half the South's population and had military success due to the disproportionate training and outfitting of the two forces (the NKPA were given tanks and artillery by the Soviets - the ROK forces received only small arms from the US). The modern state of South Korea is now three times the population of the north and has a modern fighting force whose training and equipment is some of the best in the world. And as for nukes? They won't need more than one, because as soon as they shoot that one,... they won't need much of anything ever again. Sullivan013",
        "intTime": 20090514,
        "postID": 9,
        "quote": "iran invades iraq...china takes taiwan....norks invade skorea",
        "reply": " Not until: The Iranians figure a way operate their military without trucks, fuel or reinforncements - Upon the opening of hostilities we'll drop every bridge and roadway over the Zagros mountain range with our Air Force, leaving any forces west of the mountains out of supply. The Chicoms teach their soldiers how to swim the 112 miles of the Taiwan Straight - Any attempt in boats will be immediately sunk by the two Carrier Battle Groups we'll put there. The North Koreans triples their population and spends the next twenty years modernizing their infrastructure. In 1950 they were roughly half the South's population and had military success due to the disproportionate training and outfitting of the two forces (the NKPA were given tanks and artillery by the Soviets - the ROK forces received only small arms from the US). The modern state of South Korea is now three times the population of the north and has a modern fighting force whose training and equipment is some of the best in the world. And as for nukes? They won't need more than one, because as soon as they shoot that one,... they won't need much of anything ever again. Sullivan013",
        "threadID": "7871978016_6250009771001",
        "time": "2009-05-14 05:42:00",
        "title": "pre-emptive nuke strike!",
        "userID": "sullivan013"
    }
]