[
    {
        "content": "Uggh. Here we go again. ++http://news.yahoo.com/s/ap/20090414/ap_on_re_as/as_nkorea_missile quote: NKorea vows to restart nuclear reactor, end talks By HYUNG-JIN KIM, Associated Press Writer Hyung-jin Kim, Associated Press Writer – 1 hr 37 mins ago SEOUL, South Korea – North Korea vowed Tuesday to restart its nuclear reactor and to boycott international disarmament talks for good in retaliation for the U.N. Security Council's condemnation of its rocket launch. Russia, voicing regret over the move, urged Pyongyang to return to the negotiating table. The Foreign Ministry called the U.N. statement \"legitimate and well-balanced,\" and Foreign Minister Sergey Lavrov said all sides must stick to the current disarmament process. China, the North's main ally, appealed for calm. In Washington, a senior U.S. official called the decision \"unfortunate.\" (...) North Korea's denunciation of the council's \"hostile\" move came just hours after all 15 members, including Beijing and Moscow, unanimously agreed to condemn the April 5 launch as a violation of U.N. resolutions and to tighten sanctions against the regime. (...) The council on Monday demanded an end to the rocket launches and said it will expand sanctions against the communist nation. The council also called for quick resumption of disarmament talks. (...) North Korea, following through on earlier threats to withdraw from international disarmament talks if the council so much as criticized the launch, announced Tuesday it would boycott the 5 1/2-year-old negotiations hosted by China. (...) Since 2003, envoys from six nations — the two Koreas, the U.S., China, Russia and Japan — have been meeting in Beijing for sporadic negotiations on getting Pyongyang to give up its nuclear program in exchange for aid and other concessions. Under a 2007 six-party deal, North Korea agreed to disable its main nuclear complex in Yongbyon north of Pyongyang — a key step toward dismantlement — in return for 1 million tons of fuel oil and other concessions. Disablement began later that year. (...)",
        "intTime": 20090414,
        "postID": 1,
        "quote": "NKorea vows to restart nuclear reactor, end talks By HYUNG-JIN KIM, Associated Press Writer Hyung-jin Kim, Associated Press Writer – 1 hr 37 mins ago SEOUL, South Korea – North Korea vowed Tuesday to restart its nuclear reactor and to boycott international disarmament talks for good in retaliation for the U.N. Security Council's condemnation of its rocket launch. Russia, voicing regret over the move, urged Pyongyang to return to the negotiating table. The Foreign Ministry called the U.N. statement \"legitimate and well-balanced,\" and Foreign Minister Sergey Lavrov said all sides must stick to the current disarmament process. China, the North's main ally, appealed for calm. In Washington, a senior U.S. official called the decision \"unfortunate.\" (...) North Korea's denunciation of the council's \"hostile\" move came just hours after all 15 members, including Beijing and Moscow, unanimously agreed to condemn the April 5 launch as a violation of U.N. resolutions and to tighten sanctions against the regime. (...) The council on Monday demanded an end to the rocket launches and said it will expand sanctions against the communist nation. The council also called for quick resumption of disarmament talks. (...) North Korea, following through on earlier threats to withdraw from international disarmament talks if the council so much as criticized the launch, announced Tuesday it would boycott the 5 1/2-year-old negotiations hosted by China. (...) Since 2003, envoys from six nations — the two Koreas, the U.S., China, Russia and Japan — have been meeting in Beijing for sporadic negotiations on getting Pyongyang to give up its nuclear program in exchange for aid and other concessions. Under a 2007 six-party deal, North Korea agreed to disable its main nuclear complex in Yongbyon north of Pyongyang — a key step toward dismantlement — in return for 1 million tons of fuel oil and other concessions. Disablement began later that year. (...)",
        "reply": "Uggh. Here we go again. ++http://news.yahoo.com/s/ap/20090414/ap_on_re_as/as_nkorea_missile ",
        "threadID": "7871978016_5310007022001",
        "time": "2009-04-14 10:07:00",
        "title": "North Korea vows to restart nuclear plant, boycotts 6 party talks",
        "userID": "Canuck_Centaur"
    }
]