[
    {
        "content": "Two very interesting articles that gives outsiders better insight into how the 3 predominantly Sinophone/Chinese-speaking nations of East Asia- China , Taiwan, and Singapore- plan their defence strategies. quote: by Andrei Chang Hong Kong (UPI) Jan 11, 2007 China, Taiwan and Singapore all share the Chinese language and culture. Yet due to their different positions in the international sphere and the capabilities of their respective military industries, the three have chosen very different military strategies and weapons systems. It is interesting to compare the three approaches. First, in terms of military strategy, China is now gradually transforming itself from the passive defense of the Cold War years to today's active defense, with balanced offensive and defensive capabilities. China's navy is also turning from coastal defense to offshore defense. The two sides of the Taiwan Strait are now under abnormal adversarial conditions. Taiwan's strategic goal has changed from staging large-scale counterattacks on mainland China to engaging in a decisive battle away from Taiwan Island and establishing balanced offensive and defensive capabilities. Singapore's approach is proactive defense, typical of a small country. Since Singapore is much better off than other countries in the region, and it has a sensitive historical relationship with Malaysia, Singapore's national defense policy has followed the dual-track principle of diplomacy and deterrence. While building up formidable military strengths to dissuade potential enemies from reckless action, Singapore also tries to reinforce its national defense through diplomatic ties, hoping it will receive support from the outside world should the regional situation deteriorate. Singapore learned from the Iraqi invasion of Kuwait that wealth does not equal peace. The military strategies and doctrines of Singapore and Taiwan are becoming increasingly close. Both are attempting to establish effective deterrence against potential adversaries through building up their military machines. Both also rely on the diplomatic or even military involvement of world powers should they face a protracted conflict. By procuring large batches of arms and establishing special military ties with the United States, both Singapore and Taiwan hope to guarantee their own security, expecting that the United States would come to their rescue should a major conflict arise. Singapore's practice of purchasing AIM-120C air-to-air missiles and storing these weapon systems in the United States is clearly an attempt to establish a tangible military alliance with the United States and to integrate diplomatic deterrence with military deterrence. If a conflict broke out, Singapore would inevitably ask the United States to deliver the weapon systems stored on U.S. territory, which would make it impossible for the United States to remain neutral. Taiwan's approach in recent years has been more or less similar. For the same purpose, Singapore may also deposit the 66 Leopard 2A4 main battle tanks it procured from Germany in Australia, as a tactic to contain the latest move of the Malaysian army to import PT91M main battle tanks from Poland. Secondly, Singapore hopes to win additional layers of protection through its \"diplomatic deterrence\" strategy. Through reinforcing its ties with Australia, Canada and the joint defense cooperation among the five ASEAN countries, Singapore intends to implement the strategy of multilayered diplomatic deterrence; that is, using different diplomatic deterrence strategies to deal with different adversaries. In recent years, Taiwan has also sought to weaken the dominance of the United States in the dynamics of the Taiwan Strait and actively expand its military exchanges with Japan, Australia and India, with the same strategic objectives as Singapore. Although China, Taiwan and Singapore all seek to balance their offensive and defensive capabilities, Singapore's navy and air force have the most advanced Western military technologies and the most formidable attack power in comparison with Taiwan and China. In other words, in implementing the strategy of balanced offensive and defensive deterrence, the Singaporean military forces place much greater emphasis on offensive operations than the Taiwanese and Chinese forces. Singapore's \"active defense\" strategy is probably influenced by traditional British military ideology. Similar traces can be found in the military strategies of fellow former British colonies India and Pakistan. With the import of 12 plus 8 F-15ST fighters from the United States, Singapore has become the first of the three militaries to acquire joint direct attack munition bombs. (...) Because of the differences in the combat capabilities of their prospective adversaries, Taiwan and Singapore also have different deterrence strengths. The powerful offensive weapon systems mentioned above are already sufficient to give Singapore the capability to paralyze the enemy through pre-emptive standoff operations, which could be followed by diplomatic measures to resolve the conflict. Singapore's latest replacements of military equipment, particularly in the navy and air force, show that the deterrence capability it aspires to is not directed solely at Malaysia. Thanks to the procurement of F-16 Block52 fighters and the KC-135R tanker, plus the fact that four E-2C aerial early-warning aircraft are already in service, the Singaporean air force can now project its power over almost all of Southeast Asia. Singapore is already armed with 70 F-16 fighters, among which 62 are F-16 Block52s. These fighters are equipped with the Israeli Python-4 and AIM120C AAM. The Taiwanese air force also dreams of acquiring the F-16 Block52. Both the Singaporean and the Taiwanese air forces are equipped... (...) As for military cooperation between Singapore and Taiwan, there has been constant speculation and many unconfirmed reports about this. Sources say that Singapore's batch of SA-18 missiles was actually ordered by Taiwan. Both Taiwan and Singapore are now employing the French-made La Fayette guided missile frigates. The Singaporean variant of the La Fayette and the same model of FFG assembled indigenously are called the Delta Project, which has undergone major upgrading, but the price is said to be less than two-thirds the price Taiwan paid for its La Fayettes. Obviously the two received far different treatment in their purchase deals. As a matter of fact, Israel has close ties with all three of the militaries under discussion. Singapore's ground forces, air force and navy use a lot of Israeli-made equipment. The Singaporean navy's \"Victory\" class missile patrol boats are equipped with the Barak I vertical launch surface-to-air systems made by Israel Aerospace Industries/Rafael, while the F-16 Block52 fighters of the Singaporean air force are equipped with Israeli-designed electronic warfare systems. As is widely known, both Taiwan and Singapore have acquired Gabriel I surface-to-surface missiles from Israel's IAI. In addition, Singapore has also purchased submarines from Sweden. In 1990 Singapore received ... (...) quote: Taiwan military presents preventive doctrine toward China in Quadrennial Defense Review ++http://www.taiwannews.com.tw/etn/news_content.php?id=893776&lang=eng_news&cate_img=1033.jpg&cate_rss=news_only_on_taiwannews TAIPEI (Taiwan News) – Taiwan’s military will concentrate on a more preventive policy as relations with rival China improve, the Ministry of National Defense reportedly said in its first-ever Quadrennial Defense Review published Monday. (...) [b]The basic principles of the new preventive defense doctrine were that Taiwan should not fire the first shot or launch the first attack, but use contact, communications, negotiations to protect the country, media reported. “If war is unavoidable, then the military will make sure the enemy is unable to bite, unable to swallow, unable to beat us to pieces,” the document said according to quotes in the Chinese-language media. Nevertheless, this would not mean that Taiwan’s military would seek to improve links with its Chinese counterpart on its own. Establishing mutual confidence-building measures was a job for the government, not for the military, officials told reporters. The military would also focus efforts on how to respond to a military attack. Under the previous Democratic Progressive Party administration, the military emphasized the capability to keep a war outside Taiwan’s main island, with some reports saying the military would strike back at China by firing missiles at its main cities. China has about 1,500 missiles targeted at Taiwan, and has been waging a robust campaign of military modernization led by the expansion of its budgets. China has also been preparing its military for the transformation from a purely continental force to a naval power capable of launching submarines and aircraft carriers. As confirmed by government statements earlier this month, Taiwan wants to introduce all-volunteer armed forces by the end of 2014. The military’s total manpower should be cut to 215,000 at that time from the 275,000 listed in the current budget, Defense Minister Chen Chao-min said. He promised to cut the number of senior officers, often a point of criticism from lawmakers and defense experts. (...) [u]Taiwan is also applying to purchase 66 F-16C/D fighter jets from the U.S. because the 150 F-16A/B planes it bought in 1992 are no longer deemed advanced enough to counter the Chinese threat. The new high-tech jets would cost an estimated US$4.9 billion, reports said. [/u] Chen told lawmakers Taiwan would continue to develop Hsiung Feng IIE missiles as a purely defensive weapon needed to hit back after an eventual attack. If China didn’t attack Taiwan, then Taiwan wouldn’t use them, the minister said, emphasizing the military would never fire its missiles at civilian targets. Experts associated with the opposition DPP said the government should pay more attention to “asymmetrical” or alternative military strategies used by weaker powers to defend themselves against strong opponents. Upgrading reconnaissance, information gathering and missile defense were more important as ways to offset numerical shortcomings, said Michael Tsai,... (...) He predicted the quantity and quality of China’s military would exceed Taiwan’s by 2010, causing a dangerous imbalance. Tsai questioned whether it was the right time to abolish military conscription.",
        "intTime": 20090321,
        "postID": 1,
        "quote": "by Andrei Chang Hong Kong (UPI) Jan 11, 2007 China, Taiwan and Singapore all share the Chinese language and culture. Yet due to their different positions in the international sphere and the capabilities of their respective military industries, the three have chosen very different military strategies and weapons systems. It is interesting to compare the three approaches. First, in terms of military strategy, China is now gradually transforming itself from the passive defense of the Cold War years to today's active defense, with balanced offensive and defensive capabilities. China's navy is also turning from coastal defense to offshore defense. The two sides of the Taiwan Strait are now under abnormal adversarial conditions. Taiwan's strategic goal has changed from staging large-scale counterattacks on mainland China to engaging in a decisive battle away from Taiwan Island and establishing balanced offensive and defensive capabilities. Singapore's approach is proactive defense, typical of a small country. Since Singapore is much better off than other countries in the region, and it has a sensitive historical relationship with Malaysia, Singapore's national defense policy has followed the dual-track principle of diplomacy and deterrence. While building up formidable military strengths to dissuade potential enemies from reckless action, Singapore also tries to reinforce its national defense through diplomatic ties, hoping it will receive support from the outside world should the regional situation deteriorate. Singapore learned from the Iraqi invasion of Kuwait that wealth does not equal peace. The military strategies and doctrines of Singapore and Taiwan are becoming increasingly close. Both are attempting to establish effective deterrence against potential adversaries through building up their military machines. Both also rely on the diplomatic or even military involvement of world powers should they face a protracted conflict. By procuring large batches of arms and establishing special military ties with the United States, both Singapore and Taiwan hope to guarantee their own security, expecting that the United States would come to their rescue should a major conflict arise. Singapore's practice of purchasing AIM-120C air-to-air missiles and storing these weapon systems in the United States is clearly an attempt to establish a tangible military alliance with the United States and to integrate diplomatic deterrence with military deterrence. If a conflict broke out, Singapore would inevitably ask the United States to deliver the weapon systems stored on U.S. territory, which would make it impossible for the United States to remain neutral. Taiwan's approach in recent years has been more or less similar. For the same purpose, Singapore may also deposit the 66 Leopard 2A4 main battle tanks it procured from Germany in Australia, as a tactic to contain the latest move of the Malaysian army to import PT91M main battle tanks from Poland. Secondly, Singapore hopes to win additional layers of protection through its \"diplomatic deterrence\" strategy. Through reinforcing its ties with Australia, Canada and the joint defense cooperation among the five ASEAN countries, Singapore intends to implement the strategy of multilayered diplomatic deterrence; that is, using different diplomatic deterrence strategies to deal with different adversaries. In recent years, Taiwan has also sought to weaken the dominance of the United States in the dynamics of the Taiwan Strait and actively expand its military exchanges with Japan, Australia and India, with the same strategic objectives as Singapore. Although China, Taiwan and Singapore all seek to balance their offensive and defensive capabilities, Singapore's navy and air force have the most advanced Western military technologies and the most formidable attack power in comparison with Taiwan and China. In other words, in implementing the strategy of balanced offensive and defensive deterrence, the Singaporean military forces place much greater emphasis on offensive operations than the Taiwanese and Chinese forces. Singapore's \"active defense\" strategy is probably influenced by traditional British military ideology. Similar traces can be found in the military strategies of fellow former British colonies India and Pakistan. With the import of 12 plus 8 F-15ST fighters from the United States, Singapore has become the first of the three militaries to acquire joint direct attack munition bombs. (...) Because of the differences in the combat capabilities of their prospective adversaries, Taiwan and Singapore also have different deterrence strengths. The powerful offensive weapon systems mentioned above are already sufficient to give Singapore the capability to paralyze the enemy through pre-emptive standoff operations, which could be followed by diplomatic measures to resolve the conflict. Singapore's latest replacements of military equipment, particularly in the navy and air force, show that the deterrence capability it aspires to is not directed solely at Malaysia. Thanks to the procurement of F-16 Block52 fighters and the KC-135R tanker, plus the fact that four E-2C aerial early-warning aircraft are already in service, the Singaporean air force can now project its power over almost all of Southeast Asia. Singapore is already armed with 70 F-16 fighters, among which 62 are F-16 Block52s. These fighters are equipped with the Israeli Python-4 and AIM120C AAM. The Taiwanese air force also dreams of acquiring the F-16 Block52. Both the Singaporean and the Taiwanese air forces are equipped... (...) As for military cooperation between Singapore and Taiwan, there has been constant speculation and many unconfirmed reports about this. Sources say that Singapore's batch of SA-18 missiles was actually ordered by Taiwan. Both Taiwan and Singapore are now employing the French-made La Fayette guided missile frigates. The Singaporean variant of the La Fayette and the same model of FFG assembled indigenously are called the Delta Project, which has undergone major upgrading, but the price is said to be less than two-thirds the price Taiwan paid for its La Fayettes. Obviously the two received far different treatment in their purchase deals. As a matter of fact, Israel has close ties with all three of the militaries under discussion. Singapore's ground forces, air force and navy use a lot of Israeli-made equipment. The Singaporean navy's \"Victory\" class missile patrol boats are equipped with the Barak I vertical launch surface-to-air systems made by Israel Aerospace Industries/Rafael, while the F-16 Block52 fighters of the Singaporean air force are equipped with Israeli-designed electronic warfare systems. As is widely known, both Taiwan and Singapore have acquired Gabriel I surface-to-surface missiles from Israel's IAI. In addition, Singapore has also purchased submarines from Sweden. In 1990 Singapore received ... (...)",
        "reply": "Two very interesting articles that gives outsiders better insight into how the 3 predominantly Sinophone/Chinese-speaking nations of East Asia- China , Taiwan, and Singapore- plan their defence strategies.  quote: Taiwan military presents preventive doctrine toward China in Quadrennial Defense Review ++http://www.taiwannews.com.tw/etn/news_content.php?id=893776&lang=eng_news&cate_img=1033.jpg&cate_rss=news_only_on_taiwannews TAIPEI (Taiwan News) – Taiwan’s military will concentrate on a more preventive policy as relations with rival China improve, the Ministry of National Defense reportedly said in its first-ever Quadrennial Defense Review published Monday. (...) [b]The basic principles of the new preventive defense doctrine were that Taiwan should not fire the first shot or launch the first attack, but use contact, communications, negotiations to protect the country, media reported. “If war is unavoidable, then the military will make sure the enemy is unable to bite, unable to swallow, unable to beat us to pieces,” the document said according to quotes in the Chinese-language media. Nevertheless, this would not mean that Taiwan’s military would seek to improve links with its Chinese counterpart on its own. Establishing mutual confidence-building measures was a job for the government, not for the military, officials told reporters. The military would also focus efforts on how to respond to a military attack. Under the previous Democratic Progressive Party administration, the military emphasized the capability to keep a war outside Taiwan’s main island, with some reports saying the military would strike back at China by firing missiles at its main cities. China has about 1,500 missiles targeted at Taiwan, and has been waging a robust campaign of military modernization led by the expansion of its budgets. China has also been preparing its military for the transformation from a purely continental force to a naval power capable of launching submarines and aircraft carriers. As confirmed by government statements earlier this month, Taiwan wants to introduce all-volunteer armed forces by the end of 2014. The military’s total manpower should be cut to 215,000 at that time from the 275,000 listed in the current budget, Defense Minister Chen Chao-min said. He promised to cut the number of senior officers, often a point of criticism from lawmakers and defense experts. (...) [u]Taiwan is also applying to purchase 66 F-16C/D fighter jets from the U.S. because the 150 F-16A/B planes it bought in 1992 are no longer deemed advanced enough to counter the Chinese threat. The new high-tech jets would cost an estimated US$4.9 billion, reports said. [/u] Chen told lawmakers Taiwan would continue to develop Hsiung Feng IIE missiles as a purely defensive weapon needed to hit back after an eventual attack. If China didn’t attack Taiwan, then Taiwan wouldn’t use them, the minister said, emphasizing the military would never fire its missiles at civilian targets. Experts associated with the opposition DPP said the government should pay more attention to “asymmetrical” or alternative military strategies used by weaker powers to defend themselves against strong opponents. Upgrading reconnaissance, information gathering and missile defense were more important as ways to offset numerical shortcomings, said Michael Tsai,... (...) He predicted the quantity and quality of China’s military would exceed Taiwan’s by 2010, causing a dangerous imbalance. Tsai questioned whether it was the right time to abolish military conscription.",
        "threadID": "8801914822_5860005812001",
        "time": "2009-03-21 11:15:00",
        "title": "China, Taiwan, Singapore- analysis of defence strategies",
        "userID": "Canuck_Centaur"
    },
    {
        "content": "There is nothing to do with you ,Taiwan,SHUT UP.It's our island.the day will come soon we take back Taiwan.you can cry and tell you mother. do you know our rocket can cover with island everywhere.imbalance,fool.",
        "intTime": 20090325,
        "postID": 2,
        "quote": "",
        "reply": "There is nothing to do with you ,Taiwan,SHUT UP.It's our island.the day will come soon we take back Taiwan.you can cry and tell you mother. do you know our rocket can cover with island everywhere.imbalance,fool.",
        "threadID": "8801914822_5860005812001",
        "time": "2009-03-25 07:41:00",
        "title": "China, Taiwan, Singapore- analysis of defence strategies",
        "userID": "imposeland"
    },
    {
        "content": "quote: Originally posted by imposeland: There is nothing to do with you ,Taiwan,SHUT UP.It's our island.the day will come soon we take back Taiwan.you can cry and tell you mother. do you know our rocket can cover with island everywhere.imbalance,fool. NI GAN SHEN ME??????? SUI RAN WO SHI JIA NA DA REN, WO YI QIAN ZHU ZAI TAIWAN HEN JIU LE, HE WO YOU HEN DUO DE TAI WAN PENG YOU. TA MEN BI NI HAO!!!!! NI MEN DA LU REN DOU SHI MAO ZHU XI DE ZOU GOU!!!!!(您们大陸人是主席毛的狗!) GUO MIN JUN JIU KUAI YAO HUI DAO DA LU! (partial translation: WTF did you say? Although I am Canadian, I used to live in Taiwan a few years and I have many Taiwanese friends. They are better than nitwits like you as people. (really bias) Mainlanders like you are Chairman Mao's running dogs!...) This message has been edited. Last edited by: Canuck_Centaur, Wed 25 March 2009 09:29 AM",
        "intTime": 20090325,
        "postID": 3,
        "quote": "Originally posted by imposeland: There is nothing to do with you ,Taiwan,SHUT UP.It's our island.the day will come soon we take back Taiwan.you can cry and tell you mother. do you know our rocket can cover with island everywhere.imbalance,fool.",
        "reply": " NI GAN SHEN ME??????? SUI RAN WO SHI JIA NA DA REN, WO YI QIAN ZHU ZAI TAIWAN HEN JIU LE, HE WO YOU HEN DUO DE TAI WAN PENG YOU. TA MEN BI NI HAO!!!!! NI MEN DA LU REN DOU SHI MAO ZHU XI DE ZOU GOU!!!!!(您们大陸人是主席毛的狗!) GUO MIN JUN JIU KUAI YAO HUI DAO DA LU! (partial translation: WTF did you say? Although I am Canadian, I used to live in Taiwan a few years and I have many Taiwanese friends. They are better than nitwits like you as people. (really bias) Mainlanders like you are Chairman Mao's running dogs!...) This message has been edited. Last edited by: Canuck_Centaur, Wed 25 March 2009 09:29 AM",
        "threadID": "8801914822_5860005812001",
        "time": "2009-03-25 09:05:00",
        "title": "China, Taiwan, Singapore- analysis of defence strategies",
        "userID": "Canuck_Centaur"
    }
]