[
    {
        "content": "Yet another concession on the part of Pres. Ma and the Guomindang to show that they are committed to reunifcation. From the STRAITS TIMES: quote: Taiwan to end conscription TAIPEI - TAIWAN will phase out its decades-old military conscription policy over the next five years, the defence minister said on Monday, amid warming ties with China. Currently all men aged over 20 are required to do one year's military service. But Defence Minister Chen Chao-min told reporters that the structure of Taiwan's military manpower will undergo a dramatic change over the next few years. 'From 2011, the number of conscripts will be reduced by at least 10 percent each year, to be replaced by professional soldiers,' Mr Chen said. 'That is to say, eventually, conscript measures will come to an end by 2014.' Critics have argued that the island's armed forces have struggled to enhance their defence capabilities because conscripts are unable to become proficient in high-tech weaponry in their short military service. However, the new proposals sparked concerns over whether the defence ministry would be able to recruit sufficiently qualified professional soldiers at a monthly salary of NT$35,000 (S$1,550). The plan to phase out conscription was a campaign pledge of President Ma Ying-jeou during the 2008 election. The number of service personnel in Taiwan stands at around 275,000, down from a peak of 600,000 during the Cold War. Taiwan's relatively large army is a legacy of decades of tensions with China, which has regarded the island as part of its territory awaiting reunification since the two sides split at the end of a civil war in 1949. However, ties between Taiwan and China have improved dramatically since Mr Ma's Kuomintang party took office last May promising to boost cross-strait trade and tourism. -- AFP",
        "intTime": 20090312,
        "postID": 1,
        "quote": "Taiwan to end conscription TAIPEI - TAIWAN will phase out its decades-old military conscription policy over the next five years, the defence minister said on Monday, amid warming ties with China. Currently all men aged over 20 are required to do one year's military service. But Defence Minister Chen Chao-min told reporters that the structure of Taiwan's military manpower will undergo a dramatic change over the next few years. 'From 2011, the number of conscripts will be reduced by at least 10 percent each year, to be replaced by professional soldiers,' Mr Chen said. 'That is to say, eventually, conscript measures will come to an end by 2014.' Critics have argued that the island's armed forces have struggled to enhance their defence capabilities because conscripts are unable to become proficient in high-tech weaponry in their short military service. However, the new proposals sparked concerns over whether the defence ministry would be able to recruit sufficiently qualified professional soldiers at a monthly salary of NT$35,000 (S$1,550). The plan to phase out conscription was a campaign pledge of President Ma Ying-jeou during the 2008 election. The number of service personnel in Taiwan stands at around 275,000, down from a peak of 600,000 during the Cold War. Taiwan's relatively large army is a legacy of decades of tensions with China, which has regarded the island as part of its territory awaiting reunification since the two sides split at the end of a civil war in 1949. However, ties between Taiwan and China have improved dramatically since Mr Ma's Kuomintang party took office last May promising to boost cross-strait trade and tourism. -- AFP",
        "reply": "Yet another concession on the part of Pres. Ma and the Guomindang to show that they are committed to reunifcation. From the STRAITS TIMES: ",
        "threadID": "8801914822_7580096712001",
        "time": "2009-03-12 18:50:00",
        "title": "Taiwan to end conscription",
        "userID": "Canuck_Centaur"
    }
]